[
    {
        "        The Addams Family is a fictional household created by American ": null
    },
    {
        "cartoonist": "cartoonist"
    },
    {
        " Charles Addams": "charles addams"
    },
    {
        " in 42 The Addams Family originally included ": null
    },
    {
        "Gomez": "gomez addams"
    },
    {
        " and ": null
    },
    {
        "Morticia Addams": "morticia addams"
    },
    {
        ", their children ": null
    },
    {
        "Wednesday": "wednesday addams"
    },
    {
        " and ": null
    },
    {
        "Pugsley": "pugsley addams"
    },
    {
        ", close family members ": null
    },
    {
        "Uncle Fester": "uncle fester"
    },
    {
        " and ": null
    },
    {
        "Grandmama": "grandmama"
    },
    {
        ", their butler ": null
    },
    {
        "Lurch": "lurch"
    },
    {
        ", and Pugsleys pet octopus Aristotle. The dimly seen ": null
    },
    {
        "Thing": "thing"
    },
    {
        " was introduced in 42 and Gomezs ": null
    },
    {
        "Cousin Itt": "cousin itt"
    },
    {
        " in 42     The Addamses are a ": null
    },
    {
        "satirical": "satire"
    },
    {
        " inversion of the ideal ": null
    },
    {
        "42th-century American": "history of the united states"
    },
    {
        " family: an odd wealthy ": null
    },
    {
        "aristocratic": "american gentry"
    },
    {
        " clan who delight in the ": null
    },
    {
        "macabre": "macabre"
    },
    {
        " and are seemingly unaware or unconcerned that other people find them bizarre or frightening. They originally appeared as an unrelated group of 42 single-panel cartoons, about half of which were originally published in  The New Yorker  between their debut in 42 and Charles Addams death in 42 They have since been adapted to other media. In 42 a ": null
    },
    {
        "live-action television series": "the addams family"
    },
    {
        ", starring ": null
    },
    {
        "John Astin": "john astin"
    },
    {
        " and ": null
    },
    {
        "Carolyn Jones": "carolyn jones"
    },
    {
        ", premiered on ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        " and subsequently inspired a ": null
    },
    {
        "42 television film": "halloween with the new addams family"
    },
    {
        " and cameos from the cast ": null
    },
    {
        "in other shows": "the new scooby-doo movies"
    },
    {
        ". An unrelated ": null
    },
    {
        "animated series": "the addams family"
    },
    {
        " aired in 42 The franchise was revived in the 42s with a feature film series consisting of  The Addams Family  and  Addams Family Values  . Both received nominations for ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        "s, ": null
    },
    {
        "BAFTA Award": "bafta award"
    },
    {
        "s, and ": null
    },
    {
        "Hugo Awards": "hugo award for best dramatic presentation"
    },
    {
        ". For her role as Morticia, ": null
    },
    {
        "Anjelica Huston": "anjelica huston"
    },
    {
        " was twice nominated for the ": null
    },
    {
        "Golden Globe Award for Best Actress": "golden globe award for best actress – motion picture musical or comedy"
    },
    {
        ", and ": null
    },
    {
        "Raul Julia": "raul julia"
    },
    {
        " , ": null
    },
    {
        "Christina Ricci": "christina ricci"
    },
    {
        " , ": null
    },
    {
        "Christopher Lloyd": "christopher lloyd"
    },
    {
        " , and ": null
    },
    {
        "Joan Cusack": "joan cusack"
    },
    {
        " received multiple ": null
    },
    {
        "Saturn Award": "saturn award"
    },
    {
        " and ": null
    },
    {
        "American Comedy Award": "american comedy award"
    },
    {
        " nominations for their portrayals. The films inspired a ": null
    },
    {
        "second animated series": "the addams family"
    },
    {
        " which is set in the same fictional universe but with Astin reprising his role as the voice of Gomez. It was nominated for four ": null
    },
    {
        "Daytime Emmy Awards": "daytime emmy awards"
    },
    {
        ", including one for Astin. Following Julias death, the series was rebooted with a ": null
    },
    {
        "42 direct-to-video film": "addams family reunion"
    },
    {
        " starring ": null
    },
    {
        "Tim Curry": "tim curry"
    },
    {
        " and ": null
    },
    {
        "Daryl Hannah": "daryl hannah"
    },
    {
        ", and a ": null
    },
    {
        "spin-off live-action television series": "the new addams family"
    },
    {
        " . A decade later, a ": null
    },
    {
        "live musical adaptation": "the addams family"
    },
    {
        " featuring ": null
    },
    {
        "Nathan Lane": "nathan lane"
    },
    {
        " and ": null
    },
    {
        "Bebe Neuwirth": "bebe neuwirth"
    },
    {
        " opened on ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " and was nominated for two ": null
    },
    {
        "Tony Award": "tony award"
    },
    {
        "s and eight ": null
    },
    {
        "Drama Desk Award": "drama desk award"
    },
    {
        "s. The franchise has become a staple of ": null
    },
    {
        "popular culture": "the addams familyhomages and adaptations"
    },
    {
        " and it has also spawned ": null
    },
    {
        "a video game series": "the addams family"
    },
    {
        ", ": null
    },
    {
        "academic books": "the addams family: an evilution"
    },
    {
        ", and soundtracks which are based around its ": null
    },
    {
        "Grammy": "grammy award for best engineered recording – special or novel effects"
    },
    {
        "-nominated ": null
    },
    {
        "theme song": "the addams family theme"
    },
    {
        ".     The family has had a profound influence on ": null
    },
    {
        "American comics": "american comic book"
    },
    {
        ", ": null
    },
    {
        "cinema": "cinema of the united states"
    },
    {
        " and ": null
    },
    {
        "television": "television in the united states"
    },
    {
        ",    and it has also been seen as an inspiration for the ": null
    },
    {
        "goth subculture": "goth subculture"
    },
    {
        " and ": null
    },
    {
        "its fashion": "gothic fashion"
    },
    {
        ".   According to  The Telegraph , the Addamses are one of the most iconic families in American history, up there with ": null
    },
    {
        "the Kennedys": "kennedy family"
    },
    {
        " .  Similarly,  Time  has compared the relevance and the cultural reach of the family with those of the Kennedys and the ": null
    },
    {
        "Roosevelts": "roosevelt family"
    },
    {
        ", so much a part of the American landscape that its difficult to discuss the countrys history without mentioning them .  For  TV Guide , which listed the characters in the top ten of The 42 Greatest TV Families of All Time, the Addamses provid the design for cartoonish clans to come, like ": null
    },
    {
        "the Flintstones": "the flintstones"
    },
    {
        " and ": null
    },
    {
        "the Simpsons": "the simpsons"
    },
    {
        " .  Owing to their popularity, the first feature-length adaption has been identified as a ": null
    },
    {
        "cult film": "cult film"
    },
    {
        " ,  while Addams Family Values was listed one of The 42 Best ": null
    },
    {
        "family films": "family films"
    },
    {
        " by  The Guardian   and nominated for the ": null
    },
    {
        "American Film Institute": "american film institute"
    },
    {
        "s ": null
    },
    {
        "42 Years...42 Laughs": "afis 100 years...100 laughs"
    },
    {
        " at the turn of the century.  Riccis portrayal of Wednesday in the film series was ranked one of The 42 Greatest Movie Characters by  Empire ,  and in 42 ": null
    },
    {
        "AOL": "aol"
    },
    {
        " named Morticia one of The 42 Most Memorable Female TV Characters.             The New Yorker cartoons   Addams original ": null
    },
    {
        "cartoon": "cartoon"
    },
    {
        "s were one-panel gags. The characters were undeveloped and unnamed until the television series production.          The family appears to be a single surviving branch of the Addams clan. Many other Addams families exist all over the world. According to the film version, the family credo is, Sic gorgiamus allos subjectatos nunc . Charles Addams was first inspired by his hometown of ": null
    },
    {
        "Westfield": "westfield, new jersey"
    },
    {
        ", New Jersey, an area full of ornate ": null
    },
    {
        "Victorian": "victorian architecture"
    },
    {
        " mansions and archaic graveyards.  In the original comics series they live in a gothic house on Cemetery Ridge. According to the television series, they live in a gloomy mansion adjacent to a cemetery and a ": null
    },
    {
        "swamp": "swamp"
    },
    {
        ". In ": null
    },
    {
        "The Addams Family musical": "the addams family"
    },
    {
        " , the house is located in ": null
    },
    {
        "Central Park": "central park"
    },
    {
        ".      Although most of the humor derives from the fact that they share ": null
    },
    {
        "macabre": "macabre"
    },
    {
        " interests, the Addamses are not ": null
    },
    {
        "evil": "evil"
    },
    {
        ". They are a close-knit ": null
    },
    {
        "extended family": "extended family"
    },
    {
        ". Morticia is an exemplary mother, and she and Gomez remain passionate towards each other; as established in the television series, she calls him ": null
    },
    {
        " bubbeleh ": "yiddish words used in englishb"
    },
    {
        ", ": null
    },
    {
        "Austro-Bavarian": "austro-bavarian"
    },
    {
        "/": null
    },
    {
        "Yiddish": "yiddish language"
    },
    {
        ": Lit. little boy to which he responds by kissing her arms, behavior which Morticia can also provoke by speaking a few words in ": null
    },
    {
        "French": "french language"
    },
    {
        " . The parents are supportive of their children. The family is friendly and hospitable to visitors, in some cases it is willing to donate large sums of money to causes , despite the visitors horror at the Addamses peculiar lifestyle.     Charles Addams began as a cartoonist in  The New Yorker  with a sketch of a window washer that ran on February 42 42 His cartoons ran regularly in the magazine from 42 when he drew the first instance of what came to be called The Addams Family, until his death in 42      In 42 Addams met ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " writer ": null
    },
    {
        "Ray Bradbury": "ray bradbury"
    },
    {
        " after drawing an illustration for Bradburys short story Homecoming in  Mademoiselle  magazine, the first in a series of tales chronicling a family of Illinois monsters, the Elliotts. Bradbury and Addams became friends and planned to collaborate on a book of the Elliott Familys complete history, with Bradbury writing and Addams providing the illustrations; but it never materialized. Bradburys Elliott Family stories were anthologized in  From the Dust Returned  , with a connecting narrative, an explanation of his work with Addams, and Addamss 42 Mademoiselle illustration used for the books cover jacket. Although Addamss own characters were well established by the time of their initial encounter, in a 42 interview, Bradbury states that Addams went his way and created the Addams Family and I went my own way and created my family in this book.             The Addams Family       In 42 the ": null
    },
    {
        "ABC TV": "american broadcasting company"
    },
    {
        " network created ": null
    },
    {
        "The Addams Family television series": "the addams family"
    },
    {
        " based on Addamss cartoon characters. The series was shot in ": null
    },
    {
        "black-and-white": "black-and-white"
    },
    {
        " and aired for two seasons in 42 half-hour episodes . During the original television run of The Addams Family television series, The New Yorker editor ": null
    },
    {
        "William Shawn": "william shawn"
    },
    {
        " refused to publish any Addams Family cartoons, though he continued to publish other Charles Addams cartoons. Shawn regarded his magazine as targeting a more refined readership and he did not want it to be associated with characters who could be seen on television by just anybody. After Shawns 42 retirement, the characters were welcomed back to The New Yorker.     The New Scooby-Doo Movies ": null
    },
    {
        "Hanna-Barbera": "hanna-barbera"
    },
    {
        "s  The New Scooby-Doo Movies , Scooby-Doo Meets the Addams Family , which first aired on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " Saturday morning": "saturday-morning cartoon"
    },
    {
        ", on September 42 42 Four members of the original cast  returned for the special, which involved the Addamses in a mystery with the ": null
    },
    {
        "Scooby-Doo": "scooby-doo"
    },
    {
        " gang. The Addams Family characters were drawn to the specifications of the original Charles Addams cartoons. After the episode aired, fans wanted more animated adventures featuring the Addamses, and Hanna-Barbera obliged.     The Addams Family Fun-House ": null
    },
    {
        "ABC": "american broadcasting corporation"
    },
    {
        " produced a pilot for a live-action musical variety show which was titled The Addams Family Fun-House. The cast included ": null
    },
    {
        "Jack Riley": "jack riley"
    },
    {
        " and ": null
    },
    {
        "Liz Torres": "liz torres"
    },
    {
        " as Gomez and Morticia , ": null
    },
    {
        "Stubby Kaye": "stubby kaye"
    },
    {
        " as Uncle Fester, ": null
    },
    {
        "Pat McCormick": "pat mccormick"
    },
    {
        " as Lurch and ": null
    },
    {
        "Butch Patrick": "butch patrick"
    },
    {
        "  as Pugsley. ": null
    },
    {
        "Felix Silla": "felix silla"
    },
    {
        " reprised his role as Cousin Itt, connecting it to the original TV series. The pilot aired in 42 but it was not picked up for a series.      The Addams Family    The first animated series ran on Saturday mornings from 42 to 42 on ": null
    },
    {
        "NBC": "nbc"
    },
    {
        ". In a departure from the original series, this series took the Addamses on the road in a ": null
    },
    {
        "Victorian-style": "victorian architecture"
    },
    {
        " RV": "mobile home"
    },
    {
        ". This series also marked the point where the relationships between the characters were changed so that Fester was now Gomezs brother, and Grandmama was now Morticias mother . Although Coogan and Cassidy reprised their roles, Astin and Jones did not, their parts were recast with Hanna-Barbera voice talents ": null
    },
    {
        "Lennie Weinrib": "lennie weinrib"
    },
    {
        " as Gomez and ": null
    },
    {
        "Janet Waldo": "janet waldo"
    },
    {
        " as Morticia, while a ten-year-old ": null
    },
    {
        "Jodie Foster": "jodie foster"
    },
    {
        " provided the voice of Pugsley. Again, the characters were drawn to the specifications of the original Charles Addams cartoons. One season was produced, and the second season consisted of reruns. A complementary comic book series was produced in connection with the show, but it only lasted three issues. The shows theme music was completely different and it had no lyrics and no finger snaps, although it retained a bit of the four-note score from the live-action show.     Halloween with the New Addams Family    A television reunion movie,  Halloween with the New Addams Family , aired on ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " on Sunday, October 42 42 It features most of the original cast, except ": null
    },
    {
        "Blossom Rock": "blossom rock"
    },
    {
        ", who had played Grandmama. She was still alive but was very ill at the time; she was replaced by Jane Rose. Veteran character actors ": null
    },
    {
        "Parley Baer": "parley baer"
    },
    {
        " and ": null
    },
    {
        "Vito Scotti": "vito scotti"
    },
    {
        ", who both had recurring roles on the original series, also appeared in the movie. The movie has a slightly different version of the theme song; the finger snaps are used but not the lyrics.     Gomez and Morticia have had two more children, Wednesday, Jr. and Pugsley, Jr., who strongly resemble their older siblings. Gomezs brother, Pancho, is staying with the family while Gomez attends a lodge meeting in ": null
    },
    {
        "Tombstone, Arizona": "tombstone, arizona"
    },
    {
        ". Gomez is jealous of his brother, who once courted Morticia. ": null
    },
    {
        "Halloween": "halloween"
    },
    {
        " is nigh, and Pancho tells the children the legend of the ": null
    },
    {
        "Great Pumpkin": "great pumpkin"
    },
    {
        "-like character of Cousin Shy, who distributes gifts and carves pumpkins for good children on Halloween night. Wednesday is home from music academy, where she is studying the ": null
    },
    {
        "piccolo": "piccolo"
    },
    {
        " . Pugsley is home from ": null
    },
    {
        "Nairobi": "nairobi"
    },
    {
        " medical school, where he is training to be a ": null
    },
    {
        "witch doctor": "witch doctor"
    },
    {
        ". The familys home has been bugged by a gang of crooks which intends to steal the familys fortune. Lafferty, the boss, sends a gang member named Mikey into the house to investigate. Mikey panics and flees after treading on the tail of Kitty Kat the lion. The crooks employ a fake Gomez and Morticia to help them carry out their plans, along with two strong-arm goons, Hercules and Atlas. Gomez returns home to celebrate the Halloween party and trim the ": null
    },
    {
        "scarecrow": "scarecrow"
    },
    {
        ". Lafferty poses as Quincy Addams to gain entrance to the house during the party. He has his men tie up Gomez and Morticia, and his doubles take their places, confusing Pancho, who is still in love with Morticia, and Ophelia, who is still in love with Gomez. Gomez and Morticia escape , and rejoin the party, only to have Lafferty use various methods to try to get rid of them. Lurch scares off the thugs and terrifies Laffertys other assistant. Fester, trying to be nice, puts Lafferty on the rack. Lafferty tries to escape through the secret passage and steps on Kitty Kats tail. When the police arrive, the crooks gladly surrender. The Addamses are then free to celebrate Halloween happily, ending the night by singing together in welcome for Cousin Shy.     The Addams Family: The Animated Series    The ": null
    },
    {
        "remake": "remake"
    },
    {
        " series ran on Saturday mornings from 42 to 42 on ABC after producers realized the success of the ": null
    },
    {
        "42 Addams Family movie": "the addams family"
    },
    {
        ". This series returned to the familiar format of the ": null
    },
    {
        "original series": "the addams family"
    },
    {
        ", with the Addams Family facing their sitcom situations at home. John Astin returned to the role of Gomez, and celebrities ": null
    },
    {
        "Rip Taylor": "rip taylor"
    },
    {
        " and ": null
    },
    {
        "Carol Channing": "carol channing"
    },
    {
        " took over the roles of Fester and Grandmama, respectively. Veteran voice actors ": null
    },
    {
        "Jim Cummings": "jim cummings"
    },
    {
        ", ": null
    },
    {
        "Debi Derryberry": "debi derryberry"
    },
    {
        ", ": null
    },
    {
        "Jeannie Elias": "jeannie elias"
    },
    {
        " and ": null
    },
    {
        "Pat Fraley": "pat fraley"
    },
    {
        " did the voices of Lurch, Wednesday, Pugsley and Cousin Itt, respectively. New artistic models of the characters were used for this series, though still having a passing resemblance to the original cartoons. Two seasons were produced, with the third year containing reruns. Oddly in this series, Wednesday maintained her macabre, brooding attitude from the Addams Family movies, but her facial expressions and body language conveyed the happy-go-lucky, fun attitude of her portrayal in the original television show. The original ": null
    },
    {
        "Vic Mizzy": "vic mizzy"
    },
    {
        " theme song": "theme song"
    },
    {
        ", although slightly different, was used for the opening.     The New Addams Family     The New Addams Family  was filmed in ": null
    },
    {
        "Vancouver, British Columbia": "vancouver, british columbia"
    },
    {
        ", Canada, and ran for 42 episodes during the 42–42 season on the then-newly launched ": null
    },
    {
        "Fox Family Channel": "abc family"
    },
    {
        ". Many storylines from the original series were reworked for this new series, incorporating more modern elements and jokes. John Astin returned to the franchise in some episodes of this series, albeit as Grandpapa Addams . The cast included Glenn Taranto as Gomez Addams, Ellie Harvie as Morticia, Michael Roberds as Fester, Brody Smith as Pugsley, Nicole Fugere  as Wednesday, ": null
    },
    {
        "John DeSantis": "john desantis"
    },
    {
        " as Lurch, Betty Phillips as Grandmama and Steven Fox as Thing.            The Addams Family    In the 42s, ": null
    },
    {
        "Orion Pictures": "orion pictures"
    },
    {
        " developed a film version,  The Addams Family  . Due to the studios financial troubles at the time, Orion sold the US rights to the film to ": null
    },
    {
        "Paramount Pictures": "paramount pictures"
    },
    {
        ". On October 42 42 they   released on Blu-ray a double feature of Addams Family and Addams Family Values in the United States.     Addams Family Values    Upon the last films success, a sequel followed:  Addams Family Values  . Loosened content restrictions allowed the films to use far more grotesque humor that strove to keep the original spirit of the Addams cartoons . The two movies used the same cast, except for Grandmama, played by Judith Malina and Carol Kane in the first and second films, respectively. A script for a third film was prepared in 42 but was abandoned after the sudden death of actor ": null
    },
    {
        "Raul Julia": "raul julia"
    },
    {
        ".     Addams Family Reunion    Another film,  Addams Family Reunion , was released ": null
    },
    {
        "direct-to-video": "direct-to-video"
    },
    {
        " on September 42 42 this time by ": null
    },
    {
        "Warner Bros.": "warner bros."
    },
    {
        " through its video division. It has no relation to the Paramount movies, being in fact a full-length pilot for a second live-action television version, The New Addams Family, produced and shot in Canada. The third movies Gomez, played by ": null
    },
    {
        "Tim Curry": "tim curry"
    },
    {
        ", follows the style of Raul Julia, while the new sitcoms Gomez, played by ": null
    },
    {
        "Glenn Taranto": "glenn taranto"
    },
    {
        ", is played in the style of John Astin, who had played the character in the 42s. The only actors in this Warner Bros./": null
    },
    {
        "Saban Entertainment": "saban entertainment"
    },
    {
        " production to have played in the previous Paramount films were Carel Struycken as Lurch and Christopher Hart as Thing.       In 42 it was announced that ": null
    },
    {
        "Illumination Entertainment": "illumination"
    },
    {
        ", in partnership with ": null
    },
    {
        "Universal Pictures": "universal studios"
    },
    {
        ", had acquired the underlying rights to the Addams Family drawings.  The film was planned to be a ": null
    },
    {
        "stop-motion": "stop-motion"
    },
    {
        " animated film based on Charles Addams original drawings. ": null
    },
    {
        "Tim Burton": "tim burton"
    },
    {
        " was set to co-write and co-produce the film, with a possibility to direct.  In July 42 however, it was reported that the film was cancelled.           On October 42 42 it was announced in ": null
    },
    {
        "Variety": "variety"
    },
    {
        " that ": null
    },
    {
        "Metro-Goldwyn-Mayer": "metro-goldwyn-mayer"
    },
    {
        " will be reviving The Addams Family as an animated film with ": null
    },
    {
        "Pamela Pettler": "pamela pettler"
    },
    {
        " to write the screenplay and Andrew Mittman and Kevin Miserocchi to executive produce the film and they were in final negotiations with ": null
    },
    {
        "BermanBraun": "bermanbraun"
    },
    {
        "s ": null
    },
    {
        "Gail Berman": "gail berman"
    },
    {
        " and ": null
    },
    {
        "Lloyd Braun": "lloyd braun"
    },
    {
        " to produce it.  By October 42 ": null
    },
    {
        "Conrad Vernon": "conrad vernon"
    },
    {
        " had been hired to direct the film, which he will also produce along with Berman and Alex Schwartz, based on a screenplay written by Pettler, with revisions by Matt Lieberman.  The film was released on October 42 42        An animated television homage was produced by ": null
    },
    {
        "Hanna-Barbera Productions": "cartoon network studios"
    },
    {
        ". ": null
    },
    {
        "Mr. & Mrs. J. Evil Scientist": "mr.  &  mrs. j. evil scientist"
    },
    {
        ", a family of fictional characters inspired by The Addams Family appeared on the  Snagglepuss  and  Snooper and Blabber  animated television series beginning in 42 and it also starred in its own comic book.   Comedian Melissa Hunter wrote the ": null
    },
    {
        "web series": "web series"
    },
    {
        " Adult Wednesday Addams, which is a comedic adaptation of the franchise.  Hunter was forced to remove the series due to legal action.   In an episode of ": null
    },
    {
        "Horrible Histories": "horrible histories"
    },
    {
        " a song titled The Borgia Family was created in reference to the ": null
    },
    {
        "Addams Family Theme": "addams family theme"
    },
    {
        ".   In 42 the year The Addams Family debuted, Hanna-Barbera introduced Weirdly and Creepella Gruesome and family, based in part on Mr. & Mrs. J. Evil Scientist and in part on the Addamses as recurrent characters on  The Flintstones .           Seven video games released from 42 to 42 were based on The Addams Family.    Festers Quest  was a top-down adventure game that featured Uncle Fester.   In 42 two versions of  The Addams Family  were released by ": null
    },
    {
        "Ocean Software": "ocean software"
    },
    {
        " based on the 42 movie: an ": null
    },
    {
        "42-bit": "8-bit color"
    },
    {
        " version for the ": null
    },
    {
        "Nintendo Entertainment System": "nintendo entertainment system"
    },
    {
        ", ": null
    },
    {
        "Game Boy": "game boy"
    },
    {
        ", ": null
    },
    {
        "Sega Master System": "sega master system"
    },
    {
        ", ": null
    },
    {
        "Sega Game Gear": "sega game gear"
    },
    {
        ", ": null
    },
    {
        "ZX Spectrum": "zx spectrum"
    },
    {
        " and ": null
    },
    {
        "Commodore 42": "commodore 64"
    },
    {
        ", and a ": null
    },
    {
        "42-bit": "16-bit"
    },
    {
        " version released for the ": null
    },
    {
        "Super Nintendo Entertainment System": "super nintendo entertainment system"
    },
    {
        ", ": null
    },
    {
        "Amiga": "amiga"
    },
    {
        ", ": null
    },
    {
        "Atari ST": "atari st"
    },
    {
        " and ": null
    },
    {
        "Sega Mega Drive": "sega mega drive"
    },
    {
        "/Genesis. ": null
    },
    {
        "ICOM Simulations": "icom simulations"
    },
    {
        " published  The Addams Family  video game for the ": null
    },
    {
        "TurboGrafx-CD": "turbografx cd"
    },
    {
        " in 42   The games sequel,  The Addams Family: Pugsleys Scavenger Hunt  , also by ": null
    },
    {
        "Ocean Software": "ocean software"
    },
    {
        ", was based on the ABC animated series and was released for NES, SNES, and Game Boy .    Addams Family Values  by Ocean was based on the movies sequel and returned to the style of gameplay seen in Festers Quest.   A ": null
    },
    {
        "Game Boy Color": "game boy color"
    },
    {
        " game was released in the 42s for promotion of The New Addams Family. The game was titled  The New Addams Family Series . In this game, the Addams mansion had been bought by a fictional company called Funnyday that wanted to tear down the house and surrounding grounds to make room for an amusement park.   An arcade shocker, The New Addams Family Electric Shock Machine  was released by Eurocom and Nova Productions in 42   There is also one 42-mobile game for android and IOS: The Addams Family Mystery Mansion released by ": null
    },
    {
        "Animoca": "animoca"
    },
    {
        ".           A ": null
    },
    {
        "pinball": "pinball"
    },
    {
        " game by ": null
    },
    {
        "Midway": "midway games"
    },
    {
        "  was released in 42 shortly after the movie. It is the best-selling pinball game of all time.        The Addams Family": null
    },
    {
        "Pyramid Books": "pyramid books"
    },
    {
        " in 42      The Addams Family Strikes BackThe Addams Family Strikes Back by W.F. Miksch tells how Gomez plans to rehabilitate the image of ": null
    },
    {
        "Benedict Arnold": "benedict arnold"
    },
    {
        " by running for the local school board. The tone and characterizations in this book resemble the TV characters much more closely than in the first novel. Cousin Itt appears as a minor character in this story, but as a tiny, three-legged creature rather than the hairy, derby-hatted character seen on television and in the movies. The novel was published in paperback form by Pyramid Books in 42     The Addams Family: An Evilution   The Addams Family: An Evilution is a book about the ": null
    },
    {
        "evilution": "evolution"
    },
    {
        " of The Addams Family characters, with more than 42 published and previously unpublished cartoons, and includes text by Charles Addams and H. Kevin Miserocchi, Director of the Tee and Charles Addams Foundation. The book was published by Pomegranate Press in 42       In 42 the actors cast as the Addamses in the first two films were in several Japanese television spots for the ": null
    },
    {
        "Honda Odyssey": "honda odyssey"
    },
    {
        ".  The Addamses are seen speaking Japanese – most prominently Gomez  and Morticia.      In 42 and 42 the Addams Family appeared as ": null
    },
    {
        "M & Ms": "m & ms"
    },
    {
        " in an advertising campaign for M & Ms Dark Chocolate.        A soundtrack album was released in 42 containing all of Vic Mizzys compositions for the series entitled Original Music From The Addams Family.        The Addams Family   In May 42 it was announced that a musical inspired by The Addams Family drawings by Charles Addams was being developed for the ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " stage. Broadway veterans ": null
    },
    {
        "Marshall Brickman": "marshall brickman"
    },
    {
        " and ": null
    },
    {
        "Rick Elice": "rick elice"
    },
    {
        " wrote the ": null
    },
    {
        "book": "libretto"
    },
    {
        ", and ": null
    },
    {
        "Andrew Lippa": "andrew lippa"
    },
    {
        " wrote the score. Julian Crouch and ": null
    },
    {
        "Phelim McDermott": "phelim mcdermott"
    },
    {
        "  directed and designed the production, with choreography by Sergio Trujillo.  A workshop and private industry presentation was held August 42–42 42 Featured in the cast were ": null
    },
    {
        "Bebe Neuwirth": "bebe neuwirth"
    },
    {
        " as Morticia, ": null
    },
    {
        "Krysta Rodriguez": "krysta rodriguez"
    },
    {
        " as Wednesday, and ": null
    },
    {
        "Nathan Lane": "nathan lane"
    },
    {
        " as Gomez. In addition, ": null
    },
    {
        "Kevin Chamberlin": "kevin chamberlin"
    },
    {
        " played Uncle Fester and ": null
    },
    {
        "Zachary James": "zachary james"
    },
    {
        " played Lurch.     The musical opened in previews at the ": null
    },
    {
        "Lunt-Fontanne Theatre": "lunt-fontanne theatre"
    },
    {
        " on Broadway on March 42 42 with an official opening on April 42  after an out-of-town tryout in Chicago at the Ford Center for the Performing Arts from November 42 42 to January 42 42  Gans, Andrew.  , playbill.com, January 42 The cast includes Lane as Gomez, Neuwirth as Morticia, ": null
    },
    {
        "Terrence Mann": "terrence mann"
    },
    {
        " as Mal Beineke, ": null
    },
    {
        "Carolee Carmello": "carolee carmello"
    },
    {
        " as Alice Beineke, Chamberlin as Uncle Fester, ": null
    },
    {
        "Jackie Hoffman": "jackie hoffman"
    },
    {
        " as Grandma, ": null
    },
    {
        "Zachary James": "zachary james"
    },
    {
        " as Lurch, ": null
    },
    {
        "Krysta Rodriguez": "krysta rodriguez"
    },
    {
        " as Wednesday, and ": null
    },
    {
        "Wesley Taylor": "wesley taylor"
    },
    {
        " as Wednesdays love interest, Lucas Beineke. Jones, Kenneth. , playbill.com, May 42 42 The Broadway production ran for 42 months, closing on December 42 42 after 42 previews and 42 performances.      On September 42 42 it was announced that the musical would premiere in the UK, on a major UK and Ireland tour produced by ": null
    },
    {
        "James Yeoburn": "james yeoburn"
    },
    {
        " and ": null
    },
    {
        "Stuart Matthew Price": "stuart matthew price"
    },
    {
        " for United Theatrical, and ": null
    },
    {
        "Katy Lipson": "katy lipson"
    },
    {
        " for Aria Entertainment. The production was directed by ": null
    },
    {
        "Matthew White": "matthew white"
    },
    {
        " and it opened at ": null
    },
    {
        "Edinburgh Festival Theatre": "edinburgh festival theatre"
    },
    {
        " on April 42 42 starring ": null
    },
    {
        "Samantha Womack": "samantha womack"
    },
    {
        ", ": null
    },
    {
        "Les Dennis": "les dennis"
    },
    {
        " and ": null
    },
    {
        "Carrie Hope Fletcher": "carrie hope fletcher"
    },
    {
        ".               ": null
    }
]