[
    {
        "The Howling Man is episode 42 of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone . It originally aired on November 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ".              The story is told in a ": null
    },
    {
        "flashback": "flashback"
    },
    {
        " by an American named David Ellington. While on a walking trip through post–": null
    },
    {
        "World War I": "world war i"
    },
    {
        " Europe": "europe"
    },
    {
        " , Ellington becomes lost in a storm. He sees a building, and walks towards it. It turns out to be a castle, which is now the home of an order of Brothers near the village of Schwarzwald. He knocks, the door opens, and he pleads for help. He is told by the monk who opens the door that they cannot give him shelter and that he must leave immediately. Ellington pleads for sanctuary from the storm, and, while waiting in the front hall to see if he can stay there, hears a disturbing wolf-like howl coming from somewhere in the castle. He meets Brother Jerome, who asks his purpose. After he explains, Brother Jerome regretfully announces that they cannot help him. Ellington reluctantly turns to leave, but only gets as far as the doorway before collapsing. When he awakens, he is inside the castle.     Upon waking inside the castle, Ellington hears the howling again and investigates. He finds a bedraggled man in a cell. The man claims to be a prisoner of an insane religious order, locked up because he kissed his sweetheart in public, and beaten by Jerome using the staff he carries.     Ellington is seen talking to the prisoner and is taken to the leader of the order, Brother Jerome. When Brother Jerome refuses to explain the man in the cell, Ellington says he will leave, but also threatens to go to the police and tell them about the man in the cell. Brother Jerome, realizing that Ellingtons threat might set the prisoner free, then reveals the truth: that the prisoner is not a man, but rather the ": null
    },
    {
        "Devil": "devil"
    },
    {
        " himself, and can only be contained by the Staff of Truth , which Jerome has. He had come to the village shortly after World War I to corrupt it, but Jerome had recognized him for what he was and used the staff to imprison him. His actions have given the world five years of relative peace, with only the evils created by mankind itself. Now convinced that Jerome is insane, Ellington pretends to believe the incredible story. Jerome is not fooled, however, and assigns another brother to watch him.     Ellington waits until his guard falls asleep, then creeps down to the cell. Seeing that the door is held shut only by a staff that is within reach of the imprisoned man, Ellington briefly wonders why he has not simply removed it himself. At the mans urging, Ellington removes the staff. The prisoner exits the cell & mdash;and pins Ellington to the floor with a wave of his hand from across the hall. As he walks toward the exit, he begins to change, taking on more and more of the appearance of the Devil with each step, before departing the castle in a plume of smoke. Jerome arrives, realizes what has happened, and sadly explains that the inability to recognize the devil has always been Mans great weakness.     The flashback ends. Ellington has been telling the story to a maid. He says that ever since then he has been hunting for the devil to atone for his mistake, through ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", the ": null
    },
    {
        "Korean War": "korean war"
    },
    {
        ", and the development of ": null
    },
    {
        "nuclear weapon": "nuclear weapon"
    },
    {
        "s. He has finally succeeded; he has him locked in a closet barred by a similarly shaped staff, and he intends to return him to the castle and Brother Jeromes keeping. He warns the skeptical housekeeper not to remove the staff under any circumstances while he goes to make his final preparations. As soon as Ellington leaves, the maid hears a howl from behind the door and in her curiosity removes the staff, allowing the door to slowly open.        ": null
    },
    {
        "H.M. Wynant": "h.m. wynant"
    },
    {
        " as David Ellington   ": null
    },
    {
        "John Carradine": "john carradine"
    },
    {
        " as Brother Jerome   ": null
    },
    {
        "Robin Hughes": "robin hughes"
    },
    {
        " as The Howling Man   ": null
    },
    {
        "Frederic Ledebur": "frederic ledebur"
    },
    {
        " as Brother Christophorus   ": null
    },
    {
        "Ezelle Poule": "ezelle poule"
    },
    {
        " as Housekeeper       This was the first aired episode of the second season that was not written by Rod Serling.     ": null
    },
    {
        "Charles Beaumont": "charles beaumont"
    }
]