[
    {
        "     The Mirror is episode 42 of the American television ": null
    },
    {
        "anthology series": "anthology series"
    },
    {
        "  The Twilight Zone . It originally aired on October 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ".              In a ": null
    },
    {
        "Central America": "central america"
    },
    {
        "n dictatorship, Ramos Clemente , and his four lifelong confidants, DAlessandro, Garcia, Tabal, and Cristo, stage a successful ": null
    },
    {
        "revolution": "revolution"
    },
    {
        " against the regime of General De Cruz. Clemente faces down De Cruz and revels in his victory, but the deposed general says that Clemente will soon learn the consequences of ruling by force. De Cruz also tells Clemente that his ornate mirror has the ability to reveal enemies in its reflection. Clemente initially dismisses De Cruz.     When Clemente begins using the same repressive tactics used by De Cruz, a rift develops between him and his four friends, now the heads of the government. A particular point of contention is Clementes order for ": null
    },
    {
        "mass execution": "mass execution"
    },
    {
        "s of prisoners he has declared to be ": null
    },
    {
        "enemies of the state": "enemy of the state"
    },
    {
        ". When Clemente looks into the mirror, he sees visions implying that all four of his confidantes are plotting to assassinate him & mdash;DAlessandro with a rifle, Garcia and Tabal with knives, and Cristo with a poisoned glass of wine. Clemente believes that the mirror reflects their true thoughts, and accuses them of their supposed future crimes. In spite of their denials, he takes steps to eliminate them; he kills two himself, and orders the other two killed by his men.     Finally, Clemente is approached by a priest named Father Tomas who asks him to end the executions, which have been going on for a week. Clemente refuses, saying that as long as he has enemies the executions will continue. Eventually, Clemente seeks counsel from the priest, but finds no comfort in the priests response that all tyrants have but one real enemy, whom they never recognize until it is too late. Clemente takes one last, long look in the mirror...and sees only himself. He picks up his pistol and throws it at the mirror, smashing the glass. The priest, who is standing just outside the office, hears the glass break. As he listens at the door he hears a gunshot. He rushes into Clementes office and finds Clementes lifeless body sprawled on the floor, a gun in his hand. The last assassin, he says, and they never learn...they never seem to learn.        ": null
    },
    {
        "Peter Falk": "peter falk"
    },
    {
        " as Ramos Clemente   ": null
    },
    {
        "Will Kuluva": "will kuluva"
    },
    {
        " as De Cruz   ": null
    },
    {
        "Richard Karlan": "richard karlan"
    },
    {
        " as DAlessandro   ": null
    },
    {
        "Vladimir Sokoloff": "vladimir sokoloff"
    },
    {
        " as Father Tomas   ": null
    },
    {
        "Antony Carbone": "antony carbone"
    },
    {
        " as Cristo   ": null
    },
    {
        "Rodolfo Hoyos, Jr.": "rodolfo hoyos, jr."
    },
    {
        " as Garcia   ": null
    },
    {
        "Arthur Batanides": "arthur batanides"
    }
]