[
    {
        "      The Boswell Sisters were a ": null
    },
    {
        "close harmony": "close harmony"
    },
    {
        " singing group, consisting of sisters ": null
    },
    {
        "Martha Boswell": "martha boswell"
    },
    {
        " Lloyd , ": null
    },
    {
        "Connee Boswell": "connee boswell"
    },
    {
        " , and ": null
    },
    {
        "Helvetia Vet Boswell": "helvetia   vet   boswell"
    },
    {
        " , noted for intricate harmonies and rhythmic experimentation. They attained national prominence in the United States in the 42s.       The sisters were raised in a middle-class family at 42 Camp Street in ": null
    },
    {
        "uptown New Orleans": "uptown new orleans"
    },
    {
        ", ": null
    },
    {
        "Louisiana": "louisiana"
    },
    {
        ". Martha and Connie were born in ": null
    },
    {
        "Kansas City, Missouri": "kansas city, missouri"
    },
    {
        ". Helvetia was born in ": null
    },
    {
        "Birmingham, Alabama": "birmingham, alabama"
    },
    {
        ". Born to a former vaudevillian, Clyde “A. C.” Boswell, and his music-loving wife, Meldania, the sisters—along with their 42-year-old brother Clyde Jr. —landed in New Orleans as children, in 42 Martha, Connie, and Vet studied classical piano, cello, and violin, respectively, under the tutelage of ": null
    },
    {
        "Tulane University": "tulane university"
    },
    {
        " professor Otto Finck. They performed their classical repertoire in local recitals, often as a trio, but the citys jazz scene swiftly won them over, personally and professionally. “We studied classical music . . . and were being prepared for the stage and a concert tour throughout the United States, but the saxophone got us,” Martha said in a 42 interview with the Shreveport Times.     In addition to providing the young Boswells with formal, classical musical education, Meldania Boswell took her children regularly to see the leading African–American performers of the day at the ": null
    },
    {
        "Lyric Theatre": "lyric theatre"
    },
    {
        ". There, young Connie heard ": null
    },
    {
        "Mamie Smith": "mamie smith"
    },
    {
        ", whose ": null
    },
    {
        "Crazy Blues": "crazy blues"
    },
    {
        " , the first blues record performed by an African American, was a hit. Connie would later imitate Smiths style on the Boswells first record, Im Gonna Cry , before settling into her own vocal style. In interviews, the sisters recalled driving around New Orleans listening for new and interesting sounds, which they often found outside African–American churches and barrooms.     As their older brother Clydie began breaking away from classical music to study jazz, he introduced his sisters to the new syncopated style and to many of the young jazz players in New Orleans. ": null
    },
    {
        "Leon Roppolo": "leon roppolo"
    },
    {
        " , ": null
    },
    {
        "Monk Hazel": "monk hazel"
    },
    {
        " , ": null
    },
    {
        "Pinky Vidacovich": "pinky vidacovich"
    },
    {
        " , ": null
    },
    {
        "Nappy Lamare": "nappy lamare"
    },
    {
        " , ": null
    },
    {
        "Ray Bauduc": "ray bauduc"
    },
    {
        " , ": null
    },
    {
        "Dan LeBlanc": "dan leblanc"
    },
    {
        " , ": null
    },
    {
        "Leon Prima": "leon prima"
    },
    {
        " , ": null
    },
    {
        "Louis Prima": "louis prima"
    },
    {
        " , ": null
    },
    {
        "Wingy Manone": "wingy manone"
    },
    {
        " , ": null
    },
    {
        "Al Gallodoro": "al gallodoro"
    },
    {
        " , ": null
    },
    {
        "Chink Martin": "chink martin"
    },
    {
        " , ": null
    },
    {
        "Santo Pecora": "santo pecora"
    },
    {
        " , ": null
    },
    {
        "Raymond Burke": "raymond burke"
    },
    {
        " , and ": null
    },
    {
        "Tony Parenti": "tony parenti"
    },
    {
        " were regular guests at the Boswell home. The sisters were particularly influenced by the cornetist ": null
    },
    {
        "Emmett Louis Hardy": "emmett hardy"
    },
    {
        ", another friend of Clydies, whose well-documented talent and skill helped shape the sisters knowledge of jazz harmony, syncopation, and improvisation. Hardy and Clydie both died young and unrecorded, Hardy of tuberculosis at age 42 and Clydie of flu-related complications at 42     After becoming interested in jazz, Vet took up the banjo and Connie the saxophone. Martha continued playing the piano but focused on the rhythms and idioms of ": null
    },
    {
        "ragtime": "ragtime"
    },
    {
        " and ": null
    },
    {
        "hot jazz": "dixieland"
    },
    {
        ".       The sisters came to be well known in New Orleans while still in their early teens, making appearances in local theaters and on the emerging medium of ": null
    },
    {
        "radio": "radio"
    },
    {
        ". By the early 42s they were performing regularly at local vaudeville theaters, with an act that combined classical, semi-classical, and jazz styles—though, as their popularity increased, the classics faded into the background. The sisters performed as they would for virtually their entire career: Martha and Connie seated at the piano, with Vet close behind. This arrangement served to disguise Connies inability to walk, a condition whose source has never been fully confirmed. A childhood bout with polio and a go-cart accident are the two main hypotheses, and Connie backed up both of them in various media sources. One theory holds that Meldania crafted the go-cart accident story in order to spare her daughter the stigma attached to the disease.     In 42 they made their first record for the ": null
    },
    {
        "Victor Records": "victor talking machine company"
    },
    {
        ". After going on tour with a vaudeville company, through Arkansas, Texas, and Oklahoma, the sisters landed in Los Angeles in 42 They appeared on radio programs and recorded music to be dubbed into films. However, the Boswell Sisters did not attain national attention until they moved to ": null
    },
    {
        "New York City": "new york city"
    },
    {
        " in 42 and started making national radio broadcasts. The trio had a program on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " from 42 to 42     After a few recordings for ": null
    },
    {
        "OKeh Records": "okeh records"
    },
    {
        ", recorded in Los Angeles in 42 they made numerous recordings for ": null
    },
    {
        "Brunswick Records": "brunswick records"
    },
    {
        " from 42 to 42 These Brunswick records are widely regarded as milestone recordings of vocal jazz. Connees reworkings of the melodies and rhythms of popular songs, together with ": null
    },
    {
        "Glenn Miller": "glenn miller"
    },
    {
        "s arrangements and New York jazz musicians , made these recordings unlike any others. Melodies were rearranged and slowed down, major keys were changed to minor keys , and unexpected rhythmic changes were par for the course. They were among the very few performers who were allowed to make changes to current popular tunes; during this era music publishers and record companies pressured performers not to alter current popular song arrangements. Connee also recorded a series of more conventional solo records for Brunswick during the same period.     The Boswell Sisters appeared in films during this time. They sang their 42 song Rock and Roll in the film  Transatlantic Merry-Go-Round , bringing with them an early use of the phrase rock n roll, referring in the song to the rolling rocking rhythm of the sea . They sang the lively Shout, Sister, Shout , written by ": null
    },
    {
        "Clarence Williams": "clarence williams"
    },
    {
        ", in the 42 film  The Big Broadcast , which featured ": null
    },
    {
        "Bing Crosby": "bing crosby"
    },
    {
        " and ": null
    },
    {
        "Cab Calloway": "cab calloway"
    },
    {
        ". The song, one of the sisters signature tunes, was described in a November 42 issue of the music magazine Mojo as by no means as archaic as its age.     The Boswell Sisters chalked up 42 hits during the 42s, including the number-one record The Object of My Affection .  They also completed two successful tours of Europe, appeared on the inaugural television broadcast of ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ", and performed on Hello, Europe, the first internationally broadcast radio program.     The Boswell Sisters were among radios earliest stars, making them one of the first hit acts of the mass-entertainment age. In 42 the Sisters appeared 42 times on the ": null
    },
    {
        "Bing Crosby Entertains": "bing crosby entertains"
    },
    {
        " radio show on CBS. They were featured in fan magazines, and their likenesses were used in advertisements for beauty and household products. Cave, Mark. Text panel for the 42 exhibition Shout, Sister, Shout! The Boswell Sisters of New Orleans, The Historic New Orleans Collection, New Orleans. During the early 42s the Boswell Sisters, ": null
    },
    {
        "Three X Sisters": "three x sisters"
    },
    {
        ", and ": null
    },
    {
        "Pickens Sisters": "pickens sisters"
    },
    {
        " were the talk of early radio female harmonizing. The ": null
    },
    {
        "Andrews Sisters": "andrews sisters"
    },
    {
        " started out as imitators of the Boswell Sisters. Young ": null
    },
    {
        "Ella Fitzgerald": "ella fitzgerald"
    },
    {
        " loved the Boswell Sisters and in particular idolized Connee, after whose singing style she patterned her own.     In 42 the group signed to Decca, but after just three records they broke up. The last recording was February 42 42 Approximately one month earlier, Martha Boswell had married Major ": null
    },
    {
        "George L. Lloyd": "george lloyd"
    },
    {
        " of Britains ": null
    },
    {
        "Royal Air Force": "royal air force"
    },
    {
        ". Connie served as her sisters only attendant at the wedding and ": null
    },
    {
        "Harold J. Warner": "harold j. warner"
    },
    {
        " served as their best man. Lloyd was the managing director of the Aero Insurance Underwriters in New York. He was a ": null
    },
    {
        "Rhodesian": "company rule in rhodesia"
    },
    {
        "-born flying ace of the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ", credited with ": null
    },
    {
        "eight aerial victories": "list of world war i aces credited with 8 victories"
    },
    {
        ". Connie Boswell continued to have a successful solo career as a singer for Decca. She changed the spelling of her name from Connie to Connee in the 42s, reputedly because it made it easier to sign autographs. When she tried to get involved with the overseas ": null
    },
    {
        "USO": "uso"
    },
    {
        " tours during World War II, she was not given permission to travel overseas because of her disability.       Later groups such as the Pfister Sisters, the ": null
    },
    {
        "Stolen Sweets": "the stolen sweets"
    },
    {
        ", Boswellmania, the ": null
    },
    {
        "Puppini Sisters": "puppini sisters"
    },
    {
        ", YazooZazz, the Spanish group O Sister!, the Italian trio ": null
    },
    {
        "Sorelle Marinetti": "sorelle marinetti"
    },
    {
        ", and the Israeli band the Hazelnuts, imitated the sisters recordings. Canadas Company B Jazz Band includes many Boswell Sisters arrangements in its repertoire and even created a set saluting the Boswells appearance in Transatlantic Merry-Go-Round for the cover of their second album, Rock & Roll. ": null
    },
    {
        "The Ditty Bops": "the ditty bops"
    },
    {
        " have covered Boswell Sisters songs in concert. Caffeine Trio from Brazil, also claims to have been influenced by them. There is also an Australian group, the Boswell Project, based in Adelaide, South Australia. London harmony trio, The Haywood Sisters, have also recorded some Boswell Sisters hits and are greatly influenced by their style.     In 42 The Boswell Sisters, a major musical based on their lives, was produced at the Old Globe Theatre in ": null
    },
    {
        "San Diego, California": "san diego, california"
    },
    {
        ". The play starred Michelle Duffy, Elizabeth Ward Land, and ": null
    },
    {
        "Amy Pietz": "amy pietz"
    },
    {
        " and was produced by the same team that produced  Forever Plaid . The show was a hit with audiences and a critical success, but failed to be picked up for a much hoped-for Broadway run.     The Boswell Sisters were inducted into the ": null
    },
    {
        "Vocal Group Hall of Fame": "vocal group hall of fame"
    },
    {
        " in 42 At a ceremony covered by the Pfister Sisters, the Boswells were inducted into the ": null
    },
    {
        "Louisiana Music Hall of Fame": "louisiana music hall of fame"
    },
    {
        " in 42     In 42 Vets daughter and granddaughter published The Boswell Legacy, the first comprehensive book on the life and times of this influential group.              ": null
    }
]