[
    {
        "        The Tomfoolery Show is an American cartoon comedy television series made and first broadcast in 42 based on the works of ": null
    },
    {
        "Edward Lear": "edward lear"
    },
    {
        ". The animation was done at the ": null
    },
    {
        "Halas and Batchelor": "halas and batchelor"
    },
    {
        " Studios in London and Stroud. Though the works of other writers were also used, notably ": null
    },
    {
        "Lewis Carroll": "lewis carroll"
    },
    {
        " and ": null
    },
    {
        "Ogden Nash": "ogden nash"
    },
    {
        ", Lears works were the main source, and characters like the Yongy-Bonghy-Bo and the Umbrageous Umbrella Maker were all Lear creations. Other regular characters included the Enthusiastic Elephant, the Fizzgiggious Fish, and the Scroobious Snake. Some original material was also written based on characters created by Lear, although much of the material was a straight recital of poems and limericks or songs using Lears poems set to music. A recurring joke had a delivery boy running around trying to deliver a large plant and shouting Plant for Mrs Discobolus!.   Some of the gags were based on Abbott and Costello skits which involved one of the regular characters in troubling situations. A cooking lesson for a silly recipe was presented in each episode.     The series was produced by ": null
    },
    {
        "Rankin/Bass": "rankin/bass productions"
    },
    {
        ", and ": null
    },
    {
        "Videocraft International": "videocraft international"
    },
    {
        ", who also made the  Rudolph the Red-Nosed Reindeer  and  Frosty the Snowman  ": null
    },
    {
        "television special": "television special"
    },
    {
        "s.     The series was made in England, featuring the voices of ": null
    },
    {
        "Peter Hawkins": "peter hawkins"
    },
    {
        ", Bernard Spear, and the ": null
    },
    {
        "Maury Laws": "maury laws"
    },
    {
        " Singers.     The series received mostly mixed and negative reviews for not using original material. The series was not renewed after one year on the air.                                          ": null
    }
]