[
    {
        "   The Great Hunt is a ": null
    },
    {
        "fantasy": "fantasy"
    },
    {
        " novel by ": null
    },
    {
        "American": "united states"
    },
    {
        " author ": null
    },
    {
        "Robert Jordan": "robert jordan"
    },
    {
        ", the second book of  The Wheel of Time  series. It was published by ": null
    },
    {
        "Tor Books": "tor books"
    },
    {
        " and released on November 42 42 The Great Hunt consists of a ": null
    },
    {
        "prologue": "prologue"
    },
    {
        " and 42 ": null
    },
    {
        "chapter": "chapter"
    },
    {
        "s. In 42 The Great Hunt was re-released as two separate books, The Hunt Begins and New Threads in the Pattern.     The story features young heroes ": null
    },
    {
        "Rand alThor": "rand althor"
    },
    {
        ", ": null
    },
    {
        "Mat Cauthon": "mat cauthon"
    },
    {
        ", and ": null
    },
    {
        "Perrin Aybara": "perrin aybara"
    },
    {
        ", who join ": null
    },
    {
        "Shienar": "shienar"
    },
    {
        "en soldiers in a quest to retrieve the ": null
    },
    {
        "Horn of Valere": "horn of valere"
    },
    {
        ". At the same time, ": null
    },
    {
        "Egwene alVere": "egwene alvere"
    },
    {
        ", ": null
    },
    {
        "Nynaeve alMeara": "nynaeve almeara"
    },
    {
        ", and ": null
    },
    {
        "Elayne Trakand": "elayne trakand"
    },
    {
        " go to the White Tower in ": null
    },
    {
        "Tar Valon": "tar valon"
    },
    {
        " to learn ": null
    },
    {
        "Aes Sedai": "aes sedai"
    },
    {
        " ways. Finally, an exotic army invades the western coast.           ": null
    },
    {
        "Baalzamon": "baalzamon"
    },
    {
        " presides over a clandestine meeting. In addition to Forsaken and Darkfriends , the meeting includes two ": null
    },
    {
        "Aes Sedai": "aes sedai"
    },
    {
        ", one later identified as Liandrin.       At Fal Dara in Shienar, following the events in  The Eye of the World , the protagonists are visited by the ": null
    },
    {
        "Amyrlin Seat": "amyrlin seat"
    },
    {
        ", ": null
    },
    {
        "Siuan Sanche": "siuan sanche"
    },
    {
        ", who identifies ": null
    },
    {
        "Rand alThor": "rand althor"
    },
    {
        " as the Dragon Reborn. Mats condition worsens through his psychic attachment to a parasitic dagger. ": null
    },
    {
        "Lan Mandragoran": "lan mandragoran"
    },
    {
        " instructs Rand in sword fighting. Darkfriend ": null
    },
    {
        "Padan Fain": "padan fain"
    },
    {
        " is imprisoned but subsequently freed by Darkforces, stealing the ": null
    },
    {
        "Horn of Valere": "horn of valere"
    },
    {
        " and the tainted dagger. Rand, ": null
    },
    {
        "Perrin Aybara": "perrin aybara"
    },
    {
        ", and Mat accompany a Shienaran party southbound in pursuit, under the leadership of Lord Ingtar and guided by a tracker named Hurin. ": null
    },
    {
        "Nynaeve alMeara": "nynaeve almeara"
    },
    {
        " and ": null
    },
    {
        "Egwene alVere": "egwene alvere"
    },
    {
        " accompany Moraine to Tar Valon for Aes Sedai training, where they befriend ": null
    },
    {
        "Elayne Trakand": "elayne trakand"
    },
    {
        " and the clairvoyant Min. There, Nynaeve passes the test to become Accepted, a rank in the White Tower below Aes Sedai and above a Novice.        Rand, ": null
    },
    {
        "Loial": "loial"
    },
    {
        ", and Hurin are separated from the Shienaran party and transported to an alternate world; similar to their own, but deserted and distorted. Rand suspects that he activated the portal stone by unconsciously channeling  saidin  in his sleep, although Egwene dreams that a mysterious woman  is responsible. Rands struggle to accept his channeling ability is a recurring element in the novel. In this alternate world, Rand meets ": null
    },
    {
        "Baalzamon": "baalzamon"
    },
    {
        " and has a ": null
    },
    {
        "heron": "heron"
    },
    {
        "s image branded into his palm in a fight. Later, with the help of Selene , they return to their own world, ahead of Fains and Ingtars groups. This done, they recover the Horn and dagger. At a loss to explain Rands disappearance, Lord Ingtars group pursue Padan Fain with the aid of Perrin, who uses a telepathic ability to communicate with wolves.     Rands party journeys to Cairhien, where Rand finds gleeman ": null
    },
    {
        "Thom Merrilin": "thom merrilin"
    },
    {
        ", whom he thought dead in  The Eye of the World . Rand and Loial are attacked by Trollocs and, during their escape, destroy the Chapter House of the Illuminators Guild, a society retaining knowledge of ": null
    },
    {
        "fireworks": "fireworks"
    },
    {
        ". The ": null
    },
    {
        "Horn": "horn of valere"
    },
    {
        " and ": null
    },
    {
        "dagger": "dagger"
    },
    {
        " are again lost. Later, Thoms apprentice Dena is murdered for Thoms involvement with Rand.       With the aid of Perrin, Ingtars group is reunited with Rand, and they learn that the Horn has been taken to Toman Head, at the port city of Falme. To gain time, Rand tries to lead them through an alternate world; but instead loses time. Meanwhile the invading ": null
    },
    {
        "Seanchan": "seanchan"
    },
    {
        " and their exotic beasts have occupied Falme. Geofram Bornhald, leader of the zealous religious group ": null
    },
    {
        "Children of the Light": "children of the light"
    },
    {
        ", is preparing to attack the Seanchan. At the White Tower, Liandrin lures Egwene and Nynaeve, along with Elayne and Min, to Toman Head, where Min is captured by the Seanchan and Egwene is collared with an  adam : a device used by the Seanchan to control channelers. Nynaeve and Elayne escape.     At Falme, Rand slays High Lord Turak of the ": null
    },
    {
        "Seanchan": "seanchan"
    },
    {
        " before escaping with the Horn and dagger. Ingtar reveals himself as a Darkfriend, but redeems himself when he dies fighting for Rands group. Elayne and Nynaeve rescue Egwene from the Seanchan and attempt to flee the city. At this moment the ": null
    },
    {
        "Whitecloaks": "whitecloaks"
    },
    {
        " also attack, leaving the heroes trapped between the Seanchan and the Whitecloaks; whereupon Mat blows the ": null
    },
    {
        "Horn of Valere": "horn of valere"
    },
    {
        ", resurrecting dead heroes including ": null
    },
    {
        "Artur Hawkwing": "artur hawkwing"
    },
    {
        ", which overcome the Seanchan and vanish. Rand himself vanquishes ": null
    },
    {
        "Baalzamon": "baalzamon"
    },
    {
        ", but is himself wounded, and in doing so projects an image of their duel to numerous peoples.                                             ": null
    }
]