[
    {
        "        The Dolls House  is the second ": null
    },
    {
        "trade paperback": "trade paperback"
    },
    {
        " of the ": null
    },
    {
        "DC": "dc comics"
    },
    {
        " comic": "comic book"
    },
    {
        " series  The Sandman . It collects issues 42–42 It was written by ": null
    },
    {
        "Neil Gaiman": "neil gaiman"
    },
    {
        ", illustrated by ": null
    },
    {
        "Mike Dringenberg": "mike dringenberg"
    },
    {
        ", ": null
    },
    {
        "Malcolm Jones III": "malcolm jones iii"
    },
    {
        ", ": null
    },
    {
        "Chris Bachalo": "chris bachalo"
    },
    {
        ", ": null
    },
    {
        "Michael Zulli": "michael zulli"
    },
    {
        " and ": null
    },
    {
        "Steve Parkhouse": "steve parkhouse"
    },
    {
        ", coloured by ": null
    },
    {
        "Robbie Busch": "robbie busch"
    },
    {
        " and lettered by ": null
    },
    {
        "Todd Klein": "todd klein"
    },
    {
        ".     It is preceded by  Preludes & Nocturnes  and followed by  Dream Country .       The Dolls House was the first Sandman paperback collection. The first edition printed in 42 collected issues 4242 Its success led to the printing of  Preludes and Nocturnes , which collected issues 4242 Later editions of The Dolls House would omit issue 42     The collection was later reissued in hardcover in 42 The collected edition features a foreword by Gaimans friend ": null
    },
    {
        "Clive Barker": "clive barker"
    },
    {
        ".              As part of a manhood ritual, an old man in the desert tells a younger man an ancient story, detailing the tragic love between ": null
    },
    {
        "Dream": "dream"
    },
    {
        " and Queen Nada. Fearing the consequences of loving an immortal, Nada spurns Dream. In anger, Dream sends Nada to Hell, where she remains to the present day. Sandman 42 Sandman 42     Meanwhile, Dreams ": null
    },
    {
        "androgynous": "androgynous"
    },
    {
        " sibling ": null
    },
    {
        "Desire": "desire"
    },
    {
        " calls upon their twin, ": null
    },
    {
        "Despair": "despair"
    },
    {
        ", to inform her there is a new dream vortex. The two of them allude to a scheme against Dream. Sandman 42     Dream reviews a census of his realm, and discovers four of his creations are missing. On Earth, ": null
    },
    {
        "Rose Walker": "rose walker"
    },
    {
        " and her mother Miranda meet ": null
    },
    {
        "Unity Kinkaid": "characters of the sandmanunity kinkaid"
    },
    {
        ", a victim of the ": null
    },
    {
        "sleeping sickness": "encephalitis lethargica"
    },
    {
        " that occurred while Dream was imprisoned. Sandman 42 While Miranda stays in England with Unity, Rose goes in search of her younger brother, ": null
    },
    {
        "Jed": "characters of the sandmanjed walker"
    },
    {
        ". Sandman 42 As she tries to track his whereabouts, Rose takes residence in a boarding house full of peculiar characters, including Chantal and Zelda, who always wear bridal garb and own a collection of stuffed spiders; Ken and Barbie, an extremely ": null
    },
    {
        "yuppie": "yuppie"
    },
    {
        "-ish couple; the eccentric Gilbert, a self-described amateur knight errant ; and the landlord Hal, who performs at nightclubs in ": null
    },
    {
        "drag": "drag queen"
    },
    {
        ". At night, Rose dreams of her brother, whose new caretakers keep him locked in their basement while they enjoy the monetary benefits they receive for caring for him. Meanwhile, Brute and Glob, two creatures created by Dream, have taken residence in Jeds mind. Jed is freed when Dream collects Brute and Glob, but is himself captured by the ": null
    },
    {
        "Corinthian": "corinthian"
    },
    {
        ", an escaped nightmare. Sandman 42 Dream speaks with ": null
    },
    {
        "Hob Gadling": "hob gadling"
    },
    {
        ", whom Dream granted immortality in 42 The two share a drink in the same tavern every hundred years. Sandman 42     In search of Jed, Rose and Gilbert stop at a hotel, where the Corinthian is attending a convention of ": null
    },
    {
        "serial killer": "serial killer"
    },
    {
        "s. Gilbert recognizes the Corinthian, and tells Rose that if she is in danger she should call upon Dream, under his by-name of ": null
    },
    {
        "Morpheus": "morpheus"
    },
    {
        " . When one of the serial killers attacks her, Rose summons him; whereupon Dream destroys the Corinthian and punishes the convention by revealing the pettiness of their crimes. Sandman 42 Gilbert finds Jed and has him sent to a hospital; while Dream informs Rose she is a dream vortex, capable of uniting the imaginations of everyone she meets, and the world will be destroyed if he does not kill her. Gilbert, now identified as the ": null
    },
    {
        "fourth missing creation": "characters of the sandmanfiddlers green"
    },
    {
        ", offers his life in Roses place; but is refused. Before Dream can kill Rose, Unity assumes the vortex in her stead, and seems to naturally die in the waking world, thus destroying the vortex; whereupon Dream frees Rose, who re-unites thereafter with Jed and Miranda. Sandman 42 After months of thought, Dream confronts Desire, who admits to impregnating Unity in the hope that Dream would kill Rose, and thus occasion his own destruction, as the Endless are strictly forbidden from killing relations. Dream then warns Desire against plotting thus, and departs.              42 After positive sales of the Dolls House, DC went back and published Preludes & Nocturnes as a bound collection, and this book was published the same month as Dream Country. Newer editions of the Dolls House start with issue 42": null
    }
]