[
    {
        "      The Fever is episode seventeen of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone . It originally aired on January 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ".              Franklin and his wife Flora go to ": null
    },
    {
        "Las Vegas": "las vegas"
    },
    {
        " because she won a slogan contest. He detests ": null
    },
    {
        "gambling": "gambling"
    },
    {
        ", but his wife is excited about their vacation. She puts a nickel in a machine and Franklin admonishes her for wasting money. She convinces him to let her pull the arm since she already put the money in. She doesnt win anything. Happy that his point was made, he implores her to go back to their room so they can get ready for dinner. As they walk, Franklin is given a ": null
    },
    {
        "coin": "coin"
    },
    {
        " by a drunk man at the ": null
    },
    {
        "casino": "casino"
    },
    {
        ", who makes Franklin use it in a ": null
    },
    {
        "slot machine": "slot machine"
    },
    {
        ". He wins and tells his wife that they should keep the winnings and not lose it back like the other people.     As they depart, Franklin believes he hears the slot machine calling his name. He continues to hear this as he tries to sleep. He gets out of bed, telling his wife he cannot keep tainted money, and that he is going to get rid of it by putting it back in the machine. Later, Flora goes to the casino and finds him playing the machine obsessively. Addicted, Franklin has cashed numerous checks and draws crowds that watch him continuously plunk coins into the machine. When Flora tries to coax him to stop, Franklin declares that he has lost so much, that he has to try to win some of it back. He becomes enraged when she presses for him to leave, declaring that the machine is inhuman , that it teases you, sucks you in. The casino workers watch and talk about him as he constantly plays while ignoring his wifes pleas to go to bed.     When Franklin puts his last ": null
    },
    {
        "dollar": "dollar"
    },
    {
        " into the machine, it malfunctions and will not spin. Franklin begins yelling and pushes the machine over. He is taken out of the casino screaming. Later in bed, Franklin tells Flora that the machine was about to pay off, but deliberately broke down so that it would not have to give him his money. He then hears the machine again calling his name. To his horror, he sees the slot machine coming down the hallway towards their room, chasing him, but Flora cannot see it. The machine hounds him towards the window, repeating his name over and over. He crashes through the glass and falls to his death. The police stand over his body, noting that his wife had stated that he had not slept in 42 hours. A casino manager comments that hes seen a lot of em get hooked before, but never like him. The last scene shows Franklins last dollar rolling up and spinning out flat near his outstretched, dead hand. The camera pans over to where the coin came and there sits the slot machine, smiling at him.              In Serling: The Rise and Twilight of Televisions Last Angry Man, Gordon F. Sander wrote, Serling celebrated the signing of his new show, The Twilight Zone by spending a weekend in Las Vegas. While Carol Serling was having good luck nearby, he became enslaved by a merciless ": null
    },
    {
        "one-armed bandit": "slot machine"
    },
    {
        ", an incident he would turn into one of his first Twilight Zone episodes.     In future episodes, the slot machine was used in ": null
    },
    {
        "A Nice Place to Visit": "a nice place to visit"
    },
    {
        " and ": null
    },
    {
        "The Prime Mover": "the prime mover"
    }
]