[
    {
        "         The Sum of Us is a play by ": null
    },
    {
        "David Stevens": "david stevens"
    },
    {
        ". It is the third play in his now completed A Currency Trilogy of which the first play is The Inn at the Beginning of the World. The second play is The Beast and the Beauty produced by the Old Mill Theatre, Perth, on 42 June 42       The plot revolves around the comfortable relationship between ": null
    },
    {
        "widower": "widower"
    },
    {
        " Harry and his ": null
    },
    {
        "gay": "gay"
    },
    {
        " son Jeff and their individual searches for the right mate. Harry unconditionally loves his Rugby-playing son and even takes an active part in Jeffs search for Mr. Right. Harry reveals that his mother was a lesbian, perhaps accounting for his accepting attitude toward Jeff. Jeffs new boyfriend, Greg, who is closeted from his own ": null
    },
    {
        "homophobic": "homophobia"
    },
    {
        " father, finds it difficult to relate to Harrys well-meaning matchmaking ways. Greg is ejected from his own home by his father when he discovers his sons sexuality. Harry, via a video dating service, finds a woman that he likes, a divorcee named Joyce, who may not be so understanding after spying a gay magazine in Harry and Jeffs house. Unfortunately, Harry suffers a massive stroke and is disabled, leaving him unable to speak or walk. Jeff cares for him as best as he can, taking him to the park for an outing one day. Jeff and Greg meet up in the park and agree to try and rekindle their romance, while Jeffs Dad, although unable to speak, gives his overwhelming approval.       The play, directed by , opened on October 42 42 at the ": null
    },
    {
        "Off-Broadway": "off-broadway"
    },
    {
        " Cherry Lane Theatre": "cherry lane theatre"
    },
    {
        ", where it ran for 42 performances. ": null
    },
    {
        "Tony Goldwyn": "tony goldwyn"
    },
    {
        " and ": null
    },
    {
        "Richard Venture": "richard venture"
    },
    {
        " headed the cast. The play won the ": null
    },
    {
        "Outer Critics Circle Award": "outer critics circle award"
    },
    {
        " for the Outstanding Off-Broadway Play 4242     The first production in Australia was in 42 by the ": null
    },
    {
        "Sydney Theatre Company": "sydney theatre company"
    },
    {
        " at the Wharf Studio Theatre with ": null
    },
    {
        "Ron Graham": "ron graham"
    },
    {
        " and ": null
    },
    {
        "Peter Phelps": "peter phelps"
    },
    {
        ". A new production is touring capital cities, regional and remote venues across Australia in 42 Produced by ": null
    },
    {
        "Christine Harris": "christine harris"
    },
    {
        " and HIT Productions, the cast includes one of Australias most well-known television, theatre and film actors ": null
    },
    {
        "John Jarratt": "john jarratt"
    },
    {
        ", alongside ": null
    },
    {
        "Patrick Harvey": "patrick harvey"
    },
    {
        ", Glenn van Oosterom, and ": null
    },
    {
        "Nell Feeney": "nell feeney"
    },
    {
        ". Directed by ": null
    },
    {
        "Green Room Awards": "green room awards"
    },
    {
        " winner Denis Moore.            A 42 Australian film adaptation was directed by Dowling and Geoff Burton and starred ": null
    },
    {
        "Russell Crowe": "russell crowe"
    },
    {
        " and ": null
    },
    {
        "Jack Thompson": "jack thompson"
    },
    {
        ". The screen adaptation mimics the plays device of ": null
    },
    {
        "breaking the fourth wall": "fourth wall"
    },
    {
        " with direct to camera conversational asides by both Harry and Jeff. Stevens screenplay won awards from the ": null
    },
    {
        "Australian Film Institute": "australian film institute"
    },
    {
        " and the ": null
    },
    {
        "Montréal World Film Festival": "montréal world film festival"
    },
    {
        ", and the movie was named Best Film at the ": null
    },
    {
        "Cleveland International Film Festival": "cleveland international film festival"
    }
]