[
    {
        "              The Dukes of Hazzard is an American ": null
    },
    {
        "action": "action"
    },
    {
        "-": null
    },
    {
        "comedy": "comedy"
    },
    {
        " television series that was aired on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " from January 42 42 to February 42 42 The show aired for a total of 42 episodes spanning seven seasons. The series was inspired by the 42 film  Moonrunners , which was also created by ": null
    },
    {
        "Gy Waldron": "gy waldron"
    },
    {
        " and had many identical or similar character names and concepts.       The Dukes of Hazzard follows the adventures of the Duke boys , cousins ": null
    },
    {
        "Bo Duke": "bo duke"
    },
    {
        "  and ": null
    },
    {
        "Luke Duke": "luke duke"
    },
    {
        "  , who live on a family farm in ": null
    },
    {
        "fictional": "list of fictional counties"
    },
    {
        " Hazzard County, ": null
    },
    {
        "Georgia": "georgia"
    },
    {
        ", with their attractive female cousin ": null
    },
    {
        "Daisy": "daisy duke"
    },
    {
        "  and their wise old ": null
    },
    {
        "Uncle Jesse": "jesse"
    },
    {
        " . The Duke boys race around in their customized 42 ": null
    },
    {
        "Dodge Charger": "dodge charger"
    },
    {
        " stock car": "stock car racing"
    },
    {
        ", dubbed  General Lee , evading crooked and corrupt ": null
    },
    {
        "county commission": "county commission"
    },
    {
        "er ": null
    },
    {
        "Boss Hogg": "boss hogg"
    },
    {
        "  and his bumbling and corrupt ": null
    },
    {
        "Sheriff Rosco P. Coltrane": "sheriff rosco p. coltrane"
    },
    {
        "  along with his deputy, and always managing to get caught in the middle of the various escapades and incidents that often occur in the area. Bo and Luke had previously been sentenced to probation for illegal transportation of ": null
    },
    {
        "moonshine": "moonshine"
    },
    {
        "; their Uncle Jesse made a ": null
    },
    {
        "plea bargain": "plea bargain"
    },
    {
        " with the U.S. Government to refrain from distilling moonshine in exchange for Bo and Lukes freedom. As a result, Bo and Luke are on five years probation and not allowed to carry firearms—instead, they often use ": null
    },
    {
        "compound bow": "compound bow"
    },
    {
        "s, sometimes with arrows tipped with ": null
    },
    {
        "dynamite": "dynamite"
    },
    {
        "—or to leave Hazzard County unless they get probation permission from their probation officer, Boss Hogg, although the exact details of their probation terms vary from episode to episode. Sometimes it is implied that they would be jailed for merely crossing the county line; on other occasions, it is shown that they may leave Hazzard, as long as they are back within a certain time limit. Several other technicalities of their probation also came into play at various times.     Corrupt ": null
    },
    {
        "county commission": "county commission"
    },
    {
        "er Jefferson Davis Boss Hogg, who either runs, or has his fingers in, virtually everything in Hazzard County, is forever angry with the Dukes, especially Bo and Luke, for always foiling his crooked schemes. He is always looking for ways to get them out of the picture so that his plots have a chance of succeeding. Many episodes revolve around Hogg trying to engage in an illegal scheme, sometimes with aid of hired criminal help. Some of these are ": null
    },
    {
        "get-rich-quick scheme": "get-rich-quick scheme"
    },
    {
        "s, though many others affect the financial security of the Duke farm, which Hogg has long wanted to acquire for various reasons. Other times, Hogg hires criminals from out of town to do his dirty work for him, and often tries to frame Bo and Luke for various crimes as part of these plots. Bo and Luke always seem to stumble over Hoggs latest scheme, sometimes by curiosity, and often by sheer luck, and put it out of business. Despite the Dukes often coming to his rescue , Hogg forever seems to have an irrational dislike of the clan, particularly Bo and Luke, often accusing them of spying on him, robbing or planning to rob him, and other supposedly nefarious actions, as he believes that they are generally out to get him.     The role of Boss Hogg was played by ": null
    },
    {
        "Sorrell Booke": "sorrell booke"
    },
    {
        ", who performed frequently on radio, stage, and film prior to his role in The Dukes of Hazzard. Boss Hogg is one of only two characters to appear in every episode of the TV series, the other being Uncle Jesse Duke.     The other main characters of the show include local mechanic ": null
    },
    {
        "Cooter Davenport": "cooter"
    },
    {
        " , who in early episodes was portrayed as a wild, unshaven rebel, often breaking or treading on the edge of the law, before settling down to become the Duke familys best friend and owns the local garage; and ": null
    },
    {
        "Enos Strate": "enos"
    },
    {
        " , an honest but naive young ": null
    },
    {
        "deputy": "deputy sheriff"
    },
    {
        " who, despite his friendship with the Dukes , is reluctantly forced to take part in Hogg and Roscos crooked schemes. In the third and fourth seasons, when Enos leaves for ": null
    },
    {
        "his own show": "enos"
    },
    {
        ", he is replaced by Deputy Cletus Hogg , Bosss cousin, who is slightly more wily than Enos but still a somewhat reluctant player in Hoggs plots.     Owing to their fundamentally good natures, the Dukes often wind up helping Boss Hogg out of trouble, albeit grudgingly. More than once Hogg is targeted by former associates who are either seeking revenge or have ": null
    },
    {
        "double cross": "betrayaldouble cross"
    },
    {
        "ed him after a scheme has unraveled in one way or another. Sheriff Coltrane also finds himself targeted in some instances. On such occasions, Bo and Luke usually have to rescue their adversaries as an inevitable precursor to defeating the bad guys; in other instances, the Dukes join forces with Hogg and Coltrane to tackle bigger threats to Hazzard or one of their respective parties. These instances became more frequent as the show progressed, and later seasons saw a number of stories where the Dukes and Hogg temporarily work together.          The series was developed from the 42 film  Moonrunners . Created by Gy Waldron in collaboration with ex-": null
    },
    {
        "moonshine": "moonshine"
    },
    {
        "r ": null
    },
    {
        "Jerry Rushing": "jerry rushing"
    },
    {
        ", this movie shares many ": null
    },
    {
        "identical and very similar names and concepts with the subsequent TV series": "moonrunnersconnections to the dukes of hazzard"
    },
    {
        ". Although itself essentially a comedy, this original movie was much cruder and edgier than the family-friendly TV series that would evolve from it.     In 42 Waldron was approached by ": null
    },
    {
        "Warner Bros.": "warner bros."
    },
    {
        " with the idea of developing Moonrunners into a television series. Waldron reworked various elements from Moonrunners, and from it was devised what would become The Dukes of Hazzard. Production began in October 42 with the original intention of only nine episodes being produced as mid-season filler. The first five episodes were filmed in ": null
    },
    {
        "Covington": "covington, georgia"
    },
    {
        " and ": null
    },
    {
        "Conyers": "conyers, georgia"
    },
    {
        ", ": null
    },
    {
        "Georgia": "georgia"
    },
    {
        " and surrounding areas, including some location work in nearby ": null
    },
    {
        "Atlanta": "atlanta"
    },
    {
        ". After completing production on the fifth episode, High Octane , the cast and crew broke for Christmas break, expecting to return in several weeks time to complete the ordered run of episodes. In the meantime, executives at Warner Bros. were impressed by the rough preview cuts of the completed episodes and saw potential in developing the show into a full-running series; part of this plan was to move production from Georgia to the ": null
    },
    {
        "Warner Bros. lot": "columbia ranch"
    },
    {
        " in ": null
    },
    {
        "Burbank, California": "burbank, california"
    },
    {
        ", primarily to simplify production as well as develop a larger workshop to service the large number of automobiles needed for the series.     Rushing appeared as shady used car dealer Ace Parker in the third episode produced, Repo Men . Rushing believed this to be the start of a recurring role, in return for which he would supply creative ideas from his experiences: many of the Dukes  characters and situations were derived from Rushings experiences as a youth, and much of the character of Bo Duke he states to be based on him. However, Repo Men would turn out to be the characters only appearance in the entire shows run, leading to a legal dispute in the following years over the rights to characters and concepts between Rushing and Warner Bros., although he remained on good terms with cast and crew and in recent years has made appearances at several fan conventions.     By the end of the first season, the family-friendly tone of The Dukes of Hazzard was mostly in place. When the show returned for a second season in ": null
    },
    {
        "fall": "autumn"
    },
    {
        " 42 , with a few further minor tweaks, the show quickly found its footing as a family-friendly comedy-adventure series. By the third season, starting in fall 42 the template was well set in place for that which would be widely associated with the show.     As well as its regular car chases, jumps and stunts, The Dukes of Hazzard relied on character familiarity, with each character effectively serving the same role within a typical episode, and with Deputy Cletus replacing Deputy Enos in Seasons 42 and 42 and Coy and Vance Duke temporarily replacing Bo and Luke for most of Season 42 being the only major cast changes through the shows run . Of the characters, only Uncle Jesse and Boss Hogg appeared in all 42 episodes; Daisy appears in all but one, the third seasons To Catch a Duke . The General Lee also appears in all but one .     It was largely filmed in ": null
    },
    {
        "Hidden Valley": "hidden valley, ventura county, california"
    },
    {
        " in ": null
    },
    {
        "Thousand Oaks, California": "thousand oaks, california"
    },
    {
        ", with scenes also shot at nearby ": null
    },
    {
        "Lake Sherwood": "lake sherwood, california"
    },
    {
        " and also at ": null
    },
    {
        "Paramount Ranch": "paramount ranch"
    },
    {
        " in nearby ": null
    },
    {
        "Agoura Hills": "agoura hills, california"
    },
    {
        ". Bidwell, Carol A. . The Conejo Valley: Old and New Frontiers. Windsor Publications. Pages 4242 .            Luke Duke   is the dark-haired, older Duke boy. More mature and rational than his cousin Bo, he is typically the one who thinks of the plan that will get the two out of whatever trouble they have got into. Luke wears a checked blue shirt and a denim jacket over it in first season and a few later second-season episodes. He is a veteran of the ": null
    },
    {
        "United States Marine Corps": "united states marine corps"
    },
    {
        " and a former boxer. Luke was the first Duke to perform the hood slide across The General Lee, which is seen in the opening credits of the show . According to Wopat the slide was an accident, because his foot got caught on the side of the General Lee when he attempted to jump across the hood; he also caught his arm on the hoods radio antenna, resulting in such antennas being removed from later versions of the General Lee.  However, the hood slide quickly proved popular and became a regular staple of episodes. The only episode to directly reference the age difference between Luke and Bo is in the seventh season opener, the flashback episode Happy Birthday, General Lee , where it is stated that Luke had already been in the Marines while Bo was in his last year at high school. Though Bo and Luke share the CB call sign Lost Sheep , in the season one episode Money to Burn , Luke refers to himself as Sittin Duck .    Bo Duke   is the blonde-haired, younger Duke boy. He is more of the shoot first, ask questions later type than Luke, and is often the one to get the duo into the various scrapes in which they find themselves, although the character did mature slightly as the series progressed. Bo is also more likely to have his eye, or heart, distracted by a pretty girl. Bo has a crush on many women in some episodes, which proves to be the ": null
    },
    {
        "Achilles heel": "achilles heel"
    },
    {
        " that leads the Dukes into trouble in several episode plots. Bo usually wears a cream-yellow shirt; for the first two seasons he wears a blue T-shirt underneath . This was slowly phased out during the third season. An ex-": null
    },
    {
        "stock car": "stock car racing"
    },
    {
        " driver, Bo is the one who drives  The General Lee  most of the time with Luke ": null
    },
    {
        "riding shotgun": "riding shotgun"
    },
    {
        ". He and Luke take turns of driving the General Lee in some episodes as they share the car with each other . Bo is known for his ": null
    },
    {
        "rebel yell": "rebel yell"
    },
    {
        ", Yeeeee-haaa, which he usually yells when the General Lee is airborne during a jump. The Duke boys share the ": null
    },
    {
        "CB": "citizens band radio"
    },
    {
        " call sign": "call sign"
    },
    {
        " or handle Lost Sheep .    Daisy Duke   is Bo, Luke, Coy, and Vances cousin. She is beautiful, honest, and kind, although she can sometimes be slightly over-trusting and naïve, which has led the Duke family into trouble on a number of occasions. She sometimes aspires to be a songwriter and singer, and at other times, a reporter. She races around Hazzard with her cousins, first in a yellow and black 42 ": null
    },
    {
        "Plymouth Road Runner": "plymouth road runner"
    },
    {
        " and then, from mid-season 42 on, in her trademark white 42 ": null
    },
    {
        "Jeep CJ42": "jeep cjcj-7"
    },
    {
        ", christened Dixie with a golden eagle emblem on the hood . Daisy works as a waitress at the Boars Nest, the local bar and ": null
    },
    {
        "pub": "pub"
    },
    {
        " owned by Boss Hogg, as part of an agreement with Boss Hogg so that he would give Uncle Jesse and the boys a loan for a lower interest rate so the boys could purchase the entry fee for a race in which they wished to race the General Lee. The arrangement was supposed to be for an indefinite time, but there are several times throughout the series when Hogg fires her. However, he always ends up rehiring her at the end of each episode because of various circumstances. Although Hogg is a nemesis to Daisy and her family, she is best friends with Hoggs wife Lulu. Daisy often uses her sex appeal and her position at the restaurant to get insider information to help the Dukes in foiling Hoggs various schemes. She also has the distinction of having her trademark provocatively high-cut jean short shorts named after her: ": null
    },
    {
        "daisy dukes": "daisy dukeas a sex symbol"
    },
    {
        " . Her CB handle is Bo Peep . Occasionally, the variant of Country Cousin is used.   Jesse Duke , referred to by just about everyone in Hazzard other than Boss Hogg as Uncle Jesse , is the patriarch of the Duke clan, and the father-figure to all of the Dukes who stay with him on the somewhat dilapidated Duke farm . Jesse apparently has no children of his own, and happily provides for his nephews and niece in the unexplained absence of all of their parents . In the third broadcast episode, Mary Kayes Baby , Jesse says that he has delivered many babies, including Bo and Luke. Jesse Duke, in his youth, had been a ": null
    },
    {
        "ridge-runner": "moonshine"
    },
    {
        " in direct competition with Boss Hogg whom he always calls J.D. . However, while both Boss Hogg and Uncle Jesse would scowl at the mention of the others name, the two enjoyed a lifelong friendship of sorts, with one helping the other when in desperate need. Jesse educated his nephews against Hogg, and often provides the cousins with inspirational sage advice. Uncle Jesse drives a white 42 ": null
    },
    {
        "Ford F42": "ford f-series"
    },
    {
        " pickup truck. In the barn, he also has his old moonshine-running car, called Sweet Tillie in its first appearance , but referred to as Black Tillie in subsequent appearances. In the second-season episode Follow That Still and the sixth-season episode The Boars Nest Bears , the marriage to and death of his wife is mentioned; he also mentions marrying her in the first-season episode Lukes Love Story . His CB handle is Shepherd .    Sheriff Rosco P. Coltrane   is the bumbling and corrupt ": null
    },
    {
        "sheriff": "sheriffs in the united states"
    },
    {
        " of Hazzard County and right-hand man and brother-in-law of its corrupt county administrator, Jefferson Davis J.D. Hogg , whom Rosco calls his little fat buddy , Little Chrome Dome , Little Meadow-Muffin , and several other names. In the early episodes, it is mentioned that Rosco spent the first 42 years of his career as a mostly honest lawman, but after the county voted away his pension Rosco joined Hogg in an effort to fund his retirement in his last couple of years as sheriff. Early episodes also portray him as a fairly hard-nosed, somewhat darker policeman character, who even shoots a criminal during the first season. As the series progressed and producers recognized how popular it had become with children, Best altered his portrayal into a more bumbling, comical character. By the end of the first season, his origin had been virtually forgotten . Rosco is also the younger brother of Lulu Coltrane Hogg . Rosco frequently initiates car chases with Bo and Luke Duke, but the Duke boys usually elude Rosco by outwitting him, with Rosco typically wrecking his patrol car as a result from which he would nearly always escape unscathed . These chases are often the result of Rosco setting up illegal speed traps such as false or changing speed limit signs and various other trickery, which would evolve into being increasingly more cartoonish and far-fetched as the seasons passed. While he enjoys hot pursuit he seemingly never intends for anyone to get seriously hurt. His middle initial, P, was added at the start of the second season, and only one episode reveals his middle name, Purvis . Rosco also has a soft spot for his ": null
    },
    {
        "basset hound": "basset hound"
    },
    {
        " Flash, introduced at the start of the third season. His radio codename is Red Dog . When Best briefly boycotted the show during the mid-second season, he was temporarily replaced by several one-off sheriffs, the longest standing being Sheriff Grady Bird, played by ": null
    },
    {
        "Dick Sargent": "dick sargent"
    },
    {
        ", who appeared in two episodes .    Boss Jefferson Davis J.D. Hogg   is the wealthiest man in Hazzard County and owns most of its property and businesses—whether directly or by holding the ": null
    },
    {
        "mortgages": "mortgage law"
    },
    {
        " over the land. Usually dressed in an all-white suit, he is the fat, greedy, corrupt County Commissioner with visions of grandeur, a voracious appetite for food, who constantly orders Rosco to  Get them Duke boys!  He is also Bo and Lukes probation officer; when Bo and Luke need to leave Hazzard they always get permission from him. Boss Hogg is also married to Roscos fat sister , a point that does not always sit well with either Boss Hogg or Rosco; Hogg sometimes claims that Rosco is indebted to him because of it, though his on-screen interactions with Lulu typically show him loving her deeply . In addition to his role as county commissioner he is also the police commissioner, land commissioner, and bank president. Boss is also the chief of the Hazzard Fire Department and the owner of, or primary mortgage holder on, most of the places in the county, including the Boars Nest, Rhubottems Store, Cooters garage and the Duke farm. It is implied in some episodes that he is the Justice of the Peace but in others Hazzard relies on a circuit judge. In the episode Coltrane vs. Duke , Hogg represents Rosco when he sues the Dukes, implying that he is a licensed attorney. His vehicle is a white 42 ": null
    },
    {
        "Cadillac Coupe de Ville": "cadillac de ville series"
    },
    {
        " convertible, with bull horns mounted on the hood. In the first few seasons, he is almost always driven around by a ": null
    },
    {
        "chauffeur": "chauffeur"
    },
    {
        ". His old moonshine-running car was called the Grey Ghost . Every morning, Boss Hogg would drink coffee and eat raw liver . The Dukes of Hazzard: One Armed Bandits DVD commentary track by John Schneider and Catherine Bach Boss Hogg is described in one analysis as an ineffectual bad guy--hence amusing . John Shelton Reed, Southern Folk, Plain and Fancy: Native White Social Types , p. 42   Cooter Davenport  is the Hazzard County mechanic, nicknamed Crazy Cooter . In the early episodes, he is a wild man, often breaking the law. By the end of the first season, he has settled down and become an easy-going good ol boy. Although not mentioned in the first couple of episodes, by the mid-first season, he owns Cooters Garage in Hazzard County Square, directly across from the Sheriffs Department. Cooter is an honorary Duke , as he shares the same values and often assists the Dukes in escaping Roscos clutches, or helps them to foil Boss Hoggs schemes. During the second season, Jones left the series for a few episodes due to a dispute over whether the character should be clean-shaven or have a full beard. In his absence, Cooters place was filled by several of Cooters supposed cousins who were never mentioned before or since. Jones returned when the dispute was solved—Cooter would be clean-shaven . Cooter drives a variety of trucks, including ": null
    },
    {
        "Fords": "ford motor company"
    },
    {
        ", ": null
    },
    {
        "Chevys": "chevrolet"
    },
    {
        ", and ": null
    },
    {
        "GMCs": "gmc"
    },
    {
        ". His CB handle is Crazy Cooter and he often starts his CB transmissions with Breaker one, Breaker one, I might be crazy but I aint dumb, Craaaazy Cooter comin atcha, come on.   Deputy Enos Strate  is a friend of the Dukes, but, while working for Rosco and Boss is often forced into pursuing the Dukes and/or arresting them on trumped-up charges. In the early episodes, Enos is shown to be a rather good driver , but by the end of the first season, he is shown to be as incompetent a driver as Rosco. When he returns from his stint in Los Angeles, he seems to be able to stand up to Boss and Rosco slightly more, and sometimes refuses to participate in their schemes. In the early episodes, Rosco frequently calls him jackass , which soon evolved into the more family-friendly dipstick as the show became a hit with younger viewers . Enos has a crush on Daisy Duke that she often uses to the Dukes advantage in unraveling Hogg and Roscos schemes. Enos is very much in love with Daisy, and although Daisy seems to love him back, it is supposedly only as a close friend. In the penultimate episode, Enos and Daisys Wedding , the two plan on getting married, only to have Enos call it off at the last minute due to an attack of ": null
    },
    {
        "hives": "urticaria"
    },
    {
        ", brought on by the excitement of possibly being married to Daisy. Later, in the ": null
    },
    {
        "first reunion movie": "the dukes of hazzard: reunion!"
    },
    {
        ", Enos and Daisy become a pair again and plan to get married, but this time Daisy backs out at the last minute, upon the unexpected sight of her ex-husband.   Deputy Cletus Hogg , Boss Hoggs second cousin twice removed, is generally friendly and dim-witted. Like Enos, Cletus is often forced by Rosco and Hogg to chase the Dukes on trumped up charges. While Cletus is good-hearted, and sometimes resentful of having to treat the Dukes in such a way, he is somewhat more willing to go along with Hogg and Rosco than Enos. Cletus has a crush on Daisy and is even convinced she wants to marry him. Like Enos and Rosco, Cletus frequently ends up landing in a pond when pursuing the Duke boys in a ": null
    },
    {
        "car chase": "car chase"
    },
    {
        ". Cletus makes his first appearance as the driver of a bank truck, part of Hoggs latest get-rich-quick scheme, in the first-season episode Money To Burn , and becomes temporary deputy while Enos is away in the second-season episodes The Meeting and Road Pirates . Leaving a job at the local junkyard, he becomes permanent deputy in the third seasons Enos Strate to the Top . After Enos return, the pair both serve as deputies and share the same patrol car until 42s ": null
    },
    {
        "reunion movie": "the dukes of hazzard: reunion!"
    },
    {
        ". Each of the Hazzard County Sheriffs Department officers drives various mid- to late42s Chrysler mid-size ": null
    },
    {
        "B body": "chrysler b platform"
    },
    {
        " patrol cars, most often a ": null
    },
    {
        "Dodge Monaco": "dodge monaco"
    },
    {
        " or ": null
    },
    {
        "Plymouth Fury": "plymouth fury"
    },
    {
        ".   Coy Duke  is another blonde-haired cousin who moves to Uncle Jesses farm along with his cousin Vance after Bo and Luke left Hazzard to join the ": null
    },
    {
        "NASCAR": "nascar"
    },
    {
        " circuit in season 42 Like his cousin Bo, he often drives the General Lee and is a bit wilder than Vance and chases women; he and Vance are only in the first 42 episodes of season 42 and Coy and Vance are in only one episode with their cousins Bo and Luke when they return from the NASCAR circuit. Supposedly, with cousin Vance, Coy had previously lived on the Duke farm until 42 before the series had started.   Vance Duke , an obvious replacement for Luke, filled the void of a dark-haired Duke on the show. Like Luke, Vance is more the thinker and the planner of the duo along with being more mature than Coy and he is also a former ": null
    },
    {
        "Merchant Marine": "merchant marine"
    },
    {
        "r.   The Balladeer  sings and plays the Dukes of Hazzard theme song, Good Ol Boys , and also serves as the shows narrator. During each episode, he provides an ": null
    },
    {
        "omniscient": "narrationthird person"
    },
    {
        " viewpoint of the situations presented, and regularly interjects comical ": null
    },
    {
        "aside": "aside"
    },
    {
        "s during crucial plot points  and down home aphorisms . After numerous requests from fans to see the Balladeer on-screen, Jennings finally appeared in one episode, the seventh seasons aptly titled Welcome, Waylon Jennings , in which he was presented as an old friend of the Dukes.   Flash is a slow-paced ": null
    },
    {
        "basset hound": "basset hound"
    },
    {
        " and Roscos loyal companion, who hates Hogg but loves the Dukes. She first appeared in the first official third-season episode Enos Strate to the Top , although the dog was not formally introduced in that episode. Initially referred to as a boy, Flash is later regularly a girl . Flash was added at the start of the third season, after James Best suggested to the producers that Rosco have a dog. Rosco doted on Flash, often calling her Velvet Ears . Flash was portrayed by several basset hounds during the series , the most regular being Sandy . James Best bought a share of Sandy, who was rescued from an ": null
    },
    {
        "animal shelter": "animal shelter"
    },
    {
        " and was trained by Alvin Mears of Alvin Animal Rentals. Sandy lived to age 42 A ": null
    },
    {
        "stuffed": "stuffed toy"
    },
    {
        " dog named Flush was used for dangerous stunt work in a few episodes.      The pilot episode was to include a barber modeled after ": null
    },
    {
        "Floyd Lawson": "floyd lawson"
    },
    {
        " on  The Andy Griffith Show  as a regular character, but was eliminated when the final draft of the pilots script was written and before the show was cast.     When John Schneider auditioned for the role of Bo Duke, he came to the audition in a dilapidated pickup truck, sporting a week-long beard growth, wearing overalls and a white T-shirt with a pack of cigarettes rolled up in a sleeve collar, and carrying a can of beer, trying to look the part. At the audition, Schneider drank the beer and said he was from ": null
    },
    {
        "Snellville": "snellville"
    },
    {
        ". The producers bought his good ol boy act and Schneider was hired on the spot.              Throughout its network television run, The Dukes of Hazzard had a consistent mix of up-and-comers and established stars make guest appearances.     ": null
    },
    {
        "Robert Alda": "robert alda"
    },
    {
        " Carlos Brown/Alan Autry": "alan autry"
    },
    {
        " Anthony De Longis": "anthony de longis"
    },
    {
        " James Avery": "james avery"
    },
    {
        " Norman Alden": "norman alden"
    },
    {
        " Rayford Barnes": "rayford barnes"
    },
    {
        " Pat Buttram": "pat buttram"
    },
    {
        " Dennis Burkley": "dennis burkley"
    },
    {
        " Clancy Brown": "clancy brown"
    },
    {
        " Regis Cordic": "regis cordic"
    },
    {
        " Charles Cyphers": "charles cyphers"
    },
    {
        " Roz Kelly": "roz kelly"
    },
    {
        " Conlan Carter": "conlan carter"
    },
    {
        " Ji-Tu Cumbuka": "ji-tu cumbuka"
    },
    {
        " Ben Davidson": "ben davidson"
    },
    {
        " Elinor Donahue": "elinor donahue"
    },
    {
        " Jason Evers": "jason evers"
    },
    {
        " Jonathan Frakes": "jonathan frakes"
    },
    {
        " Janie Fricke": "janie fricke"
    },
    {
        " Michael Fairman": "michael fairman"
    },
    {
        " David Gale": "david gale"
    },
    {
        " David Graf": "david graf"
    },
    {
        " Joy Garrett": "joy garrett"
    },
    {
        " M. C. Gainey": "m. c. gainey"
    },
    {
        " Henry Gibson": "henry gibson"
    },
    {
        " Burton Gilliam": "burton gilliam"
    },
    {
        " Linda Hart": "linda hart"
    },
    {
        " Dennis Haskins": "dennis haskins"
    },
    {
        " Ernie Hudson": "ernie hudson"
    },
    {
        " Kevin Peter Hall": "kevin peter hall"
    },
    {
        " Waylon Jennings": "waylon jennings"
    },
    {
        " Arte Johnson": "arte johnson"
    },
    {
        " Stepfanie Kramer": "stepfanie kramer"
    },
    {
        " Lance LeGault": "lance legault"
    },
    {
        " Loretta Lynn": "loretta lynn"
    },
    {
        " Britt Leach": "britt leach"
    },
    {
        " Jon Locke": "jon locke"
    },
    {
        " Brion James": "brion james"
    },
    {
        " Arte Johnson": "arte johnson"
    },
    {
        " L. Q. Jones": "l. q. jones"
    },
    {
        " Frank Marth": "frank marth"
    },
    {
        " Robin Mattson": "robin mattson"
    },
    {
        " John Matuszak": "john matuszak"
    },
    {
        " Donald May": "donald may"
    },
    {
        " Gerald McRaney": "gerald mcraney"
    },
    {
        " Louise Minchin": "louise minchin"
    },
    {
        " Richard Moll": "richard moll"
    },
    {
        " Chris Mulkey": "chris mulkey"
    },
    {
        " Charles Napier": "charles napier"
    },
    {
        " Tim OConnor": "tim oconnor"
    },
    {
        " Roy Orbison": "roy orbison"
    },
    {
        " Johnny Paycheck": "johnny paycheck"
    },
    {
        " Kim Richards": "kim richards"
    },
    {
        " Hari Rhodes": "hari rhodes"
    },
    {
        " Roger Robinson": "roger robinson"
    },
    {
        " Dick Sargent": "dick sargent"
    },
    {
        " Ronnie Schell": "ronnie schell"
    },
    {
        " Avery Schreiber": "avery schreiber"
    },
    {
        " Judson Scott": "judson scott"
    },
    {
        " Reid Smith": "reid smith"
    },
    {
        " William Smith": "william smith"
    },
    {
        " Don Stroud": "don stroud"
    },
    {
        " Les Tremayne": "les tremayne"
    },
    {
        " Mel Tillis": "mel tillis"
    },
    {
        " Mary Treen": "mary treen"
    },
    {
        " Lurene Tuttle": "lurene tuttle"
    },
    {
        " Lewis Van Bergen": "lewis van bergen"
    },
    {
        " Joseph Whipp": "joseph whipp"
    },
    {
        " Dottie West": "dottie west"
    },
    {
        " Hal Williams": "hal williams"
    },
    {
        " Steven Williams": "steven williams"
    },
    {
        " Terry Wilson": "terry wilson"
    },
    {
        "   Morgan Woodward": "morgan woodward"
    },
    {
        " Tammy Wynette": "tammy wynette"
    },
    {
        " Cale Yarborough": "cale yarborough"
    },
    {
        "       NASCAR": "nascar"
    },
    {
        " driver ": null
    },
    {
        "Terry Labonte": "terry labonte"
    },
    {
        " makes a brief, uncredited appearance as a crewman in the episode Undercover Dukes Part 42 . The race cars supplied for both Part 42 and Part 42 of Undercover Dukes were supplied by Labontes race owner, ": null
    },
    {
        "Billy Hagan": "billy hagan"
    },
    {
        ". However, the emblems of the sponsors of the cars  were covered to avoid paying royalties.       During the shows second season, the shows writers began flirting with the idea of incorporating a celebrity speed trap into some of the episodes, as a means to feature top ": null
    },
    {
        "country": "country music"
    },
    {
        " stars of the day performing their hits. On its first couple of instances, the speed trap was featured early in the story, but for most of the cases, it was featured in the last few minutes of an episode, often used when the main story was running too short to fill episode time.     The celebrity speed trap feature was essentially similar: Aware that a big-name country star was passing through the area, Boss Hogg would order Rosco to lower the speed limit on a particular road to an unreasonable level , so that the targeted singer would be in violation of the posted limit. The singer would be required to give a free performance at the Boars Nest in exchange for having their citations forgiven; the performer would then perform one of their best-known hits or other popular country music standard, while the Dukes, Boss, Rosco, Enos, Cletus, Cooter, and other patrons whooped and hollered in enjoyment of the performance. More often than not, the performer would give a sarcastic parting shot to Boss and Rosco.     Singers who were featured in the speed trap segments were:     ": null
    },
    {
        "Hoyt Axton": "hoyt axton"
    },
    {
        " Donna Fargo": "donna fargo"
    },
    {
        " Freddy Fender": "freddy fender"
    },
    {
        " Doug Kershaw": "doug kershaw"
    },
    {
        "   The Oak Ridge Boys": "the oak ridge boys"
    },
    {
        "   Roy Orbison": "roy orbison"
    },
    {
        " Buck Owens": "buck owens"
    },
    {
        " Johnny Paycheck": "johnny paycheck"
    },
    {
        "   Mel Tillis": "mel tillis"
    },
    {
        " Dottie West": "dottie west"
    },
    {
        " Tammy Wynette": "tammy wynette"
    },
    {
        " Waylon Jennings": "waylon jennings"
    },
    {
        "     Honorable mentions: ": null
    },
    {
        "Mickey Gilley": "mickey gilley"
    },
    {
        ", ": null
    },
    {
        "Loretta Lynn": "loretta lynn"
    },
    {
        "     Gilleys and Lynns appearances were not solely for the celebrity speed trap. After performing a concert in Hazzard, Gilley was nabbed while leaving and forced to do a second show to nullify his citation. Lynn was kidnapped by criminals wanting to break into the music business. Loretta Lynn was the very first country music guest star on the show in 42 and had an entire episode dedicated to her titled Find Loretta Lynn .     Note: ": null
    },
    {
        "Janie Fricke": "janie fricke"
    },
    {
        " was the only country music guest star who did not perform a song, celebrity speed trap or otherwise. She played an accomplice to a robber in an episode who hid money in the dashboard of the car that was to become the General Lee.            The Dukes of Hazzard was consistently among the top-rated television series . With that success came huge profits in merchandising, with a wide array of Dukes of Hazzard toys and products being licensed and becoming big sellers. However, over the course of the shows fourth season, series stars Tom Wopat and John Schneider—who had already previously voiced their concern and discontent about increasingly inferior scripts being written for episodes—became increasingly concerned about a contract dispute over their salaries and merchandising royalties owed to them over the high sales of Dukes products. They felt that neither of them were being paid what was owed to them and this became very frustrating to the duo. As a result, in the spring of 42 as filming was due to begin on the fifth season, Wopat and Schneider did not report to the set in protest over the matter. Catherine Bach also considered walking out due to similar concerns, but Wopat and Schneider convinced her to stay, insisting that if she left then there might not be a show to come back to, and that settling the issue was up to them.      Production was pushed back by a few weeks as fairly similar looking replacements were subsequently, hastily hired: ": null
    },
    {
        "Byron Cherry": "byron cherry"
    },
    {
        " as Coy Duke and ": null
    },
    {
        "Christopher Mayer": "christopher mayer"
    },
    {
        " as Vance Duke. Bo and Luke were said to have gone to race on the ": null
    },
    {
        "NASCAR": "nascar"
    },
    {
        " circuit; how they managed to do this, bearing in mind the terms of their probation, was never explained. Cherry and Mayer were originally contracted at just 42 episodes as stand-ins, still with hope that a settlement might be reached with Wopat and Schneider  . Some scripts for Coy and Vance were originally written for Bo and Luke but with their names quite literally crossed out and Coy and Vance penned in.     The new Dukes—previously-unmentioned nephews of Uncle Jesse, who were said to have left the farm in 42 before the show had started—were unpopular with the great majority of viewers, and the ratings immediately sank. Much of the criticism was that Coy and Vance were nothing but direct clones of Bo and Luke, with Coy a direct carbon copy replacement for Bo and Vance for Luke, with little variation in character. This was something that even show creator Gy Waldron has said was wrong,  and that he insisted, unsuccessfully, that audiences would not accept direct character clones and the two replacements should be taken in a different direction characterwise, but was overridden by the producers. Waldron also commented that if Bach too had walked, the show would have most probably been cancelled. It was reported that prior to filming, Cherry and Mayer were given Bo and Luke episodes to watch, to study and learn to emulate them, although Cherry has said in interviews that he does not recall this ever happening.     Hit hard by the significant drop in ratings, Warner Bros. renegotiated with Wopat and Schneider, and eventually a settlement was reached, and the original Duke boys returned to the series in early 42 four episodes from the conclusion of the fifth season. Initially, part of the ": null
    },
    {
        "press release": "press release"
    },
    {
        " announcing Wopat and Schneiders return suggested that Cherry and Mayer would remain as part of the cast ,  but it was quickly realized that four Duke boys would not work within the context of the series, and due to the huge unpopularity associated with their time on the show, they were quickly written out of the same episode in which Bo and Luke returned.       Although Coy and Vance were never popular with the majority, a few viewers were disappointed by their departure episode, Welcome Back, Bo N Luke , which was for the most part a standard episode, with the return of Bo and Luke and the departure of Coy and Vance tacked onto the beginning . Even a few viewers commented that they were disappointed by this, and that they would have liked to have seen both pairs of Duke boys team up to tackle a particularly dastardly plot by Boss Hogg before Coy and Vances departure, but as it turned out, Coy and Vance had little dialogue and were gone by the first commercial break, never to be seen or mentioned again.      While the return of Bo and Luke was welcomed by ardent and casual viewers alike, and as a result ratings recovered slightly, the show never completely regained its former popularity. One of Wopat and Schneiders disputes even before they left was what they considered to be increasingly weak and formulaic scripts and episode plots.  With Wopat and Schneiders return, the producers agreed to try a wider scope of storylines.  However, although it continued for two more seasons, the show never fully returned to its former glory. Many cast members, such as Tom Wopat, decried the miniature car effects newly incorporated to depict increasingly absurd General Lee and patrol car stunts .  The miniature car effects were intended as a budget saving measure and to help compete visually with ": null
    },
    {
        "KITT": "kitt"
    },
    {
        " from the ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " series  Knight Rider . In February 42 The Dukes of Hazzard ended its run after seven seasons.                      The ": null
    },
    {
        "General Lee": "general lee"
    },
    {
        " was based on a 42 ": null
    },
    {
        "Dodge Charger": "dodge charger"
    },
    {
        "  owned by Bo and Luke . It was orange with a ": null
    },
    {
        "Confederate battle flag": "flags of the confederate states of americathe   confederate flag"
    },
    {
        " painted on the roof, the words GENERAL LEE over each door, and the number 42 on each door. In the original five Georgia-filmed episodes, a Confederate flag along with a checkered racing flag in a criss-cross pattern could be seen behind the rear window; this was removed when it was felt that this extra detail did not show up enough on-screen to warrant the already very tight time constraints of preparing and repairing each example of the car. The name refers to the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        " Confederate": "confederate states of america"
    },
    {
        " General ": null
    },
    {
        "Robert E. Lee": "robert e. lee"
    },
    {
        ". The television show was based on the movie  Moonrunners , in turn based on actual moonshine runners who used a 42 Chrysler named Traveler, after ": null
    },
    {
        "General Lees horse": "traveller"
    },
    {
        " . Traveler was originally intended to be the name of the Duke boys stock car too, until producers agreed that General Lee had more punch to it.     Since it was built as a race car, the doors were welded shut. Through the history of the show, an estimated 42 Chargers were used; 42 are still known to exist in various states of repair. A replica was owned by John Schneider, known as Bos General Lee . In 42 Schneider sold Bos General Lee at the ": null
    },
    {
        "Barrett-Jackson": "barrett-jackson"
    },
    {
        " automobile auction for $42. An eBay auction which garnered a bid of $42,42 for the car was never finalized, with the purported bidder claiming his account had been hacked.  The underside of the hood has the signatures of the cast from the 42 TV movie. Schneider has also restored over 42 other General Lees to date. In 42 a replica of the General Lee fetched a high bid of $42 at the Barrett-Jackson auto auction. In 42 the General Lee 42 , the first car used in filming the series, was purchased at auction by golfer Bubba Watson for $42. The car had been scrapped after being wrecked during the famous opening jump shoot, and was later discovered in a junk-yard by the president of the North American General Lee fan club.  In 42 following a wave of sentiment against Confederate symbolism in the wake of ": null
    },
    {
        "shootings in Charleston, SC": "charleston church shooting"
    },
    {
        ", , Bubba Watson announced that he would remove the Confederate Flag from the roof of General Lee 42 and repaint it with the ": null
    },
    {
        "U.S. National Flag": "flag of the united states"
    },
    {
        ".      The show also used 42 Chargers by pop-riveting the I piece to the center of the 42s grille, as well as cutting out the tail lights, pop-riveting the 42 lenses in place, and removing the round side marker lights. These Chargers performed many record-breaking jumps throughout the show, almost all of them resulting in a completely destroyed car. No 42 Chargers were used, as backdating them proved to be too time consuming.     The Duke boys added a custom air horn to the General Lee that played the first 42 notes of the song  Dixie . The Dixie horn was not originally planned, until a Georgia local ": null
    },
    {
        "hot rod": "hot rod"
    },
    {
        " racer drove by and sounded his cars Dixie horn. The producers immediately rushed after him asking where he had bought the horn. Warner Bros. purchased several Chargers for stunts, as they generally destroyed at least one or two cars per episode. By the end of the shows sixth season, the Chargers were becoming harder to find, and more expensive. In addition, the television series  Knight Rider  began to rival the General Lees stunts. As such, the producers used 42:42 scale miniatures, filmed by Jack Sessums crew, or recycled stock jump footage—the latter being a practice that had been in place to an extent since the second season, and had increased as the seasons passed.     Some of the 42 and Confederate flag motifs were initially hand painted, but as production sped up, these were replaced with vinyl decals for quick application , as needed.     During the first five episodes of the show that were filmed in Georgia, the cars involved with filming were given to the crew at H & H body shop near the filming location. At this shop, the men worked day and night to prepare the wrecked cars for the next day while still running their body shop during the day. Time was of the essence, and the men that worked at this shop worked hard hours to get the cars prepared for the show.     The third episode Mary Kayes Baby is the only one in which the General Lee does not appear. Instead, the Dukes drove around in a blue 42 ": null
    },
    {
        "Plymouth Fury": "plymouth fury"
    },
    {
        " borrowed from Cooter that Luke later destroyed by shooting an arrow at the car, whose trunk had been leaking due to the moonshine stowed in the back.     The Duke boys CB handle was Lost Sheep . Originally when the show was conceived, their handle was to be General Lee to match their vehicle, but this was only ever used on-screen on one occasion, in the second episode, Daisys Song , when Cooter calls Bo and Luke over the CB by this handle, although they were actually driving Daisys Plymouth Road Runner at the time. As it became obvious that the General Lee handle would be out of place when the Duke boys were in another vehicle, the Lost Sheep handle was devised .          The 42 ": null
    },
    {
        "AMC Matador": "amc matador"
    },
    {
        "  was one of many different Hazzard County police cars used on the series, mostly in the first season; they had light bars and working radios. A 42 ": null
    },
    {
        "Dodge Polara": "dodge polara"
    },
    {
        "  and a 42 ": null
    },
    {
        "Dodge Monaco": "dodge monaco"
    },
    {
        "  were used during the pilot episode ": null
    },
    {
        " One Armed Bandits ": "list of the dukes of hazzard episodesep1"
    },
    {
        ", these were also seen in the shows title sequence. From the second season, the 42 ": null
    },
    {
        "Dodge Monaco": "dodge monaco"
    },
    {
        "  was mostly used. From mid-season four the similar looking 42 ": null
    },
    {
        "Plymouth Fury": "plymouth fury"
    },
    {
        "  was used instead. The Matadors and Furies were former Los Angeles Police Department vehicles, while the Monacos were former California Highway Patrol units.       A 42 ": null
    },
    {
        "Plymouth Road Runner": "plymouth road runner"
    },
    {
        "  was Daisy Dukes car in the first five episodes of the first season. For the last episodes of the first season a similarly painted 42 Plymouth Satellite Sebring with a matching Road Runner stripe was used. In the second season Bo and Luke send it off a cliff in The Runaway . Another identical Plymouth 42 model car appeared in the background a few more episodes along with the Jeep CJ42 until it was finally dropped altogether.       Dixie was the name given to Daisy Dukes white 42 ": null
    },
    {
        "Jeep CJ42": "jeep cjcj-7"
    },
    {
        " Golden Eagle which had a golden eagle emblem on the hood and the name Dixie on the sides. Like other vehicles in the show, there was actually more than one Jeep used throughout the series. Sometimes it would have an automatic transmission, and other times it would be a manual. The design of the roll cage also varied across the seasons. When the Jeep was introduced at the end of the second seasons The Runaway , it was seen to have doors and a slightly different paint job, but, bar one appearance in the next produced episode, Arrest Jesse Duke , thereafter the doors were removed and the paint job was made all-white, with Dixie painted on the sides of the hood. These Jeeps were leased to the producers of the show by ": null
    },
    {
        "American Motors Corporation": "american motors"
    },
    {
        " in exchange for a brief mention in the closing credits of the show.       Uncle Jesses truck was a white ": null
    },
    {
        "Ford": "ford motor company"
    },
    {
        " pickup truck": "pickup truck"
    },
    {
        ", most commonly a ": null
    },
    {
        "sixth-generation F42": "ford f-series"
    },
    {
        " Styleside.  However, in the earliest episodes it had a Flareside bed, and varied between F42 and F42 models throughout the shows run. Bo, Luke and Daisy also drove Jesses truck on occasion.       A white 42 ": null
    },
    {
        "Cadillac de Ville": "cadillac de ville series"
    },
    {
        " convertible was used as Boss Hoggs car, notably with large bull horns as a hood ornament. In early seasons, Hogg was almost always driven by a ": null
    },
    {
        "chauffeur": "chauffeur"
    },
    {
        ", who was normally nameless and had little or no dialogue, but identified on occasion as being called Alex ; and played by several different uncredited actors, including stuntman ": null
    },
    {
        "Gary Baxley": "gary baxley"
    },
    {
        ". This chauffeur would often be dressed in a red plaid shirt and deep brown or black Stetson hat, but on occasion would be an older man, sometimes dressed in more typical chauffeur attire.     Hogg is first seen to drive for himself in the second season opener Days of Shine and Roses , where he and Jesse challenge each other to one last moonshine race. From the fourth season onward, except for a couple of brief reappearances of the chauffeur , Hogg drove himself around in his Cadillac and frequently challenged others by invoking his driving expertise from his days as a ridge-runner. Unlike other vehicles in the series, Boss Hoggs Cadillac is typically treated with kid gloves. The car is almost always seen with its convertible top down, with the top only being seen in two episodes, Daisys Song , the second to be produced and broadcast, and briefly in the second-season episode Witness for the Persecution , when Cooter is returning it to the Court House after repairs.       A Green and blacked out 42 Ford Custom 42 sedan named Black Tilly was used by Uncle Jesse to make moonshine runs.            The theme song The Good Ol Boys was written and performed by ": null
    },
    {
        "Waylon Jennings": "waylon jennings"
    },
    {
        ". He was also The Balladeer , and served as narrator of the show. However, the version released as a single is not the same version that was used in the shows opening credits; the single version has a repeat of the chorus and an instrumental to pad out the length, uses a different instrumental mix that emphasizes the bass, and replaces the last verse with an inside joke about how the TV show producers keep on showing hands and not face on TV .     In 42 the song reached 42 on the American Country chart and peaked at 42 on the ": null
    },
    {
        "Billboard Hot 42": "billboard hot 100"
    },
    {
        ".         ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " on Friday nights, at 42:42  p.m. and later 42:42  p.m., preceding  Dallas  from January 42 42 to February 42 42   Until ": null
    },
    {
        "TNN": "spike tv"
    },
    {
        "  was purchased by ": null
    },
    {
        "Viacom": "viacom"
    },
    {
        ", it aired reruns of The Dukes of Hazzard. Some months after the creation of ": null
    },
    {
        "The National Network": "paramount network"
    },
    {
        " , the program was absent from much of television for quite some time. ": null
    },
    {
        "Viacom": "viacom"
    },
    {
        "s country music-themed cable network ": null
    },
    {
        "CMT": "cmt"
    },
    {
        " aired the show from 42 to 42 at 42:42  p.m. and 42:42  p.m. Eastern Time every weekday. CMT began airing the series in late February 42 It also aired Monday–Thursday on ": null
    },
    {
        "ABC Family": "freeform"
    },
    {
        ".   The series was broadcast by ": null
    },
    {
        "BBC42": "bbc one"
    },
    {
        " in the United Kingdom, debuting on Saturday March 42 42 at 42:42  p.m. . Popular with all ages , it quickly moved from its post-": null
    },
    {
        "watershed": "watershed united kingdom"
    },
    {
        " position to a more family-friendly Monday evening slot at 42:42  p.m. Soon a massive hit, it moved from Monday evenings to prime-time Saturday evening , where it stayed for a number of years. Later when ratings began to dip , it moved back to Mondays, making the odd return for short runs on Saturdays. Late episodes also popped up occasionally on Sunday afternoons, and the remaining episodes of the final season were broadcast on weekday mornings during school holidays in the late 42s.   In 42 UK satellite channel ": null
    },
    {
        "Sky42": "sky1"
    },
    {
        " bought a package of the program, owning the rights to the first 42 episodes produced , showing the series on Saturday afternoons at 42  p.m. They later showed the episodes they owned again, including a stint showing it in a weekday 42  p.m. slot, running for fifty minutes with the episodes heavily edited for time as a result, often leaving gaps in the plot. Despite requests from fans, they did not secure the rights to later episodes. The series was later run on the satellite channels ": null
    },
    {
        "Granada Plus": "plus"
    },
    {
        " and ": null
    },
    {
        "TNT": "tnt"
    },
    {
        ". UK satellite channel ": null
    },
    {
        "Bravo": "bravo"
    },
    {
        " began airing reruns in August 42   UK reruns are currently Shown on ": null
    },
    {
        "ITV42": "itv4"
    },
    {
        ".   In Brazil, the series was named Os Gatões , which limited its popularity among the male audience.   The series was also shown in the Netherlands by Dutch broadcasting organization ": null
    },
    {
        "AVRO": "algemene vereniging radio omroep"
    },
    {
        ", with Dutch subtitles, rather than being dubbed.   It was shown on ": null
    },
    {
        "Nine Network": "nine network"
    },
    {
        " in Australia from September 42 until the end of the series, and repeated throughout the 42s, 42s and 42s. It was quietly rerun on ": null
    },
    {
        "pay TV": "pay television"
    },
    {
        " channel ": null
    },
    {
        "TV42": "tv1"
    },
    {
        " in the 42s, but is now shown on Nine Networks subchannel, ": null
    },
    {
        "Go!": "9go!"
    },
    {
        ".   The series was popular in ": null
    },
    {
        "Colombia": "colombia"
    },
    {
        ", dubbed into Spanish. Some late-night reruns continue to the present day. ": null
    },
    {
        "Canale 42": "canale 5"
    },
    {
        ", under the title Hazzard and quickly became popular with the viewers.   ": null
    },
    {
        "CMT": "cmt"
    },
    {
        " aired The Dukes Ride Again, a special marathon which featured episodes from the first two seasons, on the weekend of September 42 42 and have begun airing episodes weeknights at 42  p.m. and 42  p.m. Eastern Time starting September 42 42   The series aired weekdays on New Zealands channel ": null
    },
    {
        "The BOX": "sky 5"
    },
    {
        ". Previously it aired on ": null
    },
    {
        "TVNZ": "tvnz"
    },
    {
        " for its original run, being repeated on Saturday afternoons in the early 42s.   CMT began to re-air The Dukes of Hazzard reruns in high definition, on January 42 42   ": null
    },
    {
        "TV Land": "tv land"
    },
    {
        " began to air The Dukes of Hazzard reruns on June 42 42 but removed them just three weeks later as a response to the ": null
    },
    {
        "Charleston church shooting": "charleston church shooting"
    },
    {
        " and the ensuing debate over the ": null
    },
    {
        "modern display of the Confederate flag": "modern display of the confederate battle flag"
    },
    {
        ".        Soon before the series ended its original run on CBS, The Dukes of Hazzard went into off-network syndication. Although not as widely run as it was back in the 42s and the years since, reruns of the program do continue to air in various parts of the United States.     Notably, television stations that aired the show in syndication include ": null
    },
    {
        "KCOP": "kcop-tv"
    },
    {
        " Los Angeles, ": null
    },
    {
        "WGN-TV": "wgn-tv"
    },
    {
        " Chicago, ": null
    },
    {
        "KBHK": "kbcw"
    },
    {
        " San Francisco, ": null
    },
    {
        "WKBD": "wkbd-tv"
    },
    {
        " Detroit, ": null
    },
    {
        "WTAF/WTXF": "wtxf-tv"
    },
    {
        " Philadelphia, ": null
    },
    {
        "KTXL": "ktxl"
    },
    {
        " Sacramento, ": null
    },
    {
        "WVTV": "wvtv"
    },
    {
        " Milwaukee, ": null
    },
    {
        "KMSP": "kmsp-tv"
    },
    {
        " Minneapolis–Saint Paul, among others.     Nationwide, the show also aired on ": null
    },
    {
        "ABC Family": "freeform"
    },
    {
        " and ": null
    },
    {
        "CMT": "cmt"
    },
    {
        " and ": null
    },
    {
        "TV Land": "tv land"
    },
    {
        " ; TV Land dropped the show in the wake of protests and controversy surrounding the ": null
    },
    {
        "display of the Confederate flag": "modern display of the confederate battle flag"
    },
    {
        ".      ": null
    },
    {
        "The Nashville Network": "the nashville network"
    },
    {
        " bought The Dukes of Hazzard from ": null
    },
    {
        "Warner Bros.": "warner bros."
    },
    {
        " in 42 for well over $42 million; not only did it improve the networks ratings, the show was also popular among younger viewers, a demographic TNN had a notorious difficulty in drawing; The Dukes of Hazzard has run either on TNN or sister network CMT ever since. Flint, Joe. . EW.com. Retrieved on August 42 42        ": null
    }
]