[
    {
        "Theodora Goes Wild is a 42 American romantic ": null
    },
    {
        "comedy film": "comedy film"
    },
    {
        " that tells the story of the residents in a small town who are incensed by a risqué novel, unaware that the book was written under a ": null
    },
    {
        "pseudonym": "pseudonym"
    },
    {
        " by a member of the towns leading family. It stars ": null
    },
    {
        "Irene Dunne": "irene dunne"
    },
    {
        " and ": null
    },
    {
        "Melvyn Douglas": "melvyn douglas"
    },
    {
        " and was directed by ": null
    },
    {
        "Richard Boleslawski": "richard boleslawski"
    },
    {
        ". The film was written by ": null
    },
    {
        "Mary McCarthy": "mary mccarthy"
    },
    {
        " and ": null
    },
    {
        "Sidney Buchman": "sidney buchman"
    },
    {
        ". It was nominated for ": null
    },
    {
        "Academy Awards": "academy awards"
    },
    {
        " for ": null
    },
    {
        "Best Actress in a Leading Role": "academy award for best actress"
    },
    {
        " for Irene Dunne and ": null
    },
    {
        "Best Film Editing": "academy award for film editing"
    },
    {
        ". Its often mentioned as a screwball comedy.     Prior to this film, Dunne had been cast in dramatic films. Theodora Goes Wild was her first comedy, and while it was reported in a biography of ": null
    },
    {
        "Cary Grant": "cary grant"
    },
    {
        " that she was unsure of herself in comedies, this extremely popular film proved to be the beginning of a new phase in her film career as a screen comedian.       Theodora Lynn  is a ": null
    },
    {
        "Sunday school": "sunday school"
    },
    {
        " teacher and former church organist in Lynnfield, ": null
    },
    {
        "Connecticut": "connecticut"
    },
    {
        ", raised by two spinster aunts, Mary  and Elsie Lynn . She also happens to be, under the ": null
    },
    {
        "pen name": "pen name"
    },
    {
        " Caroline Adams, the secret author of a bestselling book that has the straight-laced Lynnfield Literary Circle in an uproar. The book is ": null
    },
    {
        "serialized": "serial"
    },
    {
        " in the local newspaper, and the Literary Circle, led by outraged busybody Rebecca Perry , forces the newspapers owner Jed Waterbury  to stop printing the salacious installments.     Theodora travels to ": null
    },
    {
        "New York City": "new york city"
    },
    {
        " on the pretext of visiting her ": null
    },
    {
        "black sheep": "black sheep"
    },
    {
        " Uncle John , but actually goes to see her publisher Arthur Stevenson . Though Stevenson reassures an anxious Theodora that only he and his secretary know her identity, his wife Ethel  pressures him into an introduction, which the books illustrator Michael Grant  overhears. Intrigued, Michael invites himself to dinner with the Stevensons and Theodora. Theodora becomes annoyed when Michael smugly assumes that she is a teetotaler, so she orders a ": null
    },
    {
        "whiskey": "whiskey"
    },
    {
        ". As the night goes on, she becomes drunk. So does Ethel, forcing Arthur to take his wife home and leaving Theodora alone with Michael. When he makes a pass at her, she panics and flees, much to his amusement.     Michael tracks her to her hometown, and his whistling is immediately noticed outside her house. Because she technically is not supposed to know anyone outside of Lynnfield, he coerces her into hiring him as a gardener, thus scandalizing her aunts and providing Rebecca Perry with ample information for gossip. Michael declares that he is going to break Theodora out of her confining routine, ignoring her protests that she likes her life just the way it is. Despite herself, she enjoys herself when Michael makes her go ": null
    },
    {
        "berry": "berry"
    },
    {
        "picking and fishing with him. Finally, she finds the nerve to tell the disapproving women of the Literary Circle that she loves him. When she tells Michael what she has done, he is less than thrilled.     The next day, Theodora finds that he has gone back to New York and left her. She tracks him to his ": null
    },
    {
        "Park Avenue": "park avenue"
    },
    {
        " apartment. He admits he loves her, but then his father , the ": null
    },
    {
        "lieutenant governor": "lieutenant governor of new york"
    },
    {
        ", shows up, followed by Michaels wife Agnes . The estranged couple only have remained married to avoid causing a political scandal for Michaels father.     Theodora determines to free Michael just as he had done for her. He wants her to hold off until his fathers term ends in two years, but she is unwilling to wait that long. She courts publicity by revealing herself as the true Caroline Adams. She is staying in Michaels apartment even though he has moved out to get away from her, and she tells the press of her intention to publish a new book that details finding romance in her small town and searching for someone who will call her baby & ndash; a story that mimics her relationship with Michael. Meanwhile, Michael denies to the press that he has even met Theodora. She finally crashes the governors ball and arranges for reporters to photograph her embracing Michael. Agnes seeks a divorce to avoid looking like a fool.     Theodora returns to Lynnfield and is warmly welcomed as a celebrity, even by her now-supportive aunts. She causes further talk when she brings a newborn baby with her. When Michael, now divorced, sees the child, he tries to flee, but then Theodora reveals that the baby belongs to Rebecca Perrys own secretly married daughter.        ": null
    },
    {
        "Irene Dunne": "irene dunne"
    },
    {
        " as Theodora Lynn / Caroline Adams  ": null
    },
    {
        "Melvyn Douglas": "melvyn douglas"
    },
    {
        " as Michael Grant   ": null
    },
    {
        "Thomas Mitchell": "thomas mitchell"
    },
    {
        " as Jed Waterbury   ": null
    },
    {
        "Thurston Hall": "thurston hall"
    },
    {
        " as Arthur Stevenson   ": null
    },
    {
        "Rosalind Keith": "rosalind keith"
    },
    {
        " as Adelaide Perry   ": null
    },
    {
        "Elisabeth Risdon": "elisabeth risdon"
    },
    {
        " as Mary Lynn    ": null
    },
    {
        "Margaret McWade": "margaret mcwade"
    },
    {
        " as Elsie Lynn   ": null
    },
    {
        "Spring Byington": "spring byington"
    },
    {
        " as Rebecca Perry   ": null
    },
    {
        "Nana Bryant": "nana bryant"
    },
    {
        " as Ethel Stevenson   ": null
    },
    {
        "Henry Kolker": "henry kolker"
    },
    {
        " as Henry Grant   ": null
    },
    {
        "Leona Maricle": "leona maricle"
    },
    {
        " as Agnes Grant   ": null
    },
    {
        "Robert Greig": "robert greig"
    },
    {
        " as John Lynn          ": null
    },
    {
        "Orson Welles": "orson welles"
    },
    {
        " adapted the story for his ": null
    },
    {
        "Mercury Theatre": "mercury theatre"
    },
    {
        " players for a January 42 42 episode of  The Campbell Playhouse , with ": null
    },
    {
        "Loretta Young": "loretta young"
    },
    {
        " starring as Theodora.  ": null
    }
]