[
    {
        "Theoretical linguistics, or general linguistics, is the branch of ": null
    },
    {
        "linguistics": "linguistics"
    },
    {
        " which inquires into the nature of ": null
    },
    {
        "language": "language"
    },
    {
        " itself and seeks to answer fundamental questions as to what language is; how it works; how ": null
    },
    {
        "universal grammar": "universal grammar"
    },
    {
        " as a domain-specific mental organ operates, if it exists at all; what are its unique properties; how does language relate to other cognitive processes, etc. Theoretical linguists are most concerned with constructing models of linguistic knowledge, and ultimately developing a linguistic theory.     Since the 42s, the term theoretical linguistics has typically been used in more or less the same sense as general linguistics , even though it also contrasts with ": null
    },
    {
        "applied linguistics": "applied linguistics"
    },
    {
        ", and even though it is often said that language description is inherently theoretical. The usual terminology is thus not entirely clear and consistent.     In the first half of the 42th century, the term general linguistics was more common , which could be contrasted with language-particular linguistics .     The fields that are generally considered the core of theoretical linguistics are phonology, ": null
    },
    {
        "morphology": "morphology"
    },
    {
        ", syntax, and semantics. Although ": null
    },
    {
        "phonetics": "phonetics"
    },
    {
        " often guides phonology, it is often excluded from the purview of theoretical linguistics, along with ": null
    },
    {
        "semantics": "semantics"
    },
    {
        ". Theoretical linguistics also involves the search for an explanation of linguistic universals, that is, properties that all, or many ": null
    },
    {
        "language": "language"
    },
    {
        "s have in common.              ": null
    },
    {
        "Morphology": "morphology"
    },
    {
        " is the study of the internal structure of words. For example, in the sentences The dog runs and The dogs run, the ": null
    },
    {
        "word form": "word form"
    },
    {
        "s runs and dogs have an affix -s added, distinguishing them from the base forms dog and run. Adding this suffix to a ": null
    },
    {
        "nominal": "noun"
    },
    {
        " stem gives plural forms, and adding it to ": null
    },
    {
        "verb": "verb"
    },
    {
        "al stems restricts the ": null
    },
    {
        "subject": "subject"
    },
    {
        " to third-person singular. Some morphological theories operate with two distinct suffixes -s, called ": null
    },
    {
        "allomorph": "allomorph"
    },
    {
        "s of the ": null
    },
    {
        "morpheme": "morpheme"
    },
    {
        "s plural and third-person singular, respectively. Languages differ with respect to their morphological structure. Along one axis, ": null
    },
    {
        "analytic language": "analytic language"
    },
    {
        "s, with few or no affixes or other morphological processes, may be distinguished from ": null
    },
    {
        "synthetic language": "synthetic language"
    },
    {
        "s, with many affixes. Along another axis, ": null
    },
    {
        "agglutinative language": "agglutinative language"
    },
    {
        "s, whose affixes express only one grammatical property and are added neatly one after another, may be distinguished from ": null
    },
    {
        "fusional language": "fusional language"
    },
    {
        "s, with non-concatenative morphological processes  and/or with less clear-cut affix boundaries.       Phonetics is the study of speech sounds that concentrates on three main points:     ": null
    },
    {
        "Articulation": "manner of articulation"
    },
    {
        ": the production of speech sounds in human speech organs   ": null
    },
    {
        "Perception": "perception"
    },
    {
        ": how human ears respond to speech signals and how the human brain analyses them   Acoustic features: the physical characteristics of speech sounds and their loudness, amplitude, frequency, etc.     According to this definition, phonetics can also be called linguistic analysis of human speech at the surface level. That is one obvious difference from ": null
    },
    {
        "phonology": "phonology"
    },
    {
        ", which concerns the structure and organisation of speech sounds in natural languages has a theoretical and abstract nature. One example can be made to illustrate the distinction:     In English, the suffix -s can represent , , or it can be silent , depending on context.       ": null
    },
    {
        "Articulatory phonetics": "articulatory phonetics"
    },
    {
        " is a subfield of phonetics. In studying articulation, phoneticians attempt to document how humans produce speech sounds . That is, articulatory phoneticians are interested in how the different structures of the vocal tract, called the articulators , interact to create the specific sounds.       ": null
    },
    {
        "Auditory phonetics": "auditory phonetics"
    },
    {
        " is a branch of phonetics that is concerned with the hearing, acquisition and comprehension of phonetic sounds of words of a language. As articulatory phonetics explores the methods of sound production, auditory phonetics explores the methods of reception: the ear to the brain and those processes.       ": null
    },
    {
        "Acoustic phonetics": "acoustic phonetics"
    },
    {
        " is the subfield of phonetics that deals with acoustic aspects of speech sounds. Acoustic phonetics investigates properties like the mean-squared amplitude of a waveform, its duration, its ": null
    },
    {
        "fundamental frequency": "fundamental frequency"
    },
    {
        " or other properties of its frequency spectrum and the relationship of those properties to other branches of phonetics and to abstract linguistic concepts, such as phones, phrases or utterances.            ": null
    },
    {
        "Phonology": "phonology"
    },
    {
        "  is the study of how sounds are used in languages to convey meaning. Phonology includes topics such as ": null
    },
    {
        "stress": "stress"
    },
    {
        " and ": null
    },
    {
        "intonation": "intonation"
    },
    {
        ".     The basic unit of analysis for phonology is called ": null
    },
    {
        "phoneme": "phoneme"
    },
    {
        ", a group of sounds which are not distinguished by the rules of the language in determining the meaning. In English, for example,  and  are different ": null
    },
    {
        "allophone": "allophone"
    },
    {
        "s that represent the single phoneme .       ": null
    },
    {
        "Semantics": "semantics"
    },
    {
        " is the study of ": null
    },
    {
        "intension": "intension"
    },
    {
        ", the intrinsic meanings of words and phrases. Much work in the field of ": null
    },
    {
        "philosophy of language": "philosophy of language"
    },
    {
        " is concerned with the relation between meanings and the word, and this concern cross-cuts formal semantics in several ways. For example, both philosophers of language and semanticists make use of propositional, predicate and ": null
    },
    {
        "modal logic": "modal logic"
    },
    {
        "s to express their ideas about word meaning.       ": null
    },
    {
        "Syntax": "syntax"
    },
    {
        " is the study of language structure and phrasal hierarchies, depicted in ": null
    },
    {
        "parse tree": "parse tree"
    },
    {
        " format. It is concerned with the relationship between units at the level of words or morphology. Syntax seeks to exactly delineate all and only those sentences which make up a given language, using native speaker intuition. Syntax seeks to formally describe exactly how structural relations between elements in a sentence contribute to its interpretation. Syntax uses principles of formal logic and Set Theory to formalize and accurately represent the hierarchical relationship between elements in a sentence. ": null
    },
    {
        "Abstract syntax tree": "abstract syntax tree"
    }
]