[
    {
        "   Theoretical chemistry is the branch of chemistry which develops theoretical generalizations that are part of the theoretical arsenal of modern chemistry: for example, the concepts of chemical bonding, chemical reaction, valence, the surface of potential energy, molecular orbitals, orbital interactions, molecule activation, etc.       Theoretical chemistry unites principles and concepts common to all branches of chemistry. Within the framework of theoretical chemistry, there is a systematization of chemical laws, principles and rules, their refinement and detailing, the construction of a hierarchy. The central place in theoretical chemistry is occupied by the doctrine of the interconnection of the structure and properties of molecular systems. It uses mathematical and physical methods to explain the structures and dynamics of chemical systems and to correlate, understand, and predict their thermodynamic and kinetic properties. In the most general sense, it is explanation of chemical phenomena by methods of ": null
    },
    {
        "theoretical physics": "theoretical physics"
    },
    {
        ". In contrast to theoretical physics, in connection with the high complexity of chemical systems, theoretical chemistry, in addition to approximate mathematical methods, often uses semi-empirical and empirical methods.     In recent years, it has consisted primarily of ": null
    },
    {
        "quantum chemistry": "quantum chemistry"
    },
    {
        ", i.e., the application of quantum mechanics to problems in chemistry. Other major components include ": null
    },
    {
        "molecular dynamics": "molecular dynamics"
    },
    {
        ", ": null
    },
    {
        "statistical thermodynamics": "statistical thermodynamics"
    },
    {
        " and theories of ": null
    },
    {
        "electrolyte solutions": "electrolyte"
    },
    {
        ", ": null
    },
    {
        "reaction networks": "chemical reaction network theory"
    },
    {
        ", ": null
    },
    {
        "polymerization": "polymerization"
    },
    {
        ", ": null
    },
    {
        "catalysis": "catalysis"
    },
    {
        ", ": null
    },
    {
        "molecular magnetism": "magnetic momentexamples of molecular magnetism"
    },
    {
        " and ": null
    },
    {
        "spectroscopy": "spectroscopy"
    },
    {
        ".     Modern theoretical chemistry may be roughly divided into the study of chemical structure and the study of chemical dynamics. The former includes studies of: electronic structure, potential energy surfaces, and force fields; vibrational-rotational motion; equilibrium properties of condensed-phase systems and macro-molecules. Chemical dynamics includes: bimolecular kinetics and the collision theory of reactions and energy transfer; unimolecular rate theory and metastable states; condensed-phase and macromolecular aspects of dynamics.       ;": null
    },
    {
        "Quantum chemistry": "quantum chemistry"
    },
    {
        ": The application of ": null
    },
    {
        "quantum mechanics": "quantum mechanics"
    },
    {
        " or fundamental interactions to chemical and physico-chemical problems. Spectroscopic and magnetic properties are between the most frequently modelled.   ;": null
    },
    {
        "Computational chemistry": "computational chemistry"
    },
    {
        ": The application of ": null
    },
    {
        "computer code": "computational science"
    },
    {
        "s to chemistry, involving approximation schemes such as ": null
    },
    {
        "Hartree–Fock": "hartree–fock"
    },
    {
        ", ": null
    },
    {
        "post-Hartree–Fock": "post-hartree–fock"
    },
    {
        ", ": null
    },
    {
        "density functional theory": "density functional theory"
    },
    {
        ", ": null
    },
    {
        "semiempirical methods": "semi-empirical quantum chemistry method"
    },
    {
        "  or ": null
    },
    {
        "force field": "force field"
    },
    {
        " methods. Molecular shape is the most frequently predicted property. Computers can also predict vibrational spectra and vibronic coupling, but also acquire and Fourier transform Infra-red Data into frequency information. The comparison with predicted vibrations supports the predicted shape.   ;": null
    },
    {
        "Molecular modelling": "molecular modelling"
    },
    {
        ": Methods for modelling molecular structures without necessarily referring to quantum mechanics. Examples are ": null
    },
    {
        "molecular docking": "docking"
    },
    {
        ", ": null
    },
    {
        "protein-protein docking": "protein-protein docking"
    },
    {
        ", ": null
    },
    {
        "drug design": "drug design"
    },
    {
        ", ": null
    },
    {
        "combinatorial chemistry": "combinatorial chemistry"
    },
    {
        ". The fitting of shape and electric potential are the driving factor in this graphical approach.   ;": null
    },
    {
        "Molecular dynamics": "molecular dynamics"
    },
    {
        ": Application of ": null
    },
    {
        "classical mechanics": "classical mechanics"
    },
    {
        " for simulating the movement of the nuclei of an assembly of atoms and molecules. The rearrangement of molecules within an ensemble is controlled by Van der Waals forces and promoted by temperature.   ;": null
    },
    {
        "Molecular mechanics": "molecular mechanics"
    },
    {
        ": Modeling of the intra- and inter-molecular interaction ": null
    },
    {
        "potential energy surface": "potential energy surface"
    },
    {
        "s via potentials. The latter are usually parameterized from ab initio calculations.   ;": null
    },
    {
        "Mathematical chemistry": "mathematical chemistry"
    },
    {
        ": Discussion and prediction of the molecular structure using mathematical methods without necessarily referring to quantum mechanics. Topology is a branch of mathematics that allows researchers to predict properties of flexible finite size bodies like ": null
    },
    {
        "clusters": "cluster chemistry"
    },
    {
        ".   ;Theoretical ": null
    },
    {
        "chemical kinetics": "chemical kinetics"
    },
    {
        ": Theoretical study of the ": null
    },
    {
        "dynamical system": "dynamical system"
    },
    {
        "s associated to reactive ": null
    },
    {
        "chemical": "chemical"
    },
    {
        "s, the activated complex and their corresponding ": null
    },
    {
        "differential equation": "differential equation"
    },
    {
        "s.   ;": null
    },
    {
        "Cheminformatics": "cheminformatics"
    },
    {
        " : The use of computer and informational techniques, applied to crop information to solve problems in the field of chemistry.         Historically, the major field of application of theoretical chemistry has been in the following fields of research:   ": null
    },
    {
        "Atomic physics": "atomic physics"
    },
    {
        ": The discipline dealing with electrons and atomic nuclei.   ": null
    },
    {
        "Molecular physics": "molecular physics"
    },
    {
        ": The discipline of the electrons surrounding the molecular nuclei and of movement of the nuclei. This term usually refers to the study of molecules made of a few atoms in the gas phase. But some consider that molecular physics is also the study of bulk properties of chemicals in terms of molecules.   ": null
    },
    {
        "Physical chemistry": "physical chemistry"
    },
    {
        " and ": null
    },
    {
        "chemical physics": "chemical physics"
    },
    {
        ": Chemistry investigated via physical methods like ": null
    },
    {
        "laser": "laser"
    },
    {
        " techniques, ": null
    },
    {
        "scanning tunneling microscope": "scanning tunneling microscope"
    },
    {
        ", etc. The formal distinction between both fields is that physical chemistry is a branch of chemistry while chemical physics is a branch of physics. In practice this distinction is quite vague.   ": null
    },
    {
        "Many-body theory": "many-body theory"
    },
    {
        ": The discipline studying the effects which appear in systems with large number of constituents. It is based on ": null
    },
    {
        "quantum physics": "quantum physics"
    },
    {
        " – mostly ": null
    },
    {
        "second quantization": "second quantization"
    },
    {
        " formalism – and ": null
    },
    {
        "quantum electrodynamics": "quantum electrodynamics"
    },
    {
        ".     Hence, theoretical chemistry has emerged as a branch of research. With the rise of the ": null
    },
    {
        "density functional theory": "density functional theory"
    },
    {
        " and other methods like ": null
    },
    {
        "molecular mechanics": "molecular mechanics"
    },
    {
        ", the range of application has been extended to chemical systems which are relevant to other fields of chemistry and physics, including ": null
    },
    {
        "biochemistry": "biochemistry"
    },
    {
        ", ": null
    },
    {
        "condensed matter physics": "condensed matter physics"
    },
    {
        ", ": null
    },
    {
        "nanotechnology": "nanotechnology"
    },
    {
        " or ": null
    },
    {
        "molecular biology": "molecular biology"
    }
]