[
    {
        "Thermal history modelling is an exercise undertaken during ": null
    },
    {
        "basin modelling": "basin modelling"
    },
    {
        " to evaluate the temperature history of stratigraphic layers in a ": null
    },
    {
        "sedimentary basin": "sedimentary basin"
    },
    {
        ".     The thermal history of a basin is usually calibrated using thermal indicator data, including ": null
    },
    {
        "vitrinite": "vitrinite"
    },
    {
        " reflectance and ": null
    },
    {
        "fission track": "fission track"
    },
    {
        "s in the ": null
    },
    {
        "mineral": "mineral"
    },
    {
        "s ": null
    },
    {
        "apatite": "apatite"
    },
    {
        " and ": null
    },
    {
        "zircon": "zircon"
    },
    {
        ".     The temperatures undergone by rocks in a sedimentary basin are crucial when attempting to evaluate the quantity, nature and volume of ": null
    },
    {
        "hydrocarbon": "hydrocarbon"
    },
    {
        "s  produced by ": null
    },
    {
        "diagenesis": "diagenesis"
    },
    {
        " of ": null
    },
    {
        "kerogen": "kerogen"
    },
    {
        "s .     ": null
    },
    {
        "Fouriers": "jean baptiste joseph fourier"
    },
    {
        " Law": "fouriers law"
    },
    {
        " provides a simplified one-dimensional description of the variation in heat flow Q as a function of ": null
    },
    {
        "thermal conductivity": "thermal conductivity"
    },
    {
        " k and thermal gradient dT/dz:     : Q-k\\frac         If the assumptions used to justify this simplified approximation  are accepted, we define the simple 42-dimensional heat diffusion equation where temperature T at a depth z and time t is given by the equation:     : T_ T_^42 + Q_t \\int_42^z\\frac   where T t 42 is the surface temperature history, Q t is the ": null
    },
    {
        "heat flow": "heat flow"
    },
    {
        " history and k is thermal conductivity. The integral thus represents the integrated thermal conductivity history of a 42-dimensional column of rock.     Thermal history modelling attempts to describe the temperature history T z,t and therefore requires a knowledge of the burial history of the stratigraphic layers which is obtained through the process of ": null
    },
    {
        "back-stripping": "back-stripping"
    }
]