[
    {
        "The Thesmophoria  was an ancient Greek religious festival, held in honor of the goddess ": null
    },
    {
        "Demeter": "demeter"
    },
    {
        " and her daughter ": null
    },
    {
        "Persephone": "persephone"
    },
    {
        ". It was held annually, mostly around the time that seeds were sown in late autumn – though in some places it was associated with the harvest instead – and celebrated human and agricultural fertility. The festival was one of the most widely-celebrated in the Greek world. It was restricted to adult women, and the rites practised during the festival were kept secret. The most extensive sources on the festival are a comment in a ": null
    },
    {
        "scholion": "scholia"
    },
    {
        " on ": null
    },
    {
        "Lucian": "lucian"
    },
    {
        ", explaining the festival, and ": null
    },
    {
        "Aristophanes": "aristophanes"
    },
    {
        " play  Thesmophoriazusae , which parodies the festival.          The Thesmophoria was one of the most widespread ancient Greek festivals. The fact that it was celebrated across the Greek world suggests that it dates back to before the Greek settlement in ": null
    },
    {
        "Ionia": "ionia"
    },
    {
        " in the eleventh century BCE. The best evidence for the Thesmophoria concern its practice in Athens, but there is also information from elsewhere in the Greek world, including Sicily and ": null
    },
    {
        "Eretria": "eretria"
    },
    {
        ".     The festival was dedicated to Demeter and her daughter Persephone and was celebrated in order to promote fertility, both human and agricultural. It was celebrated only by women, and men were forbidden to see or hear about the rites. It is not certain whether all free women celebrated the Thesmophoria, or whether this was restricted to aristocratic women; whichever was the case, non-citizen and unmarried women appear not to have celebrated the festival.     In Athens, the Thesmophoria took place over three days, from the eleventh to the thirteenth of ": null
    },
    {
        "Pyanepsion": "pyanepsion"
    },
    {
        ". This corresponds to late October in the ": null
    },
    {
        "Gregorian calendar": "gregorian calendar"
    },
    {
        ", and was the time of the Greek year when seeds were sown. The Thesmophoria may have taken place in this month in other cities, though in some places – for instance ": null
    },
    {
        "Delos": "delos"
    },
    {
        " and ": null
    },
    {
        "Thebes": "thebes, greece"
    },
    {
        " – the festival seems to have taken place in the summer, and been associated with the harvest, instead. In other places the festival lasted for longer – in ": null
    },
    {
        "Syracuse, Sicily": "syracuse, sicily"
    },
    {
        ", the Thesmophoria was a ten-day long event.     The main source about the rituals of the Thesmophoria comes from a scholion on ": null
    },
    {
        "Lucian": "lucian"
    },
    {
        "s Dialogues of the Courtesans. A second major source is ": null
    },
    {
        "Aristophanes": "aristophanes"
    },
    {
        " play  Thesmophoriazusae ; however, Aristophanes portrayal of the festival mixes authentically Thesmophoric elements with elements from other Greek religious practice, especially the worship of ": null
    },
    {
        "Dionysus": "dionysus"
    },
    {
        ".          According to the scholiast on Lucian, during the Thesmophoria pigs were ": null
    },
    {
        "sacrificed": "animal sacrifice"
    },
    {
        ", and their remains were put into pits called megara. An inscription from Delos shows that part of the cost of the Thesmophoria there went towards paying for a ritual butcher to perform the sacrifices for the festival; literary evidence suggests that in other places, however, the sacrifices may have been made by the women themselves. Some time later, the rotten remains of these sacrifices were retrieved from the pits by bailers – women who were required to spend three days in a state of ritual purity before descending into the megara. These were placed on altars to Persephone and Demeter, along with cakes baked in the shape of snakes and phalluses. These remains were then scattered on fields when seeds were sown, in the belief that this would ensure a good harvest. According to ": null
    },
    {
        "Walter Burkert": "walter burkert"
    },
    {
        ", this practice was the clearest example in ": null
    },
    {
        "Greek religion": "religion in ancient greece"
    },
    {
        " of agrarian magic .     It is not certain how long the remains of the pigs were left in the megara. The fact that they had decomposed by the time that they were retrieved shows that they had been left in the pits for some time. Possibly they were thrown in during one festival and retrieved the next year. However, if they were thrown in during the Thesmophoria and retrieved in time for the sowing of seeds that year, then they may have only been left for a few weeks before being taken out again.       The first day of the Thesmophoria at Athens was known as anodos . This is usually thought to be because on this day the women celebrating the festival ascended to the shrine called the Thesmophorion. Preparations for the rest of the festival were made on this day: two women were elected to oversee the celebrations. Women also set up tents on this day; they would spend the rest of the festival staying in these rather than at home.     Matthew Dillon argues that the name anodos is more likely to relate to the ascent of Persephone from the underworld, which was celebrated at the festival. Dillon suggests that a sacrifice to celebrate this ascent was performed on the first day of the festival.       The second day of the festival was called the nesteia. This was a day of fasting, imitating Demeters mourning for the loss of her daughter. On this day, the women at the festival sat on the ground on seats made of plants which were believed to be ": null
    },
    {
        "anaphrodisiac": "anaphrodisiac"
    },
    {
        ". Angeliki Tzanetou says that ritual obscenity  was a feature of the second day of the festival; however, Dillon says that the ritual obscenity would have taken place on another day, not than the subdued second day, and Radek Chlup argues that it took place on the third day of the festival.       The third day of the Thesmophoria was kalligeneia, or beautiful birth . On this day, women called upon the goddess Kalligeneia, praying for their own fertility. Plutarch notes that in Eretria the women did not call upon Kalligeneia during the Thesmophoria.": null
    }
]