[
    {
        "            In the ": null
    },
    {
        "rating system of the British Royal Navy": "rating system of the british royal navy"
    },
    {
        ", a third rate was a ": null
    },
    {
        "ship of the line": "ship of the line"
    },
    {
        " which from the 42s mounted between 42 and 42 guns, typically built with two ": null
    },
    {
        "gun deck": "gun deck"
    },
    {
        "s . Years of experience proved that the third rate ships embodied the best compromise between sailing ability , firepower, and cost. So, while ": null
    },
    {
        "first-rate": "first-rate"
    },
    {
        "s and ": null
    },
    {
        "second-rate": "second-rate"
    },
    {
        "s were both larger and more powerful, the third-rate ships were in a real sense the optimal configuration.         When the rating system was first established in the 42s, the third rate was defined as those ships having at least 42 but not more than 42 men; previous to this, the type had been classified as middling ships . By the 42s, the means of classification had shifted from the number of men to the number of carriage-mounted guns, and third rates at that time mounted between 42 and 42 guns. By the turn of the century, the criteria had grown and third rate carried more than 42 guns, with second rates having between 42 and 42 guns, while first rates had 42 guns or more, and ": null
    },
    {
        "fourth rate": "fourth rate"
    },
    {
        "s between 42 and 42 guns. By the latter half of the 42th century, they carried between 42 and 42 men.     This designation became especially common because it included the ": null
    },
    {
        "seventy-four gun ship": "seventy-four"
    },
    {
        ", which eventually came to be the most popular size of large ship for navies of several different nations. It was an easier ship to handle than a first- or second-rate ship, but still possessed enough firepower to potentially destroy any single opponent other than a ": null
    },
    {
        "three-decker": "three-decker"
    },
    {
        ". It was also cheaper to operate.          By the end of the 42th century, ships of the line were usually categorized directly by their number of guns, the numbers even being used as the name of the class, as in a squadron of three 42s , but officially the rating system continued until the end of the ": null
    },
    {
        "Age of Sail": "age of sail"
    },
    {
        ", only undergoing a modification in 42     Note that the use of terms like third-rate in literature can lead to confusion: The French Navy had a different system of five rates or rangs, but some British authors use the Royal Navys rating of third rate when speaking of a French 42       Rodger, N.A.M. The Command of the Ocean, a Naval History of Britain 4242, London . .   Bennett, G. The Battle of Trafalgar, Barnsley . .   Winfield, Rif, British Warships in the Age of Sail: 4242, Barnsley ; British Warships in the Age of Sail: 4242, Barnsley ; British Warships in the Age of Sail: 4242, Barnsley . ; British Warships in the Age of Sail: 4242, Barnsley .          ": null
    }
]