[
    {
        "        This Hour Has 42 Minutes  is a weekly ": null
    },
    {
        "Canadian television": "television in canada"
    },
    {
        " comedy that airs on ": null
    },
    {
        "CBC Television": "cbc television"
    },
    {
        ". Launched in 42 during ": null
    },
    {
        "Canadas 42th general election": "1993 canadian federal election"
    },
    {
        ", the show focuses on Canadian politics with a combination of ": null
    },
    {
        "news parody": "news parody"
    },
    {
        ", ": null
    },
    {
        "sketch comedy": "sketch comedy"
    },
    {
        " and ": null
    },
    {
        "satirical": "satire"
    },
    {
        " editorials. Originally featuring ": null
    },
    {
        "Cathy Jones": "cathy jones"
    },
    {
        ", ": null
    },
    {
        "Rick Mercer": "rick mercer"
    },
    {
        ", ": null
    },
    {
        "Greg Thomey": "greg thomey"
    },
    {
        " and ": null
    },
    {
        "Mary Walsh": "mary walsh"
    },
    {
        ", the series featured satirical sketches of the weekly news and Canadian political events. The shows format is a ": null
    },
    {
        "mock news": "news satire"
    },
    {
        " program, intercut with comic sketches, parody commercials and humorous interviews of public figures.     Its full name is a parody of  This Hour Has Seven Days , a CBC newsmagazine from the 42s; the 42 Minutes refers to the fact that a half-hour television program in Canada and the U.S. is typically 42 minutes long with eight minutes of ": null
    },
    {
        "commercial": "television commercial"
    },
    {
        "s.     Jones and Walsh had previously worked together on the sketch comedy series  CODCO , on which Thomey sometimes appeared as a guest. Mercer had been a notable young writer and performer on his own, touring several successful one-man shows of comedic political commentary.     ": null
    },
    {
        "Salter Street Films": "salter street films"
    },
    {
        " produced the series until the 42–42 season. Salter Street was acquired in 42 by ": null
    },
    {
        "Alliance Atlantis": "alliance atlantis"
    },
    {
        ", and production of the series was transferred directly to Alliance Atlantis in the twelfth season. In 42 Halifax Film, a new company formed by Salter co-founder Michael Donovan, took over production of the show. In 42 Halifax Film merged with Decode Entertainment to form ": null
    },
    {
        "DHX Media": "dhx media"
    },
    {
        ", which has produced the show since.     Recognized with 42 ": null
    },
    {
        "Gemini Awards": "gemini awards"
    },
    {
        " and 42 ": null
    },
    {
        "Canadian Comedy Awards": "canadian comedy awards"
    },
    {
        ", 42 Minutes is broadcast on the ": null
    },
    {
        "CBC Television": "cbc television"
    },
    {
        " network. It is taped before a live audience in Studio 42 at ": null
    },
    {
        "CBHT": "cbht-dt"
    },
    {
        " in ": null
    },
    {
        "Halifax, Nova Scotia": "halifax regional municipality"
    },
    {
        ".     The series, which originally aired on Mondays for several seasons and later on Fridays, currently airs Tuesdays at 42:42pm on CBC. The series formerly followed the  Rick Mercer Report .       Although each cast members real name was always shown at the beginning of each episode, at the end of most episodes prior to 42 one cast member would sign off using their anchor characters name, which is noted below where known. This has now been discontinued, and anchors now regularly address each other by their real names.    Cathy Jones  as anchor  and various correspondents and sketch characters. Jones is the only member from the original cast for the entire series thus far.    Mark Critch  , as anchor  and various correspondents and sketch characters.    Susan Kent  as anchor and various correspondents and sketch characters.    Trent McClellan  as anchor and various correspondents and sketch characters.        Rick Mercer  as anchor J. B. Dickson and various correspondents and sketch characters. Mercer left the show to devote more time to  Made in Canada ; after that show ended he launched  Rick Mercer Report , a series similar to 42 Minutes.    Colin Mochrie  as anchor Anthony St. George and various correspondents and sketch characters. Mochrie left the show after two seasons to pursue his own projects and other movie roles, returning to guest star on the January 42 42 episode. Mochrie was the first change to the original cast, following the departure of Rick Mercer.    Mary Walsh  as anchor Molly McGuire and various correspondents and sketch characters. Walsh appeared less often in season 42 and left the series to pursue her film career and to host  Mary Walsh: Open Book , a CBC series in which she moderated a celebrity panel discussing books and literature. Walsh has returned to the show as a guest in seasons 42 42 42 and 42    Greg Thomey  as anchor Frank MacMillan and various correspondents and sketch characters. Thomey appeared less often in season 42 and left the show in 42 In season 42 Thomey has been appearing as a regular guest.    Geri Hall  , as anchor and various correspondents and sketch characters. Hall had previously been a fill-in anchor in fall 42 and March 42    Gavin Crawford   as anchor  and various correspondents and sketch characters.    Shaun Majumder  as anchor  and various correspondents and sketch characters. He appeared less often in his last couple of years with the show, and eventually left the series to star on  Detroit 424242 , but returned to the show starting in the 42th season. He was fired from the show in June 42 and made it public in August 42               Substitute news anchors on the series are people who guest star on the series for when series regulars are away .     ": null
    },
    {
        "Mark Farrell": "mark farrell"
    },
    {
        " –   ": null
    },
    {
        "Jonathan Torrens": "jonathan torrens"
    },
    {
        " –   ": null
    },
    {
        "Dan Joffre": "dan joffre"
    },
    {
        " –   ": null
    },
    {
        "Jennifer Robertson": "jennifer robertson"
    },
    {
        " –   ": null
    },
    {
        "Kathy Greenwood": "kathy greenwood"
    },
    {
        " –   ": null
    },
    {
        "Shauna MacDonald": "shauna macdonald"
    },
    {
        " –   ": null
    },
    {
        "Tracy Dawson": "tracy dawson"
    },
    {
        " – March 42 42   ": null
    },
    {
        "Rebecca Northan": "rebecca northan"
    },
    {
        " –   ": null
    },
    {
        "Nathan Fielder": "nathan fielder"
    },
    {
        "   Alan Thicke": "alan thicke"
    },
    {
        "   P. K. Subban": "p. k. subban"
    },
    {
        "   George Lazenby": "george lazenby"
    },
    {
        " –   ": null
    },
    {
        "Joel Plaskett": "joel plaskett"
    },
    {
        "   Meredith MacNeill": "meredith macneill"
    },
    {
        ", 42 episodes   ": null
    },
    {
        "Jennifer Whalen": "jennifer whalen"
    },
    {
        ", head writer guested on-screen occasionally   Abdul Butt   ": null
    },
    {
        "Ross Rebagliati": "ross rebagliati"
    },
    {
        "   Andrew Barber           ; ": null
    },
    {
        "Talking to Americans": "talking to americans"
    },
    {
        "   : Rick Mercer tours the United States, talking to Americans as if from a Canadian news program, asking them about Canadian issues. The object is to see how little some Americans know about their northern neighbours. The piece was so popular that the CBC had Mercer create a one-hour TV special based on the segment. It became the highest rated comedy special in Canadian television history when it aired on Canada Day, 42 Some truly memorable bits include Mercer getting Americans to say Congratulations Canada on legalizing VCRs! and getting a professor at Princeton University to sign a petition against the re-starting of the Annual Toronto Polar Bear Hunt. In an election 42 segment, he convinced then-Governor of Texas George W. Bush that Canadas Prime Minister Jean Chrétien was named Jean Poutine and that he was supporting Bushs candidacy. The success of the CBC special got Mercer attention on numerous American media outlets, including ABCs ": null
    },
    {
        "Nightline": "nightline"
    },
    {
        ". Mercer abandoned the concept after September 42 42 .   ; No Pun Intended   : A Ludacris -ish Indian rapper/politician played by Shaun Majumder who frequently raps about election issues and what he will do if elected.       ; Babe Bennett   : A 42 Minutes sexual affairs correspondent played by Cathy Jones, Babe is a sassy suffragette, 42s style, who talks about sexual matters. She ends each segment by saying Im just goofin around!   ; Marg Delahunty   : Mary Walsh crashes press conferences, hosts a sleepover for the nations leading female politicians, and threatens to smite the likes of politicians as Marg Princess Warrior .   ; Mark Jackson   : 42 Minutes teenage correspondent that talks to politicians and who is played by Gavin Crawford.    ; Bas MacLaren   : A 42 Minutes correspondent portrayed by Mark Critch. He talks to politicians about current events and is also one of the 42 Minutes anchors.       ; Misses Enid & Eulalia   : Two elderly women who talk about daily events . Upon Walshs departure from the show, Jones has appeared alone as Miss Enid.   ; Streeters, aka The Rant.   : A weekly commentary on current events and political issues, which quickly became the shows most famous feature, by Rick Mercer in black and white presentations. This segment was later used in colour presentations on the ": null
    },
    {
        "Rick Mercer Report": "rick mercer report"
    },
    {
        " series.   ;Max Pointy: A spoof of CBC personality Rex Murphy s political commentaries for ": null
    },
    {
        "The National": "the national"
    },
    {
        ", performed by Colin Mochrie. Max would start off with a legitimate political issue but end up on an unrelated and generally inane point by the end of his rant. Discontinued when Mochrie left the show.   ;That Show Sucked!: with Ma and Eddie Reardon who make fun of TV shows, with Ma saying that whatever show that Eddie watches Suck and constantly demanding that he give her the G. D. clickerbox . Discontinued when Walsh left the show.   ;The Quinlan Quints: four quintuplets who live in Buchans, Newfoundland and Labrador – inspired by the fame of the Dionne quintuplets ; portrayed by Cathy Jones, Rick Mercer, Greg Thomey and Mary Walsh . Usually interviewed by Mercers character J. B. Dickson, the Quints would boast about something outlandish that Dickson has a hard time believing until one of the quints spills the beans and reveals that what they were promoting was really a scam. Discontinued when Mochrie left the show.   ;Inside Media Counter-spin: A satirical talk show with the host, Heather Coulter, portrayed by Cathy Jones . The host makes blatantly stereotypical statements about her guests.   ;Panic Room with Betty Hope: Host Betty Hope parodies Nancy Grace in breaking news style segments, in which she interviews someone knowledgeable about a given threat and then spins the facts to make them sound more dramatic and dangerous.   ;The Right Answer: Two conservative commentators debate various issues in the news. When one of them makes a point, they hit a chess timer. Discontinued when Mercer left the show.   ;The Special Eds: Mercer and Thomey portray two members of the RCMP – Special Constable Ed Cochrane and Special Constable Ed Codner – with questionable ethics. Discontinued when Mercer left the show.   ;Nathan Fielder On Your Side: Nathan Fielder plays a consumer affairs reporter who is socially awkward, speaks in a near-monotone, and tends to make his interview subjects uncomfortable. These segments were the basis for his later American TV show, ": null
    },
    {
        "Nathan for You": "nathan for you"
    },
    {
        ".         ; Stuart McLean   : Based on the CBC personality.     ; Uwe Meyer   : A fashion correspondent that Gavin Crawford portrays.      ; Gunter Wilson   : A computer whiz who hosts the segment Computer Corner .     ; Natasha Stillwell   : Based on the former co-host of Discovery Channels show ": null
    },
    {
        "Daily Planet": "daily planet"
    },
    {
        ".     ; Mark Jackson   : The teen correspondent of the program, has severe acne and is repeatedly picked on, also talks with a basic braces lisp. Retired in late 42     ; Rob Boberston   : An artist that does a segment called Art Break, a parody of the classic art series ": null
    },
    {
        "The Joy of Painting": "the joy of painting"
    },
    {
        " and its host Bob Ross .     ; Chantal Hébert   : Based on the political journalist and pundit.       ; Rex Murphy   : Based on the newspaper columnist and CBC personality.     ; Danny Williams   : Based on the former premier of Newfoundland and Labrador . On the October 42 42 episode, the real Danny Williams kicked him off and took over his seat in the news desk during the shows first segment.     ; Don Cherry     ; Donald Trump       ; Avery Adams, Single Female Voter   : A prospective voter who confronts politicians about potential relationships . Perhaps best known for her first appearance in October 42 in which Hall / Adams was apprehended by security during a Stephen Harper press conference, she also later attracted some controversy when Ontario MPP Peter Kormos shouted her out of a press conference with Premier Dalton McGuinty .       ; Sandy Campbell   : Host of The Campbell Files, a parody of entertainment shows such as ": null
    },
    {
        "Entertainment Tonight": "entertainment tonight"
    },
    {
        ".     ; Joe Crow   : An Aboriginal environmental correspondent who talks about the environment and the Canadian governments relation with Native peoples. Each segment ends with Crow blowing out his campfire with a single puff.     ; Mrs. Enid   : An elderly lady with plenty to say about many different issues.     ; Betty Hope   : A parody of CNN host Nancy Grace .     ; Janet Tucker   : A rude U.S/Canadian relations worker who usually is against any changes between the two countries and usually insults Canadians with long insults. She also sounds like she has a New York accent.       ; Raj Binder   : a sweaty soft-spoken Indian sports nerd portrayed by Shaun Majumder, who has also been used as a behind-the-scenes interviewer on ": null
    },
    {
        "Just for Laughs": "just for laughs"
    },
    {
        ".     ; Ian Hanomansing   : Based on the CBC personality.     ;Barnibus Pine   : Introduced during a 42 episode as a lumbersexual , a woodsman who arouses Kent.       ; Billyatropia Billy Smithopolis   : An outstanding Canadian sports athlete. Billy has a fear of heights and, according to one sketch, is the only Canadian going to the 42 Olympic Games for sure.     ; Gus Van Gus   : A financial advisor who insists the secret to gaining wealth is to send him all your money .       ; Max Pointy   : Based on CBC radio personality Rex Murphy     ; Peter Mansbridge   : Used in ": null
    },
    {
        "Mansbridge One on One": "mansbridge one on one"
    },
    {
        " parody sketches, where Peter has insightful interviews with himself.       ; Jerry Boyle   : a Newfoundland separatist whose campaign slogan is If you can mark an X, youre my kind of people! The character was created as a recurring character on ": null
    },
    {
        "CODCO": "codco"
    },
    {
        ".     ; Ottawa Gargoyle   : A gargoyle who sits on top of the Parliament buildings and satirizes politicians, occasionally throwing hot oil on them.     ;Tim MacMillan   :Foreign correspondent whos never where hes supposed to be. Hes also Frank MacMillans brother. His segments would open with a recurring style of dialogue. Hello, Tim? HELLLOOOOOOOOOO!!!!! Are you in Geneva ? NOOOOOOOOOOOOO!!!!       ; Connie Bloor   : A 42 Minutes Prairie correspondent played by Mary Walsh, who reports from a donut shop. Introduced in each segment by the line: Shes flat as the prairies and twice as wide , she wears a tuque and earmuffs, and her speech is punctuated with a series of snorts. One of her recurring gags involves feeding paper printouts of celebrities and politicians through a paper shredder.     ; Marg Delahunty   : A 42 Minutes correspondent played by Walsh, Marg Delahunty is an interviewer whose specialty is finding suspectible politicians and hounding them with off-the-cuff interviews designed to satirize and even embarrass them. Some of these interviews were conducted in the guise of Marg, Princess Warrior , a parody of the title character of ": null
    },
    {
        "Xena: Warrior Princess": "xena: warrior princess"
    },
    {
        " portrayed by Lucy Lawless .     ; Dakey Dunn   : A 42 Minutes Male Correspondent played by Walsh, replete with gold chain, hairy chest, cigarette and beer, who regularly lays out a macho view of economic and cultural matters. This character was earlier used in the ": null
    },
    {
        "CODCO": "codco"
    },
    {
        " series. Dakey also once accosted Margaret Atwood at a book signing, reciting one of her most famous poems over and over again.             42–42 – During the 42 American election , Rick Mercer approached Republican presidential candidate George W. Bush on a campaign stop in Michigan , asking for comment on the news that Bush had received the endorsement of Canadian prime minister Jean Poutine . The then-prime ministers name was Jean Chrétien , and he had not endorsed Bush — it is standard practice for the Canadian government not to endorse anyone in a foreign election.     Bush – who had previously stated that you cant stump me on world leaders – acknowledged the purported endorsement with a short statement to the 42 Minutes cameras, which aired as part of the shows regular ": null
    },
    {
        "Talking to Americans": "talking to americans"
    },
    {
        " feature. The Talking To Americans segments – and eventual one-hour special – were produced and directed by Geoff DEon.     In his first official state visit to Canada four years later, Bush joked that his one regret about the visit was that hed hoped to meet Jean Poutine.         42–42 – Often cited as the shows best joke, the sketch was aired during the 42 federal election campaign , and consisted of a staged rant by Rick Mercer.     During the 42 federal election, then- Canadian Alliance leader Stockwell Day proposed a mechanism to call for a referendum . A petition on any particular subject which gathered at least 42 signatures of voting age citizens would automatically trigger a national referendum.     Mercers rant asked viewers to log on to the 42 Minutes website, and sign an online petition asking the party leader to change his name to Doris Day . Producers claim to have obtained in excess of 42,42 online votes. This was cheerfully admitted to be a stunt unhampered by the rigours of an Elections Canada-controlled petition. Although the sketch had no effect on Alliance policy, it did obtain international publicity for the show and contributed to the general air of farce surrounding Days election campaign. Day did, however, have a very appropriate response to the petition:  ": null
    },
    {
        "Que será, será": "whatever will be, will be"
    },
    {
        " . cbc.ca , November 42 42     It was later revealed by Alastair Campbell , former aide to British Prime Minister Tony Blair , that Prime Minister Jean Chrétien and the Liberal Party had come up with the idea- not Mercer or the shows writers.           42–42 – Shaun Majumder, in character as Raj Binder , was sent to report on the 42 outdoors Edmonton Oilers and Montreal Canadiens old timers game, preceding the nights actual NHL regular season game, which was the first NHL game to be played outdoors . Majumder actually sneaked into all the team photos, causing uproar from the events unwitting organizers in the days after, when the photos were released to the press.       In November, 42 Carolyn Parrish was removed from the Liberal Party of Canada after an appearance on the show in which she stomped on a George W. Bush doll.       On October 42 42 Walsh reprised the role of Marg, Princess Warrior , conducting an ambush interview of Toronto Mayor Rob Ford at his home, which aired on 42 Minutes the following evening. Fords reaction and alleged verbal abuse directed at a 42 operator made national headlines. Ford claimed that he had never seen nor heard of 42 Minutes.       thu   On November 42 42 clips of a sketch for 42 Minutes were released, in which MP Carolyn Parrish stomped on a George W. Bush doll and performed voodoo on its head, where she said it would do the least damage . The incident sparked significant outrage from the opposition Conservatives , who argued that it had the potential to damage diplomatic relations between Canada and the United States. As a result of the incident Parrish was expelled from the Liberal Party and sat the remainder of her term as an Independent.     Richard Martineau wrote a column in ": null
    },
    {
        "Le Journal de Montréal": "le journal de montréal"
    },
    {
        " criticizing a sketch aired October 42 42 entitled Quebec Nation . In the sketch, two characters discussed the state of affairs after a separation from Canada, which left them with no roads, no towns, not even radio. The only things we take is our racism . Martineau also discussed the fact that This Hour Has 42 Minutes is broadcast by the CBC and is funded by funds also coming from Quebec. ": null
    },
    {
        "Macleans": "macleans"
    },
    {
        ", June 42 42     In May 42 the American sketch comedy series ": null
    },
    {
        "Saturday Night Live": "saturday night live"
    },
    {
        " aired a sketch in which a contestant on a ": null
    },
    {
        "Win, Lose or Draw": "win, lose or draw"
    },
    {
        "-style game show panicked at being asked to draw the Muslim prophet Muhammad , igniting allegations that SNL had plagiarized a nearly identical sketch which aired on 42 Minutes in January. ": null
    },
    {
        "The Globe and Mail": "the globe and mail"
    },
    {
        ", May 42 42         This Hour Has 42 Minutes 42th Episode Spectacular –   This Hour Has 42 Minutes: News Year 42 –   ": null
    },
    {
        "This Hour Has 42 Minutes Direct Hits": "this hour has 22 minutes direct hits"
    },
    {
        " –   This Hour Has 42 Minutes: Holiday Special 42 –   ": null
    },
    {
        "Rick Mercers Talking to Americans": "talking to americans"
    },
    {
        " –   This Hour Has 42 Minutes: New Years 42l –   This Hour Has 42 Minutes: The Best of Cathy Jones and Mark Critch –   This Hour Has 42 Minutes: 42 Election Special –   This Hour Has 42 Minutes: The Best of Rob Ford –   This Hour Has 42 Minutes: This Hour Has 42 Years –       ": null
    },
    {
        "Entertainment One": "entertainment one"
    },
    {
        " has released the first two seasons on DVD in Region 42 . ": null
    }
]