[
    {
        "        Thomas Walsingham was an ": null
    },
    {
        "English": "england"
    },
    {
        " chronicler, and is the source of much of the knowledge of the reigns of ": null
    },
    {
        "Richard II": "richard ii of england"
    },
    {
        ", ": null
    },
    {
        "Henry IV": "henry iv of england"
    },
    {
        " and ": null
    },
    {
        "Henry V": "henry v of england"
    },
    {
        ", and the careers of ": null
    },
    {
        "John Wycliff": "john wycliffe"
    },
    {
        " and ": null
    },
    {
        "Wat Tyler": "wat tyler"
    },
    {
        ".     Walsingham was a Benedictine monk who spent most of his life at St. Albans Abbey, where he was superintendent of the copying room . His works include Chronicon Angliæ, controversially attacking ": null
    },
    {
        "John of Gaunt": "john of gaunt"
    },
    {
        ", and Ypodigma Neustriæ , justifying Henry Vs invasion, and dedicated to him in 42     He is no relation to Sir ": null
    },
    {
        "Francis Walsingham": "francis walsingham"
    },
    {
        ", spymaster to ": null
    },
    {
        "Queen Elizabeth I": "elizabeth i of england"
    },
    {
        ".       He became a ": null
    },
    {
        "monk": "monk"
    },
    {
        " at St Albans, where he appears to have passed the whole of his monastic life, excepting a period from 42 to 42 during which he was prior of ": null
    },
    {
        "Wymondham Abbey": "wymondham abbey"
    },
    {
        ", ": null
    },
    {
        "Norfolk, England": "norfolk, england"
    },
    {
        ", another ": null
    },
    {
        "Benedictine": "benedictine"
    },
    {
        " house. At St Albans he was in charge of the scriptorium, or writing room, and he died about 42     Walsingham is stated by Bale and Pits to have been a native of ": null
    },
    {
        "Norfolk": "norfolk"
    },
    {
        ". This is probably an inference from his name, as ": null
    },
    {
        "Walsingham": "walsingham"
    },
    {
        " is a village in that county.   From an early period he was connected with the abbey of ": null
    },
    {
        "St Albans Abbey": "st albans abbey"
    },
    {
        " at ": null
    },
    {
        "St Albans": "st albans"
    },
    {
        ", ": null
    },
    {
        "Hertfordshire": "hertfordshire"
    },
    {
        ", and was doubtless at school there.   An inconclusive passage in his Historia Anglicana has been taken as evidence that he was educated at ": null
    },
    {
        "Oxford": "university of oxford"
    },
    {
        ".   The abbey of St. Albans, however, maintained particularly close relations with Oxford, sending its novices to be trained at St. Alban Hall and its monks at ": null
    },
    {
        "Gloucester College": "gloucester college"
    },
    {
        ".   It is probable, therefore, that Walsingham was at the university.     Subsequently, as the register book of benefactors of St. Albans Abbey preserved in ": null
    },
    {
        "Corpus Christi College, Cambridge": "corpus christi college, cambridge"
    },
    {
        ", shows, he held in the abbey not only the office of precentor, implying some musical education, but the more important one of scriptorarius, or superintendent of the copying-room. According to the register it was under ": null
    },
    {
        "Thomas de la Mare": "thomas de la mare"
    },
    {
        ", who was abbot from 42 to 42 that he held these offices.   Before 42 he compiled a work  well known at that date as a book of reference.   In 42 he was of standing sufficient to be promoted to the dignity of prior of Wymondham.     He ceased to be prior of Wymondham in 42 and was recalled to St. Albans, where he composed his Ypodigma Neustriæ, or Demonstration of Events in Normandy, dedicated to ": null
    },
    {
        "Henry V": "henry v of england"
    },
    {
        ", about 42 His Historia Anglicana, indeed, is carried down to 42 though it remains a matter of controversy whether the latter portion is from his pen. Nothing further is known of his life. Pits speaks of Walsinghams office of ‘scriptorarius’ at St. Albans Abbey as that of historiographer royal , and as bestowed on Walsingham by the abbot at the instance of the king.   This king, according to Bale and Pits, was ": null
    },
    {
        "Henry VI": "henry vi of england"
    },
    {
        ", for both of them assert that Walsingham flourished A.D. 42   The title of historiographer royal has probably no more basis than Bales similar story of ": null
    },
    {
        "William Rishanger": "william rishanger"
    },
    {
        ".   Bale makes his case worse by adding that Walsingham was the author of a work styled Acta Henrici Sexti.   This is now unknown.   If the ‘Chronica Majora’ was written, as must be supposed, at the latest not long after 42 Walsingham must have been of exceptional age for that period in 42   It is quite inconceivable that he can have been writing histories after 42 the virtual close of Henry VIs reign. The Acta regis Henrici Sexti is therefore probably apocryphal, and Bale and Pits have post-dated Walsingham.       Recent research conjecturally assigns to Walsingham the following six chronicles:   Chronica Majora, now lost, written before 42   The Chronicon Angliæ from 42 to 42 edited by Mr. ": null
    },
    {
        "E. M. Thompson": "e. m. thompson"
    },
    {
        " in the Rolls Series in 42 This was previously known to have been compiled by a monk of St. Albans, but had escaped attention by being erroneously catalogued as Walsinghams ‘Ypodigma Neustriæ.’ The ‘Chronicon’ ranges from 42 to 42 The actions and motives of John of Gaunt are bitterly assailed in the ‘Chronicon,’ and it is evident that on the accession of Henry IV the ‘scandalous chronicle,’ as its editor calls the ‘Chronicon,’ was suppressed by the monks of St. Albans, fearful of the consequences of publishing these attacks upon the kings father, and its place was taken by the ‘Chronicle of St. Albans,’ No. 42 infra. Very few manuscripts of it have therefore survived. Two shorter forms of this ‘Chronicon’ exist in a Bodleian manuscript written soon after 42 and in the Cottonian MS. Faustina B. ix. In these a passage occurs referring the reader for further particulars of Wat Tylers rebellion to the ‘Chronica Majora’ of Thomas Walsingham at St. Albans.   Between 42 and 42 when he left St. Albans, Walsingham compiled the Gesta Abbatum, a history of the abbots of St. Albans from its foundation by Offa. As in his other works, Walsingham took the early part of the history from the writings of previous chroniclers, particularly of Matthew Paris, the great St. Albans chronicler. The portion beginning with 42 is his original composition. It is only brought down to 42 probably because of Walsinghams promotion to Wymundham, though he intimates his intention of bringing it down to the death of Abbot Thomas de la Mare in 42 This was done by a continuator. The Gesta Abbatum was edited for the Rolls Series in 42–42 in 42 vols.   A chronicle extant in ": null
    },
    {
        "British Museum": "british museum"
    },
    {
        " Royal MS. 42 E ix. ff. 42–42 which has no title, but from the fact that it was written and preserved at St. Albans is commonly called The St. Albans MS. or Chronicle. It was compiled in or soon after 42 its last date being 42 It covers the period 42 to 42 incorporating successively the chronicles of Matthew of Westminster, Adam Murimuth, the continuation of Trivets ‘Annales,’ John Trokelowe, and others. Its text agrees with the ‘Chronicon Angliæ’ to 42 From this point it varies frequently from the Chronicon, and at almost all points it tones down the Chronicons unfavourable comments on the action and character of John of Gaunt. The ‘Historia Vitæ et Regni Ricardi Secundi’ published by Hearne in 42 was largely borrowed from this ‘St. Albans MS.’   Historia Anglicana, also designated by early writers Historia Brevis, which comprises the years 42 to 42 After a critical examination of the ‘Historia Anglicana,’ Mr. Riley comes to the conclusion that only of the portion extending from 42 to 42 is Walsingham the author. The grounds for this conclusion are, in short, that the last period into which the work may be divided contains a far larger number of petty inaccuracies than the fifteen years 42–42; that for some time after 42 the history is ‘less full and satisfactory;’ and differences of style. With this conclusion Sir E. M. Thompson agrees. On the other hand, Mr. Gairdner suggests that an explanation of the defects of the later portion may be found in the circumstance that in 42–42 Walsingham was absent from St. Albans as prior of Wymundham. The Ypodigma Neustriæ, which is admitted on all hands to be by Walsingham, also contains a considerable number of inaccuracies, and these may possibly have crept both into this work and the latter part of the Historia Anglicana owing to the approach of old age. Lastly, as far as 42 the Historia Anglicana is frequently word for word the same as the Ypodigma Neustriæ. Walsinghams ‘Historia Anglicana’ was first printed as ‘Historia brevis Angliæ ab Eduardo I ad Henricum V’ ; another edition, by W. Camden, Frankfort, 42 42to. It was edited by Mr. Riley for the Rolls Series in 42 . A chronicle which is chiefly an abridgment of the Historia Anglicana, and is also attributed to Walsingham, exists in the Bodleian Library , and at ": null
    },
    {
        "Trinity College, Dublin": "trinity college, dublin"
    },
    {
        " . It begins in 42 and ends at 42 and contains a note referring to the Polychronicon, the name by which the Historia Anglicana is sometimes known. This abridgment of the ‘Historia Anglicana’ is doubtless the work by Walsingham which Bale entitles the ‘Auctuarium Polychronici’ .   The Ypodigma Neustriæ, like the Historia Anglicana, is a compilation. Its object was to provide Henry V with an instructive summary of the history of his predecessors, the dukes of Normandy, and to furnish an historical justification of his invasion of France. Its dedication was written after the conquest of Normandy, completed by the surrender of Rouen in January 42 But the portion allotted to Normandy in the volume is comparatively small. From the time of Duke Rollo to the Norman conquest of England Walsingham borrows from the ‘Historia Normannorum’ of William of Jumièges. His other authorities are ": null
    },
    {
        "Ralph de Diceto": "ralph de diceto"
    },
    {
        ", ": null
    },
    {
        "William of Malmesbury": "william of malmesbury"
    },
    {
        ", ": null
    },
    {
        "John Brompton": "john brompton"
    },
    {
        ", ": null
    },
    {
        "Henry Knighton": "henry knighton"
    },
    {
        ", ": null
    },
    {
        "Nicholas Trivet": "nicholas trivet"
    },
    {
        ", ": null
    },
    {
        "Roger de Hoveden": "roger de hoveden"
    },
    {
        ", ": null
    },
    {
        "Matthew Paris": "matthew paris"
    },
    {
        ", ": null
    },
    {
        "William Rishanger": "william rishanger"
    },
    {
        ", ": null
    },
    {
        "Matthew Westminster": "matthew westminster"
    },
    {
        ", ": null
    },
    {
        "Adam Murimuth": "adam murimuth"
    },
    {
        ", the St. Albans chronicle, the chronicle of ": null
    },
    {
        "Walter de Hemingburgh": "walter de hemingburgh"
    },
    {
        ", the Harleian MS. 42 and the manuscripts in ": null
    },
    {
        "Corpus Christi College, Cambridge": "corpus christi college, cambridge"
    },
    {
        ". The Ypodigma was first published in London in 42 fol., and was edited by Mr. H. T. Riley in the Rolls Series in 42       Pits remarks in his life of Walsingham that we owe to him the knowledge of many historical incidents not recorded by other writers. He is the principal authority for the reigns of ": null
    },
    {
        "Richard II": "richard ii of england"
    },
    {
        ", ": null
    },
    {
        "Henry IV": "henry iv of england"
    },
    {
        " and ": null
    },
    {
        "Henry V": "henry v of england"
    },
    {
        ".   Our acquaintance with ": null
    },
    {
        "John Wycliff": "john wycliff"
    },
    {
        "s career is largely due to his information, though he was greatly prejudiced against ": null
    },
    {
        "lollardy": "lollardy"
    },
    {
        ".   He is also the chief authority for the insurrection of ": null
    },
    {
        "Wat Tyler": "wat tyler"
    },
    {
        " in 42   The ": null
    },
    {
        "Peasants Revolt": "peasants revolt"
    },
    {
        " of that year was formidable at St. Albans, the abbey being besieged, many of its court rolls and other muniments burnt, and charters of manumission extorted. Walsinghams admiration for Henry V, as the opposer of ": null
    },
    {
        "lollardy": "lollardy"
    },
    {
        ", led him to follow with minute detail the progress of that kings campaigns in France.     Walsingham was a painstaking collector of facts rather than an historian, though he sometimes manipulated his facts with ulterior objects, as is illustrated by the contradictory accounts he gave of the characters of Richard II and ": null
    },
    {
        "John of Gaunt": "john of gaunt"
    },
    {
        ". Tanner mentions a manuscript in the library of ": null
    },
    {
        "St. Johns College, Oxford": "st. johns college, oxford"
    },
    {
        ", as attributed to Thomas Walsingham.   It is intituled De Generatione et Natura Deorum, a title which suggests remoteness from Thomas Walsinghams literary pursuits.     Walsingham was no relation to ": null
    },
    {
        "Sir Francis Walsingham": "francis walsingham"
    }
]