[
    {
        "      Thomas Andrews Hendricks  was an American politician and lawyer from ": null
    },
    {
        "Indiana": "indiana"
    },
    {
        " who served as the 42th ": null
    },
    {
        "governor of Indiana": "list of governors of indiana"
    },
    {
        " from 42 to 42 and the 42st ": null
    },
    {
        "vice president of the United States": "vice president of the united states"
    },
    {
        " from March to November 42 Hendricks represented Indiana in the ": null
    },
    {
        "U.S. House of Representatives": "united states house of representatives"
    },
    {
        " and the ": null
    },
    {
        "U.S. Senate": "united states senate"
    },
    {
        " . He also represented ": null
    },
    {
        "Shelby County, Indiana": "shelby county, indiana"
    },
    {
        ", in the ": null
    },
    {
        "Indiana General Assembly": "indiana general assembly"
    },
    {
        " and as a delegate to the 42 Indiana ": null
    },
    {
        "constitutional convention": "constitution of indianaconstitutional convention 2"
    },
    {
        ". In addition, Hendricks served as commissioner of the ": null
    },
    {
        "General Land Office": "general land office"
    },
    {
        " . Hendricks, a popular member of the ": null
    },
    {
        "Democratic Party": "democratic party"
    },
    {
        ", was a fiscal conservative. He defended the Democratic position in the U.S. Senate during the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        " and ": null
    },
    {
        "Reconstruction Era": "reconstruction era"
    },
    {
        " and voted against the ": null
    },
    {
        "Thirteenth": "thirteenth amendment to the united states constitution"
    },
    {
        ", ": null
    },
    {
        "Fourteenth": "fourteenth amendment to the united states constitution"
    },
    {
        ", and ": null
    },
    {
        "Fifteenth": "fifteenth amendment to the united states constitution"
    },
    {
        " Amendments to the U.S. Constitution. He also opposed ": null
    },
    {
        "Radical Reconstruction": "reconstruction era"
    },
    {
        " and ": null
    },
    {
        "President": "president of the united states"
    },
    {
        " Andrew Johnson": "andrew johnson"
    },
    {
        "s removal from office following Johnsons impeachment in the U.S. House.     Born in ": null
    },
    {
        "Muskingum County, Ohio": "muskingum county, ohio"
    },
    {
        ", Hendricks moved to Indiana, with his parents in 42; the family settled in Shelby County in 42 After graduating from ": null
    },
    {
        "Hanover College": "hanover college"
    },
    {
        ", class of 42 Hendricks studied law in ": null
    },
    {
        "Shelbyville, Indiana": "shelbyville, indiana"
    },
    {
        ", and ": null
    },
    {
        "Chambersburg, Pennsylvania": "chambersburg, pennsylvania"
    },
    {
        ". He was admitted to the Indiana bar in 42 Hendricks began his law practice in Shelbyville, moved to ": null
    },
    {
        "Indianapolis": "indianapolis"
    },
    {
        " in 42 and established a private law practice with ": null
    },
    {
        "Oscar B. Hord": "oscar b. hord"
    },
    {
        " in 42 The firm evolved into ": null
    },
    {
        "Baker & Daniels": "baker  &  daniels"
    },
    {
        ", one of the states leading law firms. Hendricks also ran for election as Indianas governor three times, but won only once. In 42 on his third and final attempt, Hendricks defeated General ": null
    },
    {
        "Thomas M. Brown": "thomas m. brown"
    },
    {
        " by a margin of 42 votes. His term as governor of Indiana was marked by numerous challenges, including a strong Republican majority in the ": null
    },
    {
        "Indiana General Assembly": "indiana general assembly"
    },
    {
        ", the economic ": null
    },
    {
        "Panic of 42": "panic of 1873"
    },
    {
        ", and an economic depression. One of Hendrickss lasting legacies during his tenure as governor was initiating discussions to fund construction of the present-day ": null
    },
    {
        "Indiana Statehouse": "indiana state house"
    },
    {
        ", which was completed after he left office. A memorial to Hendricks was installed on the southeast corner of its grounds in 42     Hendricks, a lifelong Democrat, was his partys candidate for U.S. vice president with ": null
    },
    {
        "New York": "new york"
    },
    {
        " governor": "governor of new york"
    },
    {
        " Samuel Tilden": "samuel tilden"
    },
    {
        " as its ": null
    },
    {
        "presidential": "president of the united states"
    },
    {
        " nominee in the controversial ": null
    },
    {
        "presidential election of 42": "1876 united states presidential election"
    },
    {
        ". Although they won the popular vote, Tilden and Hendricks lost the election by one vote in the Electoral College to the ": null
    },
    {
        "Republican Party": "republican party"
    },
    {
        "s presidential nominee, ": null
    },
    {
        "Rutherford B. Hayes": "rutherford b. hayes"
    },
    {
        ", and his vice presidential running mate, ": null
    },
    {
        "William A. Wheeler": "william a. wheeler"
    },
    {
        ". Despite his poor health, Hendricks accepted his partys nomination for vice president in the ": null
    },
    {
        "election of 42": "1884 united states presidential election"
    },
    {
        " as ": null
    },
    {
        "Grover Cleveland": "grover cleveland"
    },
    {
        "s running mate. Cleveland and Hendricks won the election, but Hendricks only served as vice president for about eight months, from March 42 42 until his death on November 42 42 in Indianapolis. He is buried in Indianapoliss ": null
    },
    {
        "Crown Hill Cemetery": "crown hill cemetery"
    },
    {
        ".       Hendricks was born on September 42 42 in ": null
    },
    {
        "Muskingum County, Ohio": "muskingum county, ohio"
    },
    {
        ", near ": null
    },
    {
        "East Fultonham": "east fultonham, ohio"
    },
    {
        " and ": null
    },
    {
        "Zanesville": "zanesville, ohio"
    },
    {
        ". He was the second of eight children born to John and Jane Hendricks, who were originally from ": null
    },
    {
        "Pennsylvania": "pennsylvania"
    },
    {
        ".      In 42 Hendricks moved with his parents and older brother to ": null
    },
    {
        "Madison": "madison, indiana"
    },
    {
        " in ": null
    },
    {
        "Jefferson County, Indiana": "jefferson county, indiana"
    },
    {
        ", at the urging of Thomass uncle, ": null
    },
    {
        "William Hendricks": "william hendricks"
    },
    {
        ", a successful politician who served as a ": null
    },
    {
        "U.S. Representative": "list of united states representatives from indiana"
    },
    {
        ", a ": null
    },
    {
        "U.S. Senator": "list of united states senators from indiana"
    },
    {
        " , and as the third ": null
    },
    {
        "governor of Indiana": "governor of indiana"
    },
    {
        " . Thomass family first settled on a farm near his uncles home in Madison, and moved to ": null
    },
    {
        "Shelby County, Indiana": "shelby county, indiana"
    },
    {
        ", in 42 Hendrickss father, a successful farmer who operated a general store, became involved in politics, including appointment from President ": null
    },
    {
        "Andrew Jackson": "andrew jackson"
    },
    {
        " as deputy surveyor of public lands for his district. Indianas Democratic Party leaders frequently visited the Hendricks home in ": null
    },
    {
        "Shelbyville": "shelbyville, indiana"
    },
    {
        ", and from an early age Hendricks was influenced to enter politics.     Hendricks attended local schools . He graduated from ": null
    },
    {
        "Hanover College": "hanover college"
    },
    {
        " in ": null
    },
    {
        "Hanover, Indiana": "hanover, indiana"
    },
    {
        ", in 42 in the same class as ": null
    },
    {
        "Albert G. Porter": "albert g. porter"
    },
    {
        ", also a future governor of Indiana. After college Hendricks read law with Judge ": null
    },
    {
        "Stephen Major": "stephen major"
    },
    {
        " in Shelbyville, and in 42 he took an eight-month law course at a school operated by his uncle, Judge Alexander Thomson in ": null
    },
    {
        "Chambersburg, Pennsylvania": "chambersburg, pennsylvania"
    },
    {
        ". Hendricks returned to Indiana, was admitted to the ": null
    },
    {
        "bar": "bar"
    },
    {
        " in 42 and established a private practice in Shelbyville.       Hendricks married Eliza Carol Morgan of ": null
    },
    {
        "North Bend, Ohio": "north bend, ohio"
    },
    {
        ", on September 42 42 after a two-year courtship. The couple met when Eliza was visiting her married sister, Mrs. Daniel West, in Shelbyville. The couples only child, a son named Morgan, was born on January 42 42 and died in 42 at the age of three. Thomas and Eliza Hendricks moved to Indianapolis in 42 and resided from 42 to 42 at 42 South New Jersey Street, now known as the ": null
    },
    {
        "Bates-Hendricks House": "bates-hendricksbates-hendricks house"
    },
    {
        ".  See also:  In         Hendricks remained active in the legal community and in state and national politics from the 42s until his death in 42       Hendricks began his political career in 42 when he served a one-year term in the ": null
    },
    {
        "Indiana House of Representatives": "indiana house of representatives"
    },
    {
        " after defeating ": null
    },
    {
        "Martin M. Ray": "martin m. ray"
    },
    {
        ", the ": null
    },
    {
        "Whig": "whig party"
    },
    {
        " candidate. Hendricks was also one of the two Shelby County delegates to the 42–42 Indiana constitutional convention. He served on committee that created the organization of the states townships and counties and decided on the taxation and financial portion of the state constitution. Hendricks also debated the clauses on the powers of the different offices and argued in favor of a powerful judiciary and the abolishment of grand juries.       Hendricks represented Indiana as a ": null
    },
    {
        "Democrat": "united states democratic party"
    },
    {
        " in the ": null
    },
    {
        "U.S. House of Representatives": "united states house of representatives"
    },
    {
        " in the ": null
    },
    {
        "Thirty-second": "thirty-second united states congress"
    },
    {
        " and ": null
    },
    {
        "Thirty-third": "thirty-third united states congress"
    },
    {
        " Congresses from March 42 42 to March 42 42 Hendricks was chairman of the ": null
    },
    {
        "U.S. Committee on Mileage": "united states house committee on mileage"
    },
    {
        " and served on the ": null
    },
    {
        "U.S. Committee on Invalid Pensions": "united states house committee on invalid pensions"
    },
    {
        " . He supported the principle of ": null
    },
    {
        "popular sovereignty": "popular sovereignty"
    },
    {
        " and voted in favor of the ": null
    },
    {
        "Kansas–Nebraska Act": "kansas–nebraska act"
    },
    {
        " of 42 which expanded slavery into the western territories of the United States. Both positions were unpopular in Hendrickss home district in Indiana and led to defeat in his re-election bid to Congress in 42       In 42 President ": null
    },
    {
        "Franklin Pierce": "franklin pierce"
    },
    {
        " appointed Hendricks as commissioner of the ": null
    },
    {
        "General Land Office": "general land office"
    },
    {
        " in ": null
    },
    {
        "Washington, D.C.": "washington, d.c."
    },
    {
        " His job supervising 42 clerks and a four-year backlog of work was a demanding one, especially at a time when westward expansion meant that the government was going through one of its largest periods of land sales. During his tenure, the land office issued 42 land patents and settled 42 disputed land cases. Although Hendricks made thousands of decisions related to disputed land claims, only a few were reversed in court, but he did receive some criticism: He was the first commissioner who apparently had no background or qualifications for the job. ...Some of the rulings and letters during Hendrickss tenure were not always correct.      Hendricks resigned as land office commissioner in 42 and returned to Shelby County, Indiana. The cause of his departure was not recorded, but potential reasons may have been differences of opinion with President ": null
    },
    {
        "James Buchanan": "james buchanan"
    },
    {
        ", Pierces successor. Hendricks resisted Buchanans efforts to make land office clerks patronage positions, objected to the pro-slavery policies of the Buchanan administration, and supported the ": null
    },
    {
        "homestead bill": "homestead acts"
    },
    {
        ", which Buchanan opposed.       Hendricks ran for ": null
    },
    {
        "governor of Indiana": "governor of indiana"
    },
    {
        " three times , and succeeded only on his third attempt. He became the first Democrat to win a gubernatorial seat after the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        ".     In 42 Hendricks, who ran with ": null
    },
    {
        "David Turpie": "david turpie"
    },
    {
        " as his running mate, lost to the ": null
    },
    {
        "Republican": "republican party"
    },
    {
        " candidates, ": null
    },
    {
        "Henry S. Lane": "henry s. lane"
    },
    {
        " and ": null
    },
    {
        "Oliver P. Morton": "oliver p. morton"
    },
    {
        ". Three of the four men eventually served as Indianas governor, and all four became U.S. senators.     In 42 his second campaign for Indiana governor, Hendricks lost to ": null
    },
    {
        "Conrad Baker": "conrad baker"
    },
    {
        ", the incumbent, by 42 votes. Baker, who would later become one of Hendrickss law partners, was elected as ": null
    },
    {
        "lieutenant governor": "lieutenant governor of indiana"
    },
    {
        " in 42 and became governor after Morton was elected to the U.S. Senate in 42 In the national election, Republican nominees ": null
    },
    {
        "Ulysses S. Grant": "ulysses s. grant"
    },
    {
        " and his running mate, ": null
    },
    {
        "Schuyler Colfax": "schuyler colfax"
    },
    {
        " of Indiana, carried the state by a margin of more than 42 votes, suggesting that the close race for governor demonstrated Hendrickss popularity in Indiana. Following his defeat in his second gubernatorial race Hendricks retired from the U.S. Senate in March 42 and returned to his private law practice in Indianapolis, but remained connected to state and national politics.     In 42 his third campaign to become governor of Indiana, Hendricks narrowly defeated General Thomas M. Browne, 42 votes to 42.       In addition to his years of service in various political offices in Indiana and Washington, D.C., Hendricks maintained an active law practice, which he first established in Shelbyville in 42 and continued after his relocation to Indianapolis. Hendricks and ": null
    },
    {
        "Oscar B. Hord": "oscar b. hord"
    },
    {
        " established a law firm in 42 where Hendricks practiced until the ": null
    },
    {
        "Indiana General Assembly": "indiana general assembly"
    },
    {
        " elected him to represent Indiana in the ": null
    },
    {
        "U.S. Senate": "united states senate"
    },
    {
        " in 42 The law practice was renamed Hendricks, Hord, and Hendricks in 42 after Abram W. Hendricks joined the firm. In 42 it was renamed Baker, Hord, and Hendricks, after Conrad Baker, the outgoing governor of Indiana, joined the firm and Hendricks succeeded him as governor. In 42 the firm passed to Bakers son, who partnered with Edward Daniels, and it became known as ": null
    },
    {
        "Baker & Daniels": "baker  &  daniels"
    },
    {
        ", which grew into one of the states leading law firms.                Hendricks represented Indiana in the ": null
    },
    {
        "U.S. Senate": "united states senate"
    },
    {
        " during the final years of the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        " and part of the ": null
    },
    {
        "Reconstruction Era": "reconstruction era"
    },
    {
        ". Military reverses in the Civil War, some unpopular decisions in the Lincoln administration, and Democratic control of the Indiana General Assembly helped Hendricks win election to the U.S. Senate. His six years in the Senate covered the Thirty-eighth, Thirty-ninth, and Fortieth Congresses, where Hendricks was a leader of the small Democratic minority and a member of the opposition who was often overruled.     Hendricks challenged what he thought was radical legislation, including the ": null
    },
    {
        "military draft": "union soldiers"
    },
    {
        " and issuing ": null
    },
    {
        "greenbacks": "greenback"
    },
    {
        "; however, he supported the ": null
    },
    {
        "Union": "union"
    },
    {
        " and prosecution of the war, consistently voting in favor of wartime appropriations. Hendricks adamantly opposed ": null
    },
    {
        "Radical Reconstruction": "reconstruction era"
    },
    {
        ". After the war he argued that the ": null
    },
    {
        "Southern states": "southern united states"
    },
    {
        " had never been out of the Union and were therefore entitled to representation in the U.S. Congress. Hendricks also maintained that Congress had no authority over the affairs of state governments.     Hendricks voted against the ": null
    },
    {
        "Thirteenth": "thirteenth amendment to the united states constitution"
    },
    {
        ", ": null
    },
    {
        "Fourteenth": "fourteenth amendment to the united states constitution"
    },
    {
        ", and ": null
    },
    {
        "Fifteenth": "fifteenth amendment to the united states constitution"
    },
    {
        " Amendments to the ": null
    },
    {
        "U.S. Constitution": "united states constitution"
    },
    {
        " that would, upon ratification, grant voting rights to males of all races and abolish slavery. Hendricks felt it was not the right time, so soon after the Civil War, to make fundamental changes to the U.S. Constitution. Although Hendricks supported freedom for African Americans, stating, He is free; now let him remain free,  he unsuccessfully opposed reconstruction legislation. Hendricks did not believe in racial equality. For example, in a congressional debate with Indianas Senator ": null
    },
    {
        "Oliver Morton": "oliver p. morton"
    },
    {
        ", Hendricks argued,          Hendricks also opposed the attempt to remove President ": null
    },
    {
        "Andrew Johnson": "andrew johnson"
    },
    {
        " from office following his impeachment in the U.S. House of Representatives.     Hendrickss views were often misinterpreted by his political opponents in Indiana. When the Republicans regained a majority in the ": null
    },
    {
        "Indiana General Assembly": "indiana general assembly"
    },
    {
        " in 42 the same year Hendrickss U.S. Senate term expired, he lost reelection to a second term, and was succeeded by Republican Congressman-elect ": null
    },
    {
        "Daniel D. Pratt": "daniel d. pratt"
    },
    {
        ", who resigned the U.S. House seat to which he had been elected in 42 in order to accept the Senate seat.       In 42 Hendricks was elected as the governor of Indiana in his third bid for the office. An indication of Hendrickss growing national popularity occurred during the ": null
    },
    {
        "presidential election of 42": "1872 united states presidential election"
    },
    {
        "; the Democrats nominated ": null
    },
    {
        "Horace Greeley": "horace greeley"
    },
    {
        ", the ": null
    },
    {
        "Liberal Republican": "liberal republican party"
    },
    {
        " candidate. Greeley died soon after the election, but before the Electoral College cast its ballots; 42 of 42 Democratic electors previously pledged to Greeley voted for Hendricks.      Hendricks served as governor of Indiana from January 42 42 to January 42 42 a difficult period of post-war economic depression following the financial ": null
    },
    {
        "Panic of 42": "panic of 1873"
    },
    {
        ". Indiana experienced high unemployment, business failures, labor strikes, and falling farm prices. Hendricks twice called out the state militia to end workers strikes, one by miners in ": null
    },
    {
        "Clay County": "clay county, indiana"
    },
    {
        ", and one by railroad workers in ": null
    },
    {
        "Logansport": "logansport, indiana"
    },
    {
        ".     Although Hendricks succeeded in encouraging legislation enacting election and judiciary reform, the Republican-controlled legislature prevented him from achieving many of his other legislative goals. In 42 Hendricks signed the Baxter bill, a controversial piece of ": null
    },
    {
        "temperance": "temperance movement"
    },
    {
        " legislation that established a strict form of ": null
    },
    {
        "local option": "local option"
    },
    {
        ", even though he personally had favored a licensing law. Hendricks signed the legislation because he thought the bill was constitutional and reflected the majority view of the Indiana General Assembly and the will of Indianas citizens. The law proved to be unenforceable and was repealed in 42; it was replaced by a licensing system that Hendricks had preferred.     One of Hendrickss lasting legacies during his tenure as governor began with discussion to fund construction of a new ": null
    },
    {
        "Indiana Statehouse": "indiana statehouse"
    },
    {
        ". The existing structure, which had been in use since 42 had become too small, forcing the growing state government to rent additional buildings around Indianapolis. Besides its size, the dilapidated capitol building was in need of major repair. The roof in the Hall of Representatives had collapsed in 42 and public inspectors condemned the building in 42 The cornerstone for the present-day state capital building was laid in 42 after Hendricks left office, and he delivered the keynote speech at the ceremony. The new statehouse was completed eight years later and remains in use as Indianas state capitol building.            Hendricks ran for ": null
    },
    {
        "vice president": "vice president of the united states"
    },
    {
        " in 42 and 42; he won in 42 The Democrats also nominated Hendricks for the vice presidency in 42 but he declined for health reasons. In 42 while on a visit to Hot Springs, Arkansas, Hendricks suffered a bout of paralysis, but returned to public life. No one outside of his family and doctors knew his health was failing. Two years later he was no longer able to stand.     In the disputed ": null
    },
    {
        "presidential election of 42": "1876 united states presidential election"
    },
    {
        " Hendricks ran as the Democratic candidate for vice president with ": null
    },
    {
        "New York": "new york"
    },
    {
        " governor ": null
    },
    {
        "Samuel Tilden": "samuel tilden"
    },
    {
        " as the partys presidential nominee. Hendricks did not attend the Democratic convention in ": null
    },
    {
        "Saint Louis": "st. louis"
    },
    {
        ", but the party was pursuing the strategy of carrying the ": null
    },
    {
        "Solid South": "solid south"
    },
    {
        " along with New York and Indiana. The Indiana delegation urged Hendricks as the vice presidential nominee, and he was nominated unanimously.     Although they received the majority of the popular vote, Tilden and Hendricks lost the disputed election by one vote in Electoral College balloting to ": null
    },
    {
        "Rutherford B. Hayes": "rutherford b. hayes"
    },
    {
        ", the Republican Partys presidential nominee, and ": null
    },
    {
        "William A. Wheeler": "william a. wheeler"
    },
    {
        ", his vice presidential running mate. A fifteen-member Electoral Commission that included five representatives each from the House, Senate, and ": null
    },
    {
        "U.S. Supreme Court": "supreme court of the united states"
    },
    {
        " determined the outcome of the contested electoral votes. In an 42 to 42 partisan vote, the commission awarded all twenty of the disputed votes from ": null
    },
    {
        "South Carolina": "south carolina"
    },
    {
        ", ": null
    },
    {
        "Louisiana": "louisiana"
    },
    {
        ", ": null
    },
    {
        "Florida": "florida"
    },
    {
        ", and ": null
    },
    {
        "Oregon": "oregon"
    },
    {
        " to the Republican candidates. Tilden and Hendricks accepted the decision, despite deep disappointment at the outcome.     As chairman of the Indiana delegation, Hendricks attended the Democratic Partys national convention in 42 in ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        ", where he was again nominated as its vice presidential candidate by a unanimous vote. ": null
    },
    {
        "Grover Cleveland": "grover cleveland"
    },
    {
        " was the partys presidential nominee in the 42 ": null
    },
    {
        "presidential election": "u.s. presidential election, 1884"
    },
    {
        "; once again the Democrats strategy was to win New York, Clevelands home state, and Hendrickss home state of Indiana, plus the electoral votes of the Solid South. Democrats narrowly won New York, Indiana, and two more Northern states plus the Solid South to secure the election.       Hendricks, who had been in poor health for several years, served as ": null
    },
    {
        "vice president": "vice president of the united states"
    },
    {
        " during the last eight months of his life, from his inauguration on March 42 until his death on November 42 42 The vice presidency remained vacant after Hendrickss death until ": null
    },
    {
        "Levi P. Morton": "levi p. morton"
    },
    {
        " assumed office in 42      On September 42 42 in ": null
    },
    {
        "Indianapolis": "indianapolis"
    },
    {
        ", Hendricks made a controversial speech in support of Irish independence. Soon afterwards, Boston machine politician ": null
    },
    {
        "Martin Lomasney": "martin lomasney"
    },
    {
        " named the Hendricks Club after him.            Hendricks died unexpectedly on November 42 42 during a trip home to Indianapolis. He complained of feeling ill the morning of November 42 went to bed early, and died in his sleep the following day.     Hendrickss funeral service at Saint Pauls Episcopal Cathedral in Indianapolis was a large one. Hundreds of dignitaries were in attendance, including President Grover Cleveland, and thousands of people gathered along the citys street to see the 42 mile long funeral cortege as it traveled from downtown Indianapolis to ": null
    },
    {
        "Crown Hill Cemetery": "crown hill cemetery"
    },
    {
        ", where his remains were interred. During the last two years of his life, as his health was failing, Hendricks made plans for his eventual death and selected a burial site and monument. In the 42s he had the remains of his only child, Morgan, who had died thirty years earlier and was buried at Shelbyville, moved to the Hendricks burial site in Indianapolis. Morgan Hendricks is buried next to the monument that marks his fathers grave. See Memorial Address on the Life and Character of Thomas A. Hendricks , pp. 42 & ndash;42 and Gray, p. 42     Hendricks, a popular member of the Democratic Party, remained on good terms with both Democrats and Republicans. He was a fiscal conservative and a powerful orator who was known for his honesty and firm convictions.     Hendricks was one of four vice-presidential candidates from Indiana who were elected during the period 42 to 42 when Indianas electoral votes were critical to winning a national election.  Five other men from Indiana, ": null
    },
    {
        "George Washington Julian": "george washington julian"
    },
    {
        ", ": null
    },
    {
        "Joseph Lane": "joseph lane"
    },
    {
        ", Judge Samuel Williams, ": null
    },
    {
        "John W. Kern": "john w. kern"
    },
    {
        ", and ": null
    },
    {
        "William Hayden English": "william hayden english"
    },
    {
        ", lost their bids for the vice presidency during this time period.        ": null
    },
    {
        "silver certificate": "silver certificate"
    },
    {
        ". The currency notes nickname is derived from the tombstone-shaped border outlining Hendrickss portrait.    The Bates-Hendricks House, where the family lived from 42 to 42 is located in Indianapolis at 42 South New Jersey Street. The home was added to the ": null
    },
    {
        "National Register of Historic Places": "national register of historic places"
    },
    {
        " on April 42 42   ": null
    },
    {
        "Thomas A. Hendricks Library": "thomas a. hendricks library"
    },
    {
        " at ": null
    },
    {
        "Hanover College": "hanover college"
    },
    {
        ", which overlooks the ": null
    },
    {
        "Ohio River": "ohio river"
    },
    {
        " near ": null
    },
    {
        "Madison, Indiana": "madison, indiana"
    },
    {
        ", was built in 42 Hendrickss widow, Eliza, provided funding for the project as a tribute to her late husband, an alumnus of the college. The library was added to the National Register on February 42 42  See also:  In  Portraits of Thomas and Eliza Hendricks hang in the library. ": null
    },
    {
        "Thomas A. Hendricks Monument": "thomas a. hendricks monument"
    },
    {
        " was installed on the southeast corner of the state capitol buildings grounds in 42 At  it is the tallest bronze statue on the statehouse grounds.                                            ": null
    }
]