[
    {
        "     Thomas of Celano  was an ": null
    },
    {
        "Italian": "italy in the middle ages"
    },
    {
        " friar": "friar"
    },
    {
        " of the ": null
    },
    {
        "Franciscans": "franciscans"
    },
    {
        "  as well as a poet and the author of three ": null
    },
    {
        "hagiographies": "hagiography"
    },
    {
        " about ": null
    },
    {
        "Saint Francis of Assisi": "francis of assisi"
    },
    {
        ".           Thomas was from ": null
    },
    {
        "Celano": "celano"
    },
    {
        " in ": null
    },
    {
        "Abruzzo": "abruzzo"
    },
    {
        " and was born in 42          The first of his works on Francis was Vita Beati Francisci , a work on the saints early life that was commissioned by ": null
    },
    {
        "Pope Gregory IX": "pope gregory ix"
    },
    {
        " in 42 at the time Franciss ": null
    },
    {
        "canonization": "canonization"
    },
    {
        ". The second work, Memoriale Desiderio Animae de Gestis et Verbis Sanctissimi Patris Nostri Francisci was commissioned by ": null
    },
    {
        "Crescentius of Jessi": "crescentius of jessi"
    },
    {
        ", the ": null
    },
    {
        "Minister General of the Franciscan Order": "minister general of the franciscan order"
    },
    {
        " sometime between 42 and 42 and reflects changing official perspectives on Francis in the decades after his death. The third is a ": null
    },
    {
        "treatise": "treatise"
    },
    {
        " on the saints ": null
    },
    {
        "miracle": "miracle"
    },
    {
        "s, written sometime between around 42 and 42 at the bidding of Blessed ": null
    },
    {
        "John of Parma": "john of parma"
    },
    {
        ", who succeeded Crescentius as Minister General.     Thomass authorship of the three works on Francis of Assisi is well-established. Thomas also wrote Fregit victor virtualis and Sanctitatis nova signa in honor of Francis. Life of St. Clare of Assisi, on the early life of ": null
    },
    {
        "Saint Clare of Assisi": "clare of assisi"
    },
    {
        " and the hymn ": null
    },
    {
        "Dies Irae": "dies irae"
    },
    {
        " are also traditionally attributed to him, but the authorship of both works is in fact uncertain.     Thomas was not among the earliest disciples of Francis, but he joined the Franciscans around 42 during the saints lifetime, and evidently knew him personally. In 42 Thomas was sent to ": null
    },
    {
        "Germany": "holy roman empire"
    },
    {
        " with ": null
    },
    {
        "Caesarius of Speyer": "caesarius of speyer"
    },
    {
        " to promote the new order there, and in 42 was named sole guardian  of the orders ": null
    },
    {
        "Rhineland": "rhineland"
    },
    {
        " province, which included ": null
    },
    {
        "convent": "convent"
    },
    {
        "s at ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        ", ": null
    },
    {
        "Mainz": "mainz"
    },
    {
        ", ": null
    },
    {
        "Worms": "worms, germany"
    },
    {
        ", and ": null
    },
    {
        "Speyer": "speyer"
    },
    {
        ". Within a few years he was back in Italy, where he seems to have remained for the rest of his life, with some possible short-term missions to Germany.       In 42 he settled down to his last post, as spiritual director to a convent of Clarisses in ": null
    },
    {
        "Tagliacozzo": "tagliacozzo"
    },
    {
        ", where he died some time between 42 and 42     He was at first buried in the church of S.  Giovanni Val dei Varri, attached to his monastery, but his body is now reburied in the church of S.  Francesco at Tagliacozzo.       The process for beatification was initiated in Avezzano; the ": null
    },
    {
        "Congregation for the Causes of Saints": "congregation for the causes of saints"
    },
    {
        " declared the process valid and allowed for the opening of the so-called Roman Phase on 42 November 42 The initiation of the process prior to this date granted him the title ": null
    },
    {
        "Servant of God": "servant of god"
    },
    {
        ".       The Eloquence of Sanctity: Rhetoric in Thomas of Celanos Vita Prima Sancti Francisci, by John Bequette, Franciscan Institute Publications , 42   Saint Francis of Assisi, by Thomas of Celano and translated by Placid Hermann, ": null
    },
    {
        "Franciscan Institute Publications": "franciscan institute publications"
    },
    {
        ", 42                                                                  ": null
    }
]