[
    {
        "   Thomas Müntzer  was a German preacher and radical theologian of the early ": null
    },
    {
        "Reformation": "reformation"
    },
    {
        " whose opposition to both ": null
    },
    {
        "Martin Luther": "martin luther"
    },
    {
        " and the ": null
    },
    {
        "Roman Catholic Church": "roman catholic church"
    },
    {
        " led to his open defiance of late-feudal authority in central Germany. Müntzer was foremost amongst those reformers who took issue with Luthers compromises with feudal authority. He became a leader of the German peasant and plebeian uprising of 42 commonly known as the ": null
    },
    {
        "German Peasants War": "german peasants war"
    },
    {
        ". He was captured after the ": null
    },
    {
        "Battle of Frankenhausen": "battle of frankenhausen"
    },
    {
        ", and was tortured and executed.     Few other figures of the German Reformation raised as much controversy as Müntzer, which continues to this day. A complex and unique figure in history, he is now regarded as a significant player in the early years of the German Reformation and also in the history of European revolutionaries. Almost all modern studies of Müntzer stress the necessity of understanding his revolutionary actions as a consequence of his theology: Müntzer believed that the end of the world was imminent and that it was the task of the true believers to aid God in ushering in a new era of history. Within the history of the Reformation, his contribution, especially in ": null
    },
    {
        "liturgy": "liturgy"
    },
    {
        " and biblical ": null
    },
    {
        "exegesis": "exegesis"
    },
    {
        ", was of substance, but remains undervalued.       Thomas Müntzer was born in late 42 , in the small town of ": null
    },
    {
        "Stolberg": "stolberg"
    },
    {
        " in the ": null
    },
    {
        "Harz Mountains": "harz"
    },
    {
        " of Germany. The legend that his father had been executed by the feudal authorities has long since been shown untrue. There is every reason to suppose that Müntzer had a relatively comfortable background and upbringing, as evidenced by his lengthy education. Both his parents were still alive in 42 his mother dying at around that time.     Soon after 42 the family moved to the neighbouring and slightly larger town of ": null
    },
    {
        "Quedlinburg": "quedlinburg"
    },
    {
        ", and it was as Thomas Munczer de Quedlinburgk that he enrolled at the ": null
    },
    {
        "University of Leipzig": "university of leipzig"
    },
    {
        " in 42 Here he may have studied the arts or even theology: relevant records are missing, and it is uncertain whether Müntzer actually graduated from Leipzig. He later enrolled in late 42 at the ": null
    },
    {
        "Viadriana University": "viadrina european university"
    },
    {
        " of ": null
    },
    {
        "Frankfurt an der Oder": "frankfurt"
    },
    {
        ". It is not known what degrees he had obtained by 42 when he found employment within the church: almost certainly a bachelors degree in theology and/or the arts; and possibly, but less certainly, a master of the arts. Again, the university records are full of holes, or are completely missing. At some time in this rather obscure period of his life, possibly before his studies at Frankfurt, he held down posts as an assistant teacher in schools in ": null
    },
    {
        "Halle": "halle"
    },
    {
        " and Aschersleben, at which time, according to his final confession, he is alleged to have formed a league against the incumbent Archbishop of ": null
    },
    {
        "Magdeburg": "magdeburg"
    },
    {
        "  – to what end the league was formed is wholly unknown.       In May 42 he took up a post as priest in the town of ": null
    },
    {
        "Braunschweig": "braunschweig"
    },
    {
        " , where he was occupied on and off for the next few years. It was here that he began to question the practices of the Catholic Church, and to criticize, for example, the selling of ": null
    },
    {
        "indulgences": "indulgences"
    },
    {
        ". In letters of this time, he is already being addressed by friends as a castigator of unrighteousness . Between 42 and 42 he also managed to find a job as schoolmaster at a nunnery in ": null
    },
    {
        "Frose": "frose"
    },
    {
        ", near Aschersleben.     In the autumn of 42 he was in ": null
    },
    {
        "Wittenberg": "wittenberg"
    },
    {
        ", met with ": null
    },
    {
        "Martin Luther": "martin luther"
    },
    {
        ", and became involved in the great discussions which preceded the posting of Luthers ": null
    },
    {
        "42 Theses": "the ninety-five theses"
    },
    {
        ". He attended lectures at the university there, and was exposed to Luthers ideas as well as other ideas originating with the ": null
    },
    {
        "humanists": "renaissance humanism"
    },
    {
        ", among whom was ": null
    },
    {
        "Andreas Bodenstein von Karlstadt": "andreas karlstadt"
    },
    {
        ", who later became a radical opponent of Luther. Müntzer did not remain in Wittenberg for long, and was reported in various other locations in ": null
    },
    {
        "Thuringia": "thuringia"
    },
    {
        " and ": null
    },
    {
        "Franconia": "franconia"
    },
    {
        ". He continued to be paid for his position at Braunschweig until early 42 when he turned up in the town of ": null
    },
    {
        "Jüterbog": "jüterbog"
    },
    {
        ", north-east of Wittenberg, where he had been asked to stand in for the preacher Franz Günther. Günther had already been preaching the reformed gospel, but had found himself attacked by the local Franciscans; requesting leave of absence, he left the scene and Müntzer was sent in. The latter picked up where Günther had left off. Before long, the local ecclesiastics were complaining bitterly about Müntzers heretical articles which challenged both church teaching and church institutions. By this time, Müntzer was not simply following Luthers teachings; he had already begun to study the works of the mystics ": null
    },
    {
        "Henry Suso": "henry suso"
    },
    {
        " and ": null
    },
    {
        "Johannes Tauler": "johannes tauler"
    },
    {
        ", was seriously wondering about the possibility of enlightenment through dreams and visions, had thoroughly explored the early history of the Christian church, and was in correspondence with other radical reformers such as Karlstadt.     In June 42 Müntzer attended the ": null
    },
    {
        "disputation in Leipzig": "leipzig debate"
    },
    {
        " between the reformers of Wittenberg  and the Catholic Church hierarchy . This was one of the high points of the early Reformation. Müntzer did not go unnoticed by Luther, who recommended him to a temporary post in the town of Zwickau. However, at the end of that year, he was still employed in a nunnery at Beuditz, near ": null
    },
    {
        "Weissenfels": "weißenfels"
    },
    {
        ". He spent the entire winter studying works by the mystics, the humanists, and the church historians.          In May 42 Müntzer was able to capitalize on the recommendation made by Luther a year earlier, and stood in as temporary replacement for a reformist/humanist preacher named Johann Sylvanus Egranus at St Marys Church in the busy town of ": null
    },
    {
        "Zwickau": "zwickau"
    },
    {
        " , near the border with Bohemia. Zwickau was in the middle of the important iron- and silver-mining area of the ": null
    },
    {
        "Erzgebirge": "ore mountains"
    },
    {
        ", and was also home to a significant number of plebeians, primarily weavers. Money from the mining operations, and from the commercial boom which mining generated, had infiltrated the town. This led to an increasing division between rich and poor citizens, and a parallel consolidation of larger manufacturers over small-scale craftsmen. Social tensions ran high. It was a town which, although exceptional for the times, nurtured conditions which presaged the trajectory of many towns over the following two centuries.     At St Marys, Müntzer carried on as he had started in Jüterbog. This brought him into conflict with the representatives of the established church. He still regarded himself as a follower of Luther, however, and as such he retained the support of the town council. So much so that when Egranus returned to post in late September 42 the town council appointed Müntzer to a permanent post at St Katharines Church.     St Katharines was the church of the weavers. Even before the arrival of Lutheran doctrines, there was already in Zwickau a reform movement inspired by the ": null
    },
    {
        "Hussite Reformation": "bohemian reformation"
    },
    {
        " of the 42th century, especially in its radical, apocalyptic ": null
    },
    {
        "Taborite": "taborite"
    },
    {
        " flavour. Amongst the Zwickau weavers this movement was particularly strong, along with spiritualism. ": null
    },
    {
        "Nikolaus Storch": "nicholas storch"
    },
    {
        " was active here, a self-taught radical who placed every confidence in spiritual revelation through dreams. Soon he and Müntzer were acting in concert. In the following months, Müntzer found himself more and more at odds with Egranus, the local representative of the Wittenberg movement, and increasingly embroiled in riots against the local Catholic priests. The town council became nervous at what was going on at St Katharines, and in April 42 at last decided that enough was enough: Müntzer was dismissed from his post and was forced to leave Zwickau.       Müntzer initially travelled over the border into Bohemia to the town of ": null
    },
    {
        "Žatec": "žatec"
    },
    {
        " ; this town was known as one of the five safe citadels of the radical Taborites of Bohemia. But Müntzer only used this as a stop-over en route to ": null
    },
    {
        "Prague": "prague"
    },
    {
        ". It was in Prague that the Hussite Church was already firmly established and Müntzer thought to find a safe home where he could develop his increasingly un-Lutheran ideas. He arrived here in late June 42 was welcomed as a Martinist , and was allowed to preach and to give lectures. He also found the time to prepare a summary of his own beliefs, which appeared in a document known to posterity, slightly misleadingly, as the Prague Manifesto. This document exists in four forms: one in Czech, one in Latin, and two in German. One of them is written on a large piece of paper, about , much like a poster, but written on both sides. However, it is evident that none of the four items was ever published in any shape or form. The contents of this document indicate clearly just how far he had diverged from the road of the Wittenberg reformers, and how much he believed that the reform movement was something apocalyptic in nature. I, Thomas Müntzer, beseech the church not to worship a mute God, but a living and speaking one; none of the gods is more contemptible to the nations than this living one to Christians who have no part of him.      In November or December 42 having discovered that Müntzer was not at all what they had supposed, the Prague authorities ran him out of town. The next twelve months were spent wandering in Saxony: he turned up in ": null
    },
    {
        "Erfurt": "erfurt"
    },
    {
        " and in ": null
    },
    {
        "Nordhausen": "nordhausen"
    },
    {
        ", in each of which he spent several weeks, applying for suitable posts but failing to be appointed. He also visited his hometown in Stolberg to give sermons , and in November 42 visited ": null
    },
    {
        "Weimar": "weimar"
    },
    {
        " to attend a disputation. From December 42 until March 42 he found employment as chaplain at a nunnery at Glaucha just outside ": null
    },
    {
        "Halle": "halle"
    },
    {
        ". Here he found little opportunity to continue with his desire for change, despite the existence of a strong and militant local reform movement; his one attempt to break the rules, by delivering the communion in both kinds  to a noblewoman named Felicitas von Selmenitz probably led directly to his dismissal.          His next post was both relatively permanent and productive. In early April 42 through the patronage of Selmenitz, he was appointed as preacher at St Johns Church in ": null
    },
    {
        "Allstedt": "allstedt"
    },
    {
        " in Saxony. He found himself working alongside another reformer, Simon Haferitz who preached at the church of St Wigberti. The town of Allstedt was small, barely more than a large village , with an imposing castle set on the hill above it. Elector Friedrich held the right to appoint to St Johns, but the town council either forgot to advise him, or did not feel that his approval was necessary. Almost immediately on arrival, Müntzer was preaching his version of the reformed doctrines, and delivering the standard church services and masses in German. Such was the popularity of his preaching and the novelty of hearing services in German that people from the surrounding countryside and towns were soon flocking to Allstedt. Some reports suggest that upwards of two thousand people were on the move every Sunday. Within weeks, Luther got to hear of this and wrote to the Allstedt authorities, asking them to persuade Müntzer to come to Wittenberg for closer inspection. Müntzer refused to go. He was far too busy carrying through his Reformation and wanted no discussion behind closed doors . At this time, he also married Ottilie von Gersen, a former nun; in the spring of 42 Ottilie gave birth to a son.     It was not only Luther who was concerned. The Catholic Count Ernst von Mansfeld spent the summer of 42 trying to prevent his own subjects from attending the reformed services in Allstedt. Müntzer felt secure enough to pen a letter to the count in September, ordering him to leave off his tyranny: I am as much a Servant of God as you, so tread gently, for the whole world has to be exercised in patience. Don’t grab, or the old coat may tear. I will deal with you a thousand times more drastically than Luther with the Pope.      Throughout the remainder of 42 and into 42 Müntzer consolidated his reformed services and spread his message in the small town. He arranged for the printing of his German Church Service; the Protestation or Proposition by Thomas Müntzer from Stolberg in the Harz Mountains, now pastor of Allstedt, about his teachings; and On the Counterfeit Faith, in which he set out his belief that the true faith came from inner spiritual suffering and despair.   In the spring of 42 supporters of Müntzer burned down a small pilgrimage chapel at Mallerbach, much to the annoyance of the abbess of the Naundorf nunnery. The town council and the castellan failed to do anything about her complaint. But in July, Müntzer was invited before the ": null
    },
    {
        "Electoral Duke Johann": "john, elector of saxony"
    },
    {
        " in Allstedt Castle, possibly in lieu of a belated trial sermon , and there he preached his famous sermon on the Second Chapter of the Book of Daniel   – a barely concealed warning to the princes that they should pitch in with the Allstedt reforms or face the wrath of God.        The immediate reaction of the princes is not documented, but Luther did not hold back: he published his Letter to the Princes of Saxony about the Rebellious Spirit demanding the radicals banishment from Saxony. However, the princes simply summoned all the relevant persons of Allstedt, Müntzer included, to a hearing at Weimar where, after being interrogated separately, they were warned about their future conduct. This hearing had the desired effect upon town officials, who back-pedalled rapidly and withdrew their support for the radicals. In the night of 42 August 42 Müntzer slipped out of Allstedt , and headed for the self-ruling Imperial Free City of ": null
    },
    {
        "Mühlhausen": "mühlhausen"
    },
    {
        ", around  to the southwest.          Mühlhausen was a town with a population of 42. During 42 social tensions which had been brewing for several years came to a head, and the poorer inhabitants had managed to wrest some political concessions from the town council; building on this success, the radical reform movement kept up the pressure, under the leadership of a lay preacher named Heinrich Pfeiffer, who had been denouncing the practices of the old church from the pulpit of St Nikolaus Church. Thus, before Müntzer arrived, there was already considerable tension in the air. He was not appointed to any pulpit, but this did not stop him from preaching, agitating, and publishing pamphlets against Luther. His comrade-in-arms here was Pfeiffer; while the two men did not necessarily share the same beliefs there was enough common-ground in their reformatory zeal and belief in the inspired spirit to allow them to work together closely. A minor civic coup took place in late September 42 as a result of which, leading members of the town council fled the town, taking with them the city insignia and the municipal horse. But the coup was short-lived  – partly because of divisions within the reformers inside the town and partly because the peasantry in the surrounding countryside took issue with the unchristian behaviour of the urban radicals. After only seven weeks in the town, on 42 September, Müntzer was forced to abandon wife and child once more and escape with Pfeiffer to a safer haven.     He travelled first to ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        " in the south, where he arranged for the publication of his anti-Lutheran pamphlet A Highly Provoked Vindication and Refutation of the unspiritual soft-living flesh in Wittenberg, as well as one entitled A Manifest Exposé of False Faith. Both were confiscated by the city authorities, the former before any copies could be distributed. Müntzer kept a low profile in Nuremberg, clearly considering that his best strategy would be to spread his teaching in print, rather than end up behind bars. He remained there until November and then left for the southwest of Germany and Switzerland, where peasants and plebeians were beginning to organize themselves for the great ": null
    },
    {
        "peasant uprising of 42": "german peasants war"
    },
    {
        " in defiance of their feudal overlords. There is no direct evidence of what Müntzer did in this part of the world, but almost certainly he would have come in contact with leading members of the various rebel conspiracies; it is proposed that he met the later Anabaptist leader, ": null
    },
    {
        "Balthasar Hubmaier": "balthasar hubmaier"
    },
    {
        " in ": null
    },
    {
        "Waldshut": "waldshut"
    },
    {
        ", and it is known that he was in Basel in December, where he met the Zwinglian reformer ": null
    },
    {
        "Oecolampadius": "johannes oecolampadius"
    },
    {
        ", and may also have met the Swiss Anabaptist ": null
    },
    {
        "Conrad Grebel": "conrad grebel"
    },
    {
        " there. He spent several weeks in the ": null
    },
    {
        "Klettgau": "klettgau"
    },
    {
        " area, and there is some evidence to suggest that he helped the peasants to formulate their grievances. While the famous ": null
    },
    {
        "Twelve Articles": "twelve articles"
    },
    {
        " of the Swabian peasants were certainly not composed by Müntzer, at least one important supporting document, the Constitutional Draft, may well have originated with him.          In February 42 Müntzer returned to Mühlhausen and took over the pulpit at St Marys Church; the town council neither gave, nor was asked for, permission to make this appointment; it would seem that a popular vote thrust Müntzer into the pulpit. Immediately, he and Pfeiffer, who had managed to return to the town some three months earlier, were at the centre of considerable activity. In early March, the citizens were called upon to elect an Eternal Council which was to replace the existing town council, but whose duties went far beyond the merely municipal. Surprisingly, neither Pfeiffer nor Müntzer were admitted to the new council, nor to its meetings. Possibly because of this, Müntzer then founded the Eternal League of God in late March . This was an armed militia, designed not just as a defence league, but also as a God-fearing cadre for the coming apocalypse. It met under a huge white banner which had been painted with a rainbow and decorated with the words The Word of God will endure forever. In the surrounding countryside and neighbouring small towns, the events in Mühlhausen found a ready echo, for the peasantry and the urban poor had had news of the great uprising in southwest Germany, and many were ready to join in.        In late April, all of Thuringia was up in arms, with peasant and plebeian troops from various districts mobilized. However, the princes were laying their own plans for the suppression of the revolt. The feudal authorities had far better weapons and more disciplined armies than their subjects. At the beginning of May, the Mühlhausen troop marched around the countryside in north Thuringia, but failed to meet up with other troops, being content to loot and pillage locally.        Luther pitched in very firmly on the side of the princes; he made a tour of southern Saxony  – Stolberg, Nordhausen, and the ": null
    },
    {
        "Mansfeld": "mansfeld"
    },
    {
        " district  – in an attempt to dissuade the rebels from action, although in some of these places he was roundly heckled. He followed this up with his pamphlet Against the Robbing and Murdering Hordes of Peasants, calling for the ruthless suppression of the revolt. This had a title and a timing that could not have been more ill-considered since it was the German peasantry who at that time died in their thousands at the hands of the princely armies. Estimates put the figure at 42–42, possibly even as high as 42.     At length, on 42 May, Müntzer and what remained of his troops arrived outside the town of ": null
    },
    {
        "Frankenhausen": "bad frankenhausen"
    },
    {
        ", meeting up with rebels there who had been asking for help for some time. No sooner had they set up camp on a hill than the princes’ army arrived, having already crushed the rebellion in southern Thuringia. On 42 May, battle was joined. It lasted only a few minutes, and left the streams of the hill running with blood. Six thousand rebels were killed, but barely a single soldier. Many more rebels were executed in the following days. Müntzer fled, but was captured as he hid in a house in Frankenhausen. His identity was revealed by a sack of papers and letters which he was clutching. On 42 May, after torture and confession, he was executed alongside Pfeiffer, outside the walls of Mühlhausen, their heads being displayed prominently for years to come as a warning to others.       Müntzers theology has been the subject of many studies over the years. Modern researchers agree that Müntzer was deeply read and that it was his theology, and not any socio-political dogma, which drove him to stand up to feudal authority. The short paragraphs below attempt to give a very brief summary of his theology.       Evident from Müntzers writings is his broad knowledge of aspects of the Christian religion. From 42 onwards, possibly earlier, he read widely in the early Christian fathers , in the history of the early church , in the mystics of the late medieval period , in Humanist ideas which harked back to Plato, and in the Bible itself. By around 42 after he had left Prague, most of his theology had matured and settled around some guiding principles, even if some details, such as the identity of the Elect , were unclear.       Despite the profusion of biblical quotations in Müntzers writings, it was his doctrine that true belief was dictated by spiritual experience, not by written testimony. The Bible was for him evidence only of spiritual experiences of the past; the words of the Bible still had to be validated by the working of the Spirit in the believers heart. If someone had never had sight or sound of the Bible at any time in his life, he could still hold the one true Christian faith because of the true teaching of the spirit, just like all those who composed the holy Scripture without any books at all.  The insistence on written, Biblical proof by the academics or scholars meant that it was impossible for the common man to gain a true understanding of the true faith. Müntzers true believers were capable of reaching faith through personal suffering, guided by true servants of God , and without regard to Catholic or Lutheran-reformed priests.       Spiritual revelation came sometimes through dreams and visions and sometimes through suffering. In Zwickau, Müntzers belief in the possibilities of revelation by dream matched the same belief in the sect of radicals led by Nikolaus Storch. Storch was later to confound Luthers colleague Melanchthon with plausible arguments about this. Müntzer himself clearly believed in the power of vision and dream, as evidenced by his lengthy and carefully argued Sermon Before the Princes, which discussed the dream of Nebuchadnezzar:          It was essential, in Müntzers view, for a person to experience real suffering and pain  – either spiritual or physical  – in order to come to a true Christian belief. The theme of hardship and suffering, purgation and sevenfold cleansing, runs through all of his writings.      On the very eve of Battle at Frankenhausen, he had this to say to the people of Allstedt:          One of the principal dialectics in Müntzers teaching is the opposition of the Fear of Man to the Fear of God . Regardless of ones position in society, it was necessary for the true believer to have a fear of God and to have no fear of man. This was the thrust of his Sermon Before the Princes and it was the rallying call in his final letter to Mühlhausen in May 42: May the pure, upright fear of God be with you my dear brothers.  In his Sermon Before the Princes he stated quite clearly: The fear of God must be pure, unsullied by any fear of men or creaturely things. How desperately we need a fear like this! For just as it is impossible to fear two masters and be saved, so it is impossible to fear both God and created things and be saved.        Interwoven with Müntzers mystical piety, as for many of his contemporaries, was a conviction that the whole cosmos stood at a tipping point. Now God would set right all the wrongs of the world, largely by destruction, but with the active assistance of true Christians. From this would emerge a new age of mankind. In the Prague Manifesto he wrote: O ho, how ripe the rotten apples are! O ho, how rotten the elect have become! The time of the harvest has come! That is why he himself has hired me for his harvest.  In a letter to the people of Erfurt, in May 42 he wrote:           – all things are to be held in common and distribution should be to each according to his need . This statement has often been cited as evidence of Müntzers early communism , but it stands quite alone in all of his writings and letters. Thus, it is far more likely to have been a statement of what his captors feared than what Müntzer actually believed. Indeed, in the very same confession, Müntzer is also reported as recommending that princes should ride out with a maximum of eight horses and gentlemen with two . Müntzers own writings and letters clearly propose that power be taken from the feudal authorities and given to the people. For that proposal, he may be described as a revolutionary, but he never once considered the question of redistributing wealth.       The doctrines of essential suffering, of spiritual revelation, of denial of the fear of Man - all combined with the expectation of the Apocalypse to place the Elect person in total opposition to feudal authority, and to both Catholic and Lutheran teaching. However, this was no individualistic path to salvation. The importance which Müntzer laid on communal activities  – the reformed liturgies and the leagues he founded or supported in Zwickau, Allstedt, and Mühlhausen  – are central to his ministry. To judge from his writings of 42 and 42 it was by no means inevitable that Müntzer would take the road of social revolution. However, it was precisely on this same theological foundation that Müntzers ideas briefly coincided with the aspirations of the peasants and plebeians of 42 Viewing the uprising as an apocalyptic act of God, he stepped up as Gods Servant against the Godless and took his position as leader of the rebels.       Müntzer was one of many preachers and theologians caught up in the extraordinary atmosphere of the early Reformation. In this period, from around 42 to 42 Martin Luther had no monopoly of the reforms. This was the time not only of Luther, but also of ": null
    },
    {
        "Erasmus of Rotterdam": "desiderius erasmus"
    },
    {
        " and fellow-Humanists, of the alchemists ": null
    },
    {
        "Paracelsus": "paracelsus"
    },
    {
        " and ": null
    },
    {
        "Cornelius Agrippa": "heinrich cornelius agrippa"
    },
    {
        ", of localized urban and rural acts of defiance. The social upheavals triggered the Reformation - or more precisely, the reformations, for it was above all a time of massive dissent, and indeed dissent from dissent; in turn, the reformation of thought triggered further social and political upheavals.     In this roiling pot of ideas, Müntzer quite readily respected Luther for a period and then just as readily rejected the Lutheran doctrines. Although it is clear in retrospect that Müntzers ideas were already diverging from Luthers at least as early as the period in Zwickau, Müntzer himself may not have been aware of this. Luther, like Müntzer, had shown an avid interest in the mystic and theologian ": null
    },
    {
        "Johannes Tauler": "johannes tauler"
    },
    {
        ". Müntzer may even have looked at Luthers many admiring references to Tauler in his Theologia Germanica and assumed him to be a fellow fan of Taulers work. In July 42 Müntzer was still able to sign off a letter to Luther as Thomas Müntzer, whom you brought to birth by the gospel . However, it is clear that Luther considered that Müntzer was moving ahead too fast, and correspondence from Wittenberg seems to have contained explicit criticisms of his activities. By March 42 Müntzer was writing to Melanchthon in Wittenberg, warning that our most beloved Martin acts ignorantly because he does not want to offend the little ones... Dear brothers, leave your dallying, the time has come! Do not delay, summer is at the door. ... Do not flatter your princes, otherwise you will live to see your undoing.  An attempt at reconciliation with Luther, in a letter written by Müntzer from Allstedt in July 42 went without reply. In June 42 however, Luther published his pamphlet A Letter to the Princes of Saxony concerning the Rebellious Spirit, which essentially called on Prince Friedrich and Duke Johann to deal firmly with the rebellious spirit of Allstedt , this bloodthirsty Satan . Shortly afterwards, Müntzer described Luther as Brother Fatted Pig and Brother Soft Life in his Sermon Before the Princes. After the summer of 42 the tone of the written conflict became ever more bitter on both sides, culminating in Müntzers pamphlet A Highly-Provoked Vindication and a Refutation of the Unspiritual Soft-living Flesh in Wittenberg of 42 and in Luthers A Terrible History and Judgement of God on Thomas Müntzer of 42 in which the radical preacher was described as a murderous and bloodthirsty prophet .        Deutzsch Kirchen Ampt, vorordnet, auffzuheben den hinterlistigen Deckel etc.   The Order and Explanation of the German Church Service in Allstedt. Ordnung und Berechunge des Teutschen Ampts zu Alstadt Ein ernster Sendebrieff an seine lieben Bruder zu Stolberg, unfuglichen Auffrur zu meiden Von dem getichten Glawben.   Protestation or Proposition. Protestation odder Empietung.   Interpretation of the Second Chapter of Daniel the Prophet. Ausslegung des andern Unterschyds Danielis dess Propheten Deutsch Euangelisch Messze Aussgetrueckte Emplössung des falschen Glaubens der ungetrewen Welt.   A Highly-Provoked Vindication and a Refutation of the Unspiritual, Soft-Living Flesh in Wittenberg. Hoch verursachte Schutzrede und Antwwort wider das gaistlosse sanfft lebende Fleysch zuo Wittenberg       During the last two years of his life, Müntzer had come into contact with a number of other radicals; prominent amongst them were ": null
    },
    {
        "Hans Hut": "hans hut"
    },
    {
        ", ": null
    },
    {
        "Hans Denck": "hans denck"
    },
    {
        ", ": null
    },
    {
        "Melchior Rinck": "melchior rink"
    },
    {
        ", Hans Römer, and ": null
    },
    {
        "Balthasar Hubmaier": "balthasar hubmaier"
    },
    {
        ". All of them were leaders of the emerging ": null
    },
    {
        "Anabaptist": "anabaptists"
    },
    {
        " movement, which nurtured similar reformed doctrines to those of Müntzer himself. While it is not appropriate to claim that they were all or consistently Müntzerites , it is possible to argue that they all shared some common teaching. A common thread links Müntzer, the early Anabaptists, the ": null
    },
    {
        "Kingdom of Münster": "münster rebellion"
    },
    {
        " in North Germany in 42 the Dutch Anabaptists, the radicals of the English Revolution, and beyond.   There was a short-lived legacy even within the official reformed church as well; in the towns where Müntzer had been active, his reformed liturgies were still being used some ten years after his death.     ": null
    },
    {
        "Friedrich Engels": "friedrich engels"
    },
    {
        " and ": null
    },
    {
        "Karl Kautsky": "karl kautsky"
    },
    {
        " claimed him as a precursor of the revolutionaries of more modern times. They based their analysis on the pioneering work of the German liberal historian ": null
    },
    {
        "Wilhelm Zimmermann": "wilhelm zimmermann"
    },
    {
        ", whose important three-volume history of the Peasants War appeared in 42 It is not only as an early social revolutionary that Müntzer has historical importance as his activities within the early Reformation movement were influential on Luther and his reforms.        Further interest in Müntzer was spurred at various moments in German history: during the creation of a German national identity between 42 and 42; in the revolutionary era in Germany immediately after 42; in an East Germany looking for its own history after 42 ; and leading up to the 42th anniversary of the Peasant War in 42 and the 42th anniversary of Müntzers birth in 42 In terms of pure statistics, the number of books, articles and essays devoted to Müntzer rose dramatically after 42 Before that year, around 42 had appeared; between 42 and 42 another 42; between 42 and 42 42     Since around 42 the number of fictional works on Müntzer has grown significantly; this encompasses over 42 novels, poems, plays and films, almost all in German. A ": null
    },
    {
        "film of his life": "thomas müntzer"
    },
    {
        " was produced in East Germany in 42 directed by ": null
    },
    {
        "Martin Heilberg": "martin heilberg"
    },
    {
        " and starring ": null
    },
    {
        "Wolfgang Stumpf": "wolfgang stumpf"
    },
    {
        ". In 42 shortly before the fall of the ": null
    },
    {
        "Berlin Wall": "berlin wall"
    },
    {
        ", the ": null
    },
    {
        "Peasants War Panorama": "bad frankenhausenpeasants.27 war panorama"
    },
    {
        " at Bad Frankenhausen was opened, containing the largest oil painting in the world, with Müntzer in central position. The painter was ": null
    },
    {
        "Werner Tübke": "werner tübke"
    },
    {
        ".       Very little is known about Müntzers wife Ottilie von Gersen other than the fact that she was a nun who had left a nunnery under the influence of the Reformation movement. Her family name may have been ": null
    },
    {
        "von Görschen": "görschen family"
    },
    {
        " . She may have been one of a group of sixteen nuns who left the convent at Wiederstedt, some miles north of Allstedt, of whom eleven found refuge in Allstedt. She and Müntzer were married in June 42 Apart from the son born to her and Müntzer on Easter Day, 42 it is possible she was again pregnant at the time of her husbands death, by which time, the son may also have died. A letter she wrote to Duke Georg on 42 August 42 pleading for the chance to recover her belongings from Mühlhausen, went unheeded. No further reports of her life have been found.       ": null
    }
]