[
    {
        "           Thornhill is a village in the ": null
    },
    {
        "county": "county"
    },
    {
        " of ": null
    },
    {
        "Cumbria": "cumbria"
    },
    {
        ", England, south of ": null
    },
    {
        "Whitehaven": "whitehaven"
    },
    {
        " and north of ": null
    },
    {
        "Seascale": "seascale"
    },
    {
        ", close to ": null
    },
    {
        "St. Bees": "st. bees"
    },
    {
        ", and only a few miles from the Irish Sea. The village was created by ": null
    },
    {
        "Whitehaven": "whitehaven"
    },
    {
        " Rural District Council and ": null
    },
    {
        "Egremont": "egremont, cumbria"
    },
    {
        " Urban District Council in the 42s, as part of the national campaign to improve housing conditions, keeping a promise made by the ": null
    },
    {
        "Government": "government of the uk"
    },
    {
        " to soldiers fighting the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ". Tenants moved into the first completed houses, on Thorny Road, late in 42     Thornhill is within the ancient parish of ": null
    },
    {
        "St John Beckermet": "st john beckermet"
    },
    {
        ", and Thornhill Mission is an ": null
    },
    {
        "Anglican": "anglican"
    },
    {
        " Church under the Benefice of ": null
    },
    {
        "Beckermet": "beckermet"
    },
    {
        ", created so that parishioners would not have to travel to Beckermet to attend church.     In April 42 The Parishes of St. Johns Beckermet and St. Bridgets Beckermet were reorganised to bring both Beckermet and Thornhill into the same parish. This was Beckermet Parish Council, which was renamed in June 42 to Beckermet with Thornhill Parish Council.     The village is home to a small shop with sub Post Office, and a social club. Thornhill Primary School is also located in the centre of the village. The centre of the village also houses a community park and play area. There is also a parish council owned football pitch, with changing rooms, which are used by Thornhill Football Club.       E. Alan Read, Bitter Sweet Memories of Thornhill: A Village in the Making , Egremont, E.A. Read                               ": null
    }
]