[
    {
        "Thorin II Oakenshield, son of Thráin, son of Thrór, King under the Mountain is a fictional character in ": null
    },
    {
        "J. R. R. Tolkien": "j. r. r. tolkien"
    },
    {
        "s 42 novel  The Hobbit . Thorin is the leader of ": null
    },
    {
        "the Company": "list of the hobbit charactersthorins company"
    },
    {
        " of ": null
    },
    {
        "Dwarves": "dwarf"
    },
    {
        " who aim to reclaim the Lonely Mountain from ": null
    },
    {
        "Smaug": "smaug"
    },
    {
        " the ": null
    },
    {
        "dragon": "dragon"
    },
    {
        ". He is the son of ": null
    },
    {
        "Thráin II": "thráin ii"
    },
    {
        ", grandson of ": null
    },
    {
        "Thrór": "thrór"
    },
    {
        ", and becomes King of ": null
    },
    {
        "Durins Folk": "durin"
    },
    {
        " during their exile from ": null
    },
    {
        "Erebor": "erebor"
    },
    {
        ". Thorins background is further elaborated in Appendix A of Tolkiens 42 novel  The Return of the King .       Thorin is described as haughty, stern, and officious. He sings and plays the harp, wears a gold chain, and has a long beard. He wears a distinctive sky blue hood with a long silver tassel. He refers to his home in the ": null
    },
    {
        "Blue Mountains": "ered luin"
    },
    {
        " as poor lodgings in exile . He is a capable and a cunning warrior, if not a particularly inspiring or clever leader. While shorter than Elves or Men, Thorin is said to be quite tall for a Dwarf. Thorin was smart, proud, brave, and vengeful. He was infamous for a high sense of his importance and rank. He shared the greed of his family, though he valued the welfare of others above his wealth.       In the year , Thorin II was born to Thráin II in the Lonely Mountain. The dwarves of the Lonely Mountain were forced to flee by the dragon ": null
    },
    {
        "Smaug": "smaug"
    },
    {
        " in T.A. 42 while Thorin was quite young. In exile, he became a capable warrior, and while still young participated in the ": null
    },
    {
        "Battle of Azanulbizar": "battle of azanulbizar"
    },
    {
        " in T.A. 42 During the fighting, his shield broke, and he took up an ": null
    },
    {
        "oak": "quercus robur"
    },
    {
        " branch to serve as a shield; Oakenshield thus became his epithet. Thorin became King-in-Exile of Durins Folk after his father presumably died in the dungeons of ": null
    },
    {
        "Dol Guldur": "dol guldur"
    },
    {
        ". He led the expedition recounted in The Hobbit to win the Lonely Mountain back from Smaug, but was killed in the ": null
    },
    {
        "Battle of Five Armies": "battle of five armies"
    },
    {
        " described at the end of that book.         The HobbitThe Hobbit, Thorin and ": null
    },
    {
        "twelve other Dwarves": "list of the hobbit charactersthorins company"
    },
    {
        " visited ": null
    },
    {
        "Bilbo Baggins": "bilbo baggins"
    },
    {
        " on ": null
    },
    {
        "Gandalf": "gandalf"
    },
    {
        "s advice to hire Bilbo as a burglar to steal their treasure back from the ": null
    },
    {
        "dragon": "dragon"
    },
    {
        " Smaug": "smaug"
    },
    {
        ". Smaug had attacked Erebor about 42 years before and had taken both the dwarves mountain and their treasure. Thorin was determined to get the treasure back and especially wanted the ": null
    },
    {
        "Arkenstone": "arkenstone"
    },
    {
        ", the Heart of the Mountain, an heirloom of his house.     On the journey, the company encountered a band of ": null
    },
    {
        "trolls": "troll"
    },
    {
        ", and Thorin alone of the Dwarves was not taken unawares. He found the Elven blade ": null
    },
    {
        "Orcrist": "orcrist"
    },
    {
        " in the trolls cache and used the sword thereafter until it was taken when he was captured by the wood-elves. He and Gandalf fought valiantly in the ": null
    },
    {
        "goblin": "orc"
    },
    {
        " tunnels in the ": null
    },
    {
        "Misty Mountains": "misty mountains"
    },
    {
        ". When the dwarves were captured by the ": null
    },
    {
        "wood-elves": "silvan elves"
    },
    {
        " of ": null
    },
    {
        "Mirkwood": "mirkwood"
    },
    {
        ", Thorin insisted that the others not disclose their quest to their captors. He was the first to emerge from the barrels at ": null
    },
    {
        "Lake-town": "esgaroth"
    },
    {
        " and marched right up to the leaders of the town, declaring himself as King Under the Mountain.     With provisions from Lake-town, Thorin led the company to Erebor. After Smaug was destroyed, the dwarves reclaimed the treasure, and Thorin, very pleased with Bilbo, gave the ": null
    },
    {
        "Hobbit": "hobbit"
    },
    {
        " a chain-mail coat made of  mithril  as the first installment of his payment. Faced with demands from ": null
    },
    {
        "Thranduil": "thranduil"
    },
    {
        " the Elvenking and ": null
    },
    {
        "Bard the Bowman": "bard the bowman"
    },
    {
        " for a fair share of the treasure to be distributed to the wood-elves and the men of Lake-town, Thorin let greed get the better of him and refused to acknowledge their right to any of the hoard. He fortified the Mountain against his new rivals and sent to his cousin ": null
    },
    {
        "Dáin Ironfoot": "dáin ii ironfoot"
    },
    {
        " for reinforcements. Thorin was furious when Bilbo stole the Arkenstone to use as a bargaining counter and drove him from the Mountain. The growing conflict was averted only by an invasion of goblins and ": null
    },
    {
        "warg": "warg"
    },
    {
        "s, whereupon the dwarves joined forces with the wood-elves, the men of Lake-town, and the great ": null
    },
    {
        "eagles": "eagle"
    },
    {
        " in what became known as the ": null
    },
    {
        "Battle of Five Armies": "battle of five armies"
    },
    {
        ". During the battle, Thorin was mortally wounded, but he made his peace with Bilbo before he died.        When Thorin died, he was buried with the Arkenstone, and Orcrist was returned and laid upon his tomb. The blade would glow blue should Orcs approach, and they could thus not take the Mountain by surprise. Thorin was succeeded as leader of Durins Folk by his cousin Dáin.     The Lord of the Rings The Return of the King  gives an overview of the history of Durins Folk and gives more of Thorins background. He was born in , and when Smaug attacked Erebor in 42 Thorin was driven into exile with the other surviving dwarves. In 42 when he was 42 , he marched with a mighty dwarf-army against the orcs of ": null
    },
    {
        "Moria": "moria"
    },
    {
        ". In the ": null
    },
    {
        "Battle of Azanulbizar": "battle of azanulbizar"
    },
    {
        " in ": null
    },
    {
        "Nanduhirion": "minor places in middle-earthdimrill dale"
    },
    {
        " beneath the East-gate of Moria, Thorins shield was broken, and he used his axe to chop a branch from an oak tree to defend himself, thus earning the epithet Oakenshield . After the battle Thorin led his people to establish a foothold in the Ered Luin - the Blue Mountains west of the ": null
    },
    {
        "Shire": "shire"
    },
    {
        ".     Unfinished Tales Unfinished Tales , a book of Tolkiens essays and stories about Middle-earth published posthumously in 42 elaborates on Thorins reasons for accepting Bilbo into his company. As depicted in the story ": null
    },
    {
        "The Quest of Erebor": "the quest of erebor"
    },
    {
        " , Thorin met with Gandalf in ": null
    },
    {
        "Bree": "bree"
    },
    {
        " shortly before the quest began. Gandalf persuaded him that stealth, rather than force, was needed to infiltrate Erebor; they would therefore need a burglar. Gandalf feared that ": null
    },
    {
        "Sauron": "sauron"
    },
    {
        " could use Smaug as a weapon, and was concerned that Thorins pride and quick temper would ruin the mission to destroy the ": null
    },
    {
        "dragon": "dragon"
    },
    {
        ". He thought that Bilbo would be a calming influence on Thorin, as well as a genuinely valuable addition to the company. Thorin, who did not think much of Hobbits, reluctantly agreed, realizing that Bilbos presence would be a small price to pay for Gandalfs help.       Tolkien adopted Thorins name from the ": null
    },
    {
        "Old Norse": "old norse"
    },
    {
        " poem ": null
    },
    {
        "Völuspá": "völuspá"
    },
    {
        " , part of the  Poetic Edda .  The name Thorin  appears in stanza 42 where it is used for a ": null
    },
    {
        "dwarf": "norse dwarves"
    },
    {
        ", and the name Oakenshield  in stanza 42  The names also appear in ": null
    },
    {
        "Snorri Sturluson": "snorri sturluson"
    },
    {
        "s  Prose Edda .  Tr. ": null
    },
    {
        "Arthur Gilchrist Brodeur": "arthur gilchrist brodeur"
    },
    {
        ". The names appear as Thorinn and Eikinskjaldi. The name ultimately derives from that of the Norse god ": null
    },
    {
        "Thor": "thor"
    },
    {
        ". The Norse Þorinn means darer or bold one,  which is apt for the dwarf who initiated the quest of Erebor.     As he was by right of birth the king of Erebor following the death of his father Thráin, he was King under the Mountain in exile until Smaug was destroyed. Upon Thorins death, the title passed to ": null
    },
    {
        "Dáin": "dáin ii ironfoot"
    },
    {
        ", his cousin and nearest heir.          In the ": null
    },
    {
        "42 animated version of The Hobbit": "the hobbit"
    },
    {
        ", Thorin is voiced by ": null
    },
    {
        "Hans Conried": "hans conried"
    },
    {
        ". In the 42 game ": null
    },
    {
        "The Hobbit": "the hobbit"
    },
    {
        " Thorin appears as an ": null
    },
    {
        "AI": "artificial intelligence"
    },
    {
        " controlled character and one of his seemingly random actions became quite famous.      In the ": null
    },
    {
        "42 video game": "the hobbit"
    },
    {
        ", Thorin is voiced by ": null
    },
    {
        "Clive Revill": "clive revill"
    },
    {
        ". Thorin briefly appears in  The Lord of the Rings Online  during the prologue for the Dwarven characters, set shortly before The Quest for Erebor. In the game the stronghold in the Ered Luin of the refugees from Erebor bears the name Thorins Hall in his honour.     In the Extended Edition of  The Lord of the Rings: The Fellowship of the Ring  Gandalf briefly mentions Thorin as the one who gave the  mithril  shirt to Bilbo as a gift.     In the three-film adaptation of  The Hobbit  , Thorin is portrayed by ": null
    },
    {
        "Richard Armitage": "richard armitage"
    },
    {
        ".  The film adaptation adds to Thorins quest a personal vendetta against the ": null
    },
    {
        "orc": "orc"
    },
    {
        " Azog": "list of middle-earth orcsazog"
    },
    {
        ", who murdered Thorins grandfather, Thrór. Thorin and Azog face each other once again following the dwarves escape from Goblin-Town, and Thorin sets out to kill Azog once and for all during the Battle of the Five Armies. After a prolonged fight, Thorin and Azog mortally wound each other, and Thorin dies in Bilbos arms.       Durins Folk   ": null
    }
]