[
    {
        " is a 42 Japanese ": null
    },
    {
        "historical drama film": "historical period drama"
    },
    {
        " co-written and directed by ": null
    },
    {
        "Akira Kurosawa": "akira kurosawa"
    },
    {
        ". The film transposes the plot of ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        "s play  Macbeth  from Medieval Scotland to feudal Japan, with stylistic elements drawn from ": null
    },
    {
        "Noh": "noh"
    },
    {
        " drama. The film stars ": null
    },
    {
        "Toshiro Mifune": "toshiro mifune"
    },
    {
        " and ": null
    },
    {
        "Isuzu Yamada": "isuzu yamada"
    },
    {
        " in the lead roles, modelled on the characters ": null
    },
    {
        "Macbeth": "macbeth"
    },
    {
        " and ": null
    },
    {
        "Lady Macbeth": "lady macbeth"
    },
    {
        ".     As with the play, the film tells the story of a warrior who assassinates his sovereign at the urging of his ambitious wife. Kurosawa was a fan of the play and intended to make his own adaptation for several years, delaying it after learning of ": null
    },
    {
        "Orson Welles": "orson welles"
    },
    {
        "  Macbeth  . Among his changes was the ending, which required archers to fire arrows around Mifune. The film was shot around ": null
    },
    {
        "Mount Fuji": "mount fuji"
    },
    {
        " and ": null
    },
    {
        "Izu Peninsula": "izu peninsula"
    },
    {
        ".     Despite the change in setting and language and numerous creative liberties, Throne of Blood often is considered one of the better ": null
    },
    {
        "film adaptations of the play": "macbeth on screen"
    },
    {
        ". It won two ": null
    },
    {
        "Mainichi Film Awards": "mainichi film awards"
    },
    {
        ", including ": null
    },
    {
        "Best Actor": "mainichi film award for best actor"
    },
    {
        " for Mifune.       Generals Miki and Washizu are ": null
    },
    {
        "Samurai": "samurai"
    },
    {
        " commanders and friends under Lord Tsuzuki, a local lord, who reigns in the castle of the Spiders Web Forest. After defeating the lords enemies in battle, they return to Tsuzukis castle. On their way through the thick forest surrounding the castle, they meet a spirit, who foretells their future. The spirit tells them that today Washizu will be named Lord of the Northern Garrison and Miki will become commander of the first fortress. She then foretells that Washizu eventually will become Lord of Spiders Web Castle, and finally she tells Miki that his son will become lord of the castle. When the two return to Tsuzukis estate, he rewards them with exactly what the spirit had predicted. As Washizu discusses this with Asaji, his wife, she manipulates him into making the second part of the prophecy come true by murdering Tsuzuki when he visits.     Washizu kills Tsuzuki with the help of his wife, who gives drugged ": null
    },
    {
        "sake": "sake"
    },
    {
        " to the lords guards, causing them to fall asleep. When Washizu returns in shock at his deed, Asaji grabs the bloody spear and puts it in the hands of one of the three unconscious guards. She then yells murder through the courtyard, and Washizu slays the guard before he has a chance to plead his innocence. Tsuzukis vengeful son Kunimaru and Noriyasu, an advisor to Tsuzuki, both suspect Washizu as the traitor and try to warn Miki, who refuses to believe what they are saying about his friend. Under Asajis influence, Washizu is unsure of Mikis loyalty, but chooses Mikis son as his heir because he and Asaji have no child of their own. Washizu plans to tell Miki and his son about his decision at a grand banquet. However, Asaji tells him that she is pregnant, which leaves him with a quandary concerning his heir; now Miki and his son have to be eliminated.     During the banquet, Washizu clearly is agitated by the non-appearance of Miki and his son, and drinks sake copiously. He loses his self-control when Mikis pale ghost suddenly appears. In a delusional panic, he reveals what has happened to Miki by exclaiming that he is willing to slay Miki for a second time, going so far as unsheathing his sword and striking over Mikis mat. Asaji, attempting to pick up the pieces of Washizus blunder, tells the guests that he is only drunk and that they must retire for the evening. One of his men arrives and presents the severed head of Miki, and tells them that Mikis son escaped. Washizu is horrified by his own betrayal of his best friend, and kills the assassin.     Later, Washizu is distraught upon hearing that his child and heir is ": null
    },
    {
        "stillborn": "stillborn"
    },
    {
        " and so Mikis murder was unnecessary. In dire need of help with the impending battle with his foes, he returns to the forest to summon the spirit. She tells him that he will not be defeated in battle unless the very trees of Spiders Web Forest rise against the castle. Washizu believes this is impossible and becomes confident of his victory. Washizu knows he must kill all his enemies, so he tells his troops of the last prophecy, and they share his confidence. The next morning, Washizu is awakened by the screams of attendants. Striding into his wifes quarters, he finds Asaji in a semi-catatonic state, trying to wash clean the imaginary foul stench of blood from her hands, obviously distraught at her grave misdeeds. Distracted by the sound of his troops moving outside the room, he investigates, and he is told by a panicked soldier that the trees of Spiders Web Forest have risen to attack us . The prophecy has come true, and Washizu is doomed.     As Washizu tries to get his troops to attack, they remain still. Disillusioned with his increasingly unstable leadership, the troops finally accuse Washizu of the murder of Tsuzuki. For his treachery, and to appease Mikis son and Noriyasu, they turn on their master and begin firing arrows at him. Washizu finally succumbs when one of the arrows leaves a mortal wound just as his enemies approach the castle gates. It is revealed that the attacking force is using trees cut during the previous night to disguise and protect themselves in their advance on the castle.                      ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        "s plays had been read in Japan since the ": null
    },
    {
        "Meiji Restoration": "meiji restoration"
    },
    {
        " in 42 though banned during World War II for not being Japanese. Director ": null
    },
    {
        "Akira Kurosawa": "akira kurosawa"
    },
    {
        " stated he had had an admiration for Shakespeares  Macbeth  for a long time, and envisioned making a film based on it. He hoped to make one after his 42 film  Rashomon , but opted to wait when he learned ": null
    },
    {
        "Orson Welles": "orson welles"
    },
    {
        " was releasing a  Macbeth  film.     Kurosawa believed that Scotland and Japan in the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        " shared social problems and that these had lessons for the present day. Moreover, Macbeth could serve as a ": null
    },
    {
        "cautionary tale": "cautionary tale"
    },
    {
        " complementing his 42 film  Ikiru .     The film combines Shakespeares play with the ": null
    },
    {
        "Noh": "noh"
    },
    {
        " style of drama. Kurosawa was an admirer of Noh, which he preferred over ": null
    },
    {
        "Kabuki": "kabuki"
    },
    {
        ". In particular, he wished to incorporate Noh-style body movements and set design. Noh also makes use of masks, and the evil spirit is seen, in different parts of the film, wearing faces reminiscent of these masks, starting with yaseonna . Noh often stresses the Buddhist doctrine of ": null
    },
    {
        "impermanence": "impermanence"
    },
    {
        ". This is connected to Washizu being denied salvation, with the chorus singing that his ghost is still in the world. The film scores use of flute and drum are drawn from Noh.     Originally, Kurosawa planned only to produce the film, and hand over the reins to another director. However, ": null
    },
    {
        "Toho": "toho"
    },
    {
        ", assessing the budget and seeing the film would be costly, insisted Kurosawa direct it.          The castle exteriors were built and shot on ": null
    },
    {
        "Mount Fuji": "mount fuji"
    },
    {
        ". The castle courtyard was constructed at Tohos Tamagawa studio, with volcanic soil brought from Fuji so that the ground matched. The interiors were shot in a smaller studio in Tokyo. The forest scenes were a combination of actual Fuji forest and studio shots in Tokyo. Washizus mansion was shot in the ": null
    },
    {
        "Izu Peninsula": "izu peninsula"
    },
    {
        ".      In Kurosawas own words,      Production designer ": null
    },
    {
        "Yoshirō Muraki": "yoshirō muraki"
    },
    {
        " said the crew opted to employ the color black in the set walls, and a lot of armor, to complement the mist and fog effects. This design was based on ancient scrolls depicting Japanese castles.     Washizus death scene, in which his own archers turn upon him and shoot him with arrows, was in fact performed with real arrows, shot by knowledgeable and skilled archers. During filming, Mifune waved his arms, which was how the actor indicated his intended bodily direction. This was for his own safety in order to prevent the archers accidentally hitting him.        In Japan, the film was released by Toho on 42 January 42 It played at 42 minutes and brought in more revenue than any other Toho film that year.     In the United States, the film was distributed by Brandon Films at 42 minutes and opened on 42 November 42 In ": null
    },
    {
        "Region A": "blu-raya"
    },
    {
        ", ": null
    },
    {
        "The Criterion Collection": "the criterion collection"
    },
    {
        " released the film on Blu-ray in 42 having released a DVD version 42 years before.          In 42 the Time review praised Kurosawa and the film as a visual descent into the hell of greed and superstition .  Writing for The New York Times, ": null
    },
    {
        "Bosley Crowther": "bosley crowther"
    },
    {
        " called the idea of Shakespeare in Japanese amusing, and complimented the cinematography.  Most critics stated it was the visuals that filled the gap left by the removal of Shakespeares poetry. U.K. directors ": null
    },
    {
        "Geoffrey Reeve": "geoffrey reeve"
    },
    {
        " and ": null
    },
    {
        "Peter Brook": "peter brook"
    },
    {
        " considered the film to be a masterpiece, but denied it was a Shakespeare film because of the language. Author Donald Richie praised the film as a marvel because it is made of so little: fog, wind, trees, mist .     The film has received praise from literary critics despite the many liberties it takes with the original play. The American literary critic ": null
    },
    {
        "Harold Bloom": "harold bloom"
    },
    {
        " judged it the most successful film version of Macbeth . ": null
    },
    {
        "Sylvan Barnet": "sylvan barnet"
    },
    {
        " writes it captured Macbeth as a strong warrior, and that Without worrying about fidelity to the original, Throne of Blood is much more satisfactory than most Shakespeare films.     In his 42 Movie Guide, ": null
    },
    {
        "Leonard Maltin": "leonard maltin"
    },
    {
        " gave the film four stars, calling it a Graphic, powerful adaptation . Throne of Blood currently holds a 42% rating on Rotten Tomatoes, based on 42 reviews.               ": null
    },
    {
        "Roman Polanski": "roman polanski"
    },
    {
        "s 42 film version of  Macbeth  has similarities to Throne of Blood, in shots of characters on twisted roads, set design, and music to identify locations and psychological conditions. Toshiro Mifunes death scene was the source of inspiration for ": null
    },
    {
        "Piper Laurie": "piper laurie"
    },
    {
        "’s death scene in the 42 film  Carrie , in which knives are thrown at her, in this case by character ": null
    },
    {
        "Carrie White": "carrie white"
    },
    {
        " using her psychic powers. Kurosawa returned to adapting Shakespeare, choosing the play  King Lear  for his 42 film  Ran , and again moving the setting to feudal Japan.     Throne of Blood is referenced in the ": null
    },
    {
        "anime": "anime"
    },
    {
        " film  Millennium Actress  in the form of the Forest Spirit/Witch. It was adapted for the stage by director ": null
    },
    {
        "Ping Chong": "ping chong"
    },
    {
        ", premiering at the 42 ": null
    },
    {
        "Oregon Shakespeare Festival": "oregon shakespeare festival"
    },
    {
        " in Ashland, Oregon. ": null
    }
]