[
    {
        "           Thundarr the Barbarian is an American ": null
    },
    {
        "Saturday morning": "saturday-morning cartoon"
    },
    {
        " animated series": "animated series"
    },
    {
        ", created by ": null
    },
    {
        "Steve Gerber": "steve gerber"
    },
    {
        " and produced by ": null
    },
    {
        "Ruby-Spears Productions": "ruby-spears productions"
    },
    {
        ". The series ran for two seasons on ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        " from October 42 42 to October 42 42 and was rerun on ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " in 42       Thundarr the Barbarian is set in a future ": null
    },
    {
        "post-apocalyptic": "apocalyptic and post-apocalyptic science fiction"
    },
    {
        " wasteland divided into kingdoms or territories — the majority of which are ruled by ": null
    },
    {
        "wizards": "magician"
    },
    {
        " – and whose ": null
    },
    {
        "ruins": "ruins"
    },
    {
        " typically feature recognizable geographical features from the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", such as ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ", ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        ", ": null
    },
    {
        "Las Vegas": "las vegas valley"
    },
    {
        ", ": null
    },
    {
        "Seattle": "seattle"
    },
    {
        ", the ": null
    },
    {
        "Badlands": "badlands"
    },
    {
        ", ": null
    },
    {
        "Mount Rushmore": "mount rushmore"
    },
    {
        ", ": null
    },
    {
        "Alaska": "alaska"
    },
    {
        ", ": null
    },
    {
        "Atlanta": "atlanta"
    },
    {
        ", ": null
    },
    {
        "Boston": "boston"
    },
    {
        ", ": null
    },
    {
        "San Antonio": "san antonio"
    },
    {
        " and its ": null
    },
    {
        "Alamo": "alamo"
    },
    {
        ", ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        ", ": null
    },
    {
        "Washington, D.C.": "washington, d.c."
    },
    {
        ", ": null
    },
    {
        "Cape Canaveral": "cape canaveral"
    },
    {
        ", and the ": null
    },
    {
        "Grand Canyon": "grand canyon"
    },
    {
        ". Other episodes with recognizable settings are set outside the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", include ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        " and ": null
    },
    {
        "London": "london"
    },
    {
        ", ": null
    },
    {
        "U.K.": "u.k."
    },
    {
        ". Another notable feature of this future ": null
    },
    {
        "Earth": "earth"
    },
    {
        " is that the ": null
    },
    {
        "Moon": "moon"
    },
    {
        " was broken in two pieces. The shattered moon and the ruins of the former human civilization were caused by the passage of a runaway planet between the Earth and the Moon in 42 which, from scenes shown in the opening sequence, caused radical changes in the Earths climate and geography. However, by the time period in which the series is set, the Earth and Moon seem to have settled into a new physical balance. Earth is reborn as New Earth , a world of savagery, super-science, and sorcery far more chaotic than Old Earth .     The hero Thundarr , a muscular warrior, whose companions include Princess Ariel, a formidable young sorceress, and Ookla the Mok traveled the world on horseback, battling mostly evil wizards who combine magical spells with reanimating technologies from the pre-catastrophe world. Some of these malevolent wizards enlist the service of certain mutant species in doing their bidding.     Other enemies include The Brotherhood of Night , the ": null
    },
    {
        "cosmic": "cosmos"
    },
    {
        " Stalker from The Stars , and various other mutants. Intelligent humanoid-animal races include the ": null
    },
    {
        "rat": "rat"
    },
    {
        "-like Groundlings, the ": null
    },
    {
        "crocodile": "crocodile"
    },
    {
        "-like Carocs, and talking ": null
    },
    {
        "hawk": "hawk"
    },
    {
        "- and ": null
    },
    {
        "pig": "pig"
    },
    {
        "-like mutants. New animals that existed include ": null
    },
    {
        "fire": "fire"
    },
    {
        "-shooting ": null
    },
    {
        "whale": "whale"
    },
    {
        "s, a giant green ": null
    },
    {
        "snake": "snake"
    },
    {
        " with a ": null
    },
    {
        "grizzly bear": "grizzly bear"
    },
    {
        "s head, and mutated ": null
    },
    {
        "dragonflies": "dragonfly"
    },
    {
        " and ": null
    },
    {
        "rabbit": "rabbit"
    },
    {
        "s.     Thundarrs weapon of choice, the Sunsword, projects a blade-like beam of energy when activated, and can be deactivated so that it is only a ": null
    },
    {
        "hilt": "hilt"
    },
    {
        ". The Sunswords energy blade can deflect other energy attacks as well as magical ones, can cut through nearly anything, and can disrupt magical spells and effects. The Sunsword is magically linked to Thundarr and as such, only he can use it; however, this link can be disrupted. The episode Master of the Stolen Sunsword details events where the Sunsword needs to be recharged, and viewers learn it becomes linked to whoever does the charging.     Comic book writer-artist ": null
    },
    {
        "Jack Kirby": "jack kirby"
    },
    {
        " worked on the production design for the show. The main characters were designed by fellow comic book writer-artist ": null
    },
    {
        "Alex Toth": "alex toth"
    },
    {
        ". Toth, however, was unavailable to continue working on the show, so most of the wizards and other villains and secondary characters that appear on the show were designed by Kirby. He was brought onto the show at the recommendation of comic writer ": null
    },
    {
        "Steve Gerber": "steve gerber"
    },
    {
        " and ": null
    },
    {
        "Mark Evanier": "mark evanier"
    },
    {
        ".      The series was the creation of Steve Gerber. Gerber and friend ": null
    },
    {
        "Martin Pasko": "martin pasko"
    },
    {
        " were having dinner in the Westwood area one night during the time Gerber was developing the series. Gerber commented to Pasko that he had not yet decided upon a name for the ": null
    },
    {
        "wookiee": "wookiee"
    },
    {
        "-like character the network insisted be added to the series, over Gerbers objections. As the two walked past the gate to the UCLA campus, Pasko quipped, Why not call him Oo-clah?  Pasko later became one of several screenwriters also known for their work in comics, such as ": null
    },
    {
        "Roy Thomas": "roy thomas"
    },
    {
        " and ": null
    },
    {
        "Gerry Conway": "gerry conway"
    },
    {
        ", to contribute to the show. After writing several scripts, singly and in collaboration with Gerber, Pasko became a story editor on the second season. Other writers included ": null
    },
    {
        "Buzz Dixon": "buzz dixon"
    },
    {
        " and ": null
    },
    {
        "Mark Jones": "mark jones"
    },
    {
        ".        The series narrator was ": null
    },
    {
        "Dick Tufeld": "dick tufeld"
    },
    {
        ".     Thundarr  – The main protagonist of the series. He is a ": null
    },
    {
        "barbarian": "barbarian"
    },
    {
        " who was once a slave to Sabian until he was freed by Princess Ariel and given the Sunsword which he uses as a weapon in his fight against evil wizards and other villains. Thundarr was known for frequently uttering such pronouncements as Demon dogs! ,  Lords of Light! ,  and the Thundarr war-cry Aaaaahh-ee! .  Thundarr, along with his friend Ookla, are largely unknowledgeable about the world and rely on Ariels guidance, but Thundarr is respectful of knowledge gained. When once asked what kind of man he was, Thundarr simply replied Free!   Ookla the Mok  – Ookla is a member of the Mok species, a ": null
    },
    {
        "leonine": "lion"
    },
    {
        " humanoid": "humanoid"
    },
    {
        " with fangs and yellow eyes. In Thundarr the Barbarians ": null
    },
    {
        "backstory": "backstory"
    },
    {
        ", Ookla and Thundarr were enslaved in the court of the wizard Sabian until Sabians stepdaughter Princess Ariel helped them escape. As a Mok, Ookla has great strength, usually fighting by ripping up a nearby sapling or piece of wreckage to club his enemies. On a few occasions he is shown to use a longbow that fires a type of paralyzing arrow. However, he is also the most likely of the heroes to charge right into an enemy attack or to be enraged by unusual nuisances or threats. Moks dwell in their own territory, ruled by a king; they fear and hate water, preferring to face overwhelming odds in battle rather than wade through a stream to escape. Both Thundarr and Ariel generally understand the howls that make up Ooklas speech, but Thundarr seems to know more about Mok culture than Ariel, perhaps because he and Ookla met and worked together as slaves before either met Ariel. Whereas Thundarr and Ariel ride horses for transportation , Ooklas steed is another quadrupedal species called an equort.   Princess Ariel  – Ariel is a powerful ": null
    },
    {
        "sorceress": "magician"
    },
    {
        ". Not much was revealed about her past before she met Thundarr except that she was the stepdaughter of an evil wizard named Sabian. She learned of Earths history from his library, and thus is considered the academic of the group. Episode 42, Secret of the Black Pearl In the episode Battle of The Barbarians , it is revealed that Thundarr was once a slave of the evil wizard Sabian before being freed by Princess Ariel. It was never revealed exactly where she was a princess. Her most common feats of ": null
    },
    {
        "sorcery": "magic"
    },
    {
        " involved creating light constructs, ranging from throwing exploding spheres to levitating weights to summoning nets, shields, or bridges over chasms. She could also produce powerful energy blasts, blinding light and magically reanimate machines. When her wrists are bound together, she cannot work her magic, and is vulnerable to capture. At times she shows romantic feelings towards Thundarr; although he never outwardly returns them, it is clear that he does care greatly for her. Ariels attire consists of knee-high boots, wrist bracelets, and an open-backed, leg-baring cyan costume which resembles a bathing suit.       The series voice director was Alan Dinehart.     ": null
    },
    {
        "Henry Corden": "henry corden"
    },
    {
        " – In addition to Ookla the Mok, Corden voiced: Caroc Leader, Gemini, Vortak, Skullus, Captain Willows , Mutant Deputy 42   ": null
    },
    {
        "Michael Ansara": "michael ansara"
    },
    {
        " – Vashtarr   Marlene Aragon – Maya   Liz Aubrey – Valorie Storm   ": null
    },
    {
        "Michael Bell": "michael bell"
    },
    {
        " – Yondo   Alan Dinehart   Al Fann   ": null
    },
    {
        "Joe Higgins": "joe higgins"
    },
    {
        " – Korb   ": null
    },
    {
        "Stacy Keach Sr.": "stacy keach sr."
    },
    {
        " Keye Luke": "keye luke"
    },
    {
        " – Zevon, Kublai   ": null
    },
    {
        "Chuck McCann": "chuck mccann"
    },
    {
        " – Artemus, Mutant Deputy 42   ": null
    },
    {
        "Nancy McKeon": "nancy mckeon"
    },
    {
        " – Tye   ": null
    },
    {
        "Julie McWhirter": "julie mcwhirter"
    },
    {
        " – Stryia   ": null
    },
    {
        "Shepard Menken": "shepard menken"
    },
    {
        " Alan Oppenheimer": "alan oppenheimer"
    },
    {
        " – Mindok, Morag   ": null
    },
    {
        "Avery Schreiber": "avery schreiber"
    },
    {
        " – Octagon   ": null
    },
    {
        "Hal Smith": "hal smith"
    },
    {
        " – Simius   ": null
    },
    {
        "Joan Van Ark": "joan van ark"
    },
    {
        " – Cinda   ": null
    },
    {
        "Janet Waldo": "janet waldo"
    },
    {
        " – Cerci   ": null
    },
    {
        "William Woodson": "william woodson"
    },
    {
        " – Crom       Twenty-one half-hour episodes were produced by ": null
    },
    {
        "Ruby-Spears Productions": "ruby-spears productions"
    },
    {
        ", an animation house formed by former ": null
    },
    {
        "Hanna-Barbera": "hanna-barbera"
    },
    {
        " head writers ": null
    },
    {
        "Joe Ruby": "joe ruby"
    },
    {
        " and ": null
    },
    {
        "Ken Spears": "ken spears"
    },
    {
        ",  from October 42 to September 42 on the ": null
    },
    {
        "ABC network": "american broadcasting company"
    },
    {
        ". Despite decent ratings, the show was cancelled, possibly due to the violent content  , but ultimately because Paramount wanted to make room in the programming schedule for  Laverne & Shirley in the Army .  Reruns of Thundarr appeared on ": null
    },
    {
        "NBC": "nbc"
    },
    {
        "s Saturday morning lineup in 42           All episodes of season 42 were directed by Rudy Larriva and produced by Jerry Eisenberg.            All episodes of season 42 were directed by Rudy Larriva and John Kimball, with animation supervision by Milt Gray & Bill Reed.            The debut episode of Thundarr the Barbarian was released on DVD as part of ": null
    },
    {
        "Warner Home Video": "warner home video"
    },
    {
        "s Saturday Morning Cartoons: 42s compilation series. The DVD set, containing episodes of ten other shows, was released on May 42 42      On September 42 42 ": null
    },
    {
        "Warner Archive": "warner archive collection"
    },
    {
        " released Thundarr the Barbarian: The Complete Series to DVD in region 42  as part of their ": null
    },
    {
        "Hanna–Barbera Classics Collection": "hanna–barbera classics collection"
    },
    {
        ". This is a Manufacture-on-Demand release, available exclusively through Warners online store and Amazon.com.  The DVD set is branded as part of the Hanna-Barbera Classics Collection Shostak, Stu .  . Stus Show. Retrieved 424242 as Thundarr and the other 42–42 Ruby-Spears programs were sold to ": null
    },
    {
        "Turner Broadcasting": "turner broadcasting system"
    },
    {
        " in 42 alongside ": null
    },
    {
        "Hanna-Barbera": "hanna-barbera"
    },
    {
        " by ": null
    },
    {
        "Great American Broadcasting": "taft broadcasting"
    },
    {
        ".       Action figures of the three main characters were released by ": null
    },
    {
        "Toynami": "toynami"
    },
    {
        " in 42        In a November 42 interview with  Revolver , ": null
    },
    {
        "Morbid Angel": "morbid angel"
    },
    {
        " guitarist Trey Azagthoth stated that the bands new album,  Kingdoms Disdained , is based on Thundarr the Barbarian,      There is also a band from ": null
    },
    {
        "New York": "new york"
    },
    {
        " called  Ookla the Mok .     The series was referenced and was involved in the plot of the episode ": null
    },
    {
        "One Watson, One Holmes": "list of elementary episodesseason 3"
    },
    {
        " of the CBS TV show  Elementary ": null
    }
]