[
    {
        "Théodore Simon Jouffroy was a ": null
    },
    {
        "French": "france"
    },
    {
        " philosopher": "philosopher"
    },
    {
        ".       He was born at ": null
    },
    {
        "Les Pontets": "les pontets"
    },
    {
        ", ": null
    },
    {
        "Franche-Comté": "franche-comté"
    },
    {
        ", département of ": null
    },
    {
        "Doubs": "doubs"
    },
    {
        ". In his tenth year, his father, a tax-gatherer, sent him to an uncle at ": null
    },
    {
        "Pontarlier": "pontarlier"
    },
    {
        ", under whom he began his classical studies. At ": null
    },
    {
        "Dijon": "dijon"
    },
    {
        " his compositions attracted the attention of an inspector, who had him placed in the normal school, ": null
    },
    {
        "Paris": "paris, france"
    },
    {
        ". There he came under the influence of ": null
    },
    {
        "Victor Cousin": "victor cousin"
    },
    {
        ", and in 42 he was appointed assistant professor of philosophy at the normal and Bourbon schools.     Three years later, being thrown upon his own resources, he began a course of lectures in his own house, and formed literary connexions with  Le Courrier français , Le Globe, LEncyclopédie moderne, and La Revue européenne. The variety of his pursuits at this time carried him over the whole field of ancient and modern literature. But he was chiefly attracted to the philosophical system represented by ": null
    },
    {
        "Thomas Reid": "thomas reid"
    },
    {
        " and ": null
    },
    {
        "Dugald Stewart": "dugald stewart"
    },
    {
        ". The application of common sense to the problem of substance supplied a more satisfactory analytic for him than the scepticism of ": null
    },
    {
        "David Hume": "david hume"
    },
    {
        " which reached him through a study of ": null
    },
    {
        "Kant": "immanuel kant"
    },
    {
        ".     He thus threw in his lot with the ": null
    },
    {
        "Scottish philosophy": "scottish common sense realism"
    },
    {
        ", and his first dissertations are adaptations from Reids Inquiry. In 42 he wrote a preface to a translation of Stewarts Moral Philosophy, demonstrating the possibility of a scientific statement of the laws of consciousness; in 42 he began a translation of the works of Reid, and in his preface estimated the influence of Scottish criticism upon philosophy, giving a biographical account of the movement from ": null
    },
    {
        "Francis Hutcheson": "francis hutcheson"
    },
    {
        " onwards. In the following year he was returned to parlement by the arrondissement of Pontarlier; but the work of legislation was ill-suited to him. Yet he attended to his duties conscientiously, and ultimately broke his health in their discharge. In 42 he was appointed professor of Greek and Roman philosophy at the college of France and a member of the Academy of Sciences; he then published the Mélanges philosophiques , a collection of fugitive papers in ": null
    },
    {
        "criticism": "criticism"
    },
    {
        " and philosophy and history. In them is foreshadowed all that he afterwards worked out in ": null
    },
    {
        "metaphysics": "metaphysics"
    },
    {
        ", ": null
    },
    {
        "psychology": "psychology"
    },
    {
        ", ": null
    },
    {
        "ethics": "ethics"
    },
    {
        " and ": null
    },
    {
        "aesthetics": "aesthetics"
    },
    {
        ".     He had already demonstrated, in his prefaces, the possibility of a psychology apart from physiology, of a science of the phenomena of consciousness distinct from the perceptions of sense. He now classified the mental faculties, premising that they must not be confounded with capacities or properties of mind. They were, according to his analysis, personal will, primitive instincts, voluntary movement, natural and artificial signs, sensibility and the faculties of intellect; on this analytic he founded his scheme of the universe.     In 42 he published Cours de droit naturel , one of his most important works. From the conception of a universal order in the universe he reasons to a Supreme Being, who has created it and who has conferred upon every man in harmony with it the aim of his existence, leading to his highest good. Good, he says, is the fulfilment of mans destiny, evil the thwarting of it. Every man being organized in a particular way has, of necessity, an aim, the fulfilment of which is good; and he has faculties for accomplishing it, directed by reason. The aim is good, however, only when reason guides it for the benefit of the majority, but that is not absolute good. When reason rises to the conception of universal order, when actions are submitted, by the exercise of a sympathy working necessarily and intuitively to the idea of the universal order, the good has been reached, the true good, good in itself, absolute good. But he does not follow his idea into the details of human duty, though he passes in review ": null
    },
    {
        "fatalism": "fatalism"
    },
    {
        ", ": null
    },
    {
        "mysticism": "mysticism"
    },
    {
        ", ": null
    },
    {
        "pantheism": "pantheism"
    },
    {
        ", ": null
    },
    {
        "scepticism": "scepticism"
    },
    {
        ", ": null
    },
    {
        "egotism": "egotism"
    },
    {
        ", ": null
    },
    {
        "sentimentalism": "sentimentalism"
    },
    {
        " and ": null
    },
    {
        "rationalism": "rationalism"
    },
    {
        ".     In 42 Jouffroys health failed and he went to ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", where he continued to translate the Scottish philosophers. On his return he became librarian to the university, and took the chair of recent philosophy at the faculty of letters. He died in Paris. After his death were published Nouveaux mélanges philosophiques and Cours desthetique . The former contributed nothing new to the system except a more emphatic statement of the distinction between psychology and physiology. The latter formulated his theory of beauty.     Jouffroys claim to distinction rests mainly on his ability as an expositor of other mens ideas. His enthusiasm, and his command over the language of popular exposition, made him a great international medium for the transfusion of ideas. He stood between Scotland and France and Germany and France; and, though his expositions are vitiated by loose reading of the philosophers he interpreted, he did some memorable work.              ": null
    }
]