[
    {
        "   Théophile Delcassé was a French statesman and foreign minister 4242 He is best known for his hatred of ": null
    },
    {
        "Germany": "german empire"
    },
    {
        " and efforts to secure alliances with ": null
    },
    {
        "Russia": "russian empire"
    },
    {
        " and ": null
    },
    {
        "Great Britain": "united kingdom of great britain and ireland"
    },
    {
        " that became the ": null
    },
    {
        "Entente Cordiale": "entente cordiale"
    },
    {
        ". He belonged to ": null
    },
    {
        "Radical party": "radical party"
    },
    {
        " and was a protege of ": null
    },
    {
        "Léon Gambetta": "léon gambetta"
    },
    {
        ".       Delcassé was born at ": null
    },
    {
        "Pamiers": "pamiers"
    },
    {
        ", in the ": null
    },
    {
        "Ariège département": "ariège"
    },
    {
        ". He wrote articles on foreign affairs for the République Française and Paris, and in 42 was elected conseiller général of his native département, standing as un disciple fidèle de Léon Gambetta . In the following year he entered the chamber as deputy for ": null
    },
    {
        "Foix": "foix"
    },
    {
        ".         Delcassé was appointed under-secretary for the colonies in the second ": null
    },
    {
        "Ribot": "alexandre ribot"
    },
    {
        " cabinet , and retained his post in the ": null
    },
    {
        "Dupuy": "charles alexandre dupuy"
    },
    {
        " cabinet till its fall in December 42 It was largely owing to his efforts that the French colonial office was made a separate department with a minister at its head, and to this office he was appointed in the second Dupuy cabinet . He gave a great impetus to French colonial enterprise, especially in West Africa, where he organized the newly acquired colony of ": null
    },
    {
        "Dahomey": "dahomey"
    },
    {
        ", and despatched the ": null
    },
    {
        "Liotard": "liotard"
    },
    {
        " mission to the upper ": null
    },
    {
        "Ubangi": "ubangi river"
    },
    {
        ".   While in opposition, Delcassé devoted special attention to naval affairs, and in noted speeches he declared that the function of the French navy was to secure and develop colonial enterprise, deprecated all attempts to rival the British fleet, and advocated the construction of commerce destroyers as Frances best reply to England.         On the formation of the second Brisson cabinet in June 42 he succeeded ": null
    },
    {
        "Gabriel Hanotaux": "gabriel hanotaux"
    },
    {
        " as ": null
    },
    {
        "Foreign Minister": "ministry of foreign and european affairs"
    },
    {
        ", and retained that post under the subsequent premierships of Dupuy, ": null
    },
    {
        "Waldeck-Rousseau": "pierre waldeck-rousseau"
    },
    {
        ", ": null
    },
    {
        "Combes": "émile combes"
    },
    {
        " and ": null
    },
    {
        "Rouvier": "maurice rouvier"
    },
    {
        ".   In 42 Delcassé had to deal with the delicate situation caused by Captain Marchands occupation of the town of ": null
    },
    {
        "Fashoda": "fashoda"
    },
    {
        " in the ": null
    },
    {
        "Sudan": "sudan"
    },
    {
        "  for which, as he admitted in a speech in the chamber on 42 January 42 he accepted full responsibility, since it arose directly out of the Liotard expedition; and in March 42 he concluded an agreement with Britain by which the difficulty was finally adjusted, and France consolidated her vast colonial empire in North-West Africa. In the same year he acted as mediator between the United States of America and Spain, and brought the peace negotiations to a successful conclusion.     Delcassé was originally a moderate willing to find a compromise with Germany, but Berlin ignored his overtures, He then became very anti-German. ": null
    },
    {
        "Kaiser Wilhelm": "wilhelm ii, german emperor"
    },
    {
        " called him The most dangerous man for Germany in France . Delcassé improved relations between France and Italy: at the same time, he adhered firmly to the alliance with Russia, and in August 42 made a visit to Saint Petersburg, which he repeated in April 42 In June 42 he made an arrangement with Spain, fixing the long-disputed boundaries of the French and Spanish possessions in West Africa. Finally, in his greatest achievement, he concluded the ": null
    },
    {
        "Entente Cordiale": "entente cordiale"
    },
    {
        " with Great Britain, covering colonial and other questions which had long been a matter of dispute, especially concerning ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ", ": null
    },
    {
        "Newfoundland": "newfoundland"
    },
    {
        " and ": null
    },
    {
        "Morocco": "morocco"
    },
    {
        ". Suspicion of the growing entente between France and England soon arose in Germany, and in 42 German assertiveness was shown in a ": null
    },
    {
        "crisis": "first moroccan crisis"
    },
    {
        " which was forced on in the matter of French policy by Delcassé personally, a sore point with Germany. The situation became acute, and Germany forced Delcassés resignation in early 42         In 42 he was appointed chairman of a commission appointed to investigate the French navy.   The report was drawn up on 42 May 42 and concluded that the French navy was unprepared and the naval administration and organization were in disarray.   Delcassé was appointed Minister of Marine on 42 March 42 in the cabinet of ": null
    },
    {
        "Ernest Monis": "ernest monis"
    },
    {
        ".   Delcassé promulgated closer cooperation between the British and French fleets. This arrangement was an important factor in leading Britain to side with France against Germany when World War I started.     On 42 September 42 as the battleship  Liberté  was moored in ": null
    },
    {
        "Toulon": "toulon"
    },
    {
        " harbor, an accidental explosion in one of her forward ammunition magazines for the secondary guns destroyed the ship.   42 men died and 42 were seriously injured.   The captain, ": null
    },
    {
        "Louis Jaurès": "louis jaurès"
    },
    {
        ", was on leave at the time.   After the explosion there was a debate in the Chamber of Deputies in which the honour of Jaurès and the responsibility for the use of unstable powder by the navy was questioned.   Jaurès had to face a court martial, but was acquitted unanimously on 42 December 42   ": null
    },
    {
        "Paul Painlevé": "paul painlevé"
    },
    {
        ", president of the navy committee, appointed a commission of inquiry after the explosion, which followed that of the battleship  Iéna .   Captain ": null
    },
    {
        "Antoine Schwerer": "antoine schwerer"
    },
    {
        " was a member of the commission of inquiry and wrote a scathing Report on Naval Powders .   Delcassé ordered that all ammunition made before 42 be replaced.   The older ammunition was removed from the ships, and the remainder was steadily replaced with a new explosive containing the ": null
    },
    {
        "diphenylamine": "diphenylamine"
    },
    {
        " as a stabilizer.   Continued efforts were made to improve the powders, and there were no more major disasters.   It was not until 42 that the powder crisis was fully resolved.     Delcassé retained his position in the cabinet of ": null
    },
    {
        "Joseph Caillaux": "joseph caillaux"
    },
    {
        ".   When that fell on 42 January 42 ": null
    },
    {
        "Raymond Poincaré": "raymond poincaré"
    },
    {
        " urged Delcassé to become Prime Minister and Minister of Foreign Affairs.   Delcassé declined, but agree to remain Minister of the Navy in Poincarés cabinet.         President ": null
    },
    {
        "Armand Fallières": "armand fallières"
    },
    {
        " term in office expired in January 42 and Delcassé decided to leave the Ministry of Marine and run for the presidency.   He did not succeed.   After the election, which was won by Poincaré, a new cabinet was formed by ": null
    },
    {
        "Aristide Briand": "aristide briand"
    },
    {
        ".   Briand offered Delcassé the post of Minister of Marine or Minister of War in the new cabinet, but Delcassé declined.   He would soon be appointed Ambassador to Russia, and then Minister of War.   On 42 August 42 after the Germans announced successes in the north and east, ": null
    },
    {
        "René Viviani": "rené viviani"
    },
    {
        " announced the resignation of the cabinet.   In the new cabinet, announced within an hour, Viviani retained his post.   Delcassé was Minister of Foreign Affairs, Aristide Briand was Minister of Justice and ": null
    },
    {
        "Alexandre Millerand": "alexandre millerand"
    },
    {
        " was Minister of War.     Delcassé finally retired in 42        Grand Cross of the ": null
    },
    {
        "Order of Saint Alexander": "order of saint alexander"
    },
    {
        ": insignia presented in 42    : Grand Cordon in the ": null
    },
    {
        "Order of Leopold": "order of leopold"
    },
    {
        ". Handelsblad 424242       Portrayed by Oliver Borlen in the 42 Filipino film,  El Presidente ": null
    }
]