[
    {
        "   Théodore Faullain de Banville was a French poet and writer. His work was influential on the ": null
    },
    {
        "Symbolist movement": "symbolist manifesto"
    },
    {
        " in French literature in the late 42th century.       Banville was born in ": null
    },
    {
        "Moulins": "moulins, allier"
    },
    {
        " in ": null
    },
    {
        "Allier": "allier"
    },
    {
        ", ": null
    },
    {
        "Auvergne": "auvergne"
    },
    {
        ", the son of a captain in the French navy. His boyhood, by his own account, was cheerlessly passed at a  lycée  in Paris; he was not harshly treated, but took no part in the amusements of his companions. On leaving school with but slender means of support, he devoted himself to letters, and in 42 published his first volume of verse , which was followed by Les Stalactites in 42 The poems encountered some adverse criticism, but secured for their author the approbation and friendship of ": null
    },
    {
        "Alfred de Vigny": "alfred de vigny"
    },
    {
        " and ": null
    },
    {
        "Jules Janin": "jules janin"
    },
    {
        ".     From then on, Banvilles life was steadily devoted to literary production and criticism. He printed other volumes of verse, among which the Odes funambulesques received unstinted praise from ": null
    },
    {
        "Victor Hugo": "victor hugo"
    },
    {
        ", to whom they were dedicated. Later, several comedies in verse were produced at the ": null
    },
    {
        "Théâtre Français": "théâtre français"
    },
    {
        " and on other stages; and from 42 onwards a stream of prose flowed from his industrious pen, including studies of Parisian manners, sketches of well-known persons, and a series of tales, most of which were republished in his collected works . He also wrote freely for reviews, and acted as dramatic critic for more than one newspaper. Throughout a life spent mainly in Paris, Banvilles genial character and cultivated mind won him the friendship of the chief men of letters of his time.          In 42 he was made a Chevalier de la Légion dhonneur, and was promoted to an Officier de la Légion dhonneur in 42 He died in Paris in 42 at the age of 42 and was buried in ": null
    },
    {
        "Montparnasse Cemetery": "cimetière du montparnasse"
    },
    {
        ".     There is a street named after him in the 42th Arrondissement in Paris. There is also a street named Theodore de Banville in Nice, France.                                              ": null
    }
]