[
    {
        "     Tildonk is a village located in the ": null
    },
    {
        "Belgian": "belgium"
    },
    {
        " province of ": null
    },
    {
        "Flemish Brabant": "flemish brabant"
    },
    {
        " and, since 42 is part of the ": null
    },
    {
        "municipality": "municipality"
    },
    {
        " of ": null
    },
    {
        "Haacht": "haacht"
    },
    {
        ", together with ": null
    },
    {
        "Wespelaar": "wespelaar"
    },
    {
        ", ": null
    },
    {
        "Wakkerzeel": "wakkerzeel"
    },
    {
        " and ": null
    },
    {
        "Kelfs": "kelfs"
    },
    {
        ". It has a total area of 42 km².       Traces of civilization have been found from the period of around 42 BCE between the hamlet Hambos and adjacent Kelfs. Later there was a ": null
    },
    {
        "Gallic": "gaul"
    },
    {
        " settlement at about the same location. The oldest mention of Tildonk occurred in 42 in the family name of Reinerus de Thieldunck.     The name Tildonk is the joining of 42 medieval words: til and donk . During the 42th century the knights van Tildonk, pledged to the ": null
    },
    {
        "Duke of Brabant": "duke of brabant"
    },
    {
        ", lived in two ": null
    },
    {
        "mottes": "motte-and-bailey"
    },
    {
        ": Oudenborg and Nieuwenborg . Tildonk was elevated to the title of ": null
    },
    {
        "count": "count"
    },
    {
        "y in 42 as part of the fiefdom of Charles LArchier. Later it came into the hands of the noble ": null
    },
    {
        "house of Lalaing": "lalaing_familycounts_of_lalaing-thildoncq"
    },
    {
        ". Count Maximilian de Lalaing was the most prominent de Lalaing lord of Tildonk.     Since 42 Tildonk is traversed by the ": null
    },
    {
        "Leuven": "leuven"
    },
    {
        "-": null
    },
    {
        "Rupel": "rupel"
    },
    {
        " canal and, since 42 by the ": null
    },
    {
        "Mechelen": "mechelen"
    },
    {
        "-Leuven railroad line.     In 42 the priest Joannes Cornelius Martinus Lambertz started the ": null
    },
    {
        "Ursulines": "ursulines"
    },
    {
        " convent that later became the mother convent of numerous new institutions spread over 42 continents. The convent was renowned for its international school. The stylish ": null
    },
    {
        "art nouveau": "art nouveau"
    },
    {
        " hall for parties was used as a setting in various films.       The village centre   The ": null
    },
    {
        "lock": "canal lock"
    },
    {
        " and lock house   The farm of de Lalaing   The Our Lady of Comfort Chapel       In 42 the municipality of Tildonk took over the escutcheon of the noble family de Lalaing: an oval escutcheon of gules with 42 united diamonds of silver, placed 42 42 42 and 42 the escutcheon held by two golden griffins looking backwards, topped with a crown of 42 fleurons separated by 42 groups of 42 pearls.       Gordts J., Tilloenk vruger, Tildonk, 42        ": null
    }
]