[
    {
        "           In music, timbre , also known as tone color or tone quality , is the perceived sound quality of a ": null
    },
    {
        "musical note": "musical note"
    },
    {
        ", sound or ": null
    },
    {
        "tone": "musical tone"
    },
    {
        ". Timbre distinguishes different types of sound production, such as choir voices and musical instruments, such as string instruments, wind instruments, and percussion instruments. It also enables listeners to distinguish different instruments in the same category .     In simple terms, timbre is what makes a particular musical sound have a different sound from another. For instance, it is the difference in sound between a guitar and a piano playing the same note at the same volume. Both instruments can sound equally tuned in relation to each other as they play the same note, and while playing at the same amplitude level each instrument will still sound distinctively with its own unique tone color. Experienced musicians are able to distinguish between different instruments of the same type based on their varied timbres, even if those instruments are playing notes at the same fundamental ": null
    },
    {
        "pitch": "pitch"
    },
    {
        " and loudness.     The physical characteristics of sound that determine the perception of timbre include ": null
    },
    {
        "spectrum": "spectrum"
    },
    {
        " and ": null
    },
    {
        "envelope": "envelope"
    },
    {
        ". Singers and instrumental musicians can change the timbre of the music they are singing/playing by using different singing or playing techniques. For example, a violinist can use different bowing styles or play on different parts of the string to obtain different timbres . On electric guitar and electric piano, performers can change the timbre using ": null
    },
    {
        "effects unit": "effects unit"
    },
    {
        "s and ": null
    },
    {
        "graphic equalizer": "graphic equalizer"
    },
    {
        "s.         Tone quality and tone color are synonyms for timbre, as well as the texture attributed to a single instrument . However, the word ": null
    },
    {
        "texture": "musical texture"
    },
    {
        " can also refer to the type of music, such as ": null
    },
    {
        "multiple, interweaving melody lines": "polyphony"
    },
    {
        " versus ": null
    },
    {
        "a singable melody accompanied by subordinate chords": "homophony"
    },
    {
        ". ": null
    },
    {
        "Hermann von Helmholtz": "hermann von helmholtz"
    },
    {
        " used the German Klangfarbe , and ": null
    },
    {
        "John Tyndall": "john tyndall"
    },
    {
        " proposed an English translation, clangtint, but both terms were disapproved of by ": null
    },
    {
        "Alexander Ellis": "alexander john ellis"
    },
    {
        ", who also discredits register and color for their pre-existing English meanings . The sound of a musical instrument may be described with words such as bright, dark, warm, harsh, and other terms. There are also ": null
    },
    {
        "colors of noise": "colors of noise"
    },
    {
        ", such as ": null
    },
    {
        "pink": "pink noise"
    },
    {
        " and ": null
    },
    {
        "white": "white noise"
    },
    {
        ". In visual representations of sound, timbre corresponds to the shape of the image , while loudness corresponds to brightness; pitch corresponds to the y-shift of the spectrogram.       The Acoustical Society of America Acoustical Terminology definition 42 of timbre describes it as that attribute of auditory sensation which enables a listener to judge that two nonidentical sounds, similarly presented and having the same loudness and ": null
    },
    {
        "pitch": "pitch"
    },
    {
        ", are dissimilar , adding, Timbre depends primarily upon the frequency spectrum, although it also depends upon the sound pressure and the temporal characteristics of the sound .       Timbre has been called ...the psychoacousticians multidimensional waste-basket category for everything that cannot be labeled pitch or loudness. .     Many commentators have attempted to decompose timbre into component attributes. For example, J. F. Schouten describes the elusive attributes of timbre as determined by at least five major acoustic parameters , which ": null
    },
    {
        "Robert": "robert erickson"
    },
    {
        "  finds, scaled to the concerns of much contemporary music :     Range between ": null
    },
    {
        "tonal": "tonality"
    },
    {
        " and noiselike character   ": null
    },
    {
        "Spectral envelope": "spectral envelope"
    },
    {
        "   Time envelope": "adsr envelope"
    },
    {
        " in terms of rise, duration, and decay   Changes both of ": null
    },
    {
        "spectral envelope": "spectral envelope"
    },
    {
        " and ": null
    },
    {
        "fundamental frequency": "fundamental frequency"
    },
    {
        "    Prefix": "prefix"
    },
    {
        ", or ": null
    },
    {
        "onset": "onset"
    },
    {
        " of a sound, quite dissimilar to the ensuing lasting vibration     An example of a tonal sound is a musical sound that has a definite pitch, such as pressing a key on a piano; a sound with a noiselike character would be ": null
    },
    {
        "white noise": "white noise"
    },
    {
        ", the sound similar to that produced when a radio is not tuned to a station.      gives a table of subjective experiences and related physical phenomena based on Schoutens five attributes:          See also ": null
    },
    {
        "Psychoacoustic evidence": "psychoacoustic evidence"
    },
    {
        " below.               The richness of a sound or note a musical instrument produces is sometimes described in terms of a sum of a number of distinct ": null
    },
    {
        "frequencies": "frequency"
    },
    {
        ". The lowest frequency is called the  fundamental frequency , and the pitch it produces is used to name the note, but the fundamental frequency is not always the dominant frequency. The dominant frequency is the frequency that is most heard, and it is always a multiple of the fundamental frequency. For example, the dominant frequency for the transverse flute is double the fundamental frequency. Other significant frequencies are called ": null
    },
    {
        "overtone": "overtone"
    },
    {
        "s of the fundamental frequency, which may include ": null
    },
    {
        "harmonic": "harmonic"
    },
    {
        "s and ": null
    },
    {
        "partials": "harmonic series partial"
    },
    {
        ". Harmonics are ": null
    },
    {
        "whole number": "natural number"
    },
    {
        " multiples of the fundamental frequency, such as ×42 ×42 ×42 etc. Partials are other overtones. There are also sometimes ": null
    },
    {
        "subharmonic": "subharmonic"
    },
    {
        "s at whole number divisions of the fundamental frequency. Most instruments produce harmonic sounds, but many instruments produce partials and ": null
    },
    {
        "inharmonic": "inharmonic"
    },
    {
        " tones, such as cymbals and other ": null
    },
    {
        "indefinite-pitched": "percussion instrumentindefinite pitch"
    },
    {
        " instruments.     When the ": null
    },
    {
        "tuning note": "a440"
    },
    {
        " in an ": null
    },
    {
        "orchestra": "orchestra"
    },
    {
        " or ": null
    },
    {
        "concert band": "concert band"
    },
    {
        " is played, the sound is a combination of 42  Hz, 42  Hz, 42  Hz, 42  Hz and so on. Each instrument in the orchestra or concert band produces a different combination of these frequencies, as well as harmonics and overtones. The sound waves of the different frequencies overlap and combine, and the balance of these amplitudes is a major factor in the characteristic sound of each instrument.     ": null
    },
    {
        "William Sethares": "william sethares"
    },
    {
        " wrote that ": null
    },
    {
        "just intonation": "just intonation"
    },
    {
        " and the western ": null
    },
    {
        "equal tempered": "equal temperament"
    },
    {
        " scale": "scale"
    },
    {
        " are related to the harmonic ": null
    },
    {
        "spectra": "spectrum"
    },
    {
        "/timbre of many western instruments in an analogous way that the inharmonic timbre of the ": null
    },
    {
        "Thai": "music of thailand"
    },
    {
        " renat": "renat"
    },
    {
        " is related to the seven-tone near-equal tempered ": null
    },
    {
        "pelog": "pelog"
    },
    {
        " scale in which they are tuned. Similarly, the inharmonic spectra of ": null
    },
    {
        "Bali": "bali"
    },
    {
        "nese metallophones combined with harmonic instruments such as the stringed ": null
    },
    {
        "rebab": "rebab"
    },
    {
        " or the voice, are related to the five-note near-equal tempered ": null
    },
    {
        "slendro": "slendro"
    },
    {
        " scale commonly found in Indonesian ": null
    },
    {
        "gamelan": "gamelan"
    },
    {
        " music .          The timbre of a sound is also greatly affected by the following aspects of its envelope: attack time and characteristics, decay, sustain, release  and ": null
    },
    {
        "transient": "transient"
    },
    {
        "s. Thus these are all common controls on professional ": null
    },
    {
        "synthesizer": "synthesizer"
    },
    {
        "s. For instance, if one takes away the attack from the sound of a piano or trumpet, it becomes more difficult to identify the sound correctly, since the sound of the hammer hitting the strings or the first blast of the players lips on the trumpet mouthpiece are highly characteristic of those instruments. The envelope is the overall amplitude structure of a sound, so called because the sound just fits inside its envelope: what this means should be clear from a time-domain display of almost any interesting sound, zoomed out enough that the entire waveform is visible.       Instrumental timbre played an increasing role in the practice of ": null
    },
    {
        "orchestration": "orchestration"
    },
    {
        " during the eighteenth and nineteenth centuries. ": null
    },
    {
        "Berlioz": "hector berlioz"
    },
    {
        "  and ": null
    },
    {
        "Wagner": "richard wagner"
    },
    {
        "  made significant contributions to its development during the nineteenth century. For example, Wagner’s “Sleep motif” from Act 42 of his opera  Die Walküre , features a descending ": null
    },
    {
        "chromatic scale": "chromatic scale"
    },
    {
        " that passes through a gamut of orchestral timbres. First the woodwind , then the massed sound of strings with the violins carrying the melody, and finally the brass .": null
    },
    {
        "Debussy": "claude debussy"
    },
    {
        ", who composed during the last decades of the nineteenth and the first decades of the twentieth centuries, has been credited with elevating further the role of timbre: To a marked degree the music of Debussy elevates timbre to an unprecedented structural status; already in  Prélude à laprès-midi dun faune  the color of ": null
    },
    {
        "flute": "flute"
    },
    {
        " and ": null
    },
    {
        "harp": "harp"
    },
    {
        " functions referentially .     ": null
    },
    {
        "Mahler": "mahler"
    },
    {
        "’s approach to ": null
    },
    {
        "orchestration": "orchestration"
    },
    {
        " illustrates the increasing role of differentiated timbres in music of the early twentieth century. ": null
    },
    {
        "Norman": "norman del mar"
    },
    {
        "  describes the following passage from the ": null
    },
    {
        "Scherzo": "scherzo"
    },
    {
        " movement of his ": null
    },
    {
        "Sixth Symphony": "symphony no. 6"
    },
    {
        ", as a seven-bar link to the trio consisting of an extension in diminuendo of the repeated As… though now rising in a succession of piled octaves which moreover leap-frog with Cs added to the As. The lower octaves then drop away and only the Cs remain so as to dovetail with the first oboe phrase of the trio. During these bars, Mahler passes the repeated notes through a gamut of instrumental colors, mixed and single: starting with horns and pizzicato strings, progressing through trumpet, clarinet, flute, piccolo and finally, oboe: See also ": null
    },
    {
        "Klangfarbenmelodie": "klangfarbenmelodie"
    },
    {
        ".     In ": null
    },
    {
        "rock music": "rock music"
    },
    {
        " from the late 42s to the 42s, the timbre of specific sounds is important to a song. For example, in ": null
    },
    {
        "heavy metal music": "heavy metal music"
    },
    {
        ", the sonic impact of the heavily amplified, heavily distorted ": null
    },
    {
        "power chord": "power chord"
    },
    {
        " played on electric guitar through very loud guitar amplifiers and rows of ": null
    },
    {
        "speaker cabinet": "speaker enclosures"
    },
    {
        "s is an essential part of the styles musical identity. You could not take the heavily amplified electric guitar part and substitute it with the same notes played on a grand piano or pipe organ.       Often, listeners can identify an instrument, even at different pitches and loudness, in different environments, and with different players. In the case of the ": null
    },
    {
        "clarinet": "clarinet"
    },
    {
        ", acoustic analysis shows waveforms irregular enough to suggest three instruments rather than one. David  suggests that this implies that rtain strong regularities in the acoustic waveform of the above instruments must exist which are invariant with respect to the above variables. However, Robert Erickson argues that there are few regularities and they do not explain our ...powers of recognition and identification. He suggests borrowing the concept of ": null
    },
    {
        "subjective constancy": "subjective constancy"
    },
    {
        " from studies of vision and ": null
    },
    {
        "visual perception": "visual perception"
    },
    {
        " .     Psychoacoustic experiments from the 42s onwards tried to elucidate the nature of timbre. One method involves playing pairs of sounds to listeners, then using a ": null
    },
    {
        "multidimensional scaling": "multidimensional scaling"
    },
    {
        " algorithm to aggregate their dissimilarity judgments into a timbre space. The most consistent outcomes from such experiments are that ": null
    },
    {
        "brightness": "brightnessbrightness of sounds"
    },
    {
        " or spectral energy distribution , and the bite, or rate and synchronicity  and rise time , of the attack are important factors.        The concept of ": null
    },
    {
        "tristimulus": "tristimulus"
    },
    {
        " originates in the world of color, describing the way three primary colors can be mixed together to create a given color. By analogy, the musical tristimulus measures the mixture of ": null
    },
    {
        "harmonic": "harmonic"
    },
    {
        "s in a given sound, grouped into three sections. It is basically a proposal of reducing a huge number of sound partials, that can amount to dozens or hundreds in some cases, down to only three values. The first tristimulus measures the relative weight of the first harmonic; the second tristimulus measures the relative weight of the second, third, and fourth harmonics taken together; and the third tristimulus measures the relative weight of all the remaining harmonics : More evidences, studies and applications would be needed regarding this type of representation, in order to validate it.     : T_42 \\frac   \\qquad T_42 \\frac   \\qquad T_42 \\frac       The term brightness is also used in discussions of sound timbres, in a rough analogy with ": null
    },
    {
        "visual brightness": "visual brightness"
    },
    {
        ". Timbre researchers consider brightness to be one of the perceptually strongest distinctions between sounds, D. Wessel, , Computer Music Journal, 42 , pp. 42–42 and formalize it acoustically as an indication of the amount of high-frequency content in a sound, using a measure such as the ": null
    },
    {
        "spectral centroid": "spectral centroid"
    }
]