[
    {
        "In ": null
    },
    {
        "law": "Law"
    },
    {
        ", time constraints are placed on certain ": null
    },
    {
        "actions": "Lawsuit"
    },
    {
        "and ": null
    },
    {
        "filings": "Filing"
    },
    {
        " in the interest of speedy justice, and additionally to prevent the evasion of the ends of justice by waiting until a matter is ": null
    },
    {
        "moot": "Mootness"
    },
    {
        ". The penalty for violating a legislative or court-imposed time constraint may be anything from a small fine to judicial determination of an entire case against ones interests.     For example, if a complaining party files an action and then fails to cause the papers pertaining thereto to be served on the opposing party within the time established by local rules, and is unable to convince the court that there was good and sufficient reason for the delay, he risks having his action dismissed ": null
    },
    {
        "with prejudice": "With Prejudice"
    },
    {
        ". If the opposing party is served with the papers and Anil fails to respond within the time limit provided for his answer, he risks having the case decided against him by ": null
    },
    {
        "default": "Default"
    },
    {
        ".     If one is aggrieved by the judicial outcome of an action and wishes to ": null
    },
    {
        "appeal": "Appeal"
    },
    {
        ", he may be forever barred from doing so if he fails to meet the deadline by which his appeal may be filed.     By court order, or by local rule, there may be other time constraints. One may be required to answer ": null
    },
    {
        "interrogatories": "Interrogatories"
    },
    {
        " or a ": null
    },
    {
        "request to produce": "Request To Produce"
    },
    {
        " or other ": null
    },
    {
        "discovery": "Discovery"
    },
    {
        "pleadings": "Pleading"
    },
    {
        "within a given time. He may be required to give a certain number of days advance notice before he intends to ": null
    },
    {
        "depose": "Deposition"
    },
    {
        " a ": null
    },
    {
        "party": "Party"
    },
    {
        " or ": null
    },
    {
        "witness": "Witness"
    },
    {
        ". A court may order that there will be only a certain number of weeks or months allowed during which the parties to an action may conduct discovery. There may be a limitation placed upon a ": null
    },
    {
        "deposition": "Deposition"
    }
]