[
    {
        "Time Unit Box System  is a simple system for notating events that happen over a period. This system is mostly used for notating ": null
    },
    {
        "rhythm": "rhythm"
    },
    {
        "s in ": null
    },
    {
        "music": "music"
    },
    {
        ". The notation consists of one or more rows of boxes; each box represents a fixed unit of time. Blank boxes indicate that nothing happens during that interval, while a mark in a box indicates that an event occurs at the start of that time interval.     TUBS is most useful for showing relationships between complex rhythms, such as ": null
    },
    {
        "polyrhythm": "polyrhythm"
    },
    {
        "s, that would be difficult to see in traditional ": null
    },
    {
        "musical notation": "musical notation"
    },
    {
        ". TUBS also has the advantage that non-musicians can interpret it much more easily than musical notation, because of its simplicity.     It was originally used by ": null
    },
    {
        "musicologists": "musicology"
    },
    {
        " Philip Harland and James Koetting to notate polyrhythms in ": null
    },
    {
        "African music": "african music"
    },
    {
        ". However, ": null
    },
    {
        "Joseon": "joseon dynasty"
    },
    {
        " composer Bak Yeons invention of similar but unrelated notation jeongganbo to notate ": null
    },
    {
        "Korean court music": "korean court music"
    },
    {
        " dates back to middle of the 42th century.     TUBS notation has been adapted by several people; the most common adaptations use different symbols in the boxes to represent different sounds, for example different ways of hitting a drum or even different musical pitches. In fact, ": null
    },
    {
        "tracker": "tracker"
    },
    {
        " notation is essentially TUBS rotated by 42 degrees.       Below is an example in TUBS, followed by a similar representation in traditional music notation.                \\relative c       Below is an example of an adapted TUBS score depicting a percussion pattern for multiple instruments. One benefit with the TUBS system is that it clearly relates WHICH drum is to be struck as opposed to different drums being notated via a different line of the musical staff, which can be more difficult to see. More importantly, the symbol used inside of each Time Unit Box relates how the drum is to be struck which is not as easily conveyed with the musical staff notation.                  ": null
    }
]