[
    {
        "The following is timeline of events surrounding the  Toledo War , a mostly bloodless conflict between the ": null
    },
    {
        "State": "u.s. state"
    },
    {
        " of ": null
    },
    {
        "Ohio": "ohio"
    },
    {
        " and the ": null
    },
    {
        "Michigan Territory": "michigan territory"
    },
    {
        " in 4242 over a  ": null
    },
    {
        "disputed": "sovereignty"
    },
    {
        " region along their common border, now known as the Toledo Strip after ": null
    },
    {
        "its major city": "toledo, ohio"
    },
    {
        ".                    42: The ": null
    },
    {
        "Northwest Ordinance": "northwest ordinance"
    },
    {
        ", also known as the Ordinance of 42, established the boundary for possible future states in the ": null
    },
    {
        "Northwest Territory": "northwest territory"
    },
    {
        " as an east-west line drawn through the southerly bend or extreme of Lake Michigan.          42: Congress restated the Ordinance Line of 42 as Ohios northern boundary, in the ": null
    },
    {
        "Enabling Act of 42": "enabling act of 1802"
    },
    {
        ", which allowed Ohio to become a state. Ohio petitions to gain statehood, and the northern boundary is set by the Ohio constitution as the Ordinance Line of 42 with one proviso: If the line intersected ": null
    },
    {
        "Lake Erie": "lake erie"
    },
    {
        " to the east of the mouth of the ": null
    },
    {
        "Maumee River": "maumee river"
    },
    {
        ", then with the assent of Congress of the United States, the northern boundary of this State shall be established by, and extended to a direct line running from the southern extremity of Lake Michigan to the most northerly cape of the Miami Bay. This laid the basis for the ": null
    },
    {
        "Toledo War": "toledo war"
    },
    {
        ".   42: Ohio admitted into the Union with an enabling act authorizing the inhabitants to set up a state government.   42: Congress created the Michigan Territory with the Ordinance Line as Michigans southern boundary.   42: Congress established the ": null
    },
    {
        "Illinois Territory": "illinois territory"
    },
    {
        ".       42: ": null
    },
    {
        "War of 42": "war of 1812"
    },
    {
        " delayed survey of the Ordinance Line.   42: ": null
    },
    {
        "Indiana": "indiana"
    },
    {
        " admitted as a state, with a northern border ten miles north of the Ordinance Line, to allow the state some lakefront. Michigan Territorial Governor ": null
    },
    {
        "Lewis Cass": "lewis cass"
    },
    {
        " renewed request for national survey.   42: ": null
    },
    {
        "Edward Tiffin": "edward tiffin"
    },
    {
        ", ": null
    },
    {
        "Surveyor General": "surveyor general"
    },
    {
        " of the Northwest and former ": null
    },
    {
        "Governor of Ohio": "governor of ohio"
    },
    {
        ", commissioned William Harris to rerun the line. Harris drew a line favoring Ohios claim to the Toledo Strip.   42: The state of ": null
    },
    {
        "Illinois": "illinois"
    },
    {
        " admitted into the Union. The Michigan Territory was enlarged to include ": null
    },
    {
        "Wisconsin": "wisconsin"
    },
    {
        " and part of ": null
    },
    {
        "Minnesota": "minnesota"
    },
    {
        ". Michigan pressed her claim to the southern boundary. At Lewis Cass urging, President ": null
    },
    {
        "James Monroe": "james monroe"
    },
    {
        " ordered a new survey. ": null
    },
    {
        "John A. Fulton": "john a. fulton"
    },
    {
        " plotted the Ordinance Line a few miles south of Toledo.   The situation was now more confused than ever. The Harris Line agreed with the Ohio Constitution, and the Fulton Line agreed with the Northwest Ordinance. The difference between the two was a wedge-shaped strip of land, five miles wide at the Indiana border, eight miles wide at ": null
    },
    {
        "Lake Erie": "lake erie"
    },
    {
        ", and  from west to east, an area of about  and including the mouth of the Maumee river. This was, in effect, a no-mans land between Michigan and Ohio, claimed by both.       42: The ": null
    },
    {
        "Michigan Territorial Council": "michigan territorial council"
    },
    {
        " organized the wedge-shaped area into ": null
    },
    {
        "Port Lawrence Township": "port lawrence township"
    },
    {
        ".   42: The ": null
    },
    {
        "U.S. House Committee on Territories": "u.s. house committee on territories"
    },
    {
        " in the ": null
    },
    {
        "United States House of Representatives": "united states house of representatives"
    },
    {
        " reported that the framers of ": null
    },
    {
        "Northwest Ordinance of 42": "northwest ordinance of 1787"
    },
    {
        " intended to give every state created from the Northwest Territory equal accessibility to the ": null
    },
    {
        "Great Lakes": "great lakes"
    },
    {
        ", thereby supporting Indianas claim to a ": null
    },
    {
        "Lake Michigan": "lake michigan"
    },
    {
        " outlet and Ohios claim to ": null
    },
    {
        "Maumee Bay": "maumee bay"
    },
    {
        ". Congress, however, took no definite action in resolving the dispute.       42: Michigan Territorial Council petitioned Congress for an enabling act which would permit Michigan to call a constitutional convention. Congress refused the request because of the unresolved boundary dispute between Michigan and Ohio. Congress passed a law providing for a third survey of the Ordinance Line to be completed December 42 42 ": null
    },
    {
        "Andrew Talcott": "andrew talcott"
    },
    {
        ", captain of ": null
    },
    {
        "U.S. Army Engineers": "u.s. army engineers"
    },
    {
        " was commissioned to undertake the project, and the actual survey was made by Lieutenants Washington Hood and ": null
    },
    {
        "Robert E. Lee": "robert e. lee"
    },
    {
        ".     Eastern capitalists had invested heavily in ": null
    },
    {
        "Port Lawrence": "port lawrence"
    },
    {
        " real estate mistakenly guessing that the area would enjoy commercial success due to the construction of the ": null
    },
    {
        "Wabash and Erie Canal": "wabash and erie canal"
    },
    {
        " hoping that it would terminate in Toledo instead of Maumee thus keeping their holdings in wealthy and established Ohio.     Michigan capitalists wanted Port Lawrence in their state. Two sizeable railroad projects were being initiated in Michigan and due to terminate in the Toledo area.       May: Congress turned down Michigans petition for statehood.   June: The Talcott survey was reported to Congress. The Talcott Line practically coincided with the Fulton Line, thereby supporting Michigans claims to Toledo.   Late June: Congress enlarged Michigan Territory to encompass ": null
    },
    {
        "Wisconsin": "wisconsin"
    },
    {
        ", ": null
    },
    {
        "Minnesota": "minnesota"
    },
    {
        ", ": null
    },
    {
        "Iowa": "iowa"
    },
    {
        ", and the eastern parts of ": null
    },
    {
        "North": "north dakota"
    },
    {
        " and ": null
    },
    {
        "South Dakota": "south dakota"
    },
    {
        ". Since 42 Wisconsin and part of Minnesota were already considered part of Michigan. Two of Michigans first six counties, including Brown, were in what is now Wisconsin.   July: ": null
    },
    {
        "Stevens T. Mason": "stevens t. mason"
    },
    {
        ", age 42 became Michigans acting Territorial Governor. He called a special session of the ": null
    },
    {
        "Michigan Legislature": "michigan legislature"
    },
    {
        " to expedite Michigans admission into the Union.   November: Mason stressed the importance of retaining the Toledo Strip. He wanted Congress to create the Wisconsin Territory and return Michigan to its natural boundaries. Mason wanted the Michigan legislature to press for statehood after that.           January 42: Acting-Governor Mason signs Enabling Act for Michigan to hold a constitutional convention on the second Monday in May 42       February 42: At the request of Governor ": null
    },
    {
        "Robert Lucas": "robert lucas"
    },
    {
        ", Ohio lawmakers passed a law extending the jurisdiction of their state over the disputed area.   February 42: The Michigan territorial legislature responded. If Ohio would extend its control into the Toledo region, then Michigan would make it a criminal offense to do so. They passed the Pains and Penalties Act which fixed a fine up to $42 and/or up to five years imprisonment at hard labor. Mason appointed Brigadier-General ": null
    },
    {
        "Joseph Brown": "joseph brown"
    },
    {
        " of the Third U.S. Brigade to be ready to strike against any Ohio trespasser.       Ohio passed a resolution confirming its belief in the Harris Line which had given Ohio the Toledo area. The ": null
    },
    {
        "Ohio legislature": "ohio general assembly"
    },
    {
        " provided for a rerunning of the line to settle the controversy once and for all. Three commissioners, ": null
    },
    {
        "Uri Seely": "uri seely"
    },
    {
        ", ": null
    },
    {
        "Jonathan Taylor": "jonathan taylor"
    },
    {
        ", and ": null
    },
    {
        "John Patterson": "john patterson"
    },
    {
        ", were to begin this project by April 42 Lucas called out the Ohio militia to be on hand, if need be, when the three commissioners arrived at ": null
    },
    {
        "Perrysburg": "perrysburg, ohio"
    },
    {
        " on April 42 & mdash;": null
    },
    {
        "April Fools Day": "april fools day"
    },
    {
        ".     Mason was worried. John Thomson Mason, Governor Masons father and former secretary of Michigan Territory, advised his son to be slow to act and let Ohio be the aggressor.     Mason took his advice and wrote General Brown to hold off on any display of force. In reference to Lucas, his three Ohio commissioners and their guard, Mason wrote, Let him get on our soil, arrest him, strike the blood at once, disgrace him and his state, and end the controversy.     However, at the same time Mason wrote the General, he also ordered three additional units of the Michigan ": null
    },
    {
        "militia": "militia"
    },
    {
        " into readiness. Lucas was an enemy and ": null
    },
    {
        "President": "president of the united states"
    },
    {
        " Andrew Jackson": "andrew jackson"
    },
    {
        " showed no sign he had any intention of interfering.     Mason received a letter from ": null
    },
    {
        "U.S. Secretary of State": "u.s. secretary of state"
    },
    {
        " John Forsyth": "john forsyth"
    },
    {
        " that Congress might use its prerogatives over a territory to force a compromise with Ohio if Michigan refused to bend on the Pains and Penalties Act. This so distressed Mason that he asked Jackson to remove him as Governor if neither the President nor his administration could support him in the boundary controversy. Mason thought Michigan was protecting itself against a law of Ohio empowering Ohio commissioners, under the protection of the Ohio Governor, to rerun an Ohio boundary in Michigan Territory. If Michigan could not act, who could?     Governor Lucas has every intention of proceeding with the rerunning of the Harris Line, but he was anxious that it be done peaceably. He encouraged President Jackson to appoint a commission to arbitrate the dispute.     March 42: Mason dispatched Senator ": null
    },
    {
        "John Norvell": "john norvell"
    },
    {
        " to talk with the President. Mason was also upset by some inhabitants in the disputed area who wanted to belong to Ohio because of interest in the Toledo canal. Norvell would press for presidential action.   March 42: President Jackson appointed ": null
    },
    {
        "Benjamin C. Howard": "benjamin c. howard"
    },
    {
        " of Baltimore, and ": null
    },
    {
        "Richard Rush": "richard rush"
    },
    {
        " of Philadelphia to serve on a commission to arbitrate the dispute.   March 42: Lucas and the Ohio line-runners set out for ": null
    },
    {
        "Perrysburg": "perrysburg, ohio"
    },
    {
        ".       April 42: Michigan held elections for township officials in the disputed area.   April 42: Lucas and the Ohio line-runners arrive in Perrysburg.   April 42: Rush and Howard reached Toledo. Both Ohio and Michigan had already created a situation for war.   April 42: Michigan residents proceeded to the polls to elect delegates for the constitutional convention in May.   April 42: Writing from Monroe, Howard indicated that all signs pointed to Governor Lucas’ determination to carry out his designs. He is very firm in his character, he noted. And though doing what nine tenths of the nation will hereafter pronounce wrong, yet will listen to no argument upon the point, because he says that his State has decided upon it and it is his duty to exercise her laws.   April 42: Ohio held elections in the disputed area.   April 42: The Monroe County sheriff and posse moved into Toledo and began arresting violators of the Pains and Penalties Act. The most publicized incident took place in the night. The Monroe contingent, numbering some thirty-five to forty persons, entered into Major Benjamin F. Stickney’s house and drove his two guests, George McKay and N. Goodsell, out of their beds, having first attempted to gouge out McKay’s eyes and having throttled Stickney’s daughter for sounding the alarm. They then carried the two to Monroe; had a mock trial; and released them on bail two days later. The alleged crime being interference with the arrest of Toledoans loyal to Ohio.     :One witness wrote, We are driven from our homes for acting under the authority of Ohio; our houses broken open in the dead of night; citizens taken prisoners, bound hand and foot, and tied to fiery horses, gagged that they may not alarm the rest of the citizens; the females too in the same house are treated with violence by being held and prevented from going to alarm the neighbors; and all this for saying to an individual, he need not obey the laws of Michigan.     :After the assault of April 42 two or three hundred Michigan horsemen, armed with guns and bayonets, moved into the city and dishonored the Ohio flag by dragging it through the streets of Toledo on the tail of a horse. Benjamin F. Stickney wrote, soon after the outrage: There cannot be a doubt that the generous Ohioans will turn out en masse to protect their northern border and restrain the savage barbarity of the hordes of the north.     :Note: Major Stickney was regarded as an ardent Ohio Patriot by the people of Ohio and as an overly verbose hypocrite by the people of Michigan.     :The outbreak of hostilities forced the Ohio officeholders elected on the sixth to make a fast retreat; likewise, the Ohio line-runners, who were unarmed and unprotected.   April 42: Writing again from Monroe, Howard described the situation: Men galloping about - guns getting ready - wagons being filled and hurrying off, and everybody in commotion.   April 42: The Ohio line-runners sized up their precarious situation. One of them wrote from Maumee, “We shall certainly be made prisoners.” They knew Michigan was resolved to enforce its right over Toledo.   Mid-April: Michigan’s determination to enforce the Pains and Penalties Act put Governor Lucas into a fighting position, the rumor was carried to Michigan that any further incursion into the disputed territory would be met by force. Ohio was mustering ten thousand volunteers.   :Rush and Howard reported to the President and to both Governors the measures they considered necessary if Michigan and Ohio were to avoid war.   Ohio was to continue running the Harris Line.   The residents in the disputed area were temporarily to decide whether they wished to belong to Ohio or Michigan. This would be in effect until Congress made a definite decision at its next session.   They suggested that Michigan not enforce the Pains and Penalties Act nor try anyone under its provisions until Congress had a chance to act.   :Mason would not listen. It would make it impossible to carry out his duties as territorial governor. The proposal allowed Lucas to extend jurisdiction over an area the Talcott Line had declared belonged to Michigan. As chief executive it was his obligation to defend the Territory against an aggressor. Force was legitimate within the American tradition. Congress had allowed the territorial government to pass the Pains and Penalties Act. As governor he could not interfere with the courts concerning those already apprehended under the Pains and Penalties Act; that would be “executive usurpation and tyranny.” He was “thwarted by circumstances beyond his control.” He would gladly be a peacemaker, but he was a governor first.   April 42: Lucas stationed forty armed men with the surveying party and gathered a force at Perrysburg.   :Mason directed the Monroe sheriff and his posse to be on hand to arrest trespassers. He also dispatched a letter to former Michigan Governor, Secretary of War, ": null
    },
    {
        "Lewis Cass": "lewis cass"
    },
    {
        ", appealing for federal intervention.   :The undersheriff of ": null
    },
    {
        "Lenawee County": "lenawee county"
    },
    {
        " William McNair, mustered and armed thirty Adrian citizens as a posse to march with him against Lucas’ ten thousand.   :Late afternoon the Ohio surveyor and their guards ran their line to Phillips Corner  and, because of the approaching Sunday, pitched camp for a day.   :A spy sent by undersheriff McNair to discover the location of the line-runners spotted them. McNair was pleased to learn the Ohioans were close, for he had the necessary force to arrest them or to chase them across the border.   April 42: About noon on Sunday the Michigan posse moved in on the surveying party. Thrown into a panic, the line-runners made a quick retreat for the border. A remaining party of nine Ohio guardsmen took shelter in a small ": null
    },
    {
        "log cabin": "log cabin"
    },
    {
        " on Phillip’s property and barricaded themselves inside.   :They were promptly surrounded by the posse and commanded to give themselves up. This they did after much delay. But no sooner had they lined up for arrest than their leader started a stampede for the woods. McNairs men fired a volley over the heads of the escaping Ohioans, wounding none but capturing all. They took the prisoners to the Tecumseh jail. Six entered bail, two were released and one was retained for refusing bail on principle.   :The first shots of the war had been fired at the so-called Battle of Phillips Corner, a term sometimes used to describe the whole of the Toledo War.   April 42: The line-runners arrived in Perrysburg. Despite their rapid nocturnal flight through the southern swamp, they suffered no greater injuries than the ruining of coats and trousers. Lucas moved his forces out of Perrysburg and into the disputed territory.   April 42: Mason pointed out to Secretary of State, John Forsyth, that once Ohioans crossed the Fulton Line, they would be resisted by Michigan. Of course, it is one thing to decide to have a war and quite another to find people to fight it.       May 42: Mason wrote to Howard and Rush indicating his willingness to let Lucas rerun the Harris Line if Ohio would do nothing to extend jurisdiction over the Toledo area once the project was completed. Mason would also deliver to the Ohio courts any individual Lucas requested. He would make these concessions out of regard for public sentiment.   :Lucas refused the peace offer. Secretary of War Cass was infuriated by Lucas unjustifiable exercise of power. Cass asked Mason to temper firmness with moderation. Mason had more to gain by suspending the Pains and Penalties Act than by pressing his right to enforce it. Jackson’s paramount desire was to see the dispute settled amicably, quickly and, if at all possible, by the two governors themselves.   May 42: Quiet returned to the border with the disbanding of the Ohio volunteer army. Monroe, Michigan was full of bustle and much excitement in getting ready for the impending war. The Michigan Sentinel of Monroe reminded citizens mustnt take lightly the prospect of civil war in which brother takes up arms against brother.   Mid-May: The Michigan Constitutional Convention met in ": null
    },
    {
        "Detroit": "detroit"
    },
    {
        ".       June 42: The Secretary of State warned Governor Lucas that if he renewed the running of the line without regard for the feelings of Michigan, he would create a crisis demanding presidential interference.   :Ohios response was unsettling. In a special session of the legislature, the delegates passed a number of laws enforcing the state’s jurisdiction over the Toledo area.   a law provided three to seven years hard labor for anyone guilty of the forcible abduction of citizens of Ohio.   a new county, to be named after the Ohio Governor, was to be formed from the disputed territory with Toledo as the temporary seat of justice.   the legislature appropriated three hundred thousand dollars to implement these statutes and empowered Governor Lucas to borrow three hundred thousand more if he found it necessary.   the lawmakers directed the court of common pleas to hold session there the first Monday in September .   :Lucas appointed a three-man delegation to meet with the President: William Allen, Noah H. Swayne and David T. Disney. Jackson acceded that Michigan discontinue proceedings and prosecutions under the Pains and Penalties Act, that Ohio be given complete freedom to run the Harris Line, and that neither side forcibly oppose the official jurisdiction of the other in the disputed area.   :Mason could not bear the suggestion that Toledo come under the concurrent jurisdiction of Ohio and Michigan. Michigan was fighting the war on the principle that the Ordinance of 42 gave Michigan both complete possession of the disputed area and complete authority to govern it. This authority was derived from Congress.       July 42: Fighting broke out on the border. The deputy sheriff of Monroe County, Joseph Wood, was commissioned to arrest ": null
    },
    {
        "Two Stickney": "two stickney"
    },
    {
        " of Toledo for allegedly having resisted two Michigan officers by force. Two Stickney notified Wood that the day he set foot in Toledo his life would be in danger.   July 42:  The deputy sheriff attempted to carry out his commission. Stickney stabbed him in the left side with a ": null
    },
    {
        "dirk": "dirk"
    },
    {
        ", saying: Damn you, you have got it. Wood was taken to the nearest inn for treatment and subsequently recovered. Meanwhile, fifty to seventy-five leading Toledo citizens, including Goodsell and McKay , gathered to pledge resistance against any further Michigan arrests, as long as they have a drop of blood left.   :Upon being informed of these developments, Mason immediately ordered the Monroe posse of about two hundred men into Toledo to arrest Two Stickney. When the Toledoans sighted the armed force, a large number fled across the Maumee River, some paddling their way to the other side on logs. Once safely out of the posses reach, they gave vent to their anger by firing on the intruders. Fonts of type of the Toledo Gazette were thrown into confusion.   :In the midst of this uproar Two Stickney escaped. The posse arrested three or four Ohio sympathizers, including McKay and Major Stickney. The Major, on the way to the Monroe jail, was forcibly held on a horse by having his legs tied under the animals body.   July 42: Mason asked Lucas to allow extradition to Michigan of Two Stickney, a request the Ohio Governor refused on grounds the stabbing had taken place on Ohio soil. The Two Stickney episode removed the border controversy one step farther from an amicable settlement. The decision of Governor Lucas to hold out on Mason confirmed the Michigan legislature in its support of Mason.   July 42: Secretary of State Forsyth in a letter to Cass regretted that Mason had submitted the controversy to the legislature. The matter could be resolved simply by the Governor himself. David Disney had said that Lucas was willing to abide by Jackson’s recommendations.       August 42: General Brown informed Mason he had it on good authority that Lucas was raising an armed force “of some magnitude” in Toledo to protect the court to be held there the first Monday in September.   August 42: Cass wrote that Forsyth had threatened Masons removal from office if the Presidents recommendations were not followed.   August 42: Mason appeared before the legislative council in defense of his position against Ohio. He could permit the rerunning of the boundary and suspend the Pains and Penalties Act. He could not recognize that Ohio had equal claim to the disputed territory. Especially since Lucas had mustered a force with the avowed purpose of murdering our citizens. The legislature stood firm behind Mason and chided the President.   August 42: The Michigan Democrats nominated Mason for their gubernatorial candidate under the new state constitution.   August 42: Mason ordered up either a force of 42 volunteers or, if that was impossible, the territorial militia.   August 42: President Jackson removed Mason as Michigans acting Governor.       Masons first replacement, Judge ": null
    },
    {
        "Charles Shuler": "charles shuler"
    },
    {
        " of Pennsylvania, refused the assignment. This left the Territory without official leadership during September, although Mason continued to function as governor in all but formal title. Jacksons appointment of ": null
    },
    {
        "John S. Horner": "john s. horner"
    },
    {
        " of Virginia was never fully received by the Michigan citizens. Shortly after Horner’s tenure of office began, the people of Michigan elected Mason as their first Governor. Despite the potential awkwardness, there were no quarrels between Mason and Horner, who was able to work quietly to ease tensions between Ohio and Michigan and then focused his attention on the western portion of the Michigan Territory that was not included in the state. Horner became Secretary of the newly formed ": null
    },
    {
        "Wisconsin Territory": "wisconsin territory"
    },
    {
        " in July 42 leaving Michigan to Masons leadership.     The September incident amounted to the ability of Buckeye brain to outwit Michigan muscle. Michigan was ready to meet the enemy. Consisting of about two hundred fifty farmers and townsfolk, the contingent sported broom handles for weapons and feathers in their hats for military insignia. The march to Toledo took four days.     September 42: The Michigan troops pitched camp at Mullhollens, about eight miles from Toledo. They expected to meet Lucas force the next day. Lucas ordered court to be held before daybreak.   September 42: Lucas ": null
    },
    {
        "adjutant general": "adjutant general"
    },
    {
        ", accompanied by twenty armed men, left Maumee at one o clock in the morning with the judges and court officials. Two hours later, in old schoolhouse, they conducted the business of officially opening court and making the necessary appointments. These brief proceedings were written on bits of paper and then deposited in the clerk’s high bell-shaped hat. The court and its escorts adjourned to a tavern to celebrate. Word came that they had been spotted by the enemy. The group made haste for the Maumee. On the run they discovered that they had been given a false alarm and the clerk had lost the hat. Two guards made their way back in the dark and retrieved the hat. After joining their companions and firing two salvos, the whole company returned to Maumee at six o’clock rejoicing in having deceived Michigan.   :Masons forces arrived hours later on foot, horseback and in boats. No Ohio soldiers were in sight. They stayed on three days and then were ordered back to Monroe for review by the Governor, unaware that Lucas had outwitted them.   :With the disbanding of the Ohio troops, Mason was forced to order his own soldiers back to their farms and villages.   Late Fall: The Territory proceeded to act as if it were a state. Michigan elected Mason as Governor and called the legislature into session. They elected John Norvell and ": null
    },
    {
        "Lucius Lyon": "lucius lyon"
    },
    {
        " as U.S. Senators and ": null
    },
    {
        "Isaac Crary": "isaac crary"
    },
    {
        " as Representative.       Congress refused to seat the three Michigan representatives, granting them only the privilege of observers.       January 42: Norvell and Crary wrote a letter to Mason pointing out that their hopes for rapid admission into the Union had disappeared. They were certain that statehood rested on the resolution of the boundary question in Ohios favor. By the end of January, the admission bill, along with the boundary issue, was locked in the judiciary committee of both Houses of Congress.   March: When the bills were reported out of committee, it was generally acknowledged that to enter the Union Michigan would have to cede the Toledo Strip in exchange for the western two-thirds of the ": null
    },
    {
        "Upper Peninsula": "upper peninsula of michigan"
    },
    {
        ".   June: Congress reviewed the committee reports.   June 42: Congress passed an act admitting Michigan into the Union once it surrendered the Toledo Strip for the Upper Peninsula.   July 42: The Michigan legislature put out a call for delegates to decide whether Michigan would accept or reject the Act of June 42 Governor Mason ordered another survey. The results confirmed the Fulton Line. At the end of September, after four days deliberation, the delegates turned down the congressional proposal by 42 to 42 By the end of October, the second council of assent , had become a reality.   December 42: After two days of debates, the Act of June 42 was submitted.   December 42: President Jackson reported the action to Congress.       January 42: ": null
    },
    {
        "Andrew Jackson": "andrew jackson"
    },
    {
        " signed the Congressional bill officially admitting Michigan as a state in the union 42 years to the day after Mason signed Michigans Enabling Act.       The official survey of the line was finished and the governors shook hands over the border.       February 42:": null
    }
]