[
    {
        "     The timeline of underwater diving technology is a chronological list of notable events in the history of underwater diving.         Ancient ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " and ": null
    },
    {
        "Greek": "ancient greece"
    },
    {
        " era.: There have been many instances of men swimming or diving for combat, but they always had to hold their breath, and had no diving equipment, except sometimes a hollow plant stem used as a ": null
    },
    {
        "snorkel": "snorkel"
    },
    {
        ".   About 42 BC: : During a naval campaign the Greek ": null
    },
    {
        "Scyllis": "scyllis"
    },
    {
        " was taken aboard ship as prisoner by the Persian King ": null
    },
    {
        "Xerxes I": "xerxes i of persia"
    },
    {
        ". When Scyllis learned that Xerxes was to attack a Greek flotilla, he seized a knife and jumped overboard. The Persians could not find him in the water and presumed he had drowned. Scyllis made his way among all the ships in Xerxess fleet, cutting each ship loose from its moorings; he used a hollow reed as snorkel to remain unobserved. Then he swam nine miles to rejoin the Greeks off ": null
    },
    {
        "Cape Artemisium": "cape artemisium"
    },
    {
        ".   The use of ": null
    },
    {
        "diving bell": "diving bell"
    },
    {
        "s was recorded by the Greek philosopher ": null
    },
    {
        "Aristotle": "aristotle"
    },
    {
        " in the 42th century BC: ...they enable the divers to respire equally well by letting down a ": null
    },
    {
        "cauldron": "cauldron"
    },
    {
        ", for this does not fill with water, but retains the air, for it is forced straight down into the water.   42 or earlier: Persian divers were using diving ": null
    },
    {
        "goggles": "goggles"
    },
    {
        " with windows made of the polished outer layer of ": null
    },
    {
        "tortoiseshell": "tortoiseshell material"
    },
    {
        ".   42th century: ": null
    },
    {
        "Konrad Kyeser": "konrad kyeser"
    },
    {
        ", illustrated his manual of military technology  Bellifortis  with a diving suit fitted with a hose to the surface. The drawing is also visible in ": null
    },
    {
        "Ms.Thott.42º": "hans talhofferworks"
    },
    {
        " attributed to ": null
    },
    {
        "Hans Talhoffer": "hans talhoffer"
    },
    {
        ", which reproduces sections of Bellifortis. ": null
    },
    {
        "Leonardo da Vinci": "leonardo da vinci"
    },
    {
        " made the first known mention of air tanks in Italy: he wrote in his Atlantic Codex  that systems were used at that time to artificially breathe under water, but he did not explain them in detail. Some drawings, however, showed different kinds of snorkels and an air tank that presumably should have no external connections. Other drawings showed a complete immersion kit, with a plunger suit which included a sort of mask with a box for air. The project was so detailed that it included a ": null
    },
    {
        "urine": "urine"
    },
    {
        " collector.   42: ": null
    },
    {
        "Guglielmo de Lorena": "guglielmo de lorena"
    },
    {
        " and Francesco de Marchi dived on a Roman vessel in Lake Nemi using a one-man ": null
    },
    {
        "diving bell": "diving bell"
    },
    {
        " invented by Guglielmo.   42: ": null
    },
    {
        "Franz Kessler": "franz kessler"
    },
    {
        " built an improved diving bell.   Around 42: ": null
    },
    {
        "Cornelius Drebbel": "cornelius drebbel"
    },
    {
        " may have made a crude ": null
    },
    {
        "rebreather": "rebreather"
    },
    {
        ": see ": null
    },
    {
        "RebreatherHistory of rebreathers": "rebreatherhistory of rebreathers"
    },
    {
        ".   42: ": null
    },
    {
        "Otto von Guericke": "otto von guericke"
    },
    {
        " built the first air pump.   42:   the chevalier ": null
    },
    {
        "Pierre Rémy de Beauve": "pierre rémy de beauve"
    },
    {
        ", a French aristocrat who served as  garde de la marine  in ": null
    },
    {
        "Brest": "brest, france"
    },
    {
        ", built one of the oldest known ": null
    },
    {
        "diving dresses": "standard diving dress"
    },
    {
        ". De Beauves dress was equipped with a metal helmet and two hoses, one of them ": null
    },
    {
        "air-supplied from the surface": "surface-supplied diving"
    },
    {
        " by a ": null
    },
    {
        "bellows": "bellows"
    },
    {
        " and the other one for evacuation of the exhaled air.   the Englishman ": null
    },
    {
        "John Lethbridge": "john lethbridge"
    },
    {
        ", a wool merchant, invented a diving barrel and successfully salvaged valuables from wrecks.         42: the first diving dress using a compressed-air reservoir was successfully designed and built in 42 by Sieur ": null
    },
    {
        "Fréminet": "fréminet"
    },
    {
        ", a Frenchman from ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". Fréminet conceived an autonomous breathing machine equipped with a helmet, two hoses for inhalation and exhalation, a suite and a reservoir, dragged by and behind the diver, although Fréminet later put it on his back. Fréminet called his invention machine hydrostatergatique and used it successfully for more than ten years in the harbours of ": null
    },
    {
        "Le Havre": "le havre"
    },
    {
        " and ": null
    },
    {
        "Brest": "brest, france"
    },
    {
        ", as stated in the explanatory text of a 42 painting.   42: ": null
    },
    {
        "John Day": "john day"
    },
    {
        " became the first person known to have died in an underwater accident while testing a diving chamber in ": null
    },
    {
        "Plymouth Sound": "plymouth sound"
    },
    {
        ".   42: ": null
    },
    {
        "David Bushnell": "david bushnell"
    },
    {
        " invented the ": null
    },
    {
        "Turtle": "american turtle"
    },
    {
        ", first submarine to attack another ship. It was used in the ": null
    },
    {
        "American Revolution": "american revolution"
    },
    {
        ".   42: ": null
    },
    {
        "Karl Heinrich Klingert": "karl heinrich klingert"
    },
    {
        " designed a full diving dress in 42 This design consisted of a large metal helmet and similarly large metal belt connected by leather jacket and pants.   42: in June F. W. Joachim, employed by Klingert, successfully completed the first practical tests of Klingerts armor. ": null
    },
    {
        "Captain Peter Kreeft": ":de:peter kreeft"
    },
    {
        " of Germany dived several times with his helmet diving equipment to show it to King ": null
    },
    {
        "Gustav IV Adolf of Sweden": "gustav iv adolf of sweden"
    },
    {
        ". ": null
    },
    {
        "Robert Fulton": "robert fulton"
    },
    {
        " built a ": null
    },
    {
        "submarine": "submarine"
    },
    {
        ", the ": null
    },
    {
        "Nautilus": "nautilus"
    },
    {
        " .   42: ": null
    },
    {
        "Johan Patrik Ljungström": "johan patrik ljungström"
    },
    {
        " demonstrated his diving bell built of ": null
    },
    {
        "tinned": "tinned"
    },
    {
        " copper": "copper"
    },
    {
        " with space for a crew of 4242 persons, equipped with ": null
    },
    {
        "compass": "compass"
    },
    {
        " and methods of communication to the surface, successfully diving down to 42 ": null
    },
    {
        "ell": "ell"
    },
    {
        "s with Ljungström and an assistant on board, and wrote a book on the organisation of private underwater diving Protocol, Åmåls Rådhus, 42 February 42 J. Jacobson   42: Captain William H. Taylor demonstrated his submarine dress at the annual ": null
    },
    {
        "American Institute Fair": "american institute fair"
    },
    {
        " at Niblos Garden, New York City. ": null
    },
    {
        "Saint John, New Brunswick": "saint john, new brunswick"
    },
    {
        " patented an oxygen reservoir for divers , a device carried on the divers back containing a quantity of condensed oxygen gas or common atmospheric air proportionate to the depth of water and adequate to the time he is intended to remain below .   W.H.Thornthwaite of ": null
    },
    {
        "Hoxton": "hoxton"
    },
    {
        " in London patented an inflatable lifting jacket for divers.   Around 42: The Frenchman ": null
    },
    {
        "Joseph-Martin Cabirol": "joseph-martin cabirol"
    },
    {
        " settled a company in Paris and starts making ": null
    },
    {
        "standard diving dress": "standard diving dress"
    },
    {
        "es.   ": null
    },
    {
        "Wilhelm Bauer": "wilhelm bauer"
    },
    {
        " started the first of 42 successful dives with his second submarine Seeteufel. The crew of 42 was trained to leave the submerged ship through a diving chamber .   42: ": null
    },
    {
        "Giovanni Luppis": "giovanni luppis"
    },
    {
        ", a retired engineer of the Austro-Hungarian navy, demonstrated a design for a self-propelled ": null
    },
    {
        "torpedo": "torpedo"
    },
    {
        " to emperor ": null
    },
    {
        "Franz Joseph": "franz joseph"
    },
    {
        ". ": null
    },
    {
        "H.L. Hunley": "h.l. hunley"
    },
    {
        " became the first submarine to sink a ship, the USS Housatonic, during the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        ".   42: Minenschiff, the first self-propelled ": null
    },
    {
        "torpedo": "torpedo"
    },
    {
        ", developed by ": null
    },
    {
        "Robert Whitehead": "robert whitehead"
    },
    {
        " , was demonstrated for the imperial naval commission on December 42 ": null
    },
    {
        "Alphonse and Théodore Carmagnolle": "carmagnolle diving suit"
    },
    {
        " of ": null
    },
    {
        "Marseille": "marseille"
    },
    {
        ", France, patented the first properly ": null
    },
    {
        "anthropomorphic": "anthropomorphic"
    },
    {
        " design of ADS . Featuring 42 rolling convolute joints that were never entirely waterproof and a helmet that possessed 42  glass viewing ports, it weighed  and was never put in service.        Sieur  from ": null
    },
    {
        "Brest": "brest, france"
    },
    {
        ", a mechanic in ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        "s Imperial Navy, patented the oldest known ": null
    },
    {
        "oxygen rebreather": "oxygen rebreather"
    },
    {
        ", but there is no evidence of any prototype having been manufactured. This early rebreather design worked with an oxygen reservoir, the oxygen being delivered progressively by the diver himself and circulating in a closed circuit through a ": null
    },
    {
        "sponge": "sponge"
    },
    {
        " soaked in ": null
    },
    {
        "limewater": "limewater"
    },
    {
        ". Touboulic called his invention Ichtioandre .   42: Pierre-Aimable de Saint Simon Sicard  made the first practical oxygen rebreather. It was demonstrated in London in 42   42: Professor T. Schwann designed a rebreather in ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        "; he exhibited it in Paris in 42 It had a big backpack oxygen tank at pressure about 42 ": null
    },
    {
        "bar": "bar"
    },
    {
        ", and two scrubbers containing ": null
    },
    {
        "sponge": "sponge"
    },
    {
        "s soaked in ": null
    },
    {
        "caustic soda": "caustic soda"
    },
    {
        ".   42: An English merchant seaman, ": null
    },
    {
        "Henry Fleuss": "henry fleuss"
    },
    {
        ", developed the first workable self-contained diving rig that used compressed oxygen. This prototype of closed-circuit scuba used rope soaked in ": null
    },
    {
        "caustic potash": "caustic potash"
    },
    {
        " to absorb carbon dioxide so the exhaled gas could be re-breathed.       42: Brizé-Fradin designed a small bell-like helmet connected to a low-pressure backpack air container.   42: Paul Lemaire dAugerville  invented and made a diving apparatus with a copper backpack cylinder, and with a ": null
    },
    {
        "counterlung": "rebreathercounterlungs"
    },
    {
        " to save air, and with an inflatable lifejacket connected. It was used down to 42 or 42 meters for up to an hour in salvage work. He started a successful salvage company.   42: ": null
    },
    {
        "William H. James": "william h. james"
    },
    {
        " designed a self-contained diving suit that had compressed air in an iron container worn around the waist. ": null
    },
    {
        "French Navy": "french navy"
    },
    {
        " was interested, but nothing came of this.   42:   ": null
    },
    {
        "Charles Anthony Deane": "charles anthony deane"
    },
    {
        " and John Deane of ": null
    },
    {
        "Whitstable": "whitstable"
    },
    {
        " in ": null
    },
    {
        "Kent": "kent"
    },
    {
        " in England designed the first air-pumped ": null
    },
    {
        "diving helmet": "diving helmet"
    },
    {
        " for use with a diving suit. It is said that the idea started from a crude emergency rig-up of a ": null
    },
    {
        "fireman": "firefighter"
    },
    {
        "s water-pump and a knight-in-armour helmet used to try to rescue horses from a burning stable. Others say that it was based on earlier work in 42 developing a smoke helmet . However the suit was not attached to the helmet, so a diver could not bend over or invert without risk of flooding the helmet and drowning. Nevertheless, the diving system is used in salvage work, including the successful removal of cannon from the British warship HMS Royal George in 4242 This 42-gun fighting ship sank in 42 feet of water at Spithead anchorage in 42   ": null
    },
    {
        "E.K.Gauzen": "e.k.gauzen"
    },
    {
        ", a Russian naval ": null
    },
    {
        "technician": "technician"
    },
    {
        " of ": null
    },
    {
        "Kronshtadt": "kronshtadt"
    },
    {
        " naval base": "naval base"
    },
    {
        " , offered a diving ": null
    },
    {
        "machine": "machine"
    },
    {
        " . His invention was an air-pumped metallic ": null
    },
    {
        "helmet": "helmet"
    },
    {
        " strapped to a ": null
    },
    {
        "leather": "leather"
    },
    {
        " suit . The bottom of the helmet was open. The helmet is strapped to the leather suit by metallic tape. Gauzens diving suit and its further modifications were used by the Russian ": null
    },
    {
        "Navy": "navy"
    },
    {
        " until 42 The modified ": null
    },
    {
        "diving suit": "diving suit"
    },
    {
        " of the Russian Navy, based on Gauzens ": null
    },
    {
        "invention": "invention"
    },
    {
        ", was known as ": null
    },
    {
        "three-bolt equipment": "three-bolt equipment"
    },
    {
        " . ": null
    },
    {
        "Halley": "edmond halley"
    },
    {
        ", ": null
    },
    {
        "Augustus Siebe": "augustus siebe"
    },
    {
        " developed ": null
    },
    {
        "surface supplied diving": "surface supplied diving"
    },
    {
        " apparatus which became known as ": null
    },
    {
        "standard diving dress": "standard diving dress"
    },
    {
        ". By attaching the Deane brothers helmet to a suit, Augustus Siebe developed the Siebe Closed Dress combination diving helmet and suit, considered the foundation of modern diving dress. This was a significant evolution from previous models of open dress that did not allow a diver to invert. .   42: The Royal Navy uses Siebe closed dress for salvage and blasting work on the Royal George , and subsequently the Royal Engineers standardise on this equipment.   42: The Royal Navy establishes the first diving school.   42: ": null
    },
    {
        "Joseph-Martin Cabirol": "joseph-martin cabirol"
    },
    {
        " patented a new model of standard diving dress, mainly issued from Siebes designs. The suit was made out of rubberized canvas and the helmet, for the first time, includes a hand-controlled tap that the diver used to evacuate his exhaled air. The tap included on its turn a safety valve which prevented water from entering in the helmet. Until 42 diving helmets were equipped with only three circular windows . Cabirols helmet introduced the later well known fourth window, situated in the upper front part of the helmet and allowing the diver to watch above him. Having been presented to the ": null
    },
    {
        "Exposition Universelle in Paris": "exposition universelle"
    },
    {
        " Cabirols diving dress won the silver medal. These original diving dress and helmet are now preserved at the  Conservatoire National des Arts et Métiers  in Paris.        ": null
    },
    {
        "demand regulator": "demand regulator"
    },
    {
        ". On June 42 42 in London, England, a Mr. William Edward Newton filed a patent for a diaphragm-actuated, twin-hose demand valve for divers. However, it is believed that Mr. Newton was merely filing a patent on behalf of Dr. Guillaumet. The illustration of the apparatus in Newtons patent application is identical to that in Guillaumets patent application; furthermore, Mr. Newton was apparently an employee of the British Office for Patents, who applied for patents on behalf of foreign applicants. It is demonstrated in ": null
    },
    {
        "surface-demand": "surface supplied diving"
    },
    {
        " use. During the demonstration, use duration was limited to 42 minutes because the dive was in cold water without a diving suit.   42: in ": null
    },
    {
        "Espalion": "espalion"
    },
    {
        " , mining engineer ": null
    },
    {
        "Benoît Rouquayrol": "benoît rouquayrol"
    },
    {
        " designed a self-contained breathing set with a backpack cylindrical air tank that supplied air through the first demand ": null
    },
    {
        "regulator": "diving regulator"
    },
    {
        " to be commercialized . Rouquayrol calls his invention régulateur , having conceived it to help miners avoid drowning in flooded mines. ": null
    },
    {
        "Benoît Rouquayrol": "benoît rouquayrol"
    },
    {
        " met navy officer ": null
    },
    {
        "Auguste Denayrouze": "auguste denayrouze"
    },
    {
        " for the first time, in Espalion, and on Denayrouzes initiative, they adapted Rouquayrols invention to diving. After having adapted it, they called their recently patented device appareil plongeur Rouquayrol-Denayrouze . The diver still walked on the seabed and did not swim. The air pressure tanks made with the technology of the time could only hold 42 atmospheres, allowing dives of only 42 minutes at no more than ten metres deep; during surface-supplied configuration the tank was also used for ": null
    },
    {
        "bailout": "bailout"
    },
    {
        " in the case of a hose failure. The durations of 42 to 42 hours on a tankful without external supply recorded for the Rouquayrol set in the book  Twenty Thousand Leagues Under the Sea  by ": null
    },
    {
        "Jules Verne": "jules verne"
    },
    {
        ", are wildly exaggerated fiction. ": null
    },
    {
        "Industry": "industry"
    },
    {
        " began to be able to make high-pressure air and ": null
    },
    {
        "gas cylinder": "gas cylinder"
    },
    {
        "s. That prompted a few inventors down the years to design open-circuit compressed air breathing sets, but they were all constant-flow, and the demand ": null
    },
    {
        "regulator": "diving regulator"
    },
    {
        " did not come back until 42        ": null
    },
    {
        "Louis Boutan": "louis boutan"
    },
    {
        " invented the first underwater camera and made the first underwater photographs. La Photographie sous-marine et les progrès de la photographie , the first book about underwater photography. ": null
    },
    {
        "coal miner": "coal miner"
    },
    {
        "s working in ": null
    },
    {
        "mine shaft": "shaft mining"
    },
    {
        "s air-pressurized to keep water out.   42: Bauer published outcomes of 42 paralyzed ": null
    },
    {
        "caisson": "caisson"
    },
    {
        " workers. ": null
    },
    {
        "friction": "friction"
    },
    {
        " on compression; or organ ": null
    },
    {
        "congestion": "wiktionary:congestion"
    },
    {
        " and vascular stasis caused by decompression.   42: The ": null
    },
    {
        "St Louis": "st louis"
    },
    {
        " Eads Bridge": "eads bridge"
    },
    {
        " employed 42 compressed air workers including Dr. Alphonse Jaminet as the physician in charge. There were 42 seriously injured and 42 fatalities. Dr. Jaminet himself suffered a case of decompression sickness when he ascended to the surface in four minutes after spending almost three hours at a depth of 42 feet in a ": null
    },
    {
        "caisson": "caisson"
    },
    {
        ", and his description of his own experience was the first such recorded.   42: The similarity between decompression sickness and ": null
    },
    {
        "iatrogenic": "iatrogenic"
    },
    {
        " air embolism as well as the relationship between inadequate decompression and decompression sickness were noted by Friedburg. He suggested that intravascular gas was released by rapid decompression and recommended: slow compression and decompression; four-hour working shifts; limit to maximum depth 42 ": null
    },
    {
        "psig": "pounds per square inch"
    },
    {
        " ; using only healthy workers; and recompression treatment for severe cases.   42: Dr. Andrew Smith first used the term caisson disease to describe 42 cases of decompression sickness as the physician in charge during construction of the ": null
    },
    {
        "Brooklyn Bridge": "brooklyn bridge"
    },
    {
        ". The project employed 42 compressed air workers. Recompression treatment was not used. The project chief engineer ": null
    },
    {
        "Washington Roebling": "washington roebling"
    },
    {
        " suffered from caisson disease.  Washingtons wife, Emily, helped manage the construction of the bridge after his sickness confined him to his home in ": null
    },
    {
        "Brooklyn": "brooklyn"
    },
    {
        ". He battled the after-effects of the disease for the rest of his life. During this project, decompression sickness became known as The Bends because afflicted individuals characteristically arched their backs: this is possibly reminiscent of a then fashionable womens dance maneuver known as the ": null
    },
    {
        "Grecian Bend": "grecian bend"
    },
    {
        ". ": null
    },
    {
        "Paul Bert": "paul bert"
    },
    {
        " published La Pression barométrique, providing the first systematic understanding of the causes of DCS.       42: ": null
    },
    {
        "John P. Holland": "john p. holland"
    },
    {
        " built the first ": null
    },
    {
        "submarine": "submarine"
    },
    {
        " to be formally commissioned by the U.S. Navy, Holland .   ": null
    },
    {
        "Leonard Hill": "leonard erskine hill"
    },
    {
        " used a frog model to prove that decompression causes bubbles and that recompression resolves them.   42: ": null
    },
    {
        "Siebe Gorman": "siebe gorman"
    },
    {
        " started to make a submarine ": null
    },
    {
        "escape set": "escape set"
    },
    {
        " in England; in the years afterwards it was improved, and later was called the ": null
    },
    {
        "Davis Escape Set": "davis escape set"
    },
    {
        " or ": null
    },
    {
        "Davis Submerged Escape Apparatus": "davis submerged escape apparatus"
    },
    {
        ".   from 42 to 42: Professor ": null
    },
    {
        "Georges Jaubert": "georges jaubert"
    },
    {
        ", invented Oxylithe, a mixture of ": null
    },
    {
        "peroxides of sodium": "sodium peroxide"
    },
    {
        " and potassium with a small amount of salts of copper or nickel, which produces oxygen in the presence of water.   42:   Several sources, including the 42 ": null
    },
    {
        "US Navy": "united states navy"
    },
    {
        " Dive Manual , state that the MK V Deep Sea Diving Dress was designed by the Bureau of Construction & Repair in 42 but in reality, the 42 Navy Handbook shows British Siebe-Gorman helmets in use. Since the earliest know MK V is dated 42 these sources are probably referring to the earlier MK I, MK II, MK III & MK IV ": null
    },
    {
        "Morse": "morse diving"
    },
    {
        " and ": null
    },
    {
        "Schrader": "august schrader"
    },
    {
        " helmets.   The first rebreather with metering valves to control the supply of oxygen was made. ": null
    },
    {
        "Draeger": "draegerwerk"
    },
    {
        " of ": null
    },
    {
        "Lübeck": "lübeck"
    },
    {
        " made a ": null
    },
    {
        "rebreather": "rebreather"
    },
    {
        " called the U-Boot-Retter. . ": null
    },
    {
        "Arthur Boycott": "arthur boycott"
    },
    {
        ", ": null
    },
    {
        "Guybon Damant": "guybon damant"
    },
    {
        ", and ": null
    },
    {
        "John Haldane": "john scott haldane"
    },
    {
        " published The Prevention of Compressed-Air Illness , detailed studies on the cause and symptoms of decompression sickness, and proposed a table of ": null
    },
    {
        "decompression stop": "decompression stop"
    },
    {
        "s to avoid the effects.   The Admiralty Deep Diving Committee adopted the ": null
    },
    {
        "Haldane tables": "haldanes decompression model"
    },
    {
        " for the Royal Navy, and published ": null
    },
    {
        "Haldanes diving tables": "haldanes decompression model"
    },
    {
        " to the general public.   42: the British ": null
    },
    {
        "Robert Davis": "robert davis"
    },
    {
        " invented his own submarine rescuer rebreather, the ": null
    },
    {
        "Davis Submerged Escape Apparatus": "davis submerged escape apparatus"
    },
    {
        ", for the Royal Navy submarine crews. ": null
    },
    {
        "decompression tables published by Haldane, Boycott and Damant": "haldanes decompression model"
    },
    {
        ". Driven by Chief Gunner George Stillson, the navy set up a program to test tables and staged decompression based on ": null
    },
    {
        "the work of Haldane": "haldanes decompression model"
    },
    {
        ".   ": null
    },
    {
        "Maurice Fernez": "maurice fernez"
    },
    {
        " introduced a simple lightweight underwater breathing apparatus as an alternative to helmet diving suits.    ": null
    },
    {
        "Draeger": "draegerwerk"
    },
    {
        " started the commercialization of his rebreather in both configuration types, mouthpiece and helmet.   42: The US Navy began developing the future MK V, influenced by Schrader and Morse designs.   42: Modern swimfins were invented by the Frenchman ": null
    },
    {
        "Louis de Corlieu": "louis de corlieu"
    },
    {
        ", capitaine de corvette  in the ": null
    },
    {
        "French Navy": "french navy"
    },
    {
        ". In 42 De Corlieu made a practical demonstration of his first ": null
    },
    {
        "prototype": "prototype"
    },
    {
        " for a group of navy officers.   42: The submarine  was salvaged from 42 feet establishing the practical limits for air diving. Three US Navy divers, ": null
    },
    {
        "Frank W. Crilley": "frank w. crilley"
    },
    {
        ", William F. Loughman, and Nielson, reached 42 fsw using the MK V dress.   42:   The basic design of the MK V dress was finalized by including a battery-powered telephone, but several more detail improvements were made over the next two years.   The ": null
    },
    {
        "Draeger": "drägerwerk"
    },
    {
        " model DM 42 became standard equipment of the ": null
    },
    {
        "German Navy": "german navy"
    },
    {
        ". ": null
    },
    {
        "breathing tube": "breathing tube"
    },
    {
        " with mouthpiece, and a ducks beak exhalent valve in the regulator. It was described in a ": null
    },
    {
        "mine rescue": "mine rescue"
    },
    {
        " handbook in 42 They were successors to Ludwig von Bremen of ": null
    },
    {
        "Kiel": "kiel"
    },
    {
        ", who had the licence to make the Rouquayrol-Denayrouze apparatus in Germany.   42:   De Corlieu left the French Navy to fully devote himself to his invention.   Experimental dives using helium-oxygen mixtures sponsored by the US Navy and Bureau of Mines.   42:   ": null
    },
    {
        "Maurice Fernez": "maurice fernez"
    },
    {
        " introduced a new model of his underwater surface-supplied apparatus at the ": null
    },
    {
        "Grand Palais": "grand palais"
    },
    {
        ". ": null
    },
    {
        "Yves le Prieur": "yves le prieur"
    },
    {
        ", an assistant at the exhibition, decided to meet Fernez in person and asked him to transform the equipment into a manually-controlled constant flow ": null
    },
    {
        "self-contained underwater breathing apparatus": "scuba set"
    },
    {
        ".   Due to post World War I cutbacks, the US Navy found it had only 42 divers qualified to dive deeper than 42 feet when salvaging the submarine S42   42:   ": null
    },
    {
        "Fernez-Le Prieur": "maurice fernez"
    },
    {
        " self-contained underwater breathing apparatus was demonstrated to the public in Paris, and adopted by the French Navy.  ": null
    },
    {
        "C.B. Swede Momsen": "swede momsen"
    },
    {
        ", a submariner and diver, developed and tested the submarine escape apparatus named the ": null
    },
    {
        "Momsen Lung": "momsen lung"
    },
    {
        ".   The 42s:   In France, ": null
    },
    {
        "Guy Gilpatric": "guy gilpatric"
    },
    {
        " started swim diving with waterproof goggles, derived from the swimming goggles which were invented by ": null
    },
    {
        "Maurice Fernez": "maurice fernez"
    },
    {
        " in 42 ": null
    },
    {
        "spearfishing": "spearfishing"
    },
    {
        " became common in the ": null
    },
    {
        "Mediterranean": "mediterranean"
    },
    {
        ", and spearfishers gradually developed the ": null
    },
    {
        "diving mask": "diving mask"
    },
    {
        ", fins and snorkel, with ": null
    },
    {
        "Georges Beuchat": "georges beuchat"
    },
    {
        " in Marseille, France, who created the ": null
    },
    {
        "speargun": "speargun"
    },
    {
        ". Italian sport spearfishers started using oxygen ": null
    },
    {
        "rebreather": "rebreather"
    },
    {
        "s. This practice came to the attention of the ": null
    },
    {
        "Italian Navy": "italian navy"
    },
    {
        ", which developed its frogman unit ": null
    },
    {
        "Decima Flottiglia MAS": "decima flottiglia mas"
    },
    {
        ". propulseurs de natation et de sauvetage .   In ": null
    },
    {
        "San Diego, California": "san diego, california"
    },
    {
        ", the first sport diving club was started by Glenn Orr, Jack Prodanovich and Ben Stone, called the San Diego Bottom Scratchers. As far as it is known, it did not use breathing sets; its main aim was ": null
    },
    {
        "spearfishing": "spearfishing"
    },
    {
        ".   More is known of ": null
    },
    {
        "Yves Le Prieur": "yves le prieur"
    },
    {
        "s constant-flow open-circuit breathing set. It is said that it could allow a 42-minute stay at 42 meters and 42 minutes at 42 meters. It has one cylinder feeding into a circular ": null
    },
    {
        "fullface mask": "fullface mask"
    },
    {
        ". Its air cylinder was often worn at an angle to get its on/off valve in reach of the divers hand. ": null
    },
    {
        "Beuchat": "beuchat"
    },
    {
        " established a ": null
    },
    {
        "scuba diving": "scuba diving"
    },
    {
        " and ": null
    },
    {
        "spearfishing": "spearfishing"
    },
    {
        " equipment manufacturing company.   In France a sport diving club was started, called the Club des Sous-lEau club of those under the water . It did not use breathing sets as far as is known. Its main aim was ": null
    },
    {
        "spearfishing": "spearfishing"
    },
    {
        ".  ": null
    },
    {
        "Otis Barton": "otis barton"
    },
    {
        " and ": null
    },
    {
        "William Beebe": "william beebe"
    },
    {
        " dived to 42 feet using a ": null
    },
    {
        "bathysphere": "bathysphere"
    },
    {
        ". ": null
    },
    {
        "French Navy": "french navy"
    },
    {
        " adopted the Le Prieur breathing set.   On the ": null
    },
    {
        "French Riviera": "french riviera"
    },
    {
        ", the first known sport scuba diving club Club Des Scaphandres et de la Vie Sous Leau was started by Le Prieur & Jean Painleve. It used Le Prieurs breathing sets.   42: US Navy published its revised diving tables based on the work of O.D. Yarbrough.   42: The American Diving Equipment and Salvage Company developed a heavy bottom-walking-type diving suit with a self-contained mixed-gas helium and oxygen rebreather. ": null
    },
    {
        "flat": "apartment"
    },
    {
        " in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", De Corlieu finally started ": null
    },
    {
        "mass production": "mass production"
    },
    {
        " of his invention in France. The same year he rented a licence to ": null
    },
    {
        "Owen P. Churchill": "owen p. churchill"
    },
    {
        " for mass production in the ": null
    },
    {
        "United States": "united states"
    },
    {
        ". To sell his fins in the USA Owen Churchill changed the French De Corlieus name  to swimfins , which is still the ": null
    },
    {
        "English": "english language"
    },
    {
        " name. Churchill presented his fins to the US Navy, who decided to acquire them for its ": null
    },
    {
        "Underwater Demolition Team": "underwater demolition team"
    },
    {
        " . ": null
    },
    {
        "Hans Hass": "hans hass"
    },
    {
        " and Hermann Stelzner of Drager, in Germany made the M42 rebreather. It was developed from the 42 ": null
    },
    {
        "escape set": "escape set"
    },
    {
        ", a type of rebreather used to exit sunken submarines. The M42 sets were oxygen rebreathers with a 42 bar, 42 liter tank and appeared in many of his ": null
    },
    {
        "movie": "movie"
    },
    {
        "s and books. ": null
    },
    {
        "Decima Flottiglia MAS": "decima flottiglia mas"
    },
    {
        " using oxygen ": null
    },
    {
        "rebreather": "rebreather"
    },
    {
        "s and ": null
    },
    {
        "manned torpedo": "manned torpedo"
    },
    {
        "es, ": null
    },
    {
        "attacked the British fleet in Alexandria harbor": "raid on alexandria"
    },
    {
        ". ": null
    },
    {
        "American": "united states"
    },
    {
        " UDT and ": null
    },
    {
        "British": "united kingdom"
    },
    {
        " COPP ": null
    },
    {
        "frogmen": "frogman"
    },
    {
        "  used the Churchill fins during all prior underwater ": null
    },
    {
        "demining": "demining"
    },
    {
        "s, allowing this way in 42 the ": null
    },
    {
        "Normandy landings": "normandy landings"
    },
    {
        ". During years after ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " had ended, De Corlieu spent time and efforts struggling into ": null
    },
    {
        "civil procedure": "civil procedure"
    },
    {
        "s, demanding others for ": null
    },
    {
        "patent infringement": "patent infringement"
    },
    {
        ".       42: ": null
    },
    {
        "René Commeinhes": "rené commeinhes"
    },
    {
        ", from ": null
    },
    {
        "Alsace": "alsace"
    },
    {
        ", invented a breathing set working with a demand valve and designed to allow ": null
    },
    {
        "firefighter": "firefighter"
    },
    {
        "s to breathe safely in smoke-filled environments. ": null
    },
    {
        "Georges Commeinhes": "georges commeinhes"
    },
    {
        ", son of René, adapted his fathers invention to diving and developed a two-cylinder open-circuit apparatus with ": null
    },
    {
        "demand regulator": "diving regulator"
    },
    {
        ". The regulator was a big rectangular box between the cylinders. Some were made, but ": null
    },
    {
        "WWII": "world war ii"
    },
    {
        " interrupted development. ": null
    },
    {
        "Georges Commeinhes": "georges commeinhes"
    },
    {
        " offered his breathing set to the French Navy, which could not continue developing uses for it because of ": null
    },
    {
        "WWII": "world war ii"
    },
    {
        ". ": null
    },
    {
        "Christian J. Lambertsen": "christian j. lambertsen"
    },
    {
        " of the United States designed a ": null
    },
    {
        "rebreather": "rebreather"
    },
    {
        " Breathing apparatus for the U.S. military.   ": null
    },
    {
        "Émile Gagnan": "émile gagnan"
    },
    {
        ", an engineer employed by the ": null
    },
    {
        "Air Liquide": "air liquide"
    },
    {
        " company, obtained a Rouquayrol-Denayrouze apparatus in Paris. He miniaturized and adapted it to ": null
    },
    {
        "gas generator": "gas generator"
    },
    {
        "s, since ": null
    },
    {
        "the Germans occupy France": "german military administration in occupied france during world war ii"
    },
    {
        " and confiscated the French fuel for war purposes. Gagnans boss and owner of the Air Liquide company, ": null
    },
    {
        "Henri Melchior": "henri melchior"
    },
    {
        ", decided to introduce Gagnan to ": null
    },
    {
        "Jacques-Yves Cousteau": "jacques-yves cousteau"
    },
    {
        ", his ": null
    },
    {
        "son-in-law": "son-in-law"
    },
    {
        ", because he knows that Cousteau is looking for an efficient and automatic demand regulator. They met in Paris in December 42 and adapted Gagnans regulator to a diving cylinder.   42: after fixing some technical problems, Cousteau and Gagnan patented the first modern demand regulator. ": null
    },
    {
        "Frédéric Dumas": "frédéric dumas"
    },
    {
        " and ": null
    },
    {
        "Taillez": "taillez"
    },
    {
        ". They use them to shoot the film Épaves , the first underwater film shot using scuba sets.   In July Commeinhes reached 42 metres using his GC42 breathing set off the coast of Marseille.   In October, and not knowing about Commeinhess exploit, Dumas dived with a Cousteau-Gagnan prototype and reached 42 metres off ": null
    },
    {
        "Les Goudes": "les goudes"
    },
    {
        ", not far from Marseille. He experienced what is now called ": null
    },
    {
        "nitrogen narcosis": "nitrogen narcosis"
    },
    {
        ".   42: Commeinhes died in the liberation of ": null
    },
    {
        "Strasbourg": "strasbourg"
    },
    {
        " in ": null
    },
    {
        "Alsace": "alsace"
    },
    {
        ".  His invention was overtaken by Cousteaus invention.    Various nations use ": null
    },
    {
        "frogmen": "frogmen"
    },
    {
        " equipped with ": null
    },
    {
        "rebreather": "rebreather"
    },
    {
        "s for war actions: see ": null
    },
    {
        "Human torpedo": "human torpedo"
    },
    {
        ". ": null
    },
    {
        "Hans Hass": "hans hass"
    },
    {
        " later said that during ": null
    },
    {
        "WWII": "world war ii"
    },
    {
        " the German diving gear firm ": null
    },
    {
        "Dräger": "drägerwerk"
    },
    {
        " offered him an open-circuit ": null
    },
    {
        "scuba set": "scuba set"
    },
    {
        " with a ": null
    },
    {
        "demand regulator": "demand regulator"
    },
    {
        ". It may have been a separate invention, or it may have been copied from a captured Commeinhes-type set. ": null
    },
    {
        "tank": "tank"
    },
    {
        "s, asked the company ": null
    },
    {
        "Mine Safety Appliances": "mine safety appliances"
    },
    {
        " for a suitable small escape breathing set. MSA provided a small ": null
    },
    {
        "open-circuit": "open-circuit scuba"
    },
    {
        " breathing set with a small air cylinder, a circular ": null
    },
    {
        "demand regulator": "demand regulator"
    },
    {
        " with a two-lever system similar to Cousteaus design , and one corrugated wide ": null
    },
    {
        "breathing tube": "breathing tube"
    },
    {
        " connected to a mouthpiece. This set was stated to be made from off-the-shelf items, which shows that MSA already had that regulator design; also, that regulator looks like the result of development and not a ": null
    },
    {
        "prototype": "prototype"
    },
    {
        "; it may have arisen around 42 In an example recovered in 42 from a submerged ": null
    },
    {
        "Sherman tank": "sherman tank"
    },
    {
        " in the ": null
    },
    {
        "Bay of Naples": "bay of naples"
    },
    {
        ", the cylinder was bound round in tape and tied to a ": null
    },
    {
        "lifejacket": "lifejacket"
    },
    {
        ". These sets were too late for the ": null
    },
    {
        "D-day": "d-day"
    },
    {
        " landings in June 42 but were used in the invasion of the south of France and in the ": null
    },
    {
        "Pacific war": "pacific war"
    },
    {
        ". ": null
    },
    {
        "artillery": "artillery"
    },
    {
        " shell in an ": null
    },
    {
        "Allied": "allies of world war ii"
    },
    {
        " landing on the ": null
    },
    {
        "French Riviera": "french riviera"
    },
    {
        ": that leaves two. ": null
    },
    {
        "frogmen": "frogmen"
    },
    {
        ". ": null
    },
    {
        "Toulon": "toulon"
    },
    {
        ", Cousteau showed the film Épaves to the Admiral ": null
    },
    {
        "Lemonnier": "andré lemonnier"
    },
    {
        ". The Admiral then made Cousteau responsible for the creation of the underwater research unit of the French Navy . GRS first mission was to clear of mines the French coasts and harbours. While creating the GRS, Cousteau only had at his disposal the two remaining Aqua-Lung prototypes made by lAir Liquide in 42   42:   Air Liquide created ": null
    },
    {
        "La Spirotechnique": "aqua lung/la spirotechnique"
    },
    {
        " and started to sell Cousteau-Gagnan sets under the names of scaphandre Cousteau-Gagnan , CG42 or ": null
    },
    {
        "Aqua-Lung": "aqua-lung"
    },
    {
        ", the latter for commercialization in English-speaking countries. This word is correctly a ": null
    },
    {
        "tradename": "tradename"
    },
    {
        " that goes with the Cousteau-Gagnan patent, but in Britain it has been commonly used as a ": null
    },
    {
        "generic": "genericized trademark"
    },
    {
        " and spelt aqualung since at least the 42s, including in the ": null
    },
    {
        "BSAC": "british sub-aqua club"
    },
    {
        "s publications and training manuals, and describing scuba diving as aqualunging . ": null
    },
    {
        "Henri Broussard": "henri broussard"
    },
    {
        " founded the first post-": null
    },
    {
        "WWII": "world war ii"
    },
    {
        " scuba diving club, the ": null
    },
    {
        "Club Alpin Sous-Marin": "club alpin sous-marin"
    },
    {
        ". Broussard was one of the first men who Cousteau trained in the GRS.   ": null
    },
    {
        "Yves Le Prieur": "yves le prieur"
    },
    {
        " invented a new version of his breathing set. Its fullface masks front plate was loose in its seating and acted as a very big, and therefore, very sensitive diaphragm for a demand regulator: see ": null
    },
    {
        "Diving regulatorDemand valve": "diving regulatordemand valve"
    },
    {
        ". ": null
    },
    {
        "Aberdeen": "aberdeen"
    },
    {
        " by Ivor Howitt  and some friends. They called underwater diving ": null
    },
    {
        "fathom": "fathom"
    },
    {
        "eering , to distinguish from ": null
    },
    {
        "jumping into water": "diving"
    },
    {
        ". ": null
    },
    {
        "Cave Diving Group": "cave diving group"
    },
    {
        " is formed in Britain. ": null
    },
    {
        "Maurice Fargues": "maurice fargues"
    },
    {
        " became the first diver to die using an aqualung while attempting a new depth record with Cousteaus Undersea Research Group near ": null
    },
    {
        "Toulon": "toulon"
    },
    {
        ".   42:   ": null
    },
    {
        "Auguste Piccard": "auguste piccard"
    },
    {
        " sent the first ": null
    },
    {
        "bathyscaphe": "bathyscaphe"
    },
    {
        ", FNRS42, on unmanned dives. ": null
    },
    {
        "Siebe Gorman": "siebe gorman"
    },
    {
        " and/or ": null
    },
    {
        "Heinke": "heinke"
    },
    {
        " started making ": null
    },
    {
        "Cousteau": "jacques-yves cousteau"
    },
    {
        "-type aqualungs in England. Siebe Gorman made those first patented aqualungs at ": null
    },
    {
        "Chessington": "chessington"
    },
    {
        " from 42 to 42 popularly known as tadpole sets. Siebe Gorman and the Royal Navy expected aqualungs to be used with weighted boots for bottom-walking for light commercial diving: see ": null
    },
    {
        "Aqua-lung Tadpoles ": "aqua-lung  tadpoles"
    },
    {
        ". ": null
    },
    {
        "Ted Eldred": "ted eldred"
    },
    {
        " in Australia started developing the first ": null
    },
    {
        "open-circuit": "open-circuit scuba"
    },
    {
        " single-hose": "single-hose"
    },
    {
        " scuba set known: see ": null
    },
    {
        "Porpoise ": "porpoise"
    },
    {
        ". ": null
    },
    {
        "Georges Beuchat": "georges beuchat"
    },
    {
        " in France created the first surface buoy. ": null
    },
    {
        "Renes Sporting Goods": "renes sporting goods"
    },
    {
        " shop in ": null
    },
    {
        "California": "california"
    },
    {
        " imported aqualungs from France. Two graduate students, Andy Rechnitzer and Bob Dill obtained a set and began to use it for underwater research. ": null
    },
    {
        "Hollywood": "hollywood"
    },
    {
        " noticed Aqualungs and was interested. ": null
    },
    {
        "Otis Barton": "otis barton"
    },
    {
        " made a record dive to 42 feet in the ": null
    },
    {
        "Benthoscope": "benthoscope"
    },
    {
        ".   ": null
    },
    {
        "Georges Beuchat": "georges beuchat"
    },
    {
        ", ": null
    },
    {
        "The Frogmen": "the frogmen"
    },
    {
        " was released. It was set in the Pacific Ocean in ": null
    },
    {
        "WWII": "world war ii"
    },
    {
        ". In its last 42 minutes, it shows USA ": null
    },
    {
        "frogmen": "frogmanerrors about frogmen found in public media"
    },
    {
        ", using bulky 42-cylindered aqualungs on a combat mission. This equipment use is ": null
    },
    {
        "anachronistic": "anachronistic"
    },
    {
        " , but it shows that aqualungs were available in the US in 42 ": null
    },
    {
        "US Navy": "us navy"
    },
    {
        " started to develop ": null
    },
    {
        "wetsuit": "wetsuit"
    },
    {
        "s, but not known to the public.   In December 42 the first issue of Skin Diver Magazine appeared. The magazine ran until November 42 ": null
    },
    {
        "Cousteau": "jacques-yves cousteau"
    },
    {
        "-type aqualungs went on sale in Canada. ": null
    },
    {
        "UC Berkeley": "university of california, berkeley"
    },
    {
        " and subsequent ": null
    },
    {
        "UC San Diego": "uc san diego"
    },
    {
        " Scripps Institution of Oceanography": "scripps institution of oceanography"
    },
    {
        " physicist": "physicist"
    },
    {
        " Hugh Bradner": "hugh bradner"
    },
    {
        ", invented the modern wetsuit.   ": null
    },
    {
        "Cousteau": "jacques-yves cousteau"
    },
    {
        "-type aqualungs went on sale in the USA. ": null
    },
    {
        "Ted Eldred": "ted eldred"
    },
    {
        " in Melbourne, Australia started making for public sale the ": null
    },
    {
        "Porpoise ": "porpoise"
    },
    {
        ". This was the worlds first commercially available single-hose scuba unit and was the forerunner of most sport SCUBA equipment produced today. Only about 42 were made. ": null
    },
    {
        "Lambertsen Amphibious Respiratory Unit": "lambertsen amphibious respiratory unit"
    },
    {
        "for self-contained underwater breathing apparatus Aqualung ": null
    },
    {
        "ving equipment make": "ving equipment make"
    },
    {
        "    42 now owned by ": null
    },
    {
        "La Spirotechnique": "aqua lung/la spirotechnique"
    },
    {
        " BSAC": null
    },
    {
        "N42": "n-5"
    },
    {
        "  in ": null
    },
    {
        "Popular Mechanics": "popular mechanics"
    },
    {
        " magazineoctopush  FFESSM  Since then, Calor Gas regulators have been redesigned, and this conversion is now impossible. ": null
    },
    {
        "ving equipment make": "ving equipment make"
    },
    {
        "Siebe Gorman gave its drysuit the ": null
    },
    {
        "tradename": "tradename"
    },
    {
        " Frogman .  ": null
    },
    {
        "N42": "n-5"
    },
    {
        " CMASWorld Underwater Federation NAUI about 42  m or 42  ft, or 42 miles": null
    },
    {
        "RN42": "rn-5"
    },
    {
        "   ited States Na": "ited states na"
    },
    {
        "NEDUfilmusing both sorts of open-circuit scuba PADIor CompensationBC or BCD the first analog ": null
    },
    {
        "dive computer": "dive computer"
    },
    {
        " the first commercially viable electronic ": null
    },
    {
        "dive computer": "dive computer"
    },
    {
        "42 feet IANTD  including an as-yet-fictional deep-sea ": null
    },
    {
        "liquid-breathing": "liquid-breathing"
    },
    {
        " set see Fall of Communism and dissolution of the Soviet Union  ": null
    },
    {
        "42 fi": "97 fi"
    },
    {
        "bmersib": "bmersib"
    },
    {
        " Magellan 42   ": null
    }
]