[
    {
        "This article summarizes the events in the remaining days of September 2001 following the ": null
    },
    {
        "September 11 attacks": "september 11 attacks"
    },
    {
        " which relate to the attacks. All times, except where otherwise noted, are in ": null
    },
    {
        "Eastern Daylight Time": "eastern daylight time"
    },
    {
        " , or ": null
    },
    {
        "UTC−04:00": "utc−04:00"
    },
    {
        ".            2:30  a.m.: ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " reports that a car packed with explosives has been stopped on the ": null
    },
    {
        "George Washington Bridge": "george washington bridge"
    },
    {
        ". The ": null
    },
    {
        "New Jersey": "new jersey"
    },
    {
        " police claim there were enough explosives to destroy the entire bridge. Apparently the ": null
    },
    {
        "FBI": "federal bureau of investigation"
    },
    {
        " has denied the report. According to a later report, three men have been arrested, but there were no explosives involved. They were arrested because they had been seen ": null
    },
    {
        "celebrating": "september 11, 2001 terrorist attack/celebrations"
    },
    {
        " the attack.   Before 3:15  a.m.:  The Boston Herald  reports that at least five Arab men have been identified as suspects. Two of them were brothers, and one a trained pilot. Their passports have been traced to the ": null
    },
    {
        "United Arab Emirates": "united arab emirates"
    },
    {
        ". A car, rented in ": null
    },
    {
        "Portland, Maine": "portland, maine"
    },
    {
        ", has been seized from the ": null
    },
    {
        "Logan International Airport": "logan international airport"
    },
    {
        " garage, containing flight training manuals in Arabic. According to ": null
    },
    {
        "CNN": "cnn"
    },
    {
        ", FBI can neither confirm nor deny this. The men had been in a fight with a man shortly before take-off; this man later recalled the incident and called the police.   Before 3:50  a.m.:  The Jerusalem Post  reports that ": null
    },
    {
        "Osama bin Laden": "osama bin laden"
    },
    {
        " has given a speech denying any connection to the attacks, which he called admirable.   4:35  a.m.: ": null
    },
    {
        "CNN": "cnn"
    },
    {
        " reports that search warrants have been issued in south ": null
    },
    {
        "Florida": "florida"
    },
    {
        " because of information from the passenger lists of the hijacked planes.   After 7:00  a.m.: ": null
    },
    {
        "PAPD": "port authority of new york and new jersey police department"
    },
    {
        " Officer ": null
    },
    {
        "John McLoughlin": "john mcloughlin"
    },
    {
        ", who was in an underground corridor between the two towers when the South Tower collapsed, is pulled alive from the rubble of the ": null
    },
    {
        "World Trade Center": "world trade center"
    },
    {
        ".   10:00  a.m.: Congress reconvenes.   10:53  a.m.: President ": null
    },
    {
        "George W. Bush": "george w. bush"
    },
    {
        " holds a cabinet meeting, saying that the attacks were more than acts of terror. They were acts of war. Bush later that day tours the Pentagon to oversee the rescue and recovery efforts.   12:30  p.m. , Genelle Guzman-McMillan is pulled from the rubble of the North Tower of the World Trade Center, and is the last person recovered alive from the buildings collapse zones. John Cloud, , Time, Sept. 1, 2002.   1:10  p.m.: ": null
    },
    {
        "FBI": "federal bureau of investigation"
    },
    {
        " agents storm the ": null
    },
    {
        "Westin Hotel": "westin hotels  &  resorts"
    },
    {
        " in Boston to investigate a room rented by a passenger on one plane. They encounter and detain three people in the room and call in a bomb squad to investigate a suspicious package.   3:58  p.m.: ": null
    },
    {
        "FBI": "federal bureau of investigation"
    },
    {
        " announces they have evidence showing the ": null
    },
    {
        "White House": "white house"
    },
    {
        " and ": null
    },
    {
        "Air Force One": "air force one"
    },
    {
        " were intended targets of the attacks. Later this is recanted, and blamed on administration staffers misunderstanding the security information they received.   5:00  p.m.: Attorney General ": null
    },
    {
        "John Ashcroft": "john ashcroft"
    },
    {
        " announces that some of the hijackers were pilots trained in the US.   7:00  p.m.: ": null
    },
    {
        "Candlelight vigils": "candlelight vigil"
    },
    {
        " are held in ": null
    },
    {
        "Washington Square": "washington square park"
    },
    {
        ", ": null
    },
    {
        "Union Square": "union square, manhattan"
    },
    {
        ", ": null
    },
    {
        "Central Park": "central park"
    },
    {
        ", and various other locations in New York City.   Late evening:  The Chicago Tribune  reports that an ": null
    },
    {
        "anti-Arab": "anti-arabism"
    },
    {
        " rally was held by a crowd of a few hundred people near ": null
    },
    {
        "Bridgeview mosque": "bridgeview mosque"
    },
    {
        " in ": null
    },
    {
        "Bridgeview": "bridgeview, illinois"
    },
    {
        ", Illinois. Three were arrested by the over 100 policemen there, two for ": null
    },
    {
        "disorderly conduct": "disorderly conduct"
    },
    {
        " and one for ": null
    },
    {
        "reckless driving": "reckless driving"
    },
    {
        ".       A few commercial airliners return to the skies and some airports reopen slowly with strict security measures from the FAA.   Before 1:00  a.m.: ": null
    },
    {
        "German police": "federal police"
    },
    {
        " raid an apartment in ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        ", apparently at the behest of the ": null
    },
    {
        "FBI": "federal bureau of investigation"
    },
    {
        ", believed to have been used by suspect passengers on the airline flight list. It is believed to be the first police action outside the U.S. connected with the attack. Two people are taken into provisional custody, one is an airport worker. Both were later released, but re-arrested in late 2002.   The data recorder from United Airlines Flight 93 is recovered.   The United States ": null
    },
    {
        "National Transportation Safety Board": "national transportation safety board"
    },
    {
        ", which usually investigates air disasters, issued a  stating that the NTSB would assist the ": null
    },
    {
        "Federal Bureau of Investigation": "federal bureau of investigation"
    },
    {
        ", and that the FBI would be the lead investigative agency .   Between 4:15  p.m. and 5:00  p.m.: 10 people were detained at New York airports, reportedly including people who had boarded planes under false pretenses, people who had been trained to fly aircraft at the same schools as the previous terrorists, and people who had attempted to bring knives and other weapons past airport security. Some of these people had already been identified by the FBI as potential suspects. Three were removed from planes ready for departure by police SWAT teams, one resisted arrest. It was later found that none of them was planning a hijacking.   It is announced that ": null
    },
    {
        "Ahmed Shah Massoud": "ahmed shah massoud"
    },
    {
        ", a military leader of the ": null
    },
    {
        "Northern Alliance": "afghan northern alliance"
    },
    {
        ", died on September 9 from wounds received during a Taliban suicide attack.   On the orders of Queen ": null
    },
    {
        "Elizabeth II": "elizabeth ii"
    },
    {
        ", the ": null
    },
    {
        "Star-Spangled Banner": "star-spangled banner"
    },
    {
        " is played during the changing of the guard at ": null
    },
    {
        "Buckingham Palace": "buckingham palace"
    },
    {
        ". This unprecedented act was witnessed by a huge crowd, many singing along.   At the orders of ": null
    },
    {
        "Vladimir Putin": "vladimir putin"
    },
    {
        ", ": null
    },
    {
        "Russia": "russia"
    },
    {
        " observes a moments silence at noontime  with flags placed at half-staff throughout Russia in memory of terrorist acts victims .   At 8:00  p.m., the ": null
    },
    {
        "World Wrestling Federation": "wwe"
    },
    {
        " holds a special live broadcast of  SmackDown!  in ": null
    },
    {
        "Houston, Texas": "houston, texas"
    },
    {
        " dedicated to the victims and heroes of the attacks. All storylines are put on hold for this tribute show, as various wrestlers and other individuals give their best wishes to the families of the victims and congratulate all of the workers and firefighters in New York. This is the first major assemblage for an American sporting event following the attacks.       The National Day of Prayer and Remembrance     Church and memorial services held throughout the world. These include a special service held in London, which was attended by a black-clad Queen and 1,500 mourners. A three-minute silence at noon Paris time was observed throughout Europe. The Star-Spangled Banner is performed or sung in front of the ": null
    },
    {
        "Brandenburg Gate": "brandenburg gate"
    },
    {
        " and at mass gatherings in ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        ", ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", and ": null
    },
    {
        "Ottawa": "ottawa"
    },
    {
        ". National days of mourning are observed in ": null
    },
    {
        "Ireland": "republic of ireland"
    },
    {
        " and ": null
    },
    {
        "South Korea": "south korea"
    },
    {
        ". Ireland was brought to a standstill on the day, because the government had ordered schools, offices, and stores across the country closed because a public holiday as part of the national day of mourning had been declared.   The ": null
    },
    {
        "New York City Office of Emergency Management": "new york city office of emergency management"
    },
    {
        " completes setup of an Emergency Operations Center after a 32-hour construction marathon, at Pier 92. This facility served to replace the Office of Emergency Management office formerly housed in the basement of ": null
    },
    {
        "7 World Trade Center": "7 world trade center"
    },
    {
        ", and destroyed on the afternoon of September 11.     AM, The United States Department of Defense releases a revised estimate and the names of unaccounted. 125 people are missing: 74 Army, 42 Navy, 9 Defense agency. The original estimate for Defense Agencies was 10, which inadvertently included one DoD employee on ": null
    },
    {
        "American Airlines Flight 77": "american airlines flight 77"
    },
    {
        ", Mr. ": null
    },
    {
        "Bryan C. Jack": "bryan c. jack"
    },
    {
        ".   AM, Resumption of package deliveries from national carriers such as UPS and Federal Express.   AM, Nine of the ten detained at New York airports were released. One is still being questioned about immigration status. Authorities suspected one of them was holding a false pilot certificate, but he was a pilot. He was carrying papers, including a visa, which were owned by his brother in Boston, who happened to live in the same building as three of the people suspected of involvement in the hijackings. There was no hijacking attempts at either airport on the 13th, only suspicious circumstances.   AM, The Pentagon reports recovering both ": null
    },
    {
        "black boxes": "flight data recorder"
    },
    {
        " from flight AA 77 which crashed into the Pentagon.   AM, The ": null
    },
    {
        "names": "template:9-11 hijackers"
    },
    {
        " of the 19 suspected ": null
    },
    {
        "hijackers": "hijackers in the september 11 attacks"
    },
    {
        " are released by the ": null
    },
    {
        "FBI": "federal bureau of investigation"
    },
    {
        ".  , FBI, national Press Release September 14, 2001   AM, Arrests are made in the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        " and ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        " and apartments searched in the ": null
    },
    {
        "Philippines": "philippines"
    },
    {
        " and on a Carnival cruise ship in ": null
    },
    {
        "Florida": "florida"
    },
    {
        ". The connection to the Sept. 11th attack is not immediately clear.      12:00 PM, ": null
    },
    {
        "Service": "september 11, 2001 terrorist attack/memorials and services"
    },
    {
        " led by Rev. ": null
    },
    {
        "Billy Graham": "billy graham"
    },
    {
        " at ": null
    },
    {
        "Washington National Cathedral": "washington national cathedral"
    },
    {
        ", with President ": null
    },
    {
        "George W. Bush": "george w. bush"
    },
    {
        " and past and present top officials in attendance.   Bush gave remarks, beginning with We are here in the middle hour of our grief. Canadian television covers a memorial service on ": null
    },
    {
        "Parliament Hill": "parliament hill"
    },
    {
        " in Ottawa, which ": null
    },
    {
        "Canadian Prime Minister": "prime minister of canada"
    },
    {
        " Jean Chrétien": "jean chrétien"
    },
    {
        ", ": null
    },
    {
        "Governor General": "governor general of canada"
    },
    {
        " Adrienne Clarkson": "adrienne clarkson"
    },
    {
        ", and ": null
    },
    {
        "U.S. Ambassador to Canada": "list of ambassadors of the united states to canada"
    },
    {
        " Paul Cellucci": "paul cellucci"
    },
    {
        " presided over, and more than 100,000 people attended.   2:20 PM ": null
    },
    {
        "Colin Powell": "colin powell"
    },
    {
        " press briefing   3:40 PM President George W. Bush arrives in New York City. Later delivers Bullhorn Address.        The Department of Defense releases a casualty update: Aerographers Mate First Class ": null
    },
    {
        "Edward Thomas Earhart": "edward thomas earhart"
    },
    {
        ", 26, Salt Lick, Kentucky, is confirmed dead. ": null
    },
    {
        "Herbert W. Homer": "herbert w. homer"
    },
    {
        ", a civilian employee of the ": null
    },
    {
        "Defense Contract Management Agency": "defense contract management agency"
    },
    {
        ", was previously listed in error as unaccounted for at the Pentagon; he was among the passengers aboard ": null
    },
    {
        "United Airlines Flight 175": "united airlines flight 175"
    },
    {
        ".     Before 8:00 AM, New York authorities end request for ": null
    },
    {
        "donations of emergency supplies": "september 11, 2001 terrorist attack/donations"
    },
    {
        ".   Before 2:30 PM, Iran announces that it has closed its border with Afghanistan.   Before 2:30 PM, the official New York City missing count has risen to 4972. Over 150 bodies have been found, 92 positively identified.   Before 2:30 PM, the official death count at the Pentagon has risen to 189, including the 64 in the plane.   3:00 PM approx., a funeral mass is held for the Rev. ": null
    },
    {
        "Mychal Judge": "mychal judge"
    },
    {
        ".   3:00 PM approx., a funeral is held for fire chief ": null
    },
    {
        "Peter J. Ganci, Jr.": "peter j. ganci, jr."
    },
    {
        " in New Jersey. Afterwards mayor ": null
    },
    {
        "Rudy Giuliani": "rudy giuliani"
    },
    {
        " breaks his policy of never making public comments after the funeral, saying All eyes are on New York City.   Before 3:00 PM, The ": null
    },
    {
        "New York Stock Exchange": "new york stock exchange"
    },
    {
        " is successfully tested for its morning open at 9:30 AM EDT.   Before 3:00 PM, Colin Powell says both Pakistan and Iran have closed their borders with Afghanistan. After intensive pressure from the Bush administration, Pakistan has agreed to act as a ": null
    },
    {
        "staging area": "staging area"
    },
    {
        " for American air strikes or forces.   Afternoon: Four gunmen, including Francisco Roque, 42, go on a shooting rampage. They drove up in two pick-up trucks to a Chevron station in Mesa, Arizona, owned by ": null
    },
    {
        "Balbir Singh Sodhi": "murder of balbir singh sodhi"
    },
    {
        ", a 52-year-old Sikh from Punjab, India, and shot him dead, possibly mistaking him for an Arab because of his turban. They dont kill anyone else, but hit another gas station and a home. In October 2003, Roque is sentenced by an Arizona jury to death by lethal injection .    Afternoon: An Egyptian-born Coptic Christian, Adel Karas, 48, was shot dead by two white males inside his International Market grocery store in ": null
    },
    {
        "San Gabriel": "san gabriel, california"
    },
    {
        ", ": null
    },
    {
        "California": "california"
    },
    {
        ".   11:05 PM, a Pakistani immigrant and businessman, Waqar Hasan, 46, was shot dead in his store, Moms Grocery, in downtown ": null
    },
    {
        "Dallas": "dallas"
    },
    {
        ", ": null
    },
    {
        "Texas": "texas"
    },
    {
        " — again, possibly because of his turban. Congress subsequently passed a private bill granting his family permanent residence.        The ": null
    },
    {
        "NFL": "national football league"
    },
    {
        " cancels games for the weekend. These games were rescheduled to be played the week after the ": null
    },
    {
        "regular season": "2001 nfl season"
    },
    {
        " was supposed to end, delaying the ": null
    },
    {
        "playoffs": "nfl playoffs, 2001–02"
    },
    {
        " and ": null
    },
    {
        "Super Bowl XXXVI": "super bowl xxxvi"
    },
    {
        ".   ": null
    },
    {
        "NASCAR": "nascar"
    },
    {
        " postpones the ": null
    },
    {
        "New Hampshire 300": "2001 new hampshire 300"
    },
    {
        " scheduled to be held at the ": null
    },
    {
        "New Hampshire International Speedway": "new hampshire international speedway"
    },
    {
        ". The race is rescheduled for the day after Thanksgiving. Support races were cancelled, while a ": null
    },
    {
        "Craftsman Truck Series": "craftsman truck series"
    },
    {
        " race at ": null
    },
    {
        "Texas Motor Speedway": "texas motor speedway"
    },
    {
        " is postponed until October.   Day of mourning in ": null
    },
    {
        "Australia": "australia"
    },
    {
        " for victims of September 11. This had been proclaimed by ": null
    },
    {
        "Australian Prime Minister": "prime minister of australia"
    },
    {
        " John Howard": "john howard"
    },
    {
        " earlier that week. He had been in Washington at the time of the attacks.   The Department of Defense releases a casualty update: Cmdr. ": null
    },
    {
        "Dan Frederic Shanower": "dan frederic shanower"
    },
    {
        ", 40, of ": null
    },
    {
        "Naperville, Ill.": "naperville, illinois"
    },
    {
        " is confirmed dead. The number of dead or unaccounted at the Pentagon remains 124, not including the 64 passengers on ": null
    },
    {
        "American Airlines Flight 77": "american airlines flight 77"
    },
    {
        ". 88 remains have been recovered from the Pentagon and transported to ": null
    },
    {
        "Dover Air Force Base, Del.": "dover air force base"
    },
    {
        " for identification.     Lower Manhattan east of Broadway is opened to pedestrians.   Tens of thousands of ": null
    },
    {
        "Afghan refugees": "afghan refugees"
    },
    {
        " stream toward the closed borders with Iran and Pakistan . Food and other aid can no longer get in.   PM, A 20-year-old Saudi Arabian student is stabbed three times in Boston by assailants yelling anti-Arab abuse as he leaves a nightclub.       The U.S. demands that Pakistan close its borders to ": null
    },
    {
        "Afghan refugees": "afghan refugees"
    },
    {
        ". Pakistan immediately complies.   ": null
    },
    {
        "Major League Baseball": "major league baseball"
    },
    {
        " games recommence kicked off by ": null
    },
    {
        "Jack Bucks": "jack buck"
    },
    {
        "poem For America and speech where he said I dont know about you, but as for me, the question has already been answered: Should we be here? Yes! .   The Department of Defense releases a casualty update: 9 DoD employees and 2 passengers accounted for, and 124 DoD employees still unaccounted for. To date, 97 remains have been recovered and transported to Dover Air Force Base, Delaware. for identification. Eleven have been identified. Search and rescue operations continue.     The ": null
    },
    {
        "Northern Alliance": "afghan northern alliance"
    },
    {
        " in Afghanistan offers fifteen to thirty-thousand troops in support of attacks on the ": null
    },
    {
        "Taliban": "taliban"
    },
    {
        ".   6:00 AM ": null
    },
    {
        "Staten Island Ferry": "staten island ferry"
    },
    {
        " resumes operation. New Brooklyn ferry also commences service.   8:30 AM approx. The ": null
    },
    {
        "US Federal Reserve": "federal reserve system"
    },
    {
        " cuts the ": null
    },
    {
        "prime interest rate": "prime interest rate"
    },
    {
        " by half a percent to three percent.   9:30 AM The ": null
    },
    {
        "NYSE": "new york stock exchange"
    },
    {
        ", Mercantile Exchange, and ": null
    },
    {
        "NASDAQ": "nasdaq"
    },
    {
        " open for the first time after the longest hiatus in history after two minutes of silence. The markets plummet.   11:08 AM The ": null
    },
    {
        "World Bank": "world bank"
    },
    {
        " and ": null
    },
    {
        "IMF": "international monetary fund"
    },
    {
        " cancel the annual meeting scheduled for September 29 and 30th at Washington D.C.   4:00 PM ": null
    },
    {
        "Dow Jones Industrial Average": "dow jones industrial average"
    },
    {
        " closes down 684.81 points in heavy trading. ": null
    },
    {
        "NASDAQ": "nasdaq"
    },
    {
        " was down 6.84%, ": null
    },
    {
        "S & P 500": "s & p 500 index"
    },
    {
        " 4.93%. Airline stocks were down over 40 percent. ": null
    },
    {
        "Insurance": "insurance"
    },
    {
        ", ": null
    },
    {
        "financial": "financial services"
    },
    {
        ", and ": null
    },
    {
        "travel and leisure": "tourist industry"
    },
    {
        " stocks were also down heavily. ": null
    },
    {
        "Military contractor": "military contractor"
    },
    {
        ", ": null
    },
    {
        "savings and loans": "savings and loan association"
    },
    {
        ", ": null
    },
    {
        "telecom": "telecommunications industry"
    },
    {
        ", and ": null
    },
    {
        "pharmaceutical": "pharmaceutical industry"
    },
    {
        " stocks gained.   4:00 PM EDT ": null
    },
    {
        "Rudy Giuliani": "rudy giuliani"
    },
    {
        " conference on casualties: 5,422 missing, 201 known dead, 135 ": null
    },
    {
        "identified": "sep11:casualties of the september 11, 2001 terrorist attacks: city of new york"
    },
    {
        ". For the week to date, crime in New York City has been down 34 percent over the same week last year. 40,000 tons of debris have been removed.   Conference of many Islamic leaders to meet in Afghanistan to determine their response to the U.S. ultimatum.   The Lebanese ": null
    },
    {
        "Hezbollah": "hezbollah"
    },
    {
        "-owned ": null
    },
    {
        "satellite channel": "satellite channel"
    },
    {
        " Al-Manar": "al-manar"
    },
    {
        " comes out with a news piece arguing that the ": null
    },
    {
        "Israeli secret services": "mossad"
    },
    {
        " and ": null
    },
    {
        "Zionist": "zionist"
    },
    {
        " supporters of them were most likely responsible, and claiming that 4,000 ": null
    },
    {
        "Israel": "israel"
    },
    {
        "is had stayed away from work at the World Trade Center that day. This false claim would soon become the most widespread of the ": null
    },
    {
        "9/11 conspiracy claims regarding Jews or Israel": "9/11 conspiracy theories"
    },
    {
        ".   ": null
    },
    {
        "David Letterman": "david letterman"
    },
    {
        " returns to the air on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " with a heartfelt monologue giving his own personal thoughts and condolences about the attacks. Letterman is not censored when he asks out loud if the motivation for the attacks makes any goddamned sense. ": null
    },
    {
        "Jay Leno": "jay leno"
    },
    {
        " and ": null
    },
    {
        "Conan OBrien": "conan obrien"
    },
    {
        " also return to the air on ": null
    },
    {
        "NBC": "nbc"
    },
    {
        ", and ": null
    },
    {
        "Jon Stewart": "jon stewart"
    },
    {
        " would return to the air on ": null
    },
    {
        "Comedy Central": "comedy central"
    },
    {
        " three nights later.   Unknown time: ": null
    },
    {
        "Senator John McCain": "john mccain"
    },
    {
        " honors ": null
    },
    {
        "Mark Bingham": "mark bingham"
    },
    {
        ", ": null
    },
    {
        "Todd Beamer": "todd beamer"
    },
    {
        ", ": null
    },
    {
        "Tom Burnett": "tom burnett"
    },
    {
        " and ": null
    },
    {
        "Jeremy Glick": "jeremy glick"
    },
    {
        ", passengers on board ": null
    },
    {
        "United Airlines Flight 93": "united airlines flight 93"
    },
    {
        ", who risked their own lives to bring the ": null
    },
    {
        "Boeing 757": "boeing 757"
    },
    {
        " down, just to make sure the hijackers—mainly the pilot ": null
    },
    {
        "Ziad Jarrah": "ziad jarrah"
    },
    {
        "—do not reach their target, the ": null
    },
    {
        "United States Capitol": "united states capitol"
    },
    {
        ", and kill more civilians.       12:30 PM Rudy Giuliani press briefing: 49,553 tons removed to ": null
    },
    {
        "Fresh Kills Landfill": "fresh kills landfill"
    },
    {
        " in 3,788 trucks. 218 confirmed dead, 152 identified. 37 uniformed officers, 32 firefighters, 2 E.M.T.s, 2 Port Authority Police officers and one New Jersey Fire Department firefighter.    2:30 PM ": null
    },
    {
        "Ari Fleischer": "ari fleischer"
    },
    {
        " press briefing. The U.S. intends to go after terrorism whenever it threatens the United States, not all terrorism.   2:50 PM US Attorney General John Ashcroft press briefing: 96,000 tips. There may have been more than four planes targeted for hijacking. ": null
    },
    {
        "INS": "immigration and naturalization service"
    },
    {
        " will have 48 hours instead of the previous 24 in which to decide whether to charge detained individuals. This will allow them to detain the 75 individuals held in connection with the investigation indefinitely. Permanent anti-terrorism task forces under the US Attorney General and FBI will be established to blur the lines between local and federal law enforcement and the federal intelligence agencies.   In ": null
    },
    {
        "Karachi": "karachi"
    },
    {
        ", ": null
    },
    {
        "Pakistan": "pakistan"
    },
    {
        " more than 5,000 radical ": null
    },
    {
        "Islam": "islam"
    },
    {
        "ist students mount the largest demonstration yet against possible US military action against ": null
    },
    {
        "Afghanistan": "afghanistan"
    },
    {
        ". By the standards of Karachi politics, where rallies of over fifty thousand people are common, this is regarded as unexpectedly small. Hundreds of police and paramilitary troops prevent the protesters from marching on the ": null
    },
    {
        "US consulate": "consulate general of the united states, karachi"
    },
    {
        ". An ": null
    },
    {
        "effigy": "effigy"
    },
    {
        " of ": null
    },
    {
        "George W. Bush": "george w. bush"
    },
    {
        " is lit.   A mass candle vigil is held in ": null
    },
    {
        "Tehran": "tehran"
    },
    {
        ", ": null
    },
    {
        "Iran": "iran"
    },
    {
        " to mourn the loss of life in the United States.         The Department of Defense orders over 100 ": null
    },
    {
        "combat aircraft": "military aircraft"
    },
    {
        ", including ": null
    },
    {
        "fighters": "fighter aircraft"
    },
    {
        ", ": null
    },
    {
        "bombers": "bomber"
    },
    {
        ", and support aircraft to military bases in the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        ". Three ": null
    },
    {
        "aircraft carrier": "aircraft carrier"
    },
    {
        " groups will soon be within operational distance of west Asia.   2:20 PM approx. Rudy Giuliani and George Pataki press briefing: two lanes of Brooklyn Bridge into city to open Thursday. The government is opening up 5.5 million ft 2 of real estate for business. Individual family grants of up to $14,000 are available from the Dept. of Labor. The State Dept. of Health is giving $60 million to NYC hospitals. The business assistance center at 633 Third Ave. has received 5000 calls and 700 visitors. The city is hoping to get Battery Park North and South open in the next two days. The prayer service Sunday 9/23 at Yankee Stadium will be by ticket for families and the uniformed services , and simulcast at Jumbotrons at Staten Island and Brooklyn baseball stadiums. The city has determined it would be too early for the Central Park memorial service originally planned.   4:00 PM, Dow Jones Industrial Average closes down 144.27 to 8759.13. Other indexes are down similarly. At its lowest point, the Dow Jones was down over 420 points.       Stock markets continue dramatic slide.   Pakistan general/president ": null
    },
    {
        "Pervez Musharraf": "pervez musharraf"
    },
    {
        " gives speech asking country to go along with government decision to support United States—allowing flights over airspace, supplying intelligence, etc.   40 Senators visit New York City to see the rescue and recovery effort firsthand.   The official number of missing persons at the WTC rises dramatically to 6333, due to reports coming in from foreign countries.   President Bush gives speech to ": null
    },
    {
        "joint session of Congress": "joint session of the united states congress"
    },
    {
        ", with British Prime Minister ": null
    },
    {
        "Tony Blair": "tony blair"
    },
    {
        ", Rudy Giuliani, and Governor Pataki in attendance. He thanks the world for its support of the United States, and announces that the United States is at war with terrorism and demands countries choose to be with us or with the terrorists. He limits the enemy to terrorist groups with global reach. Five unconditional demands are imposed on the Taliban, including the immediate closedown of all terrorist training camps and the delivery of all al-Qaeda leaders to US authorities. He creates a new cabinet-level office, the ": null
    },
    {
        "Department of Homeland Security": "department of homeland security"
    },
    {
        " and names ": null
    },
    {
        "Pennsylvania Governor": "governor of pennsylvania"
    },
    {
        " Tom Ridge": "tom ridge"
    },
    {
        " as its head. His speech is interrupted with applause on many occasions.    Conference of Afghan Islamic clerics advise Taliban leader ": null
    },
    {
        "Mohammad Shah": "mohammad shah"
    },
    {
        " to invite Osama bin Laden to leave Afghanistan by his own choice.   ": null
    },
    {
        "New York Philharmonic": "new york philharmonic"
    },
    {
        " memorial concert of ": null
    },
    {
        "Brahms": "johannes brahms"
    },
    {
        " Ein Deutsches Requiem": "ein deutsches requiem"
    },
    {
        " in ": null
    },
    {
        "Avery Fisher Hall": "avery fisher hall"
    },
    {
        ". The concert was led off by the national anthem, and on the stage was a flag which appeared on stage during all Philharmonic ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " concerts. All proceeds go to disaster relief. At the request of the Philharmonic director, all applause was held, and the audience filed out in silence.       1.15 AM GMT Increased racial tensions in ": null
    },
    {
        "Peterborough": "peterborough"
    },
    {
        ", ": null
    },
    {
        "England": "england"
    },
    {
        " see seventeen-year-old boy ": null
    },
    {
        "Ross Parker murdered": "murder of ross parker"
    },
    {
        " by a gang of up to ten Muslims of ": null
    },
    {
        "Pakistani": "pakistani"
    },
    {
        " background who had sought a white male to attack. In December 2002 Shaied Nazir, Ahmed Ali Awan, and Sarfraz Ali are sentenced to life imprisonment for the racist murder.         4:00 AM Final version of airline assistance bill is written.   In the morning hours, the Congress approves a bill to prop up the airline industry and establish a federal fund for victims. The cost of the mostly open-ended fund may reach about ": null
    },
    {
        "$": "united states dollar"
    },
    {
        "15 billion. Victims of earlier terrorist attacks, including those linked to ": null
    },
    {
        "al-Qaida": "al-qaida"
    },
    {
        ", were not included in the fund.   Afghanistan press conference announces willingness to turn ": null
    },
    {
        "Osama bin Laden": "osama bin laden"
    },
    {
        " forcibly over only with evidence. United States reiterates it will not negotiate on demands. The US never releases the evidence demanded.   Tens of thousands demonstrate in Pakistan against the governments cooperation with United States.   The official number of missing persons at the WTC continues to fluctuate, 6300s to 6500s. They come from over 60 countries.   ": null
    },
    {
        "Stock markets": "stock market"
    },
    {
        "continue dramatic slide. .   A two-hour live ": null
    },
    {
        "telethon": "telethon"
    },
    {
        " entitled ": null
    },
    {
        "America: A Tribute to Heroes": "america: a tribute to heroes"
    },
    {
        " , with musical performances and spoken tributes by top American performers, is simultaneously broadcast on nearly every network. Controversy over disbursement of the funds raised will later arise.   Yemeni-American, Mr. Ali M. Al-Mansoob/Mr. Ali Al Mansouri, 44, is fatally shot 12 times in the back in Detroit, allegedly by a man angry about the terrorist attacks.   In the first major sporting event in New York City since the attack, a baseball game at ": null
    },
    {
        "Shea Stadium": "shea stadium"
    },
    {
        ", the ": null
    },
    {
        "New York Mets": "new york mets"
    },
    {
        " Mike Piazza": "mike piazza"
    },
    {
        " hits a two-run, game-winning home run in the bottom of the eighth inning against the ": null
    },
    {
        "Atlanta Braves": "atlanta braves"
    },
    {
        " to defeat the Braves, 3-2.       ": null
    },
    {
        "United Arab Emirates": "united arab emirates"
    },
    {
        " one of the few countries that had recognized the Taliban as the legitimate government of Afghanistan, rescinds the recognition.   Hundreds of millions of dollars of donations have been raised for American relief agencies.   ": null
    },
    {
        "United States": "united states"
    },
    {
        " reschedules ": null
    },
    {
        "Pakistans": "pakistan"
    },
    {
        "debt, and drops sanctions against Pakistan in return for its help with the war on terror.       The official count of bodies found at the site of the World Trade Center is 261; 194 have been identified. The official missing count at the World Trade Center is 6,453.   ": null
    },
    {
        "Taliban": "taliban"
    },
    {
        " claim they cannot find Osama bin Laden to deliver request that he leave the country of his own will.   NFL games recommence.   Interfaith memorial service, known as Prayer for America, is held at ": null
    },
    {
        "Yankee Stadium": "yankee stadium"
    },
    {
        ".   NASCARs ": null
    },
    {
        "MBNA Cal Ripken Jr. 400": "2001 mbna cal ripken jr. 400"
    },
    {
        " was hosted at ": null
    },
    {
        "Dover International Speedway": "dover international speedway"
    },
    {
        ", most drivers having special paint jobs with American flags for honor of the attacks. During  God Bless the USA , composed and performed at the race by ": null
    },
    {
        "Lee Greenwood": "lee greenwood"
    },
    {
        ", the aftermath of the World Trade Center was aired. For the first time ever, security measures prevent anyone who was not a track employee from working the race, with a nearby military base handling logistics. ": null
    },
    {
        "Dale Earnhardt Jr.": "dale earnhardt jr."
    },
    {
        " won the event and celebrated by driving around the track with an American flag out the window.       The official count of bodies found at the site of the World Trade Center is 276; 206 have been identified. The official missing count at the World Trade Center remains 6,453.   After losing upwards of 1,300 points in the previous week, the ": null
    },
    {
        "Dow Jones Industrial Average": "dow jones industrial average"
    },
    {
        " posts its eighth biggest net gain in its history. It gains 368.05 points to 8,603.86.   95% of United Airlines Flight 93 is recovered, 80% left in the crater by the crash, and 15% outside of it. The crater is refilled.       United States freezes assets of a list of ": null
    },
    {
        "terrorist": "terrorism"
    },
    {
        " groups included in this war . The list: ": null
    },
    {
        "Al-Qaida": "al-qaida"
    },
    {
        "/Islamic Army, ": null
    },
    {
        "Abu Sayyaf Group": "abu sayyaf group"
    },
    {
        ", ": null
    },
    {
        "Armed Islamic Group": "armed islamic group"
    },
    {
        " , ": null
    },
    {
        "Harakat ul-Mujahidin": "harakat ul-mujahidin"
    },
    {
        " , ": null
    },
    {
        "Al-Jihad": "egyptian islamic jihad"
    },
    {
        " , ": null
    },
    {
        "Islamic Movement of Uzbekistan": "islamic movement of uzbekistan"
    },
    {
        " , ": null
    },
    {
        "Asbat al-Ansar": "asbat al-ansar"
    },
    {
        ", ": null
    },
    {
        "Salafist Group for Call and Combat": "salafist group for call and combat"
    },
    {
        " , ": null
    },
    {
        "Libyan Islamic Fighting Group": "libyan islamic fighting group"
    },
    {
        ", ": null
    },
    {
        "Al-Itihaad al-Islamiya": "al-itihaad al-islamiya"
    },
    {
        " , ": null
    },
    {
        "Islamic Army of Aden": "islamic army of aden"
    },
    {
        ", ": null
    },
    {
        "Osama bin Laden": "osama bin laden"
    },
    {
        ", ": null
    },
    {
        "Muhammad Atif": "mohammed atef"
    },
    {
        " Sayf al-Adl": "saif al-adel"
    },
    {
        ", ": null
    },
    {
        "Shaykh Saiid": "shaykh saiid"
    },
    {
        " , Abu Hafs the Mauritanian , ": null
    },
    {
        "Ibn Al-Shaykh al-Libi": "ibn al-shaykh al-libi"
    },
    {
        ", ": null
    },
    {
        "Abu Zubaydah": "abu zubaydah"
    },
    {
        " , ": null
    },
    {
        "Abd al-Hadi al-Iraqi": "abdul hadi al iraqi"
    },
    {
        " , ": null
    },
    {
        "Ayman al-Zawahiri": "ayman al-zawahiri"
    },
    {
        ", ": null
    },
    {
        "Thirwat Salah Shihata": "thirwat shehata"
    },
    {
        ", Tariq Anwar al-Sayyid Ahmad , Muhammad Salah , ": null
    },
    {
        "Makhtab Al-Khidamat": "maktab al-khidamat"
    },
    {
        "/Al Kifah, ": null
    },
    {
        "Wafa Humanitarian Organization": "wafa humanitarian organization"
    },
    {
        ", Al Rashid Trust, ": null
    },
    {
        "Mamoun Darkazanli Import-Export Company": "mamoun darkazanli"
    },
    {
        " spy plane": "surveillance aircraft"
    },
    {
        ".   U.S. stock markets rebound somewhat.   Over 100,000 tons of debris have been removed from the World Trade Center site. It is clear that no remains will be found for a significant number of people.   United States to present evidence of Osama bin Ladens connection secretly to some coalition governments.   ": null
    },
    {
        "Saudi Arabia": "saudi arabia"
    },
    {
        " cuts diplomatic ties with the Taliban regime in ": null
    },
    {
        "Afghanistan": "afghanistan"
    },
    {
        ".   Hundreds of people, mostly in the United States and ": null
    },
    {
        "European Union": "european union"
    },
    {
        ", have been arrested or detained in the ongoing investigation.   Legislation  granting intelligence and law enforcement agencies more latitude in ": null
    },
    {
        "surveillance": "usa patriot act, title ii"
    },
    {
        " and ": null
    },
    {
        "inter-agency communication": "usa patriot act, title vii"
    },
    {
        " is debated in Washington, D.C. Many are concerned about the effects on ": null
    },
    {
        "civil liberties": "civil liberties"
    },
    {
        " and the general atmosphere of openness in the ": null
    },
    {
        "United States": "united states"
    },
    {
        ".   ": null
    },
    {
        "Shimon Peres": "shimon peres"
    },
    {
        " and ": null
    },
    {
        "Yasser Arafat": "yasser arafat"
    },
    {
        " meet Wednesday, and agree to pursue a more permanent ceasefire.   ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        " warns of humanitarian disaster if 1.5 million expected Afghan refugees have nowhere to go, or in any case in two-three weeks when food relief supplies run out. All borders have been closed, Pakistan may accept more refugees although there are already 2 million from the previous 23 years of war.   ": null
    },
    {
        "Jesse Jackson": "jesse jackson"
    },
    {
        " reports receiving an invitation from the Taliban to come to Afghanistan as part of a peace delegation. They deny making the invitation, but welcome him to come. The United States government frowns on it, but will not stand in the way.   Significant fighting is going on between the ": null
    },
    {
        "Northern Alliance": "afghan northern alliance"
    },
    {
        " and the ": null
    },
    {
        "Taliban": "taliban"
    },
    {
        ". Russia pledges to increase aid to the Northern Alliance.   United States reveals that ": null
    },
    {
        "special forces": "special forces"
    },
    {
        " are now, and/or have been recently, operating in Afghanistan already or in recent days.       The official count of bodies found at the site of the World Trade Center is 279; 209 have been identified. The official missing count at the World Trade Center is 6,398.   FBI is investigating over 90 claims of hate violence related to 9/11 attacks.       The official count of bodies found at the site of the World Trade Center is 300; 232 have been identified. The official missing count at the World Trade Center is 6,347.       The official count of bodies found at the site of the World Trade Center is 305; 238 have been identified. The official missing count at the World Trade Center is 5,960.   The FBI released photos of all 19 hijackers, and possible nationalities and aliases.  FBI, national Press Release September 27, 2001       The official count of bodies found at the site of the World Trade Center is 306; no new identifications are made. The official missing count at the World Trade Center remains 5,960.   FBI Press Conference release of an untranslated handwritten 4-page hijackers letter written in ": null
    },
    {
        "Arabic": "arabic"
    },
    {
        " and found in three separate copies at ": null
    },
    {
        "Dulles": "dulles international airport"
    },
    {
        ", the ": null
    },
    {
        "Pennsylvania crash site": "united airlines flight 93"
    },
    {
        ", and in ": null
    },
    {
        "Mohamed Attas": "mohamed atta"
    },
    {
        "suitcase. It includes Islamic prayers, instructions for a last night of life, and a practical checklist of final reminders for the mission.  FBI, Press Conference national Press Release, September 28, 2001 Translated: , PBS Frontline, Inside the Terror Network, tracking their personal stories. The British newspaper The Observer published this translation, provided for The New York Times by Capital Communications Group, a Washington-based international consulting firm, and by Imad Musa, a translator. Some notable excerpts: ... Make an oath to die and renew your intentions... ... Check your weapon before you leave and long before you leave. . ... All of their equipment and gates and technology will not prevent, nor harm, except by Gods will. The believers do not fear such things. ... ... When the confrontation begins, strike like champions who do not want to go back to this world. Shout, Allahu Akbar, because this strikes fear in the hearts of the non-believers. God said: Strike above the neck, and strike at all of their extremities. Know that the gardens of paradise are waiting for you in all their beauty, and the women of paradise are waiting, calling out, Come hither, friend of God. They have dressed in their most beautiful clothing... ... If you slaughter, do not cause the discomfort of those you are killing, because this is one of the practices of the prophet, peace be upon him... ... Do not seek revenge for yourself. Strike for Gods sake... ... Then implement the way of the prophet in taking prisoners. Take prisoners and kill them. As Almighty God said: No prophet should have prisoners until he has soaked the land with blood... ... How beautiful it is for one to read Gods words, such as: And those who prefer the afterlife over this world should fight for the sake of God. And His words: Do not suppose that those who are killed for the sake of God are dead; they are alive ... . ... Either end your life while praying, seconds before the target, or make your last words: There is no God but God, Muhammad is His messenger.       The official count of bodies found at the site of the World Trade Center is 309; 248 have been identified. The official missing count at the World Trade Center is 5,641.   ": null
    },
    {
        "Al Gore": "al gore"
    },
    {
        " makes his biggest speech since he lost his bid for the presidency, and strongly supports President Bush and the bipartisan atmosphere prevailing since the attack.        The official count of bodies found at the site of the World Trade Center is 314; 255 have been identified. The official missing count at the World Trade Center is 5,657.   ": null
    },
    {
        "Senator": "united states senate"
    },
    {
        " Chuck Schumer": "chuck schumer"
    },
    {
        " proposes holding the ": null
    },
    {
        "Super Bowl XXXVI": "super bowl xxxvi"
    },
    {
        " at ": null
    },
    {
        "Giants Stadium": "giants stadium"
    },
    {
        ".   The Taliban ambassador to Pakistan, Mullah ": null
    },
    {
        "Abdul Salam Zaeef": "abdul salam zaeef"
    }
]