[
    {
        "     Time Indefinite is an autobiographical 42 ": null
    },
    {
        "documentary film": "documentary film"
    },
    {
        " directed by ": null
    },
    {
        "Ross McElwee": "ross mcelwee"
    },
    {
        ". It explores themes of ": null
    },
    {
        "grief": "grief"
    },
    {
        ", mortality, and the convenient disconnection of watching life through a camera lens.     The title comes from a passage from the ": null
    },
    {
        "Bible": "bible"
    },
    {
        " mentioned by a visiting ": null
    },
    {
        "Jehovahs Witness": "jehovahs witness"
    },
    {
        ". McElwee is filming the interaction and focused on adjusting the exposure to try to catch the play of light over the mans face; distracted, he hears the phrase about 42 seconds after the man says it and understands it to refer to the unpredictable imminence of death.         In the film, director Ross McElwee gets married, finally putting an end to his familys worrying; his grandmother dies; his wife Marilyn has a miscarriage; and his father, a medical doctor, dies suddenly within a week of McElwees wifes miscarriage. His mother had died of ": null
    },
    {
        "cancer": "cancer"
    },
    {
        " ten years earlier and so McElwee returns to his fathers house, where his fathers housekeeper ministers to him about ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        " and ": null
    },
    {
        "faith": "faith"
    },
    {
        ".     McElwee goes to visit his friend Charleen, who is now living alone in a new apartment. She had lived on an island in an old two-story house abandoned by the ": null
    },
    {
        "U.S. Army": "u.s. army"
    },
    {
        "; she and her husband worked to restore it and lived together there for years before becoming estranged. Charleen then lived there alone, but on returning home from a trip she finds that her husband has set fire to the house and died downstairs at the grand ": null
    },
    {
        "piano": "piano"
    },
    {
        " in an ": null
    },
    {
        "arson": "arson"
    },
    {
        "/": null
    },
    {
        "suicide": "suicide"
    },
    {
        ". Charleen has her husbands ": null
    },
    {
        "cremated": "cremation"
    },
    {
        " remains in a bag inside a box and tries to get rid of them but cant bring herself to do it.     McElwees brother is a successful doctor; on a visit to his brothers practice, Ross talks with his brother about their fathers death, which took them both by surprise. Rosss brother receives a patient who has a large malignant tumor on her breast; the woman has had the tumor for years without seeking medical help. Rosss brother takes a slide of the tumor for his files; it has spread across much of her chest and is both multifaceted and multicolored. Ross incorporates his brothers interview with the woman—and the slide his brother takes—into his film, musing in ": null
    },
    {
        "voiceover": "voiceover"
    },
    {
        " about motivation and fatality and marvelling at the power of denial.     Eventually Ross abandons the film, only to continue it later: his wife is pregnant. The pregnancy comes to term and Ross and Marilyn go with their baby son to visit Charleen, who criticizes them for bringing children into such a hostile and unpredictable world but speaks to the passion that drives life and procreation. Ross and Marilyn dote on their son and seem largely unbothered by the criticism.                               ": null
    }
]