[
    {
        "        Tintin and Alph-Art  is the unfinished twenty-fourth and final volume of  The Adventures of Tintin , the comics series by Belgian cartoonist ": null
    },
    {
        "Hergé": "hergé"
    },
    {
        ". Left incomplete on Hergés death, the manuscript was posthumously published in 42 The story revolves around ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        " modern art": "modern art"
    },
    {
        " scene, where the young reporter ": null
    },
    {
        "Tintin": "tintin"
    },
    {
        " discovers that a local art dealer has been murdered. Investigating further, he encounters a conspiracy of art forgery, masterminded by a religious guru named Endaddine Akass.     Reflecting his own fascination for modern art, Hergé began work on Tintin and Alph-Art in 42 However, it was left unfinished at the time of his death in March 42 At this point it consisted of around 42 pages of pencil-drawn notes, outlines and sketches  – not yet rendered in Hergés trademark  ligne claire  drawing style  – with no ending having been devised for the story. Hergés colleague ": null
    },
    {
        "Bob de Moor": "bob de moor"
    },
    {
        " offered to complete the story for publication, and while Hergés widow Fanny Vlamynck initially agreed, she changed her decision, citing the fact that her late husband had not wanted anyone else to continue The Adventures of Tintin. A selection of the original notes were collected together and published in book form by ": null
    },
    {
        "Casterman": "casterman"
    },
    {
        " in 42 Since that point, several other cartoonists, such as ": null
    },
    {
        "Yves Rodier": "yves rodier"
    },
    {
        ", have produced their own finished, unauthorized versions of the story. Critical reception of the work has been mixed; some commentators on The Adventures of Tintin have believed that Tintin and Alph-Art would have been an improvement over much of Hergés later work, while others have characterised this as wishful thinking.       ": null
    },
    {
        "Tintin": "tintin"
    },
    {
        " and ": null
    },
    {
        "Captain Haddock": "captain haddock"
    },
    {
        " receive a phone call from their friend, the opera singer ": null
    },
    {
        "Bianca Castafiore": "bianca castafiore"
    },
    {
        ", who informs them about a new spiritual leader whom she has begun following, ": null
    },
    {
        "Endaddine Akass": "endaddine akass"
    },
    {
        ", stating her intention to stay at his villa in ": null
    },
    {
        "Ischia": "ischia"
    },
    {
        ". Later that day, Haddock enters the Fourcart Gallery in Brussels, where Jamaican ": null
    },
    {
        "avant-garde": "avant-garde"
    },
    {
        " artist ": null
    },
    {
        "Ramó Nash": "ramó nash"
    },
    {
        " convinces him to purchase one of his Alph-Art works, a ": null
    },
    {
        "perspex": "poly"
    },
    {
        " letter H . The gallerys owner, ": null
    },
    {
        "Henri Fourcart": "henri fourcart"
    },
    {
        ", arranges to meet Tintin, but is killed in a car accident while on his way to do so. Tintin begins to investigate, discovering that Fourcarts death was murder. Tintin and Haddock attend one of Akass lectures; there, Tintin recognises Akass voice, but is unsure why. Investigating further, he concludes that Akass was spying on Fourcart through a micro-transmitter hidden in a pendant worn by the latters assistant, ": null
    },
    {
        "Martine Vandezande": "martine vandezande"
    },
    {
        ". Tintin soon faces a number of attacks designed to kill him, but survives both.     To further his investigations, Tintin decides to visit Akass villa. Arriving at Ischia, Tintin and Haddock receive death threats warning them to leave. When Castafiore hears that they are on the island, she welcomes them to Akass villa, informing them that Akass himself is in Rome. At the villa, they meet a number of acquaintances, the corrupt industrialists ": null
    },
    {
        "W.R. Gibbons": "w.r. gibbons"
    },
    {
        "  and ": null
    },
    {
        "R.W. Trickler": "r.w. trickler"
    },
    {
        " , Emir ": null
    },
    {
        "Ben Kalish Ezab": "mohammed ben kalish ezab"
    },
    {
        " , Luigi Randazzo , and Ramó Nash. Tintin and Haddock stay the night at the villa on Castafiores insistence. During the night, Tintin witnesses men loading canvases into a van, and exploring the villa discovers a room full of faked paintings by prominent artists. He is discovered by Akass, who informs him that he uses Nashs Alph-Art as a front for his criminal forgery business. Akass declares his intention to kill Tintin by having him covered in liquid ": null
    },
    {
        "polyester": "polyester"
    },
    {
        " and sold as a work of art by ": null
    },
    {
        "César Baldaccini": "césar baldaccini"
    },
    {
        ".             In 42 a few months after the publication of  Tintin and the Picaros , Hergé told the journalist ": null
    },
    {
        "Numa Sadoul": "numa sadoul"
    },
    {
        " that he was contemplating setting the next Adventure of Tintin in an airport lounge. This idea was dropped, and in 42 he decided to set the story in the world of ": null
    },
    {
        "modern art": "modern art"
    },
    {
        ". During his later years Hergé had grown increasingly interested in this subject, and decided to incorporate his love of ": null
    },
    {
        "avant-garde": "avant-garde"
    },
    {
        " artwork into the new story. Being a regular at Brussels art galleries and exhibitions, he was able to draw directly upon his experiences in the art scene when producing the story. Given his age, and the length of time that it was taking him to produce each Adventure, British literary critic ": null
    },
    {
        "Michael Farr": "michael farr"
    },
    {
        " suggested that Hergé likely knew that this would be his final installment in the series.          Hergé initially titled this new work Tintin et les Faussaires before changing this ": null
    },
    {
        "working title": "working title"
    },
    {
        " to Tintin et LAlph-Art. The storys main antagonist, Endaddine Akass, was based on a real-life art forger, ": null
    },
    {
        "Fernand Legros": "fernand legros"
    },
    {
        ", whom Hergé had learned about through reading a biography of him. The Akass character was also influenced by an article about the Indian guru ": null
    },
    {
        "Rajneesh": "rajneesh"
    },
    {
        " which Hergé had read in a December 42 edition of the  Paris Match . In Hergés notes, he included the idea of revealing that Akass was Tintins nemesis, ": null
    },
    {
        "Rastapopoulos": "rastapopoulos"
    },
    {
        ", in disguise, with Farr believing that this plot twist would have been revealed had Hergé completed the story. Conversely, ": null
    },
    {
        "Harry Thompson": "harry thompson"
    },
    {
        " suggested that Hergé had dropped Rastapopolous from the story in 42 Hergés notes reveal that he considered various different names for the artist character, including Ramon Hasj and Ramo Nasj, before settling on Ramo Nash. Similarly, he had initially debated whether Nash should be a painter or a sculptor, before deciding on the latter.     Three months before he died, Hergé stated that Unfortunately I cannot say much about this forthcoming Tintin adventure because, though I started it three years ago, I have not had much time to work on it and still do not know how it will turn out. I know very roughly where I am going... I am continuing my research and I really do not know where this story will lead me.    Upon his death, Hergé left around one hundred and fifty pages of pencil sketches for the story. The story itself had no ending, and is left on a ": null
    },
    {
        "cliffhanger": "cliffhanger"
    },
    {
        ", with Tintins fate left unexplained.     Hergés main assistant, ": null
    },
    {
        "Bob de Moor": "bob de moor"
    },
    {
        ", showed an interest in completing the book following Hergés death. In de Moors words, Personally I would have loved to finish Alph-Art. It would have been a tribute to Hergé. Fanny Remi asked me to finish it, and I began work on it, but after a few months she changed her mind. I didnt insist, but for me it was logical that there was a studio, there were artists in the studio, Casterman asked for it to be finished, there were twenty-three finished books, that one story was not finished; so I had to finish it.    In the end, Fanny decided Hergé would not have approved and the book must remain unfinished. Hergé had made it clear that he did not want anyone else to continue The Adventures of Tintin after his death, informing Sadoul that After me there will be no more Tintin. Tintin is my creation—my blood, my sweat, my guts.          Fanny ultimately decided that Hergés unfinished sketches could be published in book form. To do so, the sketches were edited by a team of experts, including ": null
    },
    {
        "Benoît Peeters": "benoît peeters"
    },
    {
        ", Michel Bareau and Jean-Manuel Duvivier, with forty-four being selected for publication. The book produced devoted one half to reproducing the sketches, and the other to producing a ": null
    },
    {
        "transcript": "wikt:special:search/transcription"
    },
    {
        " of Hergés text for the story. Published on 42 October 42 by ": null
    },
    {
        "Casterman": "casterman"
    },
    {
        ", it proved to be a best-seller.   An English language translation was published in 42              For Michael Farr, Tintin and Alph-Art provided an almost perfect ending to more than fifty years of defying danger, threats to his life and a succession of villains . He believed that it was full of a vigour and enthusiasm disappointingly absent from the two previous adventures , and that as a result it promised to be Hergés most accomplished Tintin story for twenty years . ": null
    },
    {
        "Jean-Marc Lofficier": "jean-marc lofficier"
    },
    {
        " and Randy Lofficier stated that had the story been completed, it may have turned out to be a smaller-scale, unpretentious yet far more exciting and true-to-life adventure than various recent volumes.   Hergé biographer ": null
    },
    {
        "Benoît Peeters": "benoît peeters"
    },
    {
        " felt that despite its limitations, and perhaps on account of them, this unfinished story fits perfectly alongside the other 42 Tintin adventures. Full of promise, it ends the series admirably by leaving the last word to every readers imagination.  ": null
    },
    {
        "Philippe Goddin": "philippe goddin"
    },
    {
        " opined that Tintin and Alph-Arts opening promised much, coming like new breath .     In a later publication, Peeters expressed a different view, stating that one cannot help but feel disappointed with Alph-Art. Similarly, Harry Thompson expressed the view that Hergé would never have completed the story, and that while many critics like to think... Tintin and Alph-Art was set to be Hergés last great masterpiece , he disagreed, describing this as surely just wishful thinking . He added that it could be seen as a nostalgic, or regressive book, depending on your point of view.     The literary critic Tom McCarthy suggested that some of the early scenes of the book take the form almost of Platonic dialogues , dramatized theoretical discussions about art itself , although later in the book Hergé turns to revealing the deeper and more essential Platonic truth of art: that it is fake, that its whole currency is fakeness. Discussing the final scene in the book, he opined that it reads like a snuff movie : not of Tintin, ultimately, but of Hergé . Further, he argued that Tintin and Alph-Art reflected a number of themes that also appear in other Adventures of Tintin; these include the idea of Castafiore bridging the connection between the protagonist and the villains, and the concept of Haddock being confronted with his own inauthenticity , in this case through purchasing a giant plastic H artwork.       thu     A number of pirated versions of the story exist, produced by other artists and illegally distributed among fans. In 42 such a version was completed by an artist using the pseudonym of Ramó Nash. Several further versions were produced by the Canadian artist Yves Rodier during the 42s. A further version appeared in the 42s, produced by an individual known as Regric.     In honour of Hergés legacy, the awards handed out at the Angoulême International Comics Festival were named Alph-Art Awards, having previously been named after Alain Saint-Ogan s character Alfred.     In November 42 Somerset House in London held the exhibition Tintin: Hergés Masterpiece , which featured the final sketch from Tintin and Alph-Art as one of its displays.  ": null
    }
]