[
    {
        "                 Tiswas  is a childrens British ": null
    },
    {
        "television": "television"
    },
    {
        " series that originally aired on Saturday mornings from 42 January 42 to 42 April 42 and was produced for the ": null
    },
    {
        "ITV": "itv"
    },
    {
        " network by ": null
    },
    {
        "ATV Network Limited": "associated television"
    },
    {
        ".     It was created by ATV ": null
    },
    {
        "continuity announcer": "continuity announcer"
    },
    {
        " Peter Tomlinson": "peter tomlinson"
    },
    {
        "  following a test period in 42 when he tried out a few competitions and ": null
    },
    {
        " daft stuff ": "nonsense"
    },
    {
        " between the programmes.       Tiswas began life as a links strand between many filler programmes, such as ": null
    },
    {
        "cartoon": "cartoon"
    },
    {
        "s and old ": null
    },
    {
        "films": "films"
    },
    {
        ". The popularity of the presenters links soon eclipsed the staple diet of filler.     It was originally produced as a ": null
    },
    {
        "Midlands": "english midlands"
    },
    {
        " regional programme by ATV and was first broadcast live on 42 January 42 The then ": null
    },
    {
        "federal": "federation"
    },
    {
        " structure of ITV, with its independent regional companies, meant that not all of these stations broadcast the show when it became available for networked transmission. Over a period of time, most ITV regions did, with ": null
    },
    {
        "Granada Television": "granada television"
    },
    {
        " and ": null
    },
    {
        "Southern Television": "southern television"
    },
    {
        " being among the last to pick up the show in 42 ": null
    },
    {
        "Tyne Tees": "itv tyne tees"
    },
    {
        " and ": null
    },
    {
        "Ulster": "utv"
    },
    {
        " finally decided to take Tiswas for its final series in 42 The smallest broadcaster in the network, ": null
    },
    {
        "Channel Television": "channel television"
    },
    {
        ", did not carry the programme.     Most famously hosted by ": null
    },
    {
        "Chris Tarrant": "chris tarrant"
    },
    {
        " between 42 and 42 and later, ": null
    },
    {
        "Sally James": "sally james"
    },
    {
        ", it also featured the young ": null
    },
    {
        "Lenny Henry": "lenny henry"
    },
    {
        " and occasionally ": null
    },
    {
        "Jim Davidson": "jim davidson"
    },
    {
        " together with ": null
    },
    {
        "Bob Carolgees": "bob carolgees"
    },
    {
        " and his ": null
    },
    {
        "puppet": "puppet"
    },
    {
        ", Spit the Dog. ": null
    },
    {
        "John Gorman": "john gorman"
    },
    {
        ", former member of 42s cult band ": null
    },
    {
        "The Scaffold": "the scaffold"
    },
    {
        ", was also a presenter. On the programme, ": null
    },
    {
        "Birmingham": "birmingham"
    },
    {
        " folk-singer and comedian ": null
    },
    {
        "Jasper Carrott": "jasper carrott"
    },
    {
        " was to introduce the nation to the Dying Fly Dance and also to many local hospital casualty wards as the dance at one point soared high in the ": null
    },
    {
        "RoSPA": "rospa"
    },
    {
        " list of common causes of household injury. Like its cleaner ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " counterpart,  Multi-Coloured Swap Shop , it had a running order but no script . The programme was broadcast from Studio 42 at ": null
    },
    {
        "ATV Centre": "alpha tower"
    },
    {
        " in ": null
    },
    {
        "Birmingham": "birmingham"
    },
    {
        "; this was the weekday home for the companys regional news magazine, ATV Today.     The show was a stitch-together of competitions, film clips and pop promos, just about held together by sketches and links from the cast. The show also regularly featured spoofs of ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " childrens programming.     A feature of Tiswas was The Cage wherein initially the child audience, later their parents and, finally, members of the public could apply were confined and periodically doused in water . This became so popular that the 42th show  featured several hundred fans lining the racetrack whilst a fire-engine of the local brigade drove around the track and hosed them down with water.     The series was also frequently visited by the Phantom Flan Flinger, who would throw ": null
    },
    {
        "flans": "custard pie"
    },
    {
        " around the studio at all and sundry. Both Tarrant and the Flan Flinger would take great delight in trying to flan cameramen who would go to great lengths to avoid being hit.     Nottingham-based duo ": null
    },
    {
        "Sleaford Mods": "sleaford mods"
    },
    {
        " included the song Tiswas on their 42 album,  Divide and Exit .        The original logo featured the word TISWAS in chunky letters. A later version of this logo featured a circle going round the edge with Today Is Saturday Watch And Smile embossed upon it. The classic zig-zag logo designed by Stuart Kettle appeared in 42 - this initially featured a mechanical bird flying above it, but later, Chris Wroe  replaced this with a drawing of the Phantom Flan Flinger.           The first series was intended to be eleven episodes, purely acting as links between the usual staple fillers of old films and cartoons that ATV would transmit on Saturday mornings. Presented by ": null
    },
    {
        "Chris Tarrant": "chris tarrant"
    },
    {
        " and John Asher from just a desk in a continuity studio, the pair had to rely on ad-libs and jokes sent in by viewers. Within a few weeks, the show was moved to studio 42 at ATV Centre  from which Tiswas was produced for the majority of its run.     Due to an industrial dispute by technicians at ": null
    },
    {
        "Associated TeleVision": "associated television"
    },
    {
        ", this initial run was only nine programmes in all, but was so well received that a second series was commissioned.     Billed in TV Times as Today Is Saturday or the Tis-was Show , the title sequence features both Today Is Saturday and the original Tiswas chunky letters logo, shown over a background very similar to that of  The Golden Shot . The sequence featured clips from various films and Disney cartoons, backed by a funky jazz number known as Atomic Butterfly .       Series 42 of Tiswas began from late 42 and spanned almost every Saturday in 42 finishing in early 42 The presenting team was doubled to four presenters, and these were usually culled from ATVs presentation department. Chris Tarrant and John Asher retained their roles as the main presenters, although John would leave during this series. From the ranks at ATV, other regular presenters were established, notably sports reporter ": null
    },
    {
        "Trevor East": "trevor east"
    },
    {
        "  and announcer ": null
    },
    {
        "Peter Tomlinson": "peter tomlinson"
    },
    {
        " .     Producer Peter Harris would leave the show in the summer to help produce fellow cult TV success  The Muppet Show  at ATVs London-orientated operation in ": null
    },
    {
        "Elstree": "elstree"
    },
    {
        ".       Running from late 42 to early 42 Chris Tarrant, Peter Tomlinson and Trevor East were the main presenters. Almost all these shows were produced by Sid Kilbey. The 42 April 42 show was a landmark edition, as part of the programme was broadcast outside the Midlands for the first time, on HTV Cymru Wales and HTV West, filling up their round-the-regions compilation of Saturday morning programmes called Ten On Saturday.       This series, running from 42 September 42 to May 42 marked an end to the provincial macro-budget shows of the previous series, as the initial edition of this series brought significant changes. ": null
    },
    {
        "Sally James": "sally james"
    },
    {
        " was drafted in as the series first regular female presenter. She had been the presenter of a regional Saturday morning show in London called Saturday Scene, produced by ": null
    },
    {
        "LWT": "lwt"
    },
    {
        ". Comedian ": null
    },
    {
        "Jim Davidson": "jim davidson"
    },
    {
        " was intended to be a regular presenter but left after only a few editions, although he would return for cameo appearances. Peter Tomlinson was axed as a regular, which came as a surprise to him.     Chris Tarrant was retained as the anchor presenter, and behind the scenes was annoyed with the changes, particularly the inclusion of a woman as presenter. However he later retracted this viewpoint, having witnessed the progress Tiswas had made with Sallys contribution.     One significant change almost never happened. ATV management were displeased with the visual slapstick element - the hurling of custard pies and water. They believed this was setting a bad example to the young viewers. Newly drafted producer/director ": null
    },
    {
        "Glyn Edwards": "glyn edwards"
    },
    {
        " managed to retain this vital, messy element by drawing on his experience as a Punch & Judy puppeteer to create a villain character called The Phantom Flan Flinger, who would be the black-clad masked nemesis of the presenting team, and the main instigator of pie-throwing chaos. The phantom was later revealed to be Ben Mills, a taxi driver from ": null
    },
    {
        "Cheswick Green": "cheswick green"
    },
    {
        " near ": null
    },
    {
        "Solihull": "solihull"
    },
    {
        ".     John Gorman made his debut in this series, but with just four appearances, it would not be until series 42 that he became a regular visitor to the Tiswas studios. Likewise, child performer Paul Hardin made sporadic appearances.     The programme expanded its footprint further outside its home region. As well as appearing in part on HTV, ": null
    },
    {
        "Anglia": "anglia television"
    },
    {
        ", ": null
    },
    {
        "Border": "border television"
    },
    {
        ", Granada and Scottish Television began to screen Tiswas in its entirety. Anglia dropped the series a number of times to pick up other regions Saturday morning programmes throughout Tiswass history.       This series ran from September 42 to May 42 John Gorman became a regular performer from November onwards. STV and Granada dropped the series in 42 in favour of showing other programmes but began carrying the series again in 42 HTV continued to opt in and out of the programme during Ten on Saturday.     Bob Carolgees made his debut in early 42 having been told to go on the programme by Irish comic Frank Carson . Carolgees appeared again two weeks later, and Chris was so pleased with his contribution that he decided to make a regular fixture out of Bob.     Lenny Henry made sporadic appearances throughout this series, but was not established as a regular. Child performer Paul Hardin increased his visits to the studios, and could well be considered as a series 42 team member, likewise Sylveste McCoy who performed surreal comic interludes.       ITV had been off the air across the nation since August due to a massive strike by technicians. Tiswas returned to the screens in November 42 for its sixth series, as part of ITVs comeback; this was directly referenced in the first edition of the new series, when the Welcome Home To ITV jingle was played to usher the programme in and out of the advert breaks, albeit replacing the vocals by the Mike Sammes Singers with a group of deliberately out-of-tune children. Many ITV regions took the programme for the first time, establishing the show strongly in the nations consciousness. London-based viewers tended to complain to the Independent Broadcasting Authority about some of the edgier moments the show had.     With an almost national audience, the show became inclusive of its increased viewership by making a bigger role out of specially invited viewer performances. Many of these were children who sang songs or performed dance routines. Chris Tarrant, now producer as well as presenter, found most of these contributions to be of little value, until he came across a unique act by a five-year-old boy called Matthew Butler. Encouraged by his Tiswas-obsessed mother, Matthew auditioned for the series wearing a rabbit costume and sang the song Bright Eyes made famous by the animated film Watership Down , although his own singing ability was rather poor. Chris found this so amusing that he arranged for him to appear on the following Tiswas, as well as many subsequent editions.     Also appearing a number of times in this series was Norman Collier , the Yorkshire comedian best known for his broken microphone routine and chicken impressions.     Another by-product of Tiswas increased audience was the merchandise bandwagon - an annual book was established, and there was a tour of universities by the Tiswas team, under the name of The Four Bucketeers , which tied in with their spin-off album on CBS Records . This all was born out of one feature of the sixth series - The Bucket Of Water Song, which was such a hit with the viewers that it evolved from an intended one-off to an almost regular part of Tiswas.       By now, ATV had increased the budget for Tiswas, and Chris Tarrant had more of a say in the programmes production than ever before. A proper theme tune was created and the studio set was based around ATV cartoonist Chris Wroes caricatures of the presenting team.     This series can be considered as the definitive series, due to the material drawn from this era that usually gets an airing on documentaries and clips shows when Tiswas is the subject. In addition, the three video compilations that have been released for sale have been packaged around a seventh series theme, with the bulk of the clips also being from this age.     Midway through this series, Chris Tarrant decided to leave upon the series conclusion. Also leaving after the final edition of series 42 were Bob Carolgees, Lenny Henry and John Gorman. They had decamped to start work on O.T.T. , a late night version of Tiswas intended for an adult audience, which would debut in 42 The only regular Tiswas presenter left was Sally James, who stayed on for series 42       The last series of Tiswas, beginning in September 42 and ending in April 42 had its format heavily tinkered with by ATV management. They believed that the adult audience should be avid viewers of Chris late-night Tiswas, and therefore Tiswas itself should focus on its child audience. It was also the first time Tyne Tees and Ulster started to screen the series.     The new presenting team consisted of Midlands DJ Gordon Astley , former Darts frontman Den Hegarty and comic impressionist Fogwell Flax. Veteran Tiswas presenter Sally James stayed on and became the series Music Editor, but decided to leave towards the series end. This was likely to be a factor in Central Television s decision not to bring the programme back for a ninth series.     Semi-regulars were dwarf actor David Rappaport who played characters such as Green Nigel and the Fonz -like Shades, Emil Wolk and puppeteer Trevor James with a giant parrot, presumably to fill the void left by Bob Carolgees.     At the end of 42 a restructure of ITV s broadcast franchises saw ATV win back the franchise for the Midlands on condition of changes in management, regional output and branding. Thus the first part of the series was produced by ATV and the second part by Central Independent Television .     The decision by TVS , the new ITV station in the south and south east of England, to drop the Central-produced half of the last series in favour of their own Saturday morning programme No. 42 saw fans of Tiswas picket outside their Southampton studios. The eighth series was broadcast on TVS upon the end of No. 42 s first series.     During its ATV days the chairman of the station, Lew Grade , was said to have taken a personal dislike to the show but was persuaded to let it continue, even arguing in its defence to criticism from the IBA . It was believed that the new management at Central frowned upon the anarchy of Tiswas and in a desire to make the station more upmarket than its previous incarnation took the evidence of declining audiences for the new format as justification to axe Tiswas after series 42       Almost every edition of Tiswas was transmitted live and only recorded in case of any future IBA investigation . Accordingly, they suffered the same fate as a number of 42s childrens series in that they were thought to have no further commercial use , and therefore many master tapes were wiped for re-use. As a result, very few programmes officially exist in their entirety. Those that were kept were often stored in poor conditions, which led to severe picture deterioration, so they are no longer of broadcast quality .     However, some did survive; many viewers made their own recordings and in many cases these are the only existing copies of the programmes. Members of the production team and performers on the show would also record their appearances, leading to many episodes existing in private hands. In 42 ITV began a search for many missing ITV programmes, including Tiswas, for their Raiders Of The Lost Archive series broadcast in 42     Their website reveals that only 42 episodes are known to officially exist in their entirety: episode 42 from 42 August 42 four episodes from 42 two episodes from 42 two episodes from 42 five episodes from 42 and nine episodes from 42 Incomplete segments from show 42 , an episode from 42 and two episodes from 42 are also known to have survived.     The prolific TiswasOnline fansite features an in-depth episode guide for the whole series, detailing where an episode is known to exist, whether as a private home recording or in the official archive. ITV plc has confirmed to TiswasOnline that many more programme elements have been kept, but as yet these have not been fully catalogued. This may include insert material such as animations and graphics or filmed clips. Furthermore, the Tiswas Reunited programme in 42 resulted in the discovery of further footage.         On 42 January 42 Tarrant, Carolgees, Gorman, Randolph Sutherland and Henry launched a late-night show - with the up-and-coming comics Alexei Sayle and Helen Atkinson-Wood called O.T.T. which was effectively an adult version of Tiswas - in other words, it attempted to be just as anarchic, but with swearing and occasional topless women. It was not such a success, running for just one series, and is today chiefly remembered for the naked Balloon Dance performed by The Greatest Show on Legs , including comedian Malcolm Hardee . The theme tune was recorded by Roy Wood and was released as a single       Saturday Stayback was a short-lived late night comedy show based in a pub. Although intended as some sort of sequel to O.T.T., this differed quite a lot as it was all recorded rather than the live chaos of its predecessor. It mainly consisted comedy sketches, with some live music acts - usually Thin Lizzy and Roy Wood . Saturday Stayback received much less controversy than O.T.T., and also introduced new talent such as Phil Cool and Tony Slattery . It lasted only six episodes. Chris Tarrant and Bob Carolgees were the only ex-Tiswas personnel regularly seen on screen, and John Gorman helped out on writing duty.       A definitive line-up of Tiswas presenters regrouped for a resurrection of Tiswas on the ITV Telethon of 42 This took place in LWTs South Bank studios in London , culminating in an outside performance of The Bucket Of Water Song.       In late 42 ITVs Saturday morning show Ministry of Mayhem had a special edition featuring presenters from past Saturday morning shows, including Tiswas. Representing Tiswas was Sally James, although Chris Tarrant did a video link-up for a brief interview during the show. Out of the cult Saturday morning shows that were focused on, Tiswas was significantly the most prominent, with many clips shown from it, and even a re-enactment of two Tiswas staples - the Cage and the Pass The Pie game.       In December 42 BBC Saturday morning show Dick and Dom in da Bungalow featured a thirty-year-old man singing Bright Eyes with his friends as part of a talent spot. This person was Matthew Lewis, formerly known as Matthew Butler, who performed his unique rendition of the song back in 42 on Tiswas when he was aged five. Presenters Richard McCourt and Dominic Wood took the opportunity to praise Matthew, as they are fans of Tiswas, and also to dispel recent tabloid rumours of Dick and Dom resurrecting Tiswas on ITV. However, Wood did present one episode of Dick and Dom in da Bungalow wearing a Tiswas T-shirt.       Lenny Henry appeared on the BBCs It Started With Swap Shop programme in 42 in which he was talking to Noel Edmonds about Tiswas being their rival during the whole era of Swap Shop.   The rivalry was such that it was even used by football fans singing on the terraces. The home team chanting Tiswas and the away team chanting swap shop. Tiswas,swapshop..Tiswas,swapshop..Tiswas swapshop, etc.         A new programme to celebrate 42 years since the final Tiswas show was broadcast by ITV42 on 42 June 42 it started with the traditional ATV logo and jingle. This programme had been delayed from May in order to allow for an extended transmission slot. Celebrities and old Tiswas mates alike joined in the fun. In an interview publicising this, Chris Tarrant put out an appeal to the public to submit any surviving video footage of the series to be included in the new programme - which resulted in the discovery of further footage.     A DVD release of the programme, featuring an extended edition plus a short featurette on the history of Tiswas was released shortly after transmission.     From the official press release:       For one night only, ITV42 brings you TiSWAS REUNITED, a one-off special reuniting the stars of the iconic groundbreaking children’s show TiSWAS. With a wealth of clips and reminiscences from the many stars who appeared on the series, the team will recreate the chaos and mayhem of those heady days of the show that broke the mould. TiSWAS REUNITED is new and exclusive to ITV42 , spring 42       The producers of the programme looked for people who were involved in the original series, whether they were in the audience, appeared as a guest, won a competition or in any other capacity. The TiswasOnline website helped with these searches , and people could submit their details directly to the production team and apply to be in the cage.     A new logo for the programme was produced - it features the regular zig-zag logo with Reunited rubber-stamp ed across it.     The official Tiswas Reunited mini-site features exclusive material about the making of the programme, as well as blogs by those who took part in the programme itself     The ITV broadcast referred only briefly to John Asher and Trevor East, the programmes original presenters, and omitted to make any reference to the eighth and final series       Tiswas was a pioneer for childrens television, making its way to shop shelves. Books, T-shirts, a regular magazine, an album, various singles and even a ceramic money box have all been daubed with the Tiswas logo.       A magazine counterpart was produced with interviews with cast, quizzes and letters. This appeared initially as Tiswas Family Fun Book at the beginning of 42 and developed into Tiswas Magazine from September 42 to coincide with the final series.       Four annual hardbook books were produced in Tiswass later years. Presenter/performer John Gorman wrote the first three , with Ollie Spencer writing the 42 edition .       In the early 42s, three VHS compilations were made available. The majority of Tiswas never survived as recordings, but among collectors, some with the earliest domestic VCRs, and some studio copies of later editions.     These compilations werent like ordinary editions of Tiswas, in that non-original content such as music videos, film clips and cartoons were stripped out. Original features like competition spots and pop interviews were also excluded, in favour of highlighting the shows legacy to comedy and visual slapstick.       The first compilation, lasting about an hour, and purely full of comedy sketches from the series. Some of the most repeated clips from the series have made the grade for this compilation - notably some News Flash sketches with Lenny Henry as Trevor McDoughnut and the viewers letters clip where Sally James is pied and drenched in semolina, baked beans and custard. Moving slightly away from comedy, the music video for The Four Bucketeers Bucket Of Water song is included.       The second compilation continued in the same vein as the first. Frank Carson being soaked unexpectedly is a running gag, and there is a full rendition of Bright Eyes from Matthew Butler. A music video for The Four Bucketeers Water Is Wonderful ends the compilation.       This was targeted at the stand-up comedy VHS market at the time, and the inlay cover made great mention of comic legends appearances, such as Spike Milligan , Michael Palin and Bernard Manning . Content-wise, it is very similar to the previous two compilations, with many sketches being performed by the Tiswas team. However, this compilation has no contribution from The Four Bucketeers.       In addition to the Tiswas Reunited DVD, released by ITV DVD a week after transmission of the 42 programme, the only other Tiswas DVD available is The Best of Tiswas.     Issued in October 42 by Network DVD, The Best of Tiswas was a straight DVD issuing of the three VHS compilations - Best of the Best Bits, More of the Best Bits and Comedy Capers. Being on DVD format, the incentive over the VHS version is one of picture quality. However, due to the rarity of some Tiswas material there is some understandably rough-looking footage here and there. Additionally the More of the Best Bits": null
    }
]