[
    {
        "Tongan narrative  is a variant of a more general ": null
    },
    {
        "Polynesian narrative": "polynesian narrative"
    },
    {
        " in ": null
    },
    {
        "Tonga": "tonga"
    },
    {
        ".       In the beginning there was just the sea, and the spirit world, ": null
    },
    {
        "Pulota": "pulota"
    },
    {
        "; and between them was a rock called Touiao Futuna. On the rock lived Biki and his twin sister, Kele, Atungaki and his twin sister, Maimoao Longona, Fonuauta and his twin sister, Fonuavai, and Hemoana and his twin sister, Lupe. Biki lay with his own sister and she bore him two children, a son, Taufulifonua, and a daughter, Havea Lolofonua; Atungaki also lay with his sister, who bore him a daughter, Velelahi; and Fonuauta lay with his sister and she bore him a daughter, Velesii.     When Taufulifonua grew to manhood, his sister, Havea Lolofonua, bore him a son, ": null
    },
    {
        "Hikule   o": "hikuleo"
    },
    {
        ", ": null
    },
    {
        "Tangaloa": "tangaloa"
    },
    {
        " and ": null
    },
    {
        "Maui": "maui"
    },
    {
        " divided the creation between them. Hikuleo took as his portion, Pulotu, Tangaloa took the sky and Maui the underworld. Hemoana, whose form the ": null
    },
    {
        "sea snake": "sea snake"
    },
    {
        ", and Lupe, whose form was a dove, then divided the remainder between them, Hemoana taking the sea and Lupe taking the land.     Tangaloa had several sons in the sky: Tangaloa Tamapouli Alamafoa, Tangaloa Eitumatupua, Tangaloa Atulongolongo and Tangaloa Tufunga. Old Tangaloa grew tired of looking down from the sky and seeing nothing but sea, so he sent down Tangaloa Atulongolongo in the form of a plover to see if he could find land. All Tangaloa Atulongolongo could find was a reef below the water, where Ata is now. So old Tangaloa told Tangaloa Tufunga to throw down into the sea the chips from the wood carving on which he was working. Tangaloa Tufunga continued to do this for a long time, and on two occasion Tangaloa Atulongolongo flew down in the form of a plover to see if anything had happened, but found nothing. On the third occasion, however, he found that the chips had formed an island. This was ": null
    },
    {
        "Eua": "ʻeua"
    },
    {
        ". Later, Tangaloa Tufunga threw down more chips to form the islands of ": null
    },
    {
        "Kao": "kao"
    },
    {
        " and ": null
    },
    {
        "Tofua": "tofua"
    },
    {
        ".     ": null
    },
    {
        "Tongatapu": "tongatapu"
    },
    {
        " and most of the other islands were the work of Maui. One day maui visited Manuka  and there an old man, Tonga Fusifonua, gave him a fish-hook. Maui went fishing with this hook, but when he tried to pull in his line he found it was caught. He exerted all his strength and succeeded in hauling the line in, to find that he had dragged up Tongatapu from the bottom of the sea. Maui continued fishing with this wonderful hook and so pulled up from the deeps the rest of the islands of Tonga, and some of those of ": null
    },
    {
        "Fiji": "fiji"
    },
    {
        " and ": null
    },
    {
        "Samoa": "samoan islands"
    },
    {
        " as well.     ": null
    },
    {
        "Ata": "ata"
    },
    {
        " began as a reef below the water and slowly rose out of the sea. One day Tangaloa   Atulonglongo visited Ata in the form of a plover and dropped a seed from the beak upon the island. the next time he visited Ata he found that the seed had grown into a creeper that covered the island. He pecked at the root of this creeper until it split in two. Then he returned to the sky. A few days later he returned to find that the root had rotted and a fat, juicy worm was curled up in it. He pecked the worm in two. From the top section a man was formed called Kohai. The bottom section also turned into a man called Koau. Then the plover felt a morsel left on his beak; he shook it off and it turned into a man called Momo. ": null
    },
    {
        "Kohai, Koau and Momo": "kohai, koau, mo momo"
    },
    {
        " were the first men in Tonga. Maui brought them wives from Pulotu and they became the ancestors of the ": null
    },
    {
        "Tonga people": "tonga people"
    },
    {
        ".         ": null
    },
    {
        "Ahoeitu": "ahoeitu"
    },
    {
        " Aitu": "aitu"
    },
    {
        " Eua": "eua"
    },
    {
        " Hikuleo": "hikuleo"
    },
    {
        " Ilaheva": "ilaheva"
    },
    {
        " Kae and Longopoa": "kae and longopoa"
    },
    {
        " Kohai, Koau, mo Momo": "kohai, koau, mo momo"
    },
    {
        " Laufakanaa": "laufakanaa"
    },
    {
        " Maui": "maui"
    },
    {
        " Niuatoputapu": "niuatoputapu"
    },
    {
        " Sangone": "sangone"
    },
    {
        " Seketoa": "seketoa"
    },
    {
        " Tafahi": "tafahi"
    },
    {
        " Tamapoulialamafoa": "tamapoulialamafoa"
    },
    {
        " Tangaloa": "tangaloa"
    },
    {
        " Tuitatui": "tuitatui"
    },
    {
        " Ata": "ata"
    },
    {
        " Limu": "limu"
    }
]