[
    {
        "Top 42 is a ": null
    },
    {
        "superhero": "superhero"
    },
    {
        " comic book": "comic book"
    },
    {
        " limited series": "limited series"
    },
    {
        " published by the ": null
    },
    {
        "Americas Best Comics": "americas best comics"
    },
    {
        " imprint of ": null
    },
    {
        "Wildstorm": "wildstorm"
    },
    {
        ", itself an imprint of ": null
    },
    {
        "DC Comics": "dc comics"
    },
    {
        ". Written by ": null
    },
    {
        "Alan Moore": "alan moore"
    },
    {
        " and illustrated by ": null
    },
    {
        "Gene Ha": "gene ha"
    },
    {
        " and ": null
    },
    {
        "Zander Cannon": "zander cannon"
    },
    {
        ", the series details the lives and work of the police force of Neopolis, a city in which almost everyone, from the police and criminals to civilians, children and even pets, has super powers and colourful costumes.     The series led to the production of several spin-offs;  Smax , which was set directly after the series conclusion;  Top 42: The Forty-Niners , which is set in 42; Top Ten: Beyond the Farthest Precinct, which is set five years after the series conclusion; and Top Ten Season Two, penned by Zander Cannon.       The story revolves around the day-to-day lives of the police officers at the 42th Precinct Police Station and is similar in tone to classic television police dramas like  Hill Street Blues , which Moore has described as an influence. The book also addresses a wide range of prejudices and issues, but with a science-fiction twist; monsters, robots and fantasy creatures often face the bigotry and problems faced by real-world human minorities.     The series includes several comic-book references and visual sight gags relating to the genre. For example, a caped street-corner watch-vendor uses a cardboard sign advertising ": null
    },
    {
        "signal watches": "jimmy olsenfictional character profile"
    },
    {
        " , and a hot-dog vendor cooks his wares with heat vision. One plotline involves a boy-band called Sidekix whose hit single was called Holy Broken Hearts . Likewise, most advertising, signage and graffiti in the Top 42 universe contains references to the world of comic books and super powers and crowd scenes usually feature many characters from ": null
    },
    {
        "sci-fi": "science fiction"
    },
    {
        " and comic books.     The primary Top 42 series was a 42-issue series between ": null
    },
    {
        "42": "2000 in comics"
    },
    {
        " and ": null
    },
    {
        "42": "2001 in comics"
    },
    {
        ". Follow-ups included ": null
    },
    {
        "42": "2003 in comics"
    },
    {
        "s 42-issue mini-spinoff  Smax  and ": null
    },
    {
        "42": "2005 in comics"
    },
    {
        "s ": null
    },
    {
        "graphic novel": "graphic novel"
    },
    {
        "  Top 42: The Forty-Niners . 42 also saw the publication of a 42-issue ": null
    },
    {
        "mini-series": "limited series"
    },
    {
        ", written by ": null
    },
    {
        "Paul Di Filippo": "paul di filippo"
    },
    {
        " and illustrated by ": null
    },
    {
        "Jerry Ordway": "jerry ordway"
    },
    {
        ", titled Top 42: Beyond the Farthest Precinct.     In 4242 another 42-issue series, Top 42: Season Two, was written by Zander Cannon and ": null
    },
    {
        "Kevin Cannon": "kevin cannon"
    },
    {
        ", with art by Gene Ha. A single issue Special set Two weeks later was also produced.                         Fresh from the academy, ": null
    },
    {
        "Robyn Toybox Slinger": "list of characters from top 10officer robyn   toybox   slinger"
    },
    {
        " is headed for her first day on the job at Precinct 42 home of Neopolis finest. Despite a cold reception from her new partner ": null
    },
    {
        "Jeff Smax": "smax"
    },
    {
        ", Robyn quickly helps with investigating the scene of a homicide in the robot ghetto, Tin Town. The dead man, Stefan Saddles Graczik, leads the police to a known drug factory, headed by none other than Professor Gromolko, an original architect of the city. When a telepath is brought in to interrogate the evil scientist, the drug peddler shoots himself with ": null
    },
    {
        "Dust Devil": "list of characters from top 10officer duane   dust devil   bodine"
    },
    {
        "s pistol.     The next day, ": null
    },
    {
        "Shock-headed Pete": "list of characters from top 10officer peter   shock-headed peter   cheney"
    },
    {
        " and Dust Devil discover the body of a local prostitute with her head severed, indicating the horrific Libra killer is back. Elsewhere, ": null
    },
    {
        "Detective Synaesthesia": "list of characters from top 10detective wanda   synaesthesia   jackson"
    },
    {
        " gets the idea to use ": null
    },
    {
        "zen": "zen"
    },
    {
        " taxi driver ": null
    },
    {
        "Blindshot": "list of characters from top 10bob   blindshot   booker"
    },
    {
        " to track down Marta Boots Wesson, girlfriend and associate of Saddles. Boots reveals that Gromolko had a special delivery for a unique client. At the museum hideout where Boots and Saddles had been staying, a metal canister is found containing some unknown, radioactive drug.     Back at the station, ": null
    },
    {
        "Hyperdog": "list of characters from top 10sergeant kemlo   hyperdog   caesar"
    },
    {
        " and ": null
    },
    {
        "Peregrine": "list of characters from top 10lieutenant cathy   peregrine   colby"
    },
    {
        " interview Annette Neural Nette Duvalle, a prostitute who was able to survive an encounter with Libra. She leads Hyperdog and Peregrine, along with Dust Devil, Shock-headed Pete and ": null
    },
    {
        "Jack Phantom": "list of characters from top 10sergeant jackie   jack phantom   kowalski"
    },
    {
        ", to the sewers near where she encountered her attacker. The police are able to arrest Libra, who is revealed to be former ": null
    },
    {
        "science hero": "superhero"
    },
    {
        " Mrrgla Qualtz": "list of characters from top 10mrrgla qualtz, the libra killer"
    },
    {
        ", an alien shapeshifter who assumed her natural form to feed during her metamorphic period.          After Qualtzs arrest, several of her former Seven Sentinels teammates come to give her their support, as well as political and legal aid. Even as she professes her innocence, Qualtz continues to use her telepathic powers to try and trick officers into freeing her from captivity. Meanwhile, ": null
    },
    {
        "King Peacock": "list of characters from top 10detective john   king peacock   corbeau"
    },
    {
        " travels to Grand Central, a parallel dimension where the Roman Empire never fell and is filled with countless ": null
    },
    {
        "Roman myth": "roman myth"
    },
    {
        "-based creatures. It was here that Saddles was to deliver the drug, but before Peacock can investigate anything, he is drafted into an inter-precinct gladiatorial contest due to a seeming bureaucratic oversight. Though he is victorious, King Peacock despairs that he had to assault and even kill fellow law officers.     Smax and Toybox are called to the scene of an apparent suicide, only to discover the victim, a ": null
    },
    {
        "sidekick": "sidekick"
    },
    {
        " boy band": "boy band"
    },
    {
        " star, was murdered. Back at headquarters, the precinct welcomes ": null
    },
    {
        "Commissioner Ultima": "list of characters from top 10commissioner ultima"
    },
    {
        ", visiting from Grand Central for an inspection. ": null
    },
    {
        "Detective Synaesthesias": "list of characters from top 10detective wanda   synaesthesia   jackson"
    },
    {
        " special senses reveal that Ultima was involved in the drug dealings, likely having King Peacock placed in the competition to keep him from investigating. Ultima goes berserk in resisting arrest, killing ": null
    },
    {
        "Girl One": "list of characters from top 10officer li   girl one   sung"
    },
    {
        ", Mrrgla Qualtz and injuring Toybox before she can be brought down by forcibly giving her the drug and causing her to overdose.     In the aftermath of the commissioners attack, ": null
    },
    {
        "Joe Pi": "list of characters from top 10officer joe pi"
    },
    {
        " from Precinct 42 is transferred to replace Girl One. Despite the antagonism against Pi, both for the place he occupies and his Ferro-American heritage, he quickly establishes himself as a capable policeman. After some digging, Peregrine and Jack Phantom discover that Glenn Bluejay Garland, the murdered pop star, was connected to the Seven Sentinels. He was about to sell his life story just before being killed, and investigation into his and Mrrglas past with the Seven Sentinels reveals the dark secret behind the group: the Seven Sentinels are not a superhero group, but a pedophile ring, having faked all of their famous battles and used the Young Sentinels as sexual slaves. Mrrglas old newsreels even contain clips of Sentinels being serviced.     The precinct moves to swiftly arrest all the Sentinels, but their leader, Atoman, is tipped off. Locking himself in his Impregnium shielded lair, Atoman seems to be out of the reach of the law, and ": null
    },
    {
        "Irma Geddon": "list of characters from top 10officer irma   irmageddon   wornow"
    },
    {
        " laments that even if he were to be convicted, Atomans long lifespan would allow him to walk free, even with consecutive murder charges. Joe Pi then talks to Atoman through an intercom and subtly convinces him to kill himself, rather than face trial, be stripped of his powers, and go to prison with revenge-seeking supervillains. As the events of the past few weeks wind down, Smax visits Toybox in the hospital, asking her to accompany him to his home dimension in order to attend a funeral; Hyperdog starts a relationship with Neural Nette; and Captain Traynor returns home to his loving partner, former Skyshark pilot, Wulf.     Beyond the Farthest Precinct": null
    },
    {
        "Smax mini-series": "smax"
    },
    {
        ", Precinct 42 is celebrating another year of hard work at their annual labor day picnic. The festivities are broken up by the appearance of a large avatar in the sky, nicknamed the Hell Ditch Pilgrim . The next day, as new officers are paired with veterans, Toybox goes looking for the Rumor, anxious to thank him for rescuing her from Ultima years ago. Unfortunately, she cannot find him, but new officer Hoodoo Priest informs he knows of the Rumor and alludes to his divine role.     Officer Joe Pi is reconfigured as a lesser form to investigate a new strain of robot drug that seems connected to the Hell Ditch Pilgrim. After giving Joe Pi his new assignment, Captain Traynor is called to the mayors office, where he is summarily fired and replaced with the more hawkish Sean Cindercott. Cindercott soon initiates a number of sweeping reforms, instituting radio check-ins every quarter-hour, less focus on street-level crime in favor of rooting out subversive elements, no non-essential visitors at the station , mandatory overtime with base pay, no contact with the media, and ceasing of routine maintenance of officers personal equipment. Finally, all officers are asked to sign a ten-page loyalty oath. The officers are polarized by these decisions, with a large number signing a letter of resignation, until Hyperdog convinces them all to stay.     Joe Pi reports back, after accidentally having experienced the effects of the dark energy capsules firsthand. The darkshots create a direct mental connection between any cybernetic intelligence and an extra-dimensional entity. The drugs are being created in a federal lab called Project JOOTS, where Irmageddons husband works. Irmas husband, Ron, explains the basic goal: the scientists are investigating superspace , the underlying region that seems to bind all timelines in the multiverse. In superspace, dark energy is the force that holds the multiverse together, as well as having other properties. A robot worker, named Rikby42 has been using dark energy to create and distribute the drug, but he purposefully overdoses and transcends this plane rather than talk.     After the precinct thwarts a minor attack by a group of anarchic derridadaists, they have to deal with the Hell Ditch Pilgrim spreading his influence and destructive insanity through all the entities in Neopolis, including fellow officers. While Cindercott wishes to make a beeline for city hall to protect the mayor, the officers know they have to attack the problem at its source: superspace. But without any means to breach superspace, they cannot fight the Hell Ditch Pilgrim, until the Rumor shows up. He informs Top 42 that Andy Airbag Soames, who five years ago contracted S.T.O.R.M.S. , was so radically altered by the disease as to become a creature capable of entering and controlling superspace. The Rumor says that Toybox is the only one that can harm Soames, because she carries her mothers gift: ": null
    },
    {
        "Pandoras Box": "pandoras box"
    },
    {
        ". The Rumor helps the officers bridge the gap left by Project JOOTS technology and send Toybox into superspace. When Toybox faces Andy alone, she unleashes all of her toys to protect herself, and then reveals the final thing left in Pandoras Box that can heal Andy Soames desperate mind: Hope. Smax rushes through the makeshift portal to grab his partner, escaping just before the effects backlash throughout superspace.     A few months after the events of the Hell Ditch Pilgrim case, Hyperdog is Traynors replacement as Captain of Precinct 42 Robyn Slinger is no longer Toybox, and the fascist Mayor Famaille and Major Cindercott are out of power, casualties of the reality warping by Andy Soames, who now peacefully overlooks Top 42 as they once again celebrate survival and hopeful perseverance in a crazy and confusing beautiful world.       A new officer, Slipstream Phoenix, joins as well as Girl Two, who replaces Girl One. The new commissioner, David Moon Gilbert, enforces stricter regulations to the dismay of some officers. Irma Wornow is suspended for breaking the new regulations. Shock-headed Pete is dismissed after he destroys Joe Pis body while attacking Slipstream Phoenix.            Smax , The comical 42 mini-series by ": null
    },
    {
        "Alan Moore": "alan moore"
    },
    {
        " and ": null
    },
    {
        "Zander Cannon": "zander cannon"
    },
    {
        ", took Smax, accompanied by his partner, Toybox, back to his home dimension, a world based on the conventions and clichés of ": null
    },
    {
        "fantasy": "fantasy"
    },
    {
        ". This was set immediately after the original series.        Top 42: The Forty-Niners  , a graphic novel by ": null
    },
    {
        "Alan Moore": "alan moore"
    },
    {
        " and ": null
    },
    {
        "Gene Ha": "gene ha"
    },
    {
        " detailing the origins of Neopolis and the first officers of Top 42       Deadfellas, a short story in which Neopoliss finest take on vampire gangsters, written by Moore and drawn by Cannon, that appeared in Americas Best Comics 42 Page Special .       The Top 42 series has so far been collected in:   Top 42: Book One   Hardcover editions    Paperback editions    Top 42: Book Two   Hardcover editions    Paperback editions    Smax   Hardcover editions    Paperback editions    Top 42: The Forty-Niners  &  & issues 42–42 & ": null
    }
]