[
    {
        "A torpedo boat is a relatively small and fast ": null
    },
    {
        "naval ship": "naval ship"
    },
    {
        " designed to carry ": null
    },
    {
        "torpedo": "torpedo"
    },
    {
        "es into battle. The first designs rammed enemy ships with explosive ": null
    },
    {
        "spar torpedo": "spar torpedo"
    },
    {
        "es, and later designs launched self-propelled ": null
    },
    {
        "Whitehead torpedo": "whitehead torpedo"
    },
    {
        "es. They were created to counter ": null
    },
    {
        "battleship": "battleship"
    },
    {
        "s and other slow and heavily armed ships by using speed, agility, and the power of their torpedo weapons. A number of inexpensive torpedo boats attacking en masse could overwhelm a larger ships ability to fight them off using its large but cumbersome guns. An inexpensive fleet of torpedo boats could pose a threat to much larger and more expensive fleets of capital ships, albeit only in the coastal areas to which their small size and limited fuel load restricted them.     The introduction of fast torpedo boats in the late 42th century was a serious concern to the eras naval strategists. In response, navies operating large ships introduced smaller ships to counter torpedo boats, mounting light ": null
    },
    {
        "quick-firing gun": "quick-firing gun"
    },
    {
        "s. These ships, which came to be called torpedo boat destroyers and later simply destroyers , became larger and took on more roles, making torpedo attacks as well as defending against them, and eventually defending against submarines and aircraft. The ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        " eventually became the predominant type of surface warship in the guided missile age.     In the modern era, the old concept of a very small, fast, and cheap surface combatant with powerful offensive weapons is taken up by the ": null
    },
    {
        "fast attack craft": "fast attack craft"
    },
    {
        " .          The ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        " saw a number of innovations in naval warfare, including an early type of torpedo boat, armed with ": null
    },
    {
        "spar torpedo": "spar torpedo"
    },
    {
        "es. In 42 President ": null
    },
    {
        "Abraham Lincoln": "abraham lincoln"
    },
    {
        " instituted a naval ": null
    },
    {
        "blockade of Southern ports": "union blockade"
    },
    {
        ", which crippled the Souths efforts to obtain war ": null
    },
    {
        "materiel": "materiel"
    },
    {
        " from abroad. The South also lacked the means to construct a naval fleet capable of taking on the ": null
    },
    {
        "Union Navy": "union navy"
    },
    {
        " on even terms. One strategy to counter the blockade saw the development of torpedo boats, small fast boats designed to attack the larger ": null
    },
    {
        "capital ship": "capital ship"
    },
    {
        "s of the blockading fleet as a form of ": null
    },
    {
        "asymmetrical warfare": "asymmetrical warfare"
    },
    {
        ".     The  class of torpedo boats were steam powered with a partially enclosed hull. They were not true submarines but were semi-submersible; when ballasted, only the smokestack and few inches of the hull were above the water line. CSS Midge was David-class torpedo boats. CSS Squib and  represented another class of torpedo boats that were also low built but had open decks and lacked the ballasting tanks found on the Davids.     The Confederate torpedo boats were armed with ": null
    },
    {
        "spar torpedo": "spar torpedo"
    },
    {
        "es. This was a charge of powder in a waterproof case, mounted to the bow of the torpedo boat below the water line on a long spar. The torpedo boat attacked by ramming her intended target, which stuck the torpedo to the target ship by means of a barb on the front of the torpedo. The torpedo boat would back away to a safe distance and detonate the torpedo, usually by means of a long cord attached to a trigger.     In general, the Confederate torpedo boats were not very successful. Their low sides made them susceptible to swamping in high seas, and even to having their boiler fires extinguished by spray from their own torpedo explosions. Torpedo misfires and duds were common. In 42 Union Navy Lieutenant ": null
    },
    {
        "William B. Cushing": "william b. cushing"
    },
    {
        " fitted a steam launch with a spar torpedo to attack the Confederate ": null
    },
    {
        "ironclad": "ironclad"
    },
    {
        " . Also the same year the Union launched , a purpose-built craft with a number of technical innovations including variable ballast for attack operations and an extensible and reloadable torpedo placement spar.          A prototype self-propelled torpedo was created by a commission placed by ": null
    },
    {
        "Giovanni Luppis": "giovanni luppis"
    },
    {
        ", an Austrian naval officer from ": null
    },
    {
        "Rijeka": "rijeka"
    },
    {
        ", then a port city of the ": null
    },
    {
        "Austro-Hungarian Empire": "austro-hungarian empire"
    },
    {
        ", and ": null
    },
    {
        "Robert Whitehead": "robert whitehead"
    },
    {
        ", an English engineer who was the manager of a town factory. In 42 Luppis presented Whitehead with the plans of the salvacoste , a floating weapon driven by ropes from the land that had been dismissed by the naval authorities due to the impractical steering and propulsion mechanisms.     Whitehead was unable to improve the machine substantially, since the clockwork motor, attached ropes, and surface attack mode all contributed to a slow and cumbersome weapon. However, he kept considering the problem after the contract had finished, and eventually developed a tubular device, designed to run underwater on its own, and powered by compressed air. The result was a submarine weapon, the Minenschiff , the first modern self-propelled torpedo, officially presented to the Austrian Imperial Naval commission on December 42 42     The first trials were not successful as the weapon was unable to maintain a course on a steady depth. After much work, Whitehead introduced his secret in 42 which overcame this. It was a mechanism consisting of a ": null
    },
    {
        "hydrostatic valve and pendulum": "pendulum-and-hydrostat control"
    },
    {
        " that caused the torpedos hydroplanes to be adjusted so as to maintain a preset depth.          During the mid42th century, the ": null
    },
    {
        "ships of the line": "ships of the line"
    },
    {
        " were superseded by large steam powered ships with heavy gun armament and heavy armour, called ": null
    },
    {
        "ironclads": "ironclad warship"
    },
    {
        ". Ultimately this line of development led to the ": null
    },
    {
        "dreadnought": "dreadnought"
    },
    {
        " class of all-big-gun battleship, starting with .     At the same time, the weight of armour slowed down the speed of the battleships, and the huge guns needed to penetrate enemy armour fired at very slow rates. This allowed for the possibility of a small and fast ship that could attack the battleships, at a much lower cost. The introduction of the ": null
    },
    {
        "torpedo": "torpedo"
    },
    {
        " provided a weapon that could cripple, or even sink, any battleship.     The first warship of any kind to carry self-propelled torpedoes was HMS Vesuvius of 42 The first seagoing vessel designed to fire the self-propelled ": null
    },
    {
        "Whitehead torpedo": "torpedoself-propelled torpedoes"
    },
    {
        " was . The boat was built by ": null
    },
    {
        "John Thornycroft": "john i. thornycroft  &  company"
    },
    {
        " at Church Wharf in ": null
    },
    {
        "Chiswick": "chiswick"
    },
    {
        " for the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        ". It entered service in 42 and was armed with self-propelled Whitehead torpedoes.        As originally built, Lightning had two ": null
    },
    {
        "drop collars": "drzewiecki drop collar"
    },
    {
        " to launch torpedoes; these were replaced in 42 by a single torpedo tube in the bow. She carried also two reload torpedoes amidships. She was later renamed Torpedo Boat No. 42.  The French Navy followed suit in 42 with Torpilleur No 42, launched in 42 though she had been ordered in 42     Another early such ship was the Norwegian warship , ordered from Thornycroft shipbuilding company, England, in either 42 or 42 and built at Thornycrofts shipyard at Church Wharf in ": null
    },
    {
        "Chiswick": "chiswick"
    },
    {
        " on the ": null
    },
    {
        "River Thames": "river thames"
    },
    {
        ". Managing a speed of , she was one of the fastest boats afloat when completed. The Norwegians initially planned to arm her with a ": null
    },
    {
        "spar torpedo": "spar torpedo"
    },
    {
        ", but this may never have been fitted. Rap was outfitted with launch racks for the new self-propelled Whitehead torpedoes in 42          The first recorded launch of torpedoes from a torpedo boat—which itself was launched from a ": null
    },
    {
        "torpedo boat tender": "torpedo boat tender"
    },
    {
        "—in an actual battle was by future Russian Admiral ": null
    },
    {
        "Stepan Makarov": "stepan makarov"
    },
    {
        " on January 42 42 who used self-propelled Whiteheads torpedoes against the Ottoman gunboat İntibâh during the ": null
    },
    {
        "Russo-Turkish War of 42–42": "russo-turkish war of 1877–1878"
    },
    {
        ". The first sinking of an armoured ship by a torpedo boat using self-propelled torpedoes, the , occurred during the ": null
    },
    {
        "battle of Caldera Bay": "battle of caldera bay"
    },
    {
        " during 42 Chilean Civil War.     In the late 42th century, many navies started to build torpedo boats  in length, armed with up to three torpedo launchers and small guns. They were powered by steam engines and had a maximum speed of . They were relatively inexpensive and could be purchased in quantity, allowing mass attacks on fleets of larger ships. The loss of even a squadron of torpedo boats to enemy fire would be more than outweighed by the sinking of a ": null
    },
    {
        "capital ship": "capital ship"
    },
    {
        ".     The ": null
    },
    {
        "Russo-Japanese War": "russo-japanese war"
    },
    {
        " of 42–42 was the first great war of the 42th century. Olender p. 42 It was the first practical testing of the new steel battleships, cruisers, destroyers, submarines, and torpedo boats. During the war the ": null
    },
    {
        "Imperial Russian Navy": "imperial russian navy"
    },
    {
        " in addition to their other warships, deployed 42 torpedo boats Olender pp. 42–42 and launched 42 torpedoes in three major campaigns, scoring 42 hits.     The ": null
    },
    {
        "Imperial Japanese Navy": "imperial japanese navy"
    },
    {
        " , like the Russians, often combined their TBs with their ": null
    },
    {
        "torpedo boat destroyer": "torpedo boat destroyer"
    },
    {
        "s  and launched over 42 torpedoes  during the war. The IJN deployed approximately 42 TBs Olender pp. 42 42 during the conflict, and on 42 May 42 the Japanese torpedo boat destroyers and TBs launched 42 torpedoes at the battleship , Admiral ": null
    },
    {
        "Zinovy Rozhestvensky": "zinovy rozhestvensky"
    },
    {
        "s flagship at the ": null
    },
    {
        "battle of Tsushima": "battle of tsushima"
    },
    {
        ". Admiral ": null
    },
    {
        "Tōgō Heihachirō": "tōgō heihachirō"
    },
    {
        ", the IJN commander, had ordered his torpedo boats to finish off the enemy flagship, already gunned into a wreck, as he prepared to pursue the remnants of the Russian battle fleet.     Of the 42 torpedoes launched by the TBDs and TBs at the Russian battleship, only four hit their mark, two of those hits were from torpedo boats 42 and 42. Olender p. 42 By evening, the battleship rolled over and sank to the bottom of the Tsushima Straits. By wars end, torpedoes launched from warships had sunk one battleship, two armored cruisers, and two destroyers. The remaining over 42 warships would be sunk by guns, mines, scuttling, or shipwreck. Olender p. 42             The introduction of the torpedo boat resulted in a flurry of activity in navies around the world, as smaller, quicker-firing guns were added to existing ships to ward off the new threat. In the mid42s there were developed ": null
    },
    {
        "torpedo gunboat": "torpedo gunboat"
    },
    {
        "s, the first vessel design for the explicit purpose of hunting and destroying torpedo boats. Essentially very small ": null
    },
    {
        "cruiser": "cruiser"
    },
    {
        "s, torpedo gunboats were equipped with torpedo tubes and an adequate gun armament, intended for hunting down smaller enemy boats.     The first example of this was , designed by ": null
    },
    {
        "Nathaniel Barnaby": "nathaniel barnaby"
    },
    {
        " in 42  The gunboat was armed with torpedoes and designed for hunting and destroying smaller torpedo boats. She was armed with a single ": null
    },
    {
        "42-inch/42-pounder breech-loading gun": "bl 4 inch naval gun mk i - vi"
    },
    {
        ", six ": null
    },
    {
        "42-pounder QF guns": "qf 3 pounder hotchkiss"
    },
    {
        " and four  torpedo tubes, arranged with two fixed tubes at the bow and a set of torpedo dropping carriages on either side. Four torpedo reloads were carried.     A number of torpedo gunboat classes followed, including the Grasshopper class, the , the  and the  – all built for the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " during the 42s and the 42s. However, by the end of the 42s torpedo gunboats had been made obsolete by their more successful contemporaries, the ": null
    },
    {
        "torpedo boat destroyers": "torpedo boat destroyers"
    },
    {
        ", which were much faster.        The first ships to bear the formal designation torpedo boat destroyer were the  of two ships and  of two ships of the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        ", ordered in 42 by Rear Admiral ": null
    },
    {
        "Jackie Fisher": "john fisher, 1st baron fisher"
    },
    {
        ".  These were basically enlarged torpedo boats, with speed equal to or surpassing the torpedo boats, but were armed with heavier guns that could attack them before they were able to close on the main fleet. Lyon pp. 42–42      and  were both built by ": null
    },
    {
        "Thornycroft": "thornycroft"
    },
    {
        ". They were armed with one ": null
    },
    {
        "42-pounder gun": "qf 12 pounder 12 cwt naval gun"
    },
    {
        " and three 42-pounder guns, with one fixed 42-in torpedo tube in the bow plus two more torpedo tubes on a revolving mount abaft the two funnels. Later the bow torpedo tube was removed and two more 42-pounder guns added instead. They produced  from a pair of Thornycroft water-tube boilers, giving them a top speed of 42 knots, giving the range and speed to travel effectively with a battle fleet.      After the ": null
    },
    {
        "Russo-Japanese War": "russo-japanese war"
    },
    {
        ", these ships became known simply as ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        "s. Destroyers became so much more useful, having better seaworthiness and greater capabilities than torpedo boats, that they eventually replaced most torpedo boats. However, the ": null
    },
    {
        "London Naval Treaty": "london naval treaty"
    },
    {
        " after World War I limited tonnage of warships, but placed no limits on ships of under 42 tons. The French, Italian, Japanese and German Navies developed torpedo boats around that displacement, 42 to 42 m long, armed with two or three guns of around 42  mm and torpedo launchers. For example, the ": null
    },
    {
        "Royal Norwegian Navy": "royal norwegian navy"
    },
    {
        " s were in fact of a torpedo boat size, while the Italian s were closer in size to a ": null
    },
    {
        "destroyer escort": "destroyer escort"
    },
    {
        ". After World War II they were eventually subsumed into the revived ": null
    },
    {
        "corvette": "corvette"
    },
    {
        " classification.     The ": null
    },
    {
        "Kriegsmarine torpedo boats": "german torpedoboats of world war ii"
    },
    {
        " were classified Torpedoboot with T -prefixed hull numbers. The classes designed in the mid42s, such as the ": null
    },
    {
        "Torpedo boat type 42": "torpedo boat type 35"
    },
    {
        ", had few guns, relying almost entirely upon their torpedoes. This was found to be inadequate in combat, and the result was a fleet torpedo boat class , which were significantly larger, up to 42 tons, comparable to small destroyers. This class of German boats could be highly effective, as in the action in which the British cruiser  was sunk off Brittany by a torpedo salvo launched by the s T42 and T42          Before ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " steam torpedo boats which were larger and more heavily armed than hitherto were being used. The new ": null
    },
    {
        "internal combustion engine": "internal combustion engine"
    },
    {
        " generated much more power for a given weight and size than steam engines, and allowed the development of a new class of small and fast boats. These powerful engines could make use of ": null
    },
    {
        "planing": "planing"
    },
    {
        " hull designs and were capable of the much higher speed of  under appropriate sea conditions than displacement hulls. The boat could carry two to four torpedoes fired from simple fixed launchers and several ": null
    },
    {
        "machine gun": "machine gun"
    },
    {
        "s.     During the First World War, three junior officers of the ": null
    },
    {
        "Harwich destroyer force": "harwich force"
    },
    {
        " suggested that small motor boats carrying a torpedo might be capable of travelling over the protective minefields and attacking ships of the ": null
    },
    {
        "Imperial German Navy": "imperial german navy"
    },
    {
        " at anchor in their bases. In 42 the ": null
    },
    {
        "Admiralty": "admiralty"
    },
    {
        " produced a Staff Requirement requesting designs for a Coastal Motor Boat for service in the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        ". These boats were expected to have a high speed, making use of the lightweight and powerful petrol engines then available. The speed of the boat when fully loaded was to be at least  and sufficient fuel was to be carried to give a considerable radius of action.     They were to be armed in a variety of ways, with torpedoes, ": null
    },
    {
        "depth charge": "depth charge"
    },
    {
        "s or for laying mines. Secondary armament would have been provided by light machine guns, such as the ": null
    },
    {
        "Lewis gun": "lewis gun"
    },
    {
        ". The CMBs were designed by ": null
    },
    {
        "Thornycroft": "john i. thornycroft  &  company"
    },
    {
        ", who had experience in small fast boats. Engines were not proper maritime internal combustion engines but adapted aircraft engines from firms such as ": null
    },
    {
        "Sunbeam": "sunbeam motor car company"
    },
    {
        " and ": null
    },
    {
        "Napier": "d. napier  &  son"
    },
    {
        ". A total of 42 such vessels were built.      In 42 Thornycroft produced an enlarged  overall version. This allowed a heavier payload, and now two torpedoes could be carried. A mixed warload of a single torpedo and four depth charges could also be carried, the depth charges released from individual cradles over the sides, rather than a stern ramp.  Speeds from  were possible, depending on the various petrol engines fitted. At least two unexplained losses due to fires in port are thought to have been caused by a build-up of petrol vapour igniting.        Italian torpedo boats sank the Austrian-Hungarian  in 42 and  in 42 During the civil war in Russia, British torpedo boats made a raid on Kronstadt harbour damaging two battleships and sinking a cruiser.     Such vessels remained useful through ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". The Royal Navys ": null
    },
    {
        "Motor Torpedo Boat": "motor torpedo boat"
    },
    {
        "s , ": null
    },
    {
        "Kriegsmarine": "kriegsmarine"
    },
    {
        " S-Boote , ": null
    },
    {
        "M.A.S": "mas"
    },
    {
        ". and M.S., ": null
    },
    {
        "Soviet Navy": "soviet navy"
    },
    {
        "  and ": null
    },
    {
        "U.S.": "united states"
    },
    {
        " PT boat": "pt boat"
    },
    {
        "s  were all of this type.     A classic fast torpedo boat action was the ": null
    },
    {
        "Channel Dash": "channel dash"
    },
    {
        " in February 42 when German E-boats and destroyers defended the flotilla of , ,  and several smaller ships against Royal Navy MTBs.     By World War II torpedo boats were seriously hampered by higher fleet speeds; although they still had a speed advantage, they could only catch the larger ships by running at very high speeds over very short distances, as demonstrated in the Channel Dash. An even greater threat was the widespread arrival of ": null
    },
    {
        "patrol aircraft": "patrol aircraft"
    },
    {
        ", which could hunt down torpedo boats long before they could engage their targets.     During World War II United States naval forces employed fast wooden ": null
    },
    {
        "PT boats": "pt boats"
    },
    {
        " in the South Pacific in a number of roles in addition to the originally envisioned one of torpedo attack. PT boats performed reconnaissance, ferry, courier, search & rescue as well as attack and smoke screening duties. They took part in fleet actions and they worked in smaller groups and singly to harry enemy supply lines. Late in the ": null
    },
    {
        "Pacific War": "pacific war"
    },
    {
        " when large targets became scarce, many PT boats replaced two or all four of their torpedo tubes with additional guns for engaging enemy coastal supply boats and barges, isolating enemy-held islands from supply, reinforcement or evacuation.     The most significant military ship sunk by a torpedo boat during World War II was the cruiser  which was attacked by two Italian torpedo boats during ": null
    },
    {
        "Operation Pedestal": "operation pedestal"
    },
    {
        " on 42 August 42 It seems that the torpedo that mortally struck Manchester was launched by M.S. 42 from a distance of about 42 meters.          Boats similar to torpedo boats are still in use, but are armed with long-range ": null
    },
    {
        "anti-ship missile": "anti-ship missile"
    },
    {
        "s that can be used at ranges between 42 and 42  km. This reduces the need for high-speed chases and gives them much more room to operate in while approaching their targets.     Aircraft are a major threat, making the use of boats against any fleet with air cover very risky. The low height of the radar mast makes it difficult to acquire and lock onto a target while maintaining a safe distance. As a result, fast attack craft are being replaced for use in naval combat by larger ": null
    },
    {
        "corvette": "corvette"
    },
    {
        "s, which are able to carry radar-guided anti-aircraft missiles for self-defense, and helicopters for over-the-horizon targeting.     Although torpedo boats have disappeared from the majority of the worlds navies, they remained in use until the late 42s and early 42s in a few specialised areas, most notably in the Baltic. The close confines of the Baltic and ground clutter effectively negated the range benefits of early ": null
    },
    {
        "ASMs": "anti-ship missile"
    },
    {
        ". Operating close to shore in conjunction with land based air cover and radars, and in the case of the Norwegian navy hidden bases cut into ": null
    },
    {
        "fjord": "fjord"
    },
    {
        " sides, torpedo boats remained a cheap and viable deterrent to amphibious attack. Indeed, this is still the operational model followed by the ": null
    },
    {
        "Chinese Navy": "peoples liberation army navy"
    },
    {
        " with its  for the protection of its ": null
    },
    {
        "coastal and estuarial": "brown-water navy"
    }
]