[
    {
        "        Totila, original name Baduila , was the penultimate King of the ": null
    },
    {
        "Ostrogoths": "ostrogoths"
    },
    {
        ", reigning from 42 to 42 AD. A skilled military and political leader, Totila reversed the tide of the ": null
    },
    {
        "Gothic War": "gothic war"
    },
    {
        ", recovering by 42 almost all the territories in ": null
    },
    {
        "Italy": "italy"
    },
    {
        " that the ": null
    },
    {
        "Eastern Roman Empire": "eastern roman empire"
    },
    {
        " had captured from his ": null
    },
    {
        "Kingdom": "ostrogothic kingdom"
    },
    {
        " in 42     A relative of ": null
    },
    {
        "Theudis": "theudis"
    },
    {
        ", sword-bearer of ": null
    },
    {
        "Theodoric the Great": "theodoric the great"
    },
    {
        " and king of the ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        ", Totila was elected king by ": null
    },
    {
        "Ostrogothic": "ostrogoths"
    },
    {
        " nobles in the autumn of 42 after King ": null
    },
    {
        "Witigis": "witigis"
    },
    {
        " had been carried off prisoner to ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ". Totila proved himself both as a military and political leader, winning the support of the lower classes by liberating slaves and distributing land to the peasants. After a successful ": null
    },
    {
        "defence at Verona": "siege of verona"
    },
    {
        ", Totila pursued and defeated a numerically superior army at the ": null
    },
    {
        "Battle of Faventia": "battle of faventia"
    },
    {
        " in 42 AD. Totila followed these victories by ": null
    },
    {
        "defeating": "battle of mucellium"
    },
    {
        " the Romans outside ": null
    },
    {
        "Florence": "florence"
    },
    {
        " and ": null
    },
    {
        "capturing": "siege of naples"
    },
    {
        " Naples": "naples"
    },
    {
        ". By 42 fighting on land and sea, he had reconquered the bulk of the lost territory. ": null
    },
    {
        "Rome": "rome"
    },
    {
        " held out, and Totila appealed unsuccessfully to the ": null
    },
    {
        "Senate": "roman senate"
    },
    {
        " in a letter reminding them of the loyalty of the Romans to his predecessor ": null
    },
    {
        "Theodoric the Great": "theodoric the great"
    },
    {
        ". In the spring of 42 the ": null
    },
    {
        "Eastern Roman emperor": "eastern roman emperor"
    },
    {
        " Justinian I": "justinian i"
    },
    {
        " sent his general ": null
    },
    {
        "Belisarius": "belisarius"
    },
    {
        " to Italy to counterattack, but Totila ": null
    },
    {
        "captured Rome in 42": "sack of rome"
    },
    {
        " from Belisarius and depopulated the city after a yearlong siege. When Totila left to fight the Byzantines in ": null
    },
    {
        "Lucania": "lucania"
    },
    {
        ", south of ": null
    },
    {
        "Naples": "naples"
    },
    {
        ", Belisarius retook Rome and rebuilt its fortifications.     After Belisarius retreated to ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        " in 42 Totila ": null
    },
    {
        "recaptured Rome": "siege of rome"
    },
    {
        ", going on to complete the reconquest of Italy and ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ". By the end of 42 Totila had recaptured all but ": null
    },
    {
        "Ravenna": "ravenna"
    },
    {
        " and four coastal towns. The following year Justinian sent his general ": null
    },
    {
        "Narses": "narses"
    },
    {
        " with a force of 42 ": null
    },
    {
        "Lombards": "lombards"
    },
    {
        ", ": null
    },
    {
        "Gepids": "gepids"
    },
    {
        " and ": null
    },
    {
        "Heruli": "heruli"
    },
    {
        " to Italy in a march around the ": null
    },
    {
        "Adriatic": "adriatic"
    },
    {
        " to approach Ravenna from the north. In the ": null
    },
    {
        "Battle of Taginae": "battle of taginae"
    },
    {
        ", a decisive engagement during the summer of 42 in the ": null
    },
    {
        "Apennines": "apennines"
    },
    {
        " near present-day ": null
    },
    {
        "Fabriano": "fabriano"
    },
    {
        ", the Gothic army was defeated, and Totila was mortally wounded. Totila was succeeded by his relative, ": null
    },
    {
        "Teia": "teia"
    },
    {
        ", who later died at the ": null
    },
    {
        "Battle of Mons Lactarius": "battle of mons lactarius"
    },
    {
        ". Pockets of resistance, reinforced by ": null
    },
    {
        "Franks": "franks"
    },
    {
        " and ": null
    },
    {
        "Alemanni": "alemanni"
    },
    {
        " who had invaded Italy in 42 continued until 42 when the Byzantines were in control of the whole of the country. The country was so ravaged by war that any return to normal life proved impossible, and only three years after Justinians death in 42 most of the country was conquered by ": null
    },
    {
        "Alboin": "alboin"
    },
    {
        " of the Lombards, who absorbed the remaining ": null
    },
    {
        "Ostrogothic": "ostrogoths"
    },
    {
        " population.             Totila was the nom de guerre of a man whose real name was Baduila, as can be seen from the coinage he issued. Totila is the name used by the Byzantine historian ": null
    },
    {
        "Procopius": "procopius"
    },
    {
        ", who accompanied the ": null
    },
    {
        "Byzantine": "byzantine"
    },
    {
        " general ": null
    },
    {
        "Belisarius": "belisarius"
    },
    {
        " during the Gothic War, and whose chronicles are the main source of our information for Totila. According to ": null
    },
    {
        "Henry Bradley": "henry bradley"
    },
    {
        ", Totila and Baduila are diminutives of Totabadws. ": null
    },
    {
        "Henry Bradley": "henry bradley"
    },
    {
        ", The story of the Goths: from the earliest times to the end of the Gothic dominion in Spain, p. 42 . Born in ": null
    },
    {
        "Treviso": "treviso"
    },
    {
        ", Totila was a relative of ": null
    },
    {
        "Theudis": "theudis"
    },
    {
        ", king of the ": null
    },
    {
        "Visigoths": "visigoths"
    },
    {
        ". Elected king of the ": null
    },
    {
        "Ostrogoths": "ostrogoths"
    },
    {
        " in 42 after the assassination of his uncle ": null
    },
    {
        "Ildibad": "ildibad"
    },
    {
        ", having engineered the assassination of Ildibads short-lived successor, his cousin ": null
    },
    {
        "Eraric": "eraric"
    },
    {
        ", in 42  The official Byzantine position, adopted by Procopius and even by the Romanized Goth ": null
    },
    {
        "Jordanes": "jordanes"
    },
    {
        ", writing just before the conclusion of the Gothic Wars, was that Totila was a usurper: Jordanes Getica overlooks the then-recent successes of Totila.           His lifes work was the restoration of the ": null
    },
    {
        "Gothic": "goths"
    },
    {
        " kingdom in ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", and he entered upon the task from the very beginning of his reign, collecting together and inspiring the ": null
    },
    {
        "Goths": "goths"
    },
    {
        ", defeating a poorly led Byzantine attack on the Gothic stronghold of ": null
    },
    {
        "Verona": "verona"
    },
    {
        " in the winter of 42 and scattering the stronger Byzantine army at ": null
    },
    {
        "Faenza": "faenza"
    },
    {
        "  in the spring of 42      Having gained another victory in 42 Totila avoided the stoutly-defended ": null
    },
    {
        "Florence": "florence"
    },
    {
        ", in the ": null
    },
    {
        "Mugello valley": "mugello region"
    },
    {
        ". Totila treated his prisoners so well, some served under his banner. He left well-defended ": null
    },
    {
        "Tuscany": "tuscany"
    },
    {
        " with his enlarged forces, while three Byzantine generals withdrew from Florence, dividing their forces to ": null
    },
    {
        "Perugia": "perugia"
    },
    {
        ", ": null
    },
    {
        "Spoleto": "spoleto"
    },
    {
        ", and ": null
    },
    {
        "Rome": "rome"
    },
    {
        ", cities which Totila would have to take by siege.     In the meantime, instead of pursuing the conquest of central Italy, where the Imperial forces were too formidable for his small army, he decided to transfer his operations to the south of the peninsula.  He captured ": null
    },
    {
        "Beneventum": "benevento"
    },
    {
        " and received the submission of the provinces of ": null
    },
    {
        "Lucania": "lucania"
    },
    {
        " and ": null
    },
    {
        "Bruttium": "bruttium"
    },
    {
        ", ": null
    },
    {
        "Apulia": "apulia"
    },
    {
        " and ": null
    },
    {
        "Calabria": "calabria"
    },
    {
        ", essentially the whole of the Greek south; their imperial taxes were now diverted to his benefit.     Totilas strategy was to move fast and take control of the countryside, leaving the Byzantine forces in control of well-defended cities, and especially the ports. When Belisarius eventually returned to Italy, Procopius relates that during a space of five years he did not succeed once in setting foot on any part of the land … except where some fortress was, but during this whole period he kept sailing about visiting one port after another.  Totila circumvented those cities where a drawn-out siege would have been required, razing the walls of cities that capitulated to him, such as ": null
    },
    {
        "Beneventum": "benevento"
    },
    {
        ". Totilas conquest of Italy was marked not only by celerity but also by mercy, and ": null
    },
    {
        "Gibbon": "edward gibbon"
    },
    {
        " says none were deceived, either friends or enemies, who depended on his faith or his clemency. After a successful siege of a resisting city, such as at Perugia, however, Totila could be merciless, as Procopius recounts. Procopius left a written portrayal of Totila before his troops were drawn up for battle:   The armor in which he was clad was abundantly plated with gold and the ample adornments which hung from his cheek plates as well as his helmet and spear were not only purple, but in other respects befitting a king … And he himself, sitting upon a very large horse, began to dance under arms skillfully between the two armies. And as he rode he hurled his javelin into the air and caught it again as it quivered above him, then passed it rapidly from hand to hand, shifting it with consummate skill.             Procopiuss picture is given an uncharacteristic setting, for Totila generally avoided formal battles with opposing armies drawn up in battle array and excelled at skirmishing. A siege was required at Naples, however, where the report of Totilas courteous treatment of Romans at ": null
    },
    {
        "Cumae": "cumae"
    },
    {
        " and other surrounding towns undermined morale. Justinian was alarmed, but jealousy kept his one brilliantly competent general ": null
    },
    {
        "Belisarius": "belisarius"
    },
    {
        " at Constantinople. An attempt to relieve Naples by sea was badly bungled when Totila was informed during unnecessary delays, and a storm dispersed a second attempt, delivering the general, Demetrius, into Totilas hands. Totila offered generous terms and Conons starving garrison at Naples opened their gates in the spring of 42   On this occasion Totila exhibited a considerable humanity which was not to be expected, as the historian Procopius remarks, from an enemy or a barbarian. He knew that if an abundance of food were at once supplied, the famished inhabitants would gorge themselves to death. He posted sentinels at the gates and in the harbor and allowed no one to leave the city. Then he dealt out small rations, gradually increasing the quantity every day until the people had recovered their strength. The terms of the capitulation were more than faithfully observed. Conon and his followers were embarked in ships with which the Goths provided them, and when, deciding to sail for Rome, they were hindered by contrary winds, Totila furnished horses, provisions, and guides so that they could make the journey by land. Bury, Later Roman Empire, ch. xix.     The fortifications were partly razed. Totila spent the following season establishing himself in the south and reducing pockets of resistance, while the unpaid Imperial troops in central Italy made such poor reputations pillaging the countryside that, when Totila turned his attention to taking Rome, he was able proudly to contrast Goth and Greek behavior in his initial negotiations with the senate. They were refused, however, and all the ": null
    },
    {
        "Arian": "arianism"
    },
    {
        " priests were expelled from the city, on suspicion of collaboration.             Towards the end of 42 the Gothic king took up his station at ": null
    },
    {
        "Tivoli": "tivoli, italy"
    },
    {
        " and prepared to starve ": null
    },
    {
        "Rome": "rome"
    },
    {
        " into surrender, making at the same time elaborate preparations for checking the progress of ": null
    },
    {
        "Belisarius": "general belisarius"
    },
    {
        " who was advancing to its relief. ": null
    },
    {
        "Pope Vigilius": "pope vigilius"
    },
    {
        " fled to the safety of Syracuse; when he sent a flotilla of grain ships to feed the city, Totilas navy fell on them near the mouth of the ": null
    },
    {
        "Tiber": "tiber"
    },
    {
        " and captured the fleet. The imperial fleet, moving up the Tiber and led by the great general, only just failed to relieve the city, which then was forced to open its gates to the Goths.     It was plundered, although Totila did not carry out his threat to make it a pasture for cattle, and when the Gothic army withdrew into Apulia it was from a scene of desolation. Yet, its walls and other fortifications were soon restored, and Totila again marched against it. He was defeated by Belisarius, who, however, did not follow up his advantage. Several cities, including ": null
    },
    {
        "Perugia": "perugia"
    },
    {
        ", were taken by the Goths, while Belisarius remained inactive and then was recalled from Italy. In 42 Totila advanced a third time against Rome, which he captured through the treachery of some of its starving defenders.     Totilas meeting with ": null
    },
    {
        "Benedict of Nursia": "benedict of nursia"
    },
    {
        " at ": null
    },
    {
        "Monte Cassino": "monte cassino"
    },
    {
        " is preserved in ": null
    },
    {
        "Pope Gregory I": "pope gregory i"
    },
    {
        "s Dialogues . It occurred either before or soon after the siege of Naples; the Benedictines traditional date is March 42 42 It includes a telling of the abbots discernment of an aide of Totilas, his sword-bearer Riggio, dressed in royal robes, as an impostor, and also his predictions for Totila, who knelt to him. This event was a favorite subject for Italian painters.          His next exploit was the conquest and plunder of ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ", after which he subdued ": null
    },
    {
        "Corsica": "corsica"
    },
    {
        " and ": null
    },
    {
        "Sardinia": "sardinia"
    },
    {
        " and sent a Gothic fleet against the coasts of ": null
    },
    {
        "Greece": "greece"
    },
    {
        ". By this time the emperor ": null
    },
    {
        "Justinian I": "justinian i"
    },
    {
        " was taking energetic measures to check the Goths. The conduct of a new campaign was entrusted to the ": null
    },
    {
        "eunuch": "eunuch"
    },
    {
        " Narses": "narses"
    },
    {
        "; Totila marched against him and was defeated and killed at the ": null
    },
    {
        "Battle of Taginae": "battle of taginae"
    },
    {
        " in July 42 which brought an end to the long struggle between Byzantium and the Ostrogothic Kingdom in Italy, and left the Eastern Emperor for the time being in control of Italy.       Totila was succeeded by his relative ": null
    },
    {
        "Teia": "teia"
    },
    {
        ", who later died at the ": null
    },
    {
        "Battle of Mons Lactarius": "battle of mons lactarius"
    },
    {
        ". The Goths were later absorbed into the ": null
    },
    {
        "Lombard": "lombards"
    },
    {
        " Kingdom": "kingdom of the lombards"
    },
    {
        ".       ": null
    }
]