[
    {
        "        Toxicity is the second studio album by Armenian-American ": null
    },
    {
        "heavy metal": "heavy metal music"
    },
    {
        " band ": null
    },
    {
        "System of a Down": "system of a down"
    },
    {
        ", released on September 42 42 by ": null
    },
    {
        "American Recordings": "american recordings"
    },
    {
        " and ": null
    },
    {
        "Columbia Records": "columbia records"
    },
    {
        ". Featuring the heaviness and aggression of their ": null
    },
    {
        "42 eponymous debut": "system of a down"
    },
    {
        ", it features more melody, harmonies, and singing than the bands aforementioned album. Categorized primarily as ": null
    },
    {
        "alternative metal": "alternative metal"
    },
    {
        " and ": null
    },
    {
        "nu metal": "nu metal"
    },
    {
        ", Toxicity features elements of multiple genres including ": null
    },
    {
        "folk": "folk music"
    },
    {
        ", ": null
    },
    {
        "progressive rock": "progressive rock"
    },
    {
        ", ": null
    },
    {
        "jazz": "jazz"
    },
    {
        ", ": null
    },
    {
        "Armenian music": "armenian music"
    },
    {
        ", and ": null
    },
    {
        "Greek music": "greek music"
    },
    {
        ", including prominent use of instruments such as the ": null
    },
    {
        "sitar": "sitar"
    },
    {
        ", ": null
    },
    {
        "banjo": "banjo"
    },
    {
        ", ": null
    },
    {
        "keyboards": "keyboard instrument"
    },
    {
        ", and ": null
    },
    {
        "piano": "piano"
    },
    {
        ". It contains a wide array of political and non-political themes, such as ": null
    },
    {
        "mass incarceration": "mass incarceration"
    },
    {
        ", the ": null
    },
    {
        "CIA": "central intelligence agency"
    },
    {
        ", ": null
    },
    {
        "the environment": "the environment"
    },
    {
        ", ": null
    },
    {
        "group sex": "group sex"
    },
    {
        ", ": null
    },
    {
        "police brutality": "police brutality"
    },
    {
        ", ": null
    },
    {
        "drug addiction": "drug addiction"
    },
    {
        ", and ": null
    },
    {
        "groupies": "groupie"
    },
    {
        ".     Toxicity was recorded at Cello Studios in ": null
    },
    {
        "Hollywood": "hollywood"
    },
    {
        ", California. Over thirty songs were recorded, but the band narrowed the number of songs on the album to fourteen. The album peaked at number one on both the ": null
    },
    {
        "Billboard 42": "billboard 200"
    },
    {
        " and the ": null
    },
    {
        "Canadian Albums Chart": "canadian albums chart"
    },
    {
        ", sold 42 copies in its first week of release, was certified  by the ": null
    },
    {
        "Recording Industry Association of America": "recording industry association of america"
    },
    {
        " in November 42 and has sold at least 42,42 copies in the United States. All of Toxicity singles reached the ": null
    },
    {
        "Billboard Hot 42": "billboard hot 100"
    },
    {
        ". The final single, ": null
    },
    {
        "Aerials": "aerials"
    },
    {
        " , went to number one on both the ": null
    },
    {
        "Mainstream Rock Tracks": "mainstream rock tracks"
    },
    {
        " and the ": null
    },
    {
        "Modern Rock Tracks": "modern rock tracks"
    },
    {
        " charts. Toxicity received mainly positive ratings and reviews from critics, among them perfect ratings from ": null
    },
    {
        "AllMusic": "allmusic"
    },
    {
        ",  Kerrang! , and ": null
    },
    {
        "Blabbermouth.net": "blabbermouth.net"
    },
    {
        ". Many critics praised the albums sound and innovation.     The promotional shows for Toxicity resulted in a number of controversial incidents. A six-hour riot ensued at a free concert in Hollywood the day before the albums release as a result of the shows cancellation due to an overcrowded show; the crowd in attendance was estimated to be at least twice the size which was expected. Another scheduled System of a Down performance was cancelled to prevent a similar riot, and the band then toured with ": null
    },
    {
        "Slipknot": "slipknot"
    },
    {
        ". Bassist ": null
    },
    {
        "Shavo Odadjian": "shavo odadjian"
    },
    {
        " was harassed, ethnically insulted, and physically beaten by guards when he tried to enter backstage at a concert in October 42 Regardless, the tour was successful, and System of a Down later co-headlined a leg of Slipknots ": null
    },
    {
        "Iowa World Tour": "iowa world tour"
    },
    {
        ".               Categorized as ": null
    },
    {
        "alternative metal": "alternative metal"
    },
    {
        ",   ": null
    },
    {
        "thrash metal": "thrash metal"
    },
    {
        ", ": null
    },
    {
        "art metal": "art rock"
    },
    {
        ", ": null
    },
    {
        "hard rock": "hard rock"
    },
    {
        ",  ": null
    },
    {
        "progressive metal": "progressive metal"
    },
    {
        ", ": null
    },
    {
        "heavy metal": "heavy metal music"
    },
    {
        ", and ": null
    },
    {
        "nu metal": "nu metal"
    },
    {
        ",  the album features elements of multiple genres of music: ": null
    },
    {
        "folk": "folk music"
    },
    {
        ", ": null
    },
    {
        "progressive rock": "progressive rock"
    },
    {
        ", ": null
    },
    {
        "jazz": "jazz"
    },
    {
        ",  ": null
    },
    {
        "Middle Eastern music": "middle eastern music"
    },
    {
        ", and ": null
    },
    {
        "Greek music": "greek music"
    },
    {
        ". System of a Down guitarist Daron Malakian said that he wanted to add a bit more harmony for himself in the songs and that required tastefully mixing in some softer guitars between the really heavy parts . Malakian also cited ": null
    },
    {
        "the Beatles": "the beatles"
    },
    {
        " as an influence on Toxicity. Sounds of instruments other than drums, vocals, electric guitar and bass guitar, such as ": null
    },
    {
        "sitar": "sitar"
    },
    {
        ", ": null
    },
    {
        "banjo": "banjo"
    },
    {
        ",  keyboards and ": null
    },
    {
        "piano": "piano"
    },
    {
        ", are also featured a little bit on Toxicity. The majority of the albums music was written in the tuning of ": null
    },
    {
        "drop C": "drop c tuning"
    },
    {
        ".  System of a Down recorded over thirty songs during the recording of Toxicity but narrowed the number of songs on the album to fourteen. Several of these recorded songs that didnt make it onto Toxicity were re-recorded for System of a Downs next studio album  Steal This Album! , an album released in 42  Toxicity was recorded at Cello Studios in ": null
    },
    {
        "Hollywood": "hollywood"
    },
    {
        ", California, mixed at Enterprise Studios in ": null
    },
    {
        "Burbank, California": "burbank, california"
    },
    {
        ", and mastered at Oasis Mastering in ": null
    },
    {
        "Studio City": "studio city"
    },
    {
        ", California.     According to System of a Down bassist ": null
    },
    {
        "Shavo Odadjian": "shavo odadjian"
    },
    {
        ", the song Chop Suey! is about drug addiction, but something really serious and made it a little quacky .  Prison Song is about ": null
    },
    {
        "mass incarceration": "mass incarceration"
    },
    {
        ". System of a Down vocalist ": null
    },
    {
        "Serj Tankian": "serj tankian"
    },
    {
        " said: Its about the unfairness of mandatory minimum sentences and how there are about 42,42 Americans in jail, and a lot of them are in there for marijuana possession and things of that sort. Instead of rehabilitating men who have drug problems, theyre throwing them in prison. Thats not really solving anything.  Tankian said that Prison Song also addresses how drug money is used to rig elections in other countries by the ": null
    },
    {
        "CIA": "cia"
    },
    {
        " . Bounce is about ": null
    },
    {
        "group sex": "group sex"
    },
    {
        ". Psycho is about ": null
    },
    {
        "groupie": "groupie"
    },
    {
        "s. ATWA is about ": null
    },
    {
        "Charles Manson": "charles manson"
    },
    {
        "s beliefs on the environment. Malakian has said that in jail for the wrong reasons. I think he had an unfair trial .  Deer Dance is about ": null
    },
    {
        "the protests surrounding the 42 Democratic National Convention": "2000 democratic national convention protest activity"
    },
    {
        ".              On ": null
    },
    {
        "review aggregator": "review aggregator"
    },
    {
        " website ": null
    },
    {
        "Metacritic": "metacritic"
    },
    {
        ", Toxicity holds a score of 42 out of 42 based on reviews from nine critics, which indicates generally favourable reviews . ": null
    },
    {
        "AllMusic": "allmusic"
    },
    {
        " writer Eduardo Rivadavia called Toxicity hands down one of 42s top metal releases and wrote that the album may well prove to be a lasting heavy metal classic to boot . Toxicity is one of only 42 albums to achieve a perfect rating from ": null
    },
    {
        "Blabbermouth.net": "blabbermouth.net"
    },
    {
        ", with writer Don Kaye praising System of a Down in a contemporary review of the album as one of the few bands that people may still be talking about ten years from now .  Drowned in Sound  writer Don Kaye praised the band as probably the most vital band around in the big, wide world of metal right now .  Ben Myers of  Kerrang!  stated that the band had gone and bettered their ": null
    },
    {
        "debut album": "system of a down"
    },
    {
        " and hailed Toxicity as metal album of the year, hands down .  Q  wrote that Toxicity matches ": null
    },
    {
        "Slipknot": "slipknot"
    },
    {
        " for manic intensity while employing a freeform approach to songcraft which invites comparison to the lunatic-fringe rock of the 42s .     Referring to Toxicity as both manic and schizoid , Keith Harris of  Rolling Stone  noted Tankians ability to veer easily from sing-rap rhythm to ": null
    },
    {
        "Korn": "korn"
    },
    {
        "-ish hysterics to demonic baritone growl to doomily ruminative and that the music insists on forward motion without trapping itself in a thrashy lock-step rut . Tom Sinclair of  Entertainment Weekly  called the album strange and engaging , with a wide variety of sounds which all adds up to bizarro type of metal that has a warped majesty and strength . ": null
    },
    {
        "Robert Christgau": "robert christgau"
    },
    {
        " of  The Village Voice  cited Prison Song and Bounce as highlights and later assigned the album a one-star honorable rating.    Spin s Joe Gross wrote that the band have an undeniable nerd-prog charm .   Uncut , on the other hand, panned Toxicity as virtually unlistenable .        Toxicity peaked at number one on the Billboard 42   selling 42 copies in its first week of release.  The album also peaked at number one on the Canadian Albums Chart.  Toxicity sold at least 42,42 copies in the United States, and at least 42,42 copies worldwide.  On November 42 42 the album was certified triple-platinum by the ": null
    },
    {
        "Recording Industry Association of America": "recording industry association of america"
    },
    {
        ".     All of the albums singles reached the ": null
    },
    {
        "Billboard Hot 42": "billboard hot 100"
    },
    {
        "; ": null
    },
    {
        "Chop Suey!": "chop suey!"
    },
    {
        " peaked at number 42 ": null
    },
    {
        "Toxicity": "toxicity"
    },
    {
        " peaked at number 42 and ": null
    },
    {
        "Aerials": "aerials"
    },
    {
        " peaked at number 42 Aerials would remain the bands biggest domestic hit until ": null
    },
    {
        "B.Y.O.B.": "b.y.o.b."
    },
    {
        " surpassed it, reaching number 42 in 42  Aerials peaked at number one on the ": null
    },
    {
        "Mainstream Rock Songs": "mainstream rock songs"
    },
    {
        " chart  and number one on the ": null
    },
    {
        "Alternative Songs": "modern rock tracks"
    },
    {
        " chart.  Chop Suey! and Toxicity were both top ten hits. In 42 Toxicity went to number one on the ": null
    },
    {
        "Catalog Albums": "catalog albums"
    },
    {
        " chart.  Added to the ": null
    },
    {
        "42 Clear Channel memorandum": "2001 clear channel memorandum"
    },
    {
        ",  Chop Suey! was pulled from playlists of just about every radio station after the ": null
    },
    {
        "September 42 attacks": "september 11 attacks"
    },
    {
        " in 42 Chop Suey! features some lyrics that were considered inappropriate in the aftermath of the September 42 attacks. The song returned to the airwaves when things settled down.         The album is listed on  Blender  42 CDs You Must Own.  ": null
    },
    {
        "MusicRadar": "musicradar"
    },
    {
        " held a public poll and Toxicity was ranked as the 42th greatest heavy metal album on its list of The 42 Greatest Heavy Metal Albums of All Time.  The album is ranked number 42 on Rolling Stone 42 Best Albums of the Decade for 42s  and 42th on the magazines 42 Greatest Metal Albums of All Time .   Spin  named the album one of The 42 Best Albums Of The Past 42 Years, with Toxicity being one of the highest-listed heavy metal albums on the list.  Spin also named Toxicity the Album of the Year in 42 and finally ranked it number 42 on its list of The 42 Greatest Metal Albums Of All Time.    Kludge  ranked it number five on their list of best albums of 42   Alternative Press  ranked it number nine on its 42 Best Albums of 42 ": null
    },
    {
        "Mojo": "mojo"
    },
    {
        " ranked it number 42 on its 42 Modern Classics.  The album won a 42  Metal Edge  Readers Choice Award for Album of the Year. Metal Edge, June 42  Loudwire  listed the album at number one on its list of Top 42 Metal Albums of the 42s, number two on the Top 42 Hard Rock + Metal Albums Of The 42st Century, and number 42 on its list of Top 42 Metal Albums of All Time.     NME  listed the album at number six on its list of 42 Greatest Metal Albums Ever.   Metal Hammer  declared Toxicity the best album of 42   The Observer  ranked Toxicity as one of the Top 42 Albums Of The Decade, at number 42  In 42  The Guardian  placed the album on its list of the 42 Albums To Hear Before You Die.   Entertainment Weekly  also put Toxicity on its list of the 42 Best Albums of the 42–42 Period, at number 42  ": null
    },
    {
        "Revolver": "revolver"
    },
    {
        " named Toxicity the eighth greatest metal album of all time on its list of the 42 Greatest Metal Albums Of All Time.  The album was included on  The A.V. Club s list of the best metal records of the 42s.  Chop Suey was nominated for ": null
    },
    {
        "Best Metal Performance": "best metal performance"
    },
    {
        " at the ": null
    },
    {
        "42th Grammy Awards": "44th grammy awards"
    },
    {
        " in 42        On September 42 42 System of a Down had planned on launching Toxicity at a free concert in Hollywood, California as a thank you to fans. The concert, which was to be held in a parking lot, was set up to accommodate 42 people; however, an estimated 42 to 42 fans showed up. Because of the large excess number of fans, the performance was cancelled by police officers just before System of a Down took the stage. No announcement was made that the concert had been cancelled. Fans waited for more than an hour for the band to appear, but when a banner hanging at the back of the stage that read System of a Down was removed by security, the audience rushed the stage, destroying all the bands touring gear and began to riot, throwing rocks at police, breaking windows, and knocking over portable toilets. The riot lasted six hours, during which six arrests were made. The bands manager, David Beno Benveniste, later said that the riot could have been avoided if System of a Down had been permitted to perform or had they been allowed to make a statement at the concert regarding the cancellation. System of a Downs scheduled in-store performance the next day was cancelled to prevent a similar riot.      Later that month, System of a Down embarked on tour in the United States and Mexico with ": null
    },
    {
        "Slipknot": "slipknot"
    },
    {
        ". During their concert at ": null
    },
    {
        "Grand Rapids, Michigan": "grand rapids, michigan"
    },
    {
        "s ": null
    },
    {
        "Van Andel Arena": "van andel arena"
    },
    {
        " in October 42 Odadjian was harassed, ethnically insulted and physically beaten by some guards when he attempted to enter backstage. After the attack, he received medical help from the arena personnel and the police in place. Odadjian then filed a lawsuit against DuHadway Kendall Security, the company the guards were working for.  Despite this incident, the tour, as a whole, was a success and System of a Down later co-headlined the ": null
    },
    {
        "Pledge of Allegiance": "iowa world tourpledge of allegiance"
    },
    {
        " leg of Slipknots ": null
    },
    {
        "Iowa World Tour": "iowa world tour"
    },
    {
        ".        All songs are produced by ": null
    },
    {
        "Rick Rubin": "rick rubin"
    },
    {
        ", ": null
    },
    {
        "Daron Malakian": "daron malakian"
    },
    {
        ", and ": null
    },
    {
        "Serj Tankian": "serj tankian"
    },
    {
        ". All lyrics by Serj Tankian, except where noted. All music written by Malakian, except where noted.          + Aerials contains a ": null
    },
    {
        "hidden track": "hidden track"
    },
    {
        " referred to as Arto because it features ": null
    },
    {
        "Arto Tunçboyacıyan": "arto tunçboyacıyan"
    },
    {
        ".  The track is actually an adaptation of Der Voghormia , a traditional Armenian church hymn.                           Johnny , the Japanese bonus track, is put as the eighth track on Toxicity on the albums Japanese Edition, pushing all tracks 42–42 on the albums normal track listing one track number forward. System of a Down. Toxicity, Cello Studios, Hollywood, California, United States. Japanese Edition         Adapted from Toxicity liner notes.              System of a Down ": null
    },
    {
        "Serj Tankian": "serj tankian"
    },
    {
        " – vocals, keyboards, guitar on ": null
    },
    {
        " Aerials ": "aerials"
    },
    {
        ", string arrangements   ": null
    },
    {
        "Daron Malakian": "daron malakian"
    },
    {
        " – guitars, sitar, vocals   ": null
    },
    {
        "Shavo Odadjian": "shavo odadjian"
    },
    {
        " – bass   ": null
    },
    {
        "John Dolmayan": "john dolmayan"
    },
    {
        " – drums     Additional musicians ": null
    },
    {
        "Rick Rubin": "rick rubin"
    },
    {
        " – piano   ": null
    },
    {
        "Arto Tunçboyacıyan": "arto tunçboyacıyan"
    },
    {
        " – additional vocals/music   ": null
    },
    {
        "Marc Mann": "marc mann"
    },
    {
        " – strings arrangement, conducting, additional strings writing     Artwork ": null
    },
    {
        "Glen E. Friedman": "glen e. friedman"
    },
    {
        " – photography   John Dolmayan – photography   Hallie Sirota – photography   ": null
    },
    {
        "Mark Wakefield": "list of linkin park band membersmark wakefield"
    },
    {
        " – cover art   Shavo Odadjian – art direction, album art concepts   Brandy Flower – art direction, collage art   System of a Down – album art concepts   John Dolmayan – collage art   Shavo Odadjian – co-label art          Production and directing ": null
    },
    {
        "Rick Rubin": "rick rubin"
    },
    {
        " – producer   Daron Malakian – producer   Serj Tankian – co-producer   ": null
    },
    {
        "Andy Wallace": "andy wallace"
    },
    {
        " – mixing   David Schiffman – engineer   Greg Collins – additional engineer   Darren Mora – assistant engineer, additional engineer   Al Sanderson – assistant engineer   Ryan McCormick – assistant engineer   Jim Champagne – assistant engineer   Rich Balmer – mixdown engineer   Dino Paredes – ": null
    },
    {
        "A & R": "artists and repertoire"
    },
    {
        " direction   Lindsay Chase – production coordinator   Eddy Schreyer – mastering                                                                                        ": null
    }
]