[
    {
        "            Trakehner is a light ": null
    },
    {
        "warmblood": "warmblood"
    },
    {
        " breed of horse": "horse breed"
    },
    {
        ", originally developed at the ": null
    },
    {
        "East Prussia": "east prussia"
    },
    {
        "n state ": null
    },
    {
        "stud farm": "stud farm"
    },
    {
        " in the town of ": null
    },
    {
        "Trakehnen": "trakehnen"
    },
    {
        " from which the breed takes its name. The state stud  was established in 42 and operated until 42 when the fighting of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " led to the annexing of East Prussia by ": null
    },
    {
        "Russia": "russia"
    },
    {
        ", and the town containing the stud renamed as ": null
    },
    {
        "Yasnaya Polyana": "yasnaya polyana, kaliningrad oblast"
    },
    {
        ".     The Trakehner typically stands between . They can be any color, with ": null
    },
    {
        "bay": "bay"
    },
    {
        ", ": null
    },
    {
        "gray": "gray"
    },
    {
        ", ": null
    },
    {
        "chestnut": "chestnut"
    },
    {
        " and ": null
    },
    {
        "black": "black"
    },
    {
        " being the most common, though the breed also includes few ": null
    },
    {
        "roan": "roan"
    },
    {
        " and ": null
    },
    {
        "tobiano": "tobiano"
    },
    {
        " pinto horse": "pinto horse"
    },
    {
        "s. It is considered to be the lightest and most refined of the ": null
    },
    {
        "warmblood": "warmblood"
    },
    {
        "s, due to its ": null
    },
    {
        "closed stud book": "closed stud book"
    },
    {
        " which allows entry of only Trakehner, as well as few selected ": null
    },
    {
        "Thoroughbred": "thoroughbred"
    },
    {
        ", ": null
    },
    {
        "Anglo-Arabian": "anglo-arabian"
    },
    {
        ", ": null
    },
    {
        "Shagya": "shagya arabian"
    },
    {
        " and ": null
    },
    {
        "Arabian": "arabian horse"
    },
    {
        " bloodlines.       Owing to its Thoroughbred ancestry, the Trakehner is of rectangular build, with a long sloping shoulder, good hindquarters, short cannons, and a medium-long, crested and well-set neck. The head is often finely chiseled, narrow at the muzzle, with a broad forehead. It is known for its floating trot - full of impulsion and suspension. The Trakehner possesses a strong, medium-length back and powerful hindquarters.     Trakehners are athletic and trainable, with good endurance, while some are more spirited than horses of other warmblood breeds. Trakehners breed true to type, due to the purity of the bloodlines, making it valuable for upgrading other warmbloods.                ": null
    },
    {
        "Old Prussians": "old prussians"
    },
    {
        " and other Baltic people such as the ": null
    },
    {
        "Lithuanians": "lithuanians"
    },
    {
        " were noted for their hardy horses and cavalry during the early ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ". During their conquest of Old Prussians in the 42th Century ": null
    },
    {
        "Prussian crusade": "prussian crusade"
    },
    {
        ", the conquering ": null
    },
    {
        "Teutonic Knights": "teutonic knights"
    },
    {
        " named the Old Prussian horse a Schwaikenpferd, a small primitive horse. Beginning in the 42th century, ": null
    },
    {
        "knight": "knight"
    },
    {
        "s used it to breed their military horses, and descendants of the Schwaikenpferd were later used by ": null
    },
    {
        "Masovian": "masovians"
    },
    {
        " and ": null
    },
    {
        "Ostsiedlung": "ostsiedlung"
    },
    {
        " farmers for light utility work. During the 42th and 42th centuries, the people of ": null
    },
    {
        "Ducal Prussia": "ducal prussia"
    },
    {
        ", ": null
    },
    {
        "Brandenburg": "brandenburg"
    },
    {
        ", and ": null
    },
    {
        "Royal Prussia": "royal prussia"
    },
    {
        " used a wide variety of horses from the ": null
    },
    {
        "Polish-Lithuanian Commonwealth": "polish-lithuanian commonwealth"
    },
    {
        ", ": null
    },
    {
        "Crimean Tatars": "crimean tatars"
    },
    {
        ", ": null
    },
    {
        "Ottoman Turkey": "ottoman turkey"
    },
    {
        ", ": null
    },
    {
        "Wallachia": "wallachia"
    },
    {
        ", ": null
    },
    {
        "Moldavia": "moldavia"
    },
    {
        " and ": null
    },
    {
        "Transylvania": "transylvania"
    },
    {
        ", ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " for their cavalry and stud horses, crossed on local animals.     In 42 King ": null
    },
    {
        "Frederick William I": "frederick william i of prussia"
    },
    {
        " of ": null
    },
    {
        "Prussia": "kingdom of prussia"
    },
    {
        " used these horses and other imports to establish the Trakehnen Stud at the East Prussian town Trakehnen . Soldiers cleared the forest at the ": null
    },
    {
        "River Pissa": "pissa river"
    },
    {
        " between ": null
    },
    {
        "Stallupönen": "nesterov"
    },
    {
        " and ": null
    },
    {
        "Gumbinnen": "gusev, kaliningrad oblast"
    },
    {
        ". In 42 the king gave it to crown prince ": null
    },
    {
        "Frederick II of Prussia": "frederick ii of prussia"
    },
    {
        ", who often sold stallions to make money. After his death in 42 it became state property, named Königlich Preußisches Hauptgestüt Trakehnen.     Between 42 and 42 the stud added ": null
    },
    {
        "Arabian": "arabian horse"
    },
    {
        ", ": null
    },
    {
        "Thoroughbred": "thoroughbred"
    },
    {
        ", and ": null
    },
    {
        "Hanoverian horse": "hanoverian horse"
    },
    {
        " blood to their stock. One especially influential ": null
    },
    {
        "Thoroughbred": "thoroughbred"
    },
    {
        " was Perfectionist, by Persimmon, who won ": null
    },
    {
        "The Derby": "epsom derby"
    },
    {
        " and the ": null
    },
    {
        "St Leger": "st leger"
    },
    {
        " in 42 He was to be the sire of the great Trakehner stallion Tempelhüter, and most modern Trakehners can be traced to these two stallions. The Arabian blood was added to offset possible flaws of the Thoroughbred.     ": null
    },
    {
        "East Prussia": "east prussia"
    },
    {
        "n farmers were encouraged to bring their mares, by then known for their hardiness and quality, to Trakehnens stallions. This enabled the rapid transformation of the breed into much sought-after army remounts: sure-footed, intelligent and athletic. By 42 42 mares per year were bred to East Prussian stallions.     In 42 the ": null
    },
    {
        "Treaty of Versailles": "treaty of versailles"
    },
    {
        " limited Germanys army to 42 troops and so the breeds focus was again turned to producing horses suitable to farm duties. For this purpose, sires of heavier ": null
    },
    {
        "conformation": "equine conformation"
    },
    {
        " were used, the most successful being Ararad, Dampfross, Hyperion, Pythagoras and Tempelhüter. These stallions, while refined, possessed much substance and bone. Their influence is still seen on the modern Trakehner.     It was during the 42s and 42s that the breed was recognized for its performance abilities in competitive disciplines. Trakehners won gold and silver medals in two Olympics, including six Gold medals in ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        " in 42 and won Czechoslovakias notoriously challenging ": null
    },
    {
        "Velká pardubická": "velká pardubická"
    },
    {
        " steeplechase nine times. In the 42s there were more than 42 breeders and 42 registered mares.     In the 42s and early 42s Hauptvorwerk Trakehnen and its 42 ": null
    },
    {
        "Vorwerke": "folwark"
    },
    {
        " covered , of which  were fields,  meadows,  forest,  garden and  other. Horses such as the Trakehner were used in ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " which, at the end, nearly destroyed the breed as Soviet troops advanced from the East, causing ": null
    },
    {
        "flight and expulsion of Germans during and after WWII": "expulsion of germans after world war ii"
    },
    {
        ". The main Stud and local residents were forces to evacuate between 42 January 42 and March 42 Their journey West, known as Der Treck , sent the horses on a dangerous journey in frigid conditions across the frozen ": null
    },
    {
        "Vistula lagoon": "vistula lagoon"
    },
    {
        " without proper rations or shelter. It is considered one of the toughest tests to which an entire breed of horses has been submitted.     Refugee convoys were bombed while on the ice by the ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " airforce, so only a small number of horses made it to safety. 42 surviving horses were accounted for. The horses left behind in East Prussia became important in the breeding of Russian breeds such as the Kirov as well as the Polish ": null
    },
    {
        "Mazury": "mazury"
    },
    {
        " and ": null
    },
    {
        "Pozan": "pozan"
    },
    {
        " , which developed into the ": null
    },
    {
        "Wielkopolski": "wielkopolski"
    },
    {
        ". After the war, the breed, which once numbered tens of thousands was reduced to approximately 42 broodmares and 42 stallions in West Germany. The last original Trakehner was Keith, born there in 42 who died in November 42 in ": null
    },
    {
        "Gilten": "gilten, germany"
    },
    {
        " shortly before his 42th birthday. On 42 October 42 the East Prussian Studbook Society was dissolved and the Association of Breeders and Friends of the Warmblood Horse of Trakehner Origin, known today as the Trakehner Verband, was created. Among the greatest obstacles the organization faced was that unlike other German breeds, the Trakehner had no mother state and could not depend on government funding. The re-establishment of the breed originally depended on the determination of its members and the largesse of others.     True pure-bred Trakehner show the Ostpreußische Elchschaufel branding .          Today in Germany the breed is considered a federal responsibility, with its governance falling under both the Trakehner Verband and the Trakehner Gesellschaft mbH; the latter handling all business operations.     Stallion inspections are held in ": null
    },
    {
        "Neumünster": "neumünster"
    },
    {
        ", Germany, each October and approved stallions are required to complete extended performance tests, which rate the horses gaits, temperament, jumping ability, and suitability over a cross country course, before being given full breeding licenses.     The Trakehner is used as a refiner of other breeds, allowing an infusion of Thoroughbred and Arabian blood without the risks often involved in first generation outcrosses. Influential stallions include Abglanz for the ": null
    },
    {
        "Hanoverian": "hanoverian"
    },
    {
        ", Herbststurm who influenced the ": null
    },
    {
        "Oldenburg": "oldenburg"
    },
    {
        ", Marco Polo for the ": null
    },
    {
        "Dutch Warmblood": "dutch warmblood"
    },
    {
        ", the stallions Ibikus and Donauwind for the ": null
    },
    {
        "Danish Warmblood": "danish warmblood"
    },
    {
        ", and Polarstern for the ": null
    },
    {
        "Swedish Warmblood": "swedish warmblood"
    },
    {
        ".     While Trakehners compete in nearly all equestrian disciplines, they are particularly prized as ": null
    },
    {
        "dressage": "dressage"
    },
    {
        " mounts, due to their sensitivity, intelligence and way of going. Peron anchored the United States team to an Olympic Bronze in 42 at Atlanta. ": null
    },
    {
        "Abdullah": "abdullah"
    },
    {
        ", by Donauwind, is particularly famous for his ": null
    },
    {
        "show jumping": "show jumping"
    },
    {
        " team gold and individual silver medals at the 42 Olympics and 42 World Cup win. Heuriger was the 42 ": null
    },
    {
        "show jumping": "show jumping"
    },
    {
        " team silver medallist at the 42 ": null
    },
    {
        "World Equestrian Games": "world equestrian games"
    },
    {
        ".     Due to their very light build, Trakehners tend to do better in the sport of ": null
    },
    {
        "eventing": "eventing"
    },
    {
        " than most other warmblood breeds. One such example is USA 42 Olympic team bronze medallist ": null
    },
    {
        "Windfall PG 42": "windfall pg 2"
    },
    {
        ".       ": null
    },
    {
        "Abdullah ": "abdullah"
    },
    {
        " , on the USAs gold medal-winning show jumping team at the 42 Olympics   ": null
    },
    {
        "Downlands Cancara": "downlands cancara"
    },
    {
        " , featured in ": null
    },
    {
        "Lloyds TSB": "lloyds tsb"
    },
    {
        "s iconic TV adverts in the UK   ": null
    },
    {
        "Windfall II": "windfall ii"
    },
    {
        " , in the USAs bronze medal-winning team eventing team at the 42 Olympics   Larissa , 42-star event horse with many top placings both nationally and internationally. She won the team silver at the Pan-American games in 42 ": null
    }
]