[
    {
        "     Tralla La is a ": null
    },
    {
        "Scrooge McDuck": "scrooge mcduck"
    },
    {
        " comic book": "comic book"
    },
    {
        " story by ": null
    },
    {
        "Carl Barks": "carl barks"
    },
    {
        ". The story was first published in  Uncle Scrooge  42 . In the story, Scrooge searches for a ": null
    },
    {
        "utopia": "utopia"
    },
    {
        " in which money plays no role.       Tralla La begins with Uncle Scrooge having a hard day at his office, and it doesnt get better when he attempts to walk along the street to relax. He is followed by someone who wants some of his ": null
    },
    {
        "money": "money"
    },
    {
        " for whatever reason. The stress of this way of life gets to him and he suffers a ": null
    },
    {
        "nervous breakdown": "mental breakdown"
    },
    {
        ". Though he improves, he cant stand to see or hear about money, as he now associates it with all the troubles that got him to this point. In order to heal, he searches for a place where money has no influence. Tralla La may be such a place, where a peaceful society without a monetary system is rumored to exist.     Scrooge and his nephews, who are there to support his healing, finally locate the mythical place in a deep valley high in the ": null
    },
    {
        "Himalayas": "himalayas"
    },
    {
        " and arrive by parachute. There they get acquainted with a more peaceful existence than to which they were accustomed.     However, as Scrooge seems to be healing he doesnt realise he brought his troubles with him. He brought bottles of his medication along; the ": null
    },
    {
        "bottle cap": "bottle cap"
    },
    {
        "s he discards are considered rare treasures in Tralla La and become the basis of a new monetary system! The inhabitants of Tralla La become obsessed with these new treasures. To solve the issue, Scrooge has planes drop one billion bottle caps, but this becomes too many, and the inhabitants become angry, as their fields are now covered with caps. The Ducks must flee, as they apparently cannot find peace even in an Earthly paradise.       A number of previous stories by Barks presented Scrooges way of life as rather stressful but this is the first story where this seems to be getting on his nerves. It is certainly not the last but subsequent stories rarely focus on it.     Scrooges effort this time is not to gain treasure but find some peace and regain his health. But, as so often presented in Barks tales, in trying to escape his problems he only manages to carry them with him. Tralla La  inhabitants prove to share the human characteristic of greed and Barks is allowed some bitter commentary on human nature.     The theme of never finding peace no matter how hard the characters try is a running theme in Barks tales but here it takes center place. It is considered among Barks most memorable because of its view of humanity, ": null
    },
    {
        "paradise": "paradise"
    },
    {
        "s and the vulnerability of his characters.     The story was later adapted into an episode of ": null
    },
    {
        "DuckTales": "ducktales"
    },
    {
        ".     ": null
    },
    {
        "Don Rosa": "don rosa"
    },
    {
        " wrote a sequel to the story, http://coa.inducks.org/story.php/x/D42 Return To Xanadu, in which Tralla La is revealed to be the valley of ": null
    },
    {
        "Xanadu": "shangdupopular culture"
    },
    {
        ". Return to Xanadu was first published in the United States in Uncle Scrooge": null
    }
]