[
    {
        "Transport in Antarctica has transformed from explorers crossing the isolated remote area of ": null
    },
    {
        "Antarctica": "Antarctica"
    },
    {
        " by foot to a more open era due to human technologies enabling more convenient and faster transport, predominantly by air and water, as well as land.   Transportation technologies on a remote area like Antarctica need to be able to deal with extremely low temperatures and continuous winds to ensure the travelers safety. Due to the fragility of the Antarctic environment, only a limited amount of transport movements can take place and sustainable transportation technologies have to be used to reduce the ": null
    },
    {
        "ecological footprint": "Ecological Footprint"
    },
    {
        ".   The infrastructure of land, water and air transport needs to be safe and sustainable.   Currently thousands of tourists and hundreds of scientists a year depend on the Antarctic transportation system.             Winds continuously blow snow on roads in Antarctica.     The ": null
    },
    {
        "South Pole Traverse": "South Pole Traverse"
    },
    {
        " is approximately  long and links the United States ": null
    },
    {
        "McMurdo Station": "Mcmurdo Station"
    },
    {
        " on the coast to the ": null
    },
    {
        "Amundsen–Scott South Pole Station": "Amundsen–Scott South Pole Station"
    },
    {
        ". It was constructed by leveling snow and filling in ": null
    },
    {
        "crevasse": "Crevasse"
    },
    {
        "s, but is not ": null
    },
    {
        "paved": "Road Surface"
    },
    {
        ". There are flags to mark the route.     Also, the ": null
    },
    {
        "United States Antarctic Program": "United States Antarctic Program"
    },
    {
        " maintains two ice roads during the austral summer. One provides access to ": null
    },
    {
        "Pegasus Field": "Pegasus Field"
    },
    {
        " on the ": null
    },
    {
        "Ross Ice Shelf": "Ross Ice Shelf"
    },
    {
        ". The ice road between ": null
    },
    {
        "Pegasus Field": "Pegasus Field"
    },
    {
        " and ": null
    },
    {
        "McMurdo Station": "Mcmurdo Station"
    },
    {
        " is about 14 miles. The other road provides access to the ": null
    },
    {
        "Ice Runway": "Ice Runway"
    },
    {
        ", which is on ": null
    },
    {
        "sea ice": "Sea Ice"
    },
    {
        ". The road between the ": null
    },
    {
        "Ice Runway": "Ice Runway"
    },
    {
        " and ": null
    },
    {
        "McMurdo Station": "Mcmurdo Station"
    },
    {
        " varies in length from year to year depending on many factors, including ice stability. These roads are critical for resupplying ": null
    },
    {
        "McMurdo Station": "Mcmurdo Station"
    },
    {
        ", ": null
    },
    {
        "Scott Base": "Scott Base"
    },
    {
        ", and ": null
    },
    {
        "Amundsen–Scott South Pole Station": "Amundsen–Scott South Pole Station"
    },
    {
        ".         The scarcity and poor quality of road infrastructure limits land transportation by conventional vehicles.     A normal car on tires has very limited capability for Antarctic conditions. Scientific bases are often built on snow free areas close to the   ocean. Around these stations and on a hard packed snow or ice, tire based vehicles can drive but on deeper and softer snow, a normal tire based vehicle cannot travel. Due to these limitation vehicles on belts have been the preferred option in Antarctica. In 1997 two specialized cars with very large tires running tire pressure as low as 1.5psi/0.1bar travelled onto the high Antarctica Plateau, giving strong indication that tire based vehicles could be an option for efficient travelling in Antarctica.     ": null
    },
    {
        "Mawson Station": "Mawson Station"
    },
    {
        " started using classic ": null
    },
    {
        "Volkswagen Beetle": "Volkswagen Beetle"
    },
    {
        "s, the first production cars to be used in Antarctica. The first of these was named Antarctica 1 .     In December 1997 into February 1998 two AT44, 4x4 cars joined an expedition by the Swedish Polar Institution . The cars got used to transport people and supplies from the Ice shelf to WASA station, to perform scanning of the snow and support a drilling expedition to on the Antarctica Plateau 76°S 8°03W. This is the first time tire based vehicles successfully travel on the Antarctica high plateau.     In 2005 a team of six people took part in the ": null
    },
    {
        "Ice Challenger Expedition": "Ice Challenger Expedition"
    },
    {
        ". Travelling in a specially designed six wheel drive vehicle, the team completed the journey from the ": null
    },
    {
        "Antarctic": "Antarctic"
    },
    {
        " coast at Patriot Hills to the geographic ": null
    },
    {
        "South Pole": "South Pole"
    },
    {
        " in 69 hours. In doing so they easily beat the previous record of 24 days. They arrived at the South Pole on December 12, 2005.   Retrieved on 2008-10-14     The team members on that expedition were ": null
    },
    {
        "Andrew Regan": "Andrew Regan"
    },
    {
        ", ": null
    },
    {
        "Jason De Carteret": "Jason De Carteret"
    },
    {
        ", Andrew Moon, Richard Griffiths, Gunnar Egilsson and Andrew Miles. The expedition successfully showed that wheeled transport on the continent is not only possible but also often more practical. The expedition also hoped to raise awareness about global warming and climate change.     From start of December 2008 into February 2009, four AT44, 4x4 cars were used to support a ski race by Amundsen Omega 3, from S82° 41 E17° 43 to South Pole. A film was made of this race by BBC called On Thin Ice with Ben Fogle and James Cracknell. The cars started from Novo airbase at S70° 49 E11° 38, establish a route onto the plateau through the crevasse areas in the Shcherbakov Mountain Range driving nearly 1500  km to the start line of the ski race. For the return journey each car covered between 5400 and 5800  km with one fuel depot on the way.     From 2008 to date tire based cars, AT44 4x4 and AT44 6x6 have been used every season to support various NGO and scientific expedition/projects, supporting flights, fuel drops, filming, skiers, biker, a tractor, collecting snow samples and more. The combined distance covered on the Antarctica Plateau is over 220 thousand km and even though towing capacity is much lower than for most belt based vehicles, the tire based cars multiply the travel speed and use only a fraction of the fuel making this an option for some expeditions/projects.     A second expedition led by Andrew Regan and Andrew Moon departed in November 2010. The Moon-Regan Trans Antarctic Expedition this time traversed the entire continent twice, using two six-wheel-drive vehicles and a Concept Ice Vehicle designed by Lotus.  Retrieved on 2011-02-20 This time the team used the expedition to raise awareness about the global environmental importance of the Antarctic region and to show that ": null
    },
    {
        "biofuel": "Biofuel"
    },
    {
        " can be a viable and environmentally friendly option.          Antarcticas only harbour is at ": null
    },
    {
        "McMurdo Station": "Mcmurdo Station"
    },
    {
        ". Most coastal stations have offshore anchorages, and supplies are transferred from ship to shore by small boats, barges, and helicopters. A few stations have a basic wharf facility. All ships at port are subject to inspection in accordance with Article 7, ": null
    },
    {
        "Antarctic Treaty": "Antarctic Treaty"
    },
    {
        ". Offshore anchorage is sparse and intermittent, but poses no problem to sailboats designed for the ice, typically with lifting keels and long shorelines.   ": null
    },
    {
        "McMurdo Station": "Mcmurdo Station"
    },
    {
        " , ": null
    },
    {
        "Palmer Station": "Palmer Station"
    },
    {
        " ; government use only except by permit . A number of tour boats, ranging from large motorized vessels to small sailing yachts, visit the Antarctic Peninsula during the summer months . Most are based in ": null
    },
    {
        "Ushuaia": "Ushuaia"
    },
    {
        ", Argentina.       Transport in Antarctica takes place by air, using fixed-wing aircraft and helicopters.   Runways and helicopter pads have to be kept snow free to ensure safe take off and landing conditions.     Antarctica has ": null
    },
    {
        "20 airports": "List Of Airports In Antarctica"
    },
    {
        ", but there are no developed public-access airports or landing facilities. Thirty stations, operated by 16 national governments party to the ": null
    },
    {
        "Antarctic Treaty": "Antarctic Treaty"
    },
    {
        ", have landing facilities for either helicopters and/or fixed-wing aircraft; commercial enterprises operate two additional air facilities.     Helicopter pads are available at 27 stations; runways at 15 locations are gravel, sea-ice, blue-ice, or compacted snow suitable for landing wheeled, fixed-wing aircraft; of these, one is greater than 3  km in length, six are between 2  km and 3  km in length, 3 are between 1  km and 2  km in length, three are less than 1  km in length, and two are of unknown length; snow surface skiways, limited to use by ski-equipped, fixed-wing aircraft, are available at another 15 locations; of these, four are greater than 3  km in length, three are between 2  km and 3  km in length, two are between 1  km and 2  km in length, two are less than 1  km in length, and data is unavailable for the remaining four.     Antarctic airports are subject to severe restrictions and limitations resulting from extreme seasonal and geographic conditions; they do not meet ": null
    },
    {
        "ICAO": "Icao"
    },
    {
        " standards, and advance approval from the respective governmental or nongovernmental operating organization is required for landing Flights to the continent in the permanent darkness of the winter are normally only undertaken in an emergency, with burning barrels of fuel to outline a runway. On September 11, 2008, a United States Air Force ": null
    },
    {
        "C-17 Globemaster III": "C-17 Globemaster Iii"
    },
    {
        " successfully completed the first landing in Antarctica using ": null
    },
    {
        "night-vision goggles": "Night-Vision Goggles"
    },
    {
        " at ": null
    },
    {
        "Pegasus Field": "Pegasus Field"
    },
    {
        ".      In April 2001 an emergency evacuation of Dr. Ronald Shemenski was needed from ": null
    },
    {
        "Amundsen–Scott South Pole Station": "Amundsen–Scott South Pole Station"
    },
    {
        " when he contracted ": null
    },
    {
        "pancreatitis": "Pancreatitis"
    },
    {
        ". Three ": null
    },
    {
        "C-130 Hercules": "Lockheed C-130 Hercules"
    },
    {
        " were called back before their final leg because of weather. Organizers then called on ": null
    },
    {
        "Kenn Borek Air": "Kenn Borek Air"
    },
    {
        " based in ": null
    },
    {
        "Calgary, Alberta": "Calgary, Alberta"
    },
    {
        ". Two ": null
    },
    {
        "de Havilland Twin Otters": "De Havilland Canada Dhc-6 Twin Otter"
    },
    {
        " were dispatched out of Calgary with one being back-up. Twin Otters are specifically designed for the Canadian north and Kenn Borek Airs motto is Anywhere, Anytime, World-Wide . The mission was a success but not without difficulties and drawbacks. Ground crews needed to create a 2  km runway with tracked equipment not designed to operate in the low temperatures at that time of year, the aircraft controls had to be jerry-rigged when the flaps were frozen in position after landing, and instruments were not reliable because of the cold. When they saw a faint pink line on the horizon they knew they were going in the right direction. This was the first rescue from the South Pole during winter.  Canada honoured the Otter crew for bravery.  ": null
    }
]