[
    {
        "      Transportation in Puerto Rico  includes a system of roads, highways, freeways, airports, ports and harbors, and railway systems, serving a population of approximately 42 million year-round. It is funded primarily with both ": null
    },
    {
        "local": "government of puerto rico"
    },
    {
        " and ": null
    },
    {
        "federal": "federal government of the united states"
    },
    {
        " government funds.          Puerto Rico has a total of 42 airports , including one in each of the smaller islands of ": null
    },
    {
        "Vieques": "vieques, puerto rico"
    },
    {
        " and ": null
    },
    {
        "Culebra": "culebra, puerto rico"
    },
    {
        ". The main airport is ": null
    },
    {
        "Luis Muñoz Marín International Airport": "luis muñoz marín international airport"
    },
    {
        ", and consists of two runways and three concourses. It is by far the busiest airport in Puerto Rico, with direct connections to most major cities in the mainland United States, Latin America, Canada, the Caribbean ": null
    },
    {
        "Madrid": "madrid"
    },
    {
        ", Spain, Germany.     Puerto Rico has 42 airports with paved runways, of which:   42 airports with more than  of runway.   42 airports with runways ranging between  and .   42 airports with less than  of runway.   Puerto Rico also has 42 airports with unpaved runways, all of which have less than  of runway.       The following are current and former passenger and cargo airlines based in Puerto Rico or with flights to Puerto Rico:       ": null
    },
    {
        "Aerovías Nacionales de Puerto Rico": "aerovías nacionales de puerto rico"
    },
    {
        "   Prinair": "prinair"
    },
    {
        "   Puertorriqueña de Aviación": "puertorriqueña de aviación"
    },
    {
        "   Pan American World Airways": "pan american world airways"
    },
    {
        " Mexicana de Aviacion": "mexicana de aviacion"
    },
    {
        " Lufthansa": "lufthansa"
    },
    {
        " Viasa": "viasa"
    },
    {
        " Aerolineas Argentinas": "aerolineas argentinas"
    },
    {
        " KLM": "klm"
    },
    {
        " TWA": "twa"
    },
    {
        "        Air Caribbean": "air caribbean"
    },
    {
        "   Air Culebra": "air culebra"
    },
    {
        " Air Flamenco": "air flamenco"
    },
    {
        " Dorado Wings": "dorado wings"
    },
    {
        "   Executive Air": "executive air"
    },
    {
        "   Fina Air": "fina air"
    },
    {
        "   Isla Nena Air": "isla nena air"
    },
    {
        " Oceanair": "oceanair"
    },
    {
        "   Roblex Aviation": "roblex aviation"
    },
    {
        "   San Juan Aviation": "san juan aviation"
    },
    {
        " Tol Air": "tol air"
    },
    {
        "   Vieques Air Link": "vieques air link"
    },
    {
        " American Airlines": "american airlines"
    },
    {
        " American Eagle": "american eagle airlines"
    },
    {
        " Delta Air Lines": "delta air lines"
    },
    {
        " Spirit Airlines": "spirit airlines"
    },
    {
        " JetBlue": "jetblue"
    },
    {
        " AirTran Airways": "airtran airways"
    },
    {
        "   American Trans Air": "american trans air"
    },
    {
        "   United": "united airlines"
    },
    {
        " Continental": "continental airlines"
    },
    {
        "   Copa Airlines": "copa airlines"
    },
    {
        " Insel Air": "insel air"
    },
    {
        " Iberia Airlines": "iberia airlines"
    },
    {
        " Virgin Atlantic Airlines": "virgin atlantic airlines"
    },
    {
        " US Airways": "us airways"
    },
    {
        "   PAWA Dominicana": "pawa dominicana"
    },
    {
        " Southwest Airlines": "southwest airlines"
    },
    {
        " Volaris": "volaris"
    },
    {
        " Norwegian Air Shuttle": "norwegian air shuttle"
    },
    {
        "   Fed Ex Express": "fed ex express"
    },
    {
        " Cargolux": "cargolux"
    },
    {
        " CAL Cargo Airlines": "cal cargo airlines"
    },
    {
        " Martinair": "martinair"
    },
    {
        "                  Sea-based transportation of any merchandise or persons shipped entirely or even partly by water between U.S. points—either directly or indirectly via one or any number of foreign points—U.S. Federal Law requires that said items or persons must travel in U.S.-built, U.S.-crewed, U.S.-citizen owned vessels that are U.S.-documented by the Coast Guard for such maritime ": null
    },
    {
        "cabotage": "cabotage"
    },
    {
        " carriage. This transportation/trade restriction includes Puerto Rico under the Jones Act of 42 . The ": null
    },
    {
        "Jones Act": "merchant marine act of 1920"
    },
    {
        " and various other United States laws that govern the domestic and domestic-foreign-domestic transportation of merchandise and passengers by water between two points in the United States, including Puerto Rico, have been extended to that island-territory since the initial years of United States political relations. Currently, the only providers who ship from the United States to Puerto Rico are ": null
    },
    {
        "Crowley Maritime": "crowley maritime"
    },
    {
        ", ": null
    },
    {
        "TOTE Maritime": "tote maritime"
    },
    {
        ", and ": null
    },
    {
        "Trailer Bridge": "trailer bridge"
    },
    {
        ".     Strictly construed, the Jones Act refers only to Section 42 of the ": null
    },
    {
        "Merchant Marine Act of 42": "merchant marine act of 1920"
    },
    {
        ", , which has come to bear the name of its original sponsor, Sen. ": null
    },
    {
        "Wesley L. Jones": "wesley l. jones"
    },
    {
        ". Another law that was enacted in 42 requires essentially the same standards for the transport of passengers between U.S. points, directly or indirectly transported through foreign ports or foreign points . However, since the mid42s, as part of a joint effort between the ": null
    },
    {
        "cruise ship": "cruise ship"
    },
    {
        " industry that serves Puerto Rico and Puerto Rican politicians such as then ": null
    },
    {
        "Resident Commissioner": "resident commissioner of puerto rico"
    },
    {
        ", U.S. non-voting Representative ": null
    },
    {
        "Baltasar Corrada del Río": "baltasar corrada del río"
    },
    {
        ", obtained a limited-exception since no U.S. cruise ships that were Jones Act-eligible were participating in said market.     The application of these ": null
    },
    {
        "coastwise shipping": "coastwise shipping"
    },
    {
        " laws and their imposition on Puerto Rico consist in a serious restriction of ": null
    },
    {
        "free trade": "free trade"
    },
    {
        " and have been under scrutiny and controversy due to the apparent contradictory rhetoric involving the United States Governments sponsorship of free trade policies around the world, while its own national ": null
    },
    {
        "shipping": "shipping"
    },
    {
        " policy is essentially ": null
    },
    {
        "mercantilist": "mercantilist"
    },
    {
        " and based on notions foreign to free-trade principles.        San Juan Port  - Mainly divided in three: one in ": null
    },
    {
        "Old San Juan": "old san juan"
    },
    {
        " which includes cargo/freight and cruise ships, the Pan American Port Terminal in Isla Grande section mostly for cruise ships, and Puerto Nuevo Bay, exclusively for freight/cargo ships the belong to Guaynabo City not to San Juan. It is the main port of the island.    Port of Ponce  - The second largest port in Puerto Rico and can handle both freight/cargo and cruise ships. It is currently undergoing a significant expansion , with plans to convert it to an international shipping hub.    Port of Mayagüez  - The third largest port in Puerto Rico. It is mainly used for freight/cargo ships but is also home to the ": null
    },
    {
        "Dominican Republic": "dominican republic"
    },
    {
        "-Puerto Rico passenger ferry and has also been used for cruise ships.       The following are minor ports and harbors used for small freight/cargo ships, fishing vessels, and private boats/yachts: ": null
    },
    {
        "Guánica": "guánica, puerto rico"
    },
    {
        ", ": null
    },
    {
        "Guayanilla": "guayanilla, puerto rico"
    },
    {
        ", Guayama, Fajardo, ": null
    },
    {
        "Culebra": "culebra, puerto rico"
    },
    {
        ", and ": null
    },
    {
        "Vieques": "vieques, puerto rico"
    },
    {
        ".     There are ferries between Ceiba-Culebra and Ceiba-Vieques; between ": null
    },
    {
        "San Juan and Cataño": "la lancha de cataño"
    },
    {
        "; and between Ponce and ": null
    },
    {
        "Caja de Muertos": "caja de muertos"
    },
    {
        " .     There are several private marinas in Puerto Rico for boats and yachts, the largest being Puerto del Rey in Fajardo and ": null
    },
    {
        "Club Naútico de Ponce": "club naútico de ponce"
    },
    {
        ".            The ": null
    },
    {
        "Merchant Marine Act of 42": "merchant marine act of 1920"
    },
    {
        "  prevents foreign-flagged ships from carrying cargo between two American ports . Because of the Jones Act, foreign ships inbound with goods from ": null
    },
    {
        "Central": "central america"
    },
    {
        " and ": null
    },
    {
        "South America": "south america"
    },
    {
        ", ": null
    },
    {
        "Western Europe": "western europe"
    },
    {
        ", and ": null
    },
    {
        "Africa": "africa"
    },
    {
        " cannot stop in Puerto Rico, offload Puerto Rico-bound goods, load mainland-bound Puerto Rico-manufactured goods, and continue to U.S. ports. Instead, they must proceed directly to U.S. ports, where distributors ": null
    },
    {
        "break bulk": "break bulk cargo"
    },
    {
        " and send Puerto Rico-bound manufactured goods to Puerto Rico across the ocean by U.S.-flagged ships.     Puerto Rican consumers ultimately bear the expense of transporting goods again across the Atlantic and Caribbean Sea on U.S.-flagged ships subject to the extremely high operating costs imposed by the Jones Act. This also makes Puerto Rico less competitive with Caribbean ports as a shopping destination for tourists from home countries with much higher taxes even though prices for non-American manufactured goods in theory should be cheaper since Puerto Rico is much closer to Central and South America, Western Europe, and Africa.     The ": null
    },
    {
        "local government of Puerto Rico": "government of puerto rico"
    },
    {
        " has requested several times to the ": null
    },
    {
        "U.S. Congress": "u.s. congress"
    },
    {
        " to exclude Puerto Rico from the Jones Act restrictions without success. The most recent measure has been taken by the ": null
    },
    {
        "42th Legislative Assembly of Puerto Rico": "17th legislative assembly of puerto rico"
    },
    {
        " through .   These measures have always received support from all the ": null
    },
    {
        "major local political parties": "political party strength in puerto rico"
    },
    {
        ". In 42 the ": null
    },
    {
        "Government Accountability Office": "government accountability office"
    },
    {
        " published a report which concluded that repealing or amending the Jones Act cabotage law might cut Puerto Rico shipping costs and that shippers believed that opening the trade to non-U.S.-flag competition could lower costs.  The report, however, concluded that the effects of modifying the application of the Jones Act for Puerto Rico are highly uncertain for both Puerto Rico and the United States, particularly for the ": null
    },
    {
        "U.S. shipping industry": "united states merchant marine"
    },
    {
        " and the military preparedness of the United States.         Tren Urbano  - Provides passenger train service between various points of the ": null
    },
    {
        "San Juan Metropolitan Area": "san juan metropolitan area"
    },
    {
        ", between ": null
    },
    {
        "Bayamón": "bayamón, puerto rico"
    },
    {
        ", ": null
    },
    {
        "Guaynabo": "guaynabo"
    },
    {
        " and several important sections of San Juan.    Port of Ponce Railroad  - The only ": null
    },
    {
        "industrial railroad": "industrial railway"
    },
    {
        " operating on the entire island and located within the ": null
    },
    {
        "Puerto de Las Américas": "puerto de las américas"
    },
    {
        " in ": null
    },
    {
        "Ponce, Puerto Rico": "ponce, puerto rico"
    },
    {
        ". It consists of a small ": null
    },
    {
        "railroad yard": "rail yard"
    },
    {
        " and a railroad ferry terminal. About twice monthly, the ": null
    },
    {
        "railroad ferry": "train ferry"
    },
    {
        " transports ": null
    },
    {
        "tanker cars": "tank car"
    },
    {
        " on a ": null
    },
    {
        "barge": "car float"
    },
    {
        " between ": null
    },
    {
        "Mobile, Alabama": "mobile, alabama"
    },
    {
        " and the Ponce rail terminal, delivering chemicals for Puerto Ricos pharmaceutical industry.   Chemex Railroad operation in Ponce.    Tourism Railroads  - Several locomotives are used for tourism and recreational services, such as ": null
    },
    {
        "El Parque del Tren": "el parque del tren"
    },
    {
        " in Bayamón  , RadioSabor.es and the historic narrow gauge old sugarcane plantation ": null
    },
    {
        "Tren del Sur": "tren del sur"
    },
    {
        " in ": null
    },
    {
        "Arroyo": "arroyo, puerto rico"
    },
    {
        " . Government of Puerto Rico              The Puerto Rico train system flourished during the late 42th and early 42th century due to a large ": null
    },
    {
        "sugar cane": "sugar cane"
    },
    {
        " industry in the island. Most, if not all, of these system were private-owned services. Vieques Island also had the system all around the island connecting the others sugar cane plantations.     During the 42s and 42s, Puerto Rico did not have a national railroad system, but the city of Mayagüez did have a small passenger rail system for transporting its residents mainly along the Mendez Vigo Avenue.     The main system can be traced back to 42 when the northern line was built between San Juan and the town of ": null
    },
    {
        "Manatí": "manatí"
    },
    {
        ". The system was expanded to include all the western coastal towns, providing a link which would allow passengers to travel between the northern and southern parts of the island in less than a day for the first time in its history. Before its downfall, the Puerto Rico railroad system operated in all major cities, with tracks and stations along most of the coastal towns and direct lines to all major sugar refineries.     However, when Puerto Rico changed its mostly agricultural economy to an industrialized one, and the U.S. and Puerto Rican governments started investing heavily in interstate ": null
    },
    {
        "highway": "highway"
    },
    {
        "s and ": null
    },
    {
        "freeway": "freeway"
    },
    {
        "s, the railroad business soon collapsed. Passenger travel ceased in 42 while the commercial train system continued operating until 42             Puerto Rico has an extensive system of roads and ": null
    },
    {
        "highway": "highway"
    },
    {
        "s featuring tolled freeways . Some are designated as ": null
    },
    {
        "Interstate Highways": "interstate highways"
    },
    {
        "; although these routes do not connect to the ": null
    },
    {
        "contiguous United States": "contiguous united states"
    },
    {
        ", and are unsigned as such, they still receive funding in a similar fashion to the other Interstates on the U.S. mainland. In total, there are more than 42 miles of paved road. Some of the major highways are:      PR42  - Original main road between ": null
    },
    {
        "San Juan": "san juan, puerto rico"
    },
    {
        " and ": null
    },
    {
        "Ponce": "ponce, puerto rico"
    },
    {
        " before the completion of PR42 It is now mostly used by people living nearby and as a scenic route.    PR42  - Main ": null
    },
    {
        "freeway": "freeway"
    },
    {
        "/highway/": null
    },
    {
        "urban primary highway": "street"
    },
    {
        " between/through Ponce, ": null
    },
    {
        "Mayagüez": "mayagüez"
    },
    {
        ", ": null
    },
    {
        "Aguadilla": "aguadilla, puerto rico"
    },
    {
        ", and ": null
    },
    {
        "Arecibo": "arecibo, puerto rico"
    },
    {
        ". Original main highway between Arecibo and San Juan before completion of PR42 . This is the longest road in Puerto Rico.    PR42  -  Original main highway/urban primary highway between/through ": null
    },
    {
        "Salinas": "salinas, puerto rico"
    },
    {
        ", ": null
    },
    {
        "Guayama": "guayama, puerto rico"
    },
    {
        ", ": null
    },
    {
        "Humacao": "humacao, puerto rico"
    },
    {
        ", ": null
    },
    {
        "Fajardo": "fajardo, puerto rico"
    },
    {
        " and San Juan .    PR42  - Main freeway between San Juan and ": null
    },
    {
        "Hatillo": "hatillo, puerto rico"
    },
    {
        " .    PR42   - Main freeway between San Juan and Ponce.    PR42  - Main highway between Ponce and Arecibo .    PR42  - Main freeway between Salinas, Guayama, ": null
    },
    {
        "Yabucoa": "yabucoa, puerto rico"
    },
    {
        ", Humacao and Fajardo .    PR42  - Main freeway between ": null
    },
    {
        "Canóvanas": "canovanas, puerto rico"
    },
    {
        ", ": null
    },
    {
        "Carolina": "carolina, puerto rico"
    },
    {
        ", San Juan, and ": null
    },
    {
        "Río Grande": "río grande, puerto rico"
    },
    {
        ".          Transportation in Puerto Rico is heavily dependent on automobile transportation. Nevertheless, the government has increased investment in public transportation in an attempt to decrease vehicle dependency and road congestion. The islands metro area is serviced with three major public transportation systems:     The 42 mile metro system called ": null
    },
    {
        "Tren Urbano": "tren urbano"
    },
    {
        " with a total of 42 stations.  The project, which began operations in late 42 cost a total of $42 billion and was more than $42 billion over budget and four years late. However, the subsidized Tren Urbano has received far less ridership than was originally projected and has failed to make a significant impact on reducing the islands metropolitan area traffic. , TOLLROADSNews, November 42 42 accessed April 42 42   A daily ferry service known as the ": null
    },
    {
        "Cataño Ferry": "cataño ferry"
    },
    {
        ",  which operates a route across ": null
    },
    {
        "San Juan Bay": "san juan bay"
    },
    {
        " between Old San Juan and the municipality of ": null
    },
    {
        "Cataño": "cataño, puerto rico"
    },
    {
        ".    ": null
    },
    {
        "Metropolitan Bus Authority": "autoridad metropolitana de autobuses"
    },
    {
        "  provides daily bus transportation to residents of San Juan, Guaynabo, Bayamón, Trujillo Alto, Cataño, and Carolina through . Its fleet consists of 42 regular buses and 42 buses for handicapped persons, and its ridership is estimated at 42 on work days.        Most cities and towns also have a ": null
    },
    {
        "Jitney-type taxi": "share taxi"
    },
    {
        " system locally called Carros Públicos. Each town has a central taxi terminal usually within walking distance of the towns central plaza where taxis are stationed, and they provide transportation through local and islandwide routes. In February 42 the islandwide system of Carros Públicos consisted of over 42 vehicles authorized by the Comission de Servico Público , and it covered almost 42 routes. At approximately 42 passengers per day, in 42 the Públicos system handled over five times the daily passenger volume of the islands largest international airport, the ": null
    },
    {
        "Luis Muñoz Marín": "luis muñoz marín international airport"
    },
    {
        ". ": null
    }
]