[
    {
        "      This article details the variety of means of transport in ": null
    },
    {
        "Jersey": "jersey"
    },
    {
        ", Channel Islands.           Airport s: ": null
    },
    {
        "Jersey Airport": "jersey airport"
    },
    {
        "          Historically there were public ": null
    },
    {
        "railway": "railway"
    },
    {
        " services in the island, provided by two railway companies:   The ": null
    },
    {
        "Jersey Railway": "jersey railway"
    },
    {
        "   The ": null
    },
    {
        "Jersey Eastern Railway": "jersey eastern railway"
    },
    {
        " .     The mostly coastal lines operated out of St Helier and ran across the southern part of the island, reaching ": null
    },
    {
        "Gorey Harbour": "gorey, jersey"
    },
    {
        " in the east and ": null
    },
    {
        "la Corbière": "la corbière"
    },
    {
        " in the west. There were two stations in St Helier:  and  .     After closure, most of the infrastructure was removed and today little evidence remains of these railways. A small number of former station buildings are still standing, including St Helier Weighbridge, which is now in use as the ": null
    },
    {
        "Liberty Wharf": "liberty wharf"
    },
    {
        " shopping centre, and ": null
    },
    {
        "St Aubin railway station": "st aubin railway station"
    },
    {
        ", which is used today as the Parish Hall of ": null
    },
    {
        "Saint Brélade": "saint brélade"
    },
    {
        ". Part of the former Jersey Railway line from St Aubin to Corbière has been converted into a ": null
    },
    {
        "rail trail": "rail trail"
    },
    {
        " for cyclists and walkers.     During the ": null
    },
    {
        "German military occupation 1940–1945": "german occupation of the channel islands"
    },
    {
        ", light railways were re-established by the Germans for the purpose of supplying coastal fortifications. A one-metre gauge line was laid down following the route of the former Jersey Railway from Saint Helier to ": null
    },
    {
        "La Corbière": "la corbière"
    },
    {
        ", with a branch line connecting the stone quarry at Ronez in ": null
    },
    {
        "Saint John": "saint john, jersey"
    },
    {
        ". A 60  cm line ran along the west coast, and another was laid out heading east from Saint Helier to ": null
    },
    {
        "Gorey": "gorey, jersey"
    },
    {
        ". The first line was opened in July 1942, the ceremony being disrupted by passively resisting Jersey spectators. Cruickshank, Charles G. The German Occupation of the Channel Islands, The Guernsey Press,  The German railway infrastructure was dismantled after the Liberation in 1945.     Two railways operate at the ": null
    },
    {
        "Pallot Heritage Steam Museum": "pallot heritage steam museum"
    },
    {
        "; a standard gauge heritage steam railway, and a narrow gauge pleasure line operated by steam-outline diesel motive power.             Highway s:   total:   577  km   paved:   NA km   unpaved:   NA km             Buses are operated by CT Plus Jersey, a local subsidiary of ": null
    },
    {
        "HCT Group": "hct group"
    },
    {
        ". Bus service routes radiate from the Liberation Station in St Helier.     In 2012, it was announced that ": null
    },
    {
        "CT Plus": "ct plus"
    },
    {
        " would take over the operation of the bus service, commencing on 2 January 2013, ending 10 years of Connex service in Jersey. This new service is called ": null
    },
    {
        "LibertyBus": "libertybus"
    },
    {
        ".       Jersey has a well sign posted Island Cycle Network. A ": null
    },
    {
        "traffic-free route for cyclists and pedestrians": "trail"
    },
    {
        " links Saint Helier to ": null
    },
    {
        "La Corbière": "la corbière"
    },
    {
        " and a branch of this route ends up at St Peters village passing Jersey Airport.             Driving is on the left hand side. The maximum speed limit throughout the entire island is 40  mph , with slower limits on certain stretches of road, such as 20/30  mph in built up areas and 15  mph on roads designated as green lanes.     Visitors wishing to drive must possess a Certificate of Insurance or an International Green Card, a valid Driving Licence or International Driving Permit . Photocopies are not acceptable. A nationality plate must be displayed on the back of visiting vehicles.     It is an offence to hold a mobile phone whilst driving a moving vehicle. Where fitted, all passengers inside a vehicle must wear a seat belt at all times, regardless of whether they are sitting in the front or the rear.     The penalties for drinking and driving in Jersey are up to £2,000 fine or 6 months in prison for the first offence plus unlimited disqualification of driving licence. It is an offence to drive whilst under the influence of drugs. Since July 2014 it has also been illegal to smoke in any vehicle carrying passengers under the age of 18.          Single yellow lines indicate that parking is prohibited and is liable to a fine.     Most parking, including streetside, operate using either Paycards or ": null
    },
    {
        "PaybyPhone": "paybyphone"
    },
    {
        " and is indicated with the Paycard Symbol. Paycards are available to purchase at many stores across the island. Paycards are used by scratching the relevant information such as time of arrival.     Paycards are sold in units. Car parks where Paycards are required have signs indicating how many units are required for a period of time. Paycards are sold in 1 unit, 2 units or 4 units.     Certain car parks, such as the Waterfront, Sand Street and ": null
    },
    {
        "Ports of Jersey": "ports of jersey"
    },
    {
        " Car Parks use automatic number plate recognition or ticket technology with a pay upon exit system.     There are four main residents’ and business parking zones within St Helier.       In some roads on the outskirts of St Helier and in the harbours, and also in some car parks in St Brelade, parking is free but controlled by ": null
    },
    {
        "parking discs": "parking disc"
    },
    {
        " – obtainable from the Town Hall for a small charge.           Seaport s and harbour s:     ": null
    },
    {
        "Saint Helier": "saint helier"
    },
    {
        " is the islands main port, others include ": null
    },
    {
        "Gorey": "gorey, jersey"
    },
    {
        ", ": null
    },
    {
        "Saint Aubin": "saint aubin, jersey"
    },
    {
        ", ": null
    },
    {
        "La Rocque": "vingtaine de la rocque"
    },
    {
        ", and ": null
    },
    {
        "Bonne Nuit": "bonne nuit"
    },
    {
        ". It is  distant from ": null
    },
    {
        "Granville, Manche": "granville, manche"
    },
    {
        ",  from ": null
    },
    {
        "Southampton": "southampton"
    },
    {
        ",  from ": null
    },
    {
        "Poole": "poole"
    },
    {
        ", and  from ": null
    },
    {
        "St Malo": "st malo"
    },
    {
        ".     On 20 August 2013, ": null
    },
    {
        "Huelin-Renouf": "huelin-renouf"
    },
    {
        ", which had operated a lift-on lift-off container service for 80 years between the ": null
    },
    {
        "Port of Southampton": "port of southampton"
    },
    {
        " and the Port of ": null
    },
    {
        "Jersey": "jersey"
    },
    {
        ", ceased trading.  Senator ": null
    },
    {
        "Alan Maclean": "alan j.h. maclean"
    },
    {
        ", a Jersey politician had previously tried to save the 90-odd jobs furnished by the company to no avail.  On 20 September, it was announced that ": null
    },
    {
        "Channel Island Lines": "channel island lines"
    },
    {
        " would continue this service, and would purchase the MV  Huelin Dispatch  from ": null
    },
    {
        "Associated British Ports": "associated british ports"
    },
    {
        " who in turn had purchased them from the receiver in the bankruptcy.  The new operator was to be funded by ": null
    },
    {
        "Rockayne Limited": "rockayne limited"
    },
    {
        ", a closely held association of Jersey businesspeople.     Passenger-only access to France is provided by ": null
    },
    {
        "Manche-Iles Express": ":fr:finistmer"
    },
    {
        " ferry service, to either ": null
    },
    {
        "Barneville-Carteret": "barneville-carteret"
    },
    {
        ", ": null
    },
    {
        "Granville": "granville, manche"
    },
    {
        " or ": null
    },
    {
        "Dielette": "flamanville, manche"
    },
    {
        ".     A service to ": null
    },
    {
        "St Malo": "st malo"
    },
    {
        " was provided by ": null
    },
    {
        "Compagnie Corsaire": ":fr:compagnie nationale de navigation"
    },
    {
        ", but is now operated by its sister service, ": null
    },
    {
        "Condor Ferries": "condor ferries"
    },
    {
        ", which runs  Commodore Goodwill , a large ": null
    },
    {
        "ro-ro": "roll-on/roll-off"
    },
    {
        " vessel to ": null
    },
    {
        "Portsmouth": "portsmouth"
    },
    {
        ", and has multiple ro-ro connections to ": null
    },
    {
        "Poole": "poole"
    },
    {
        " and ": null
    },
    {
        "St Malo": "st malo"
    },
    {
        ".     ": null
    },
    {
        "Poole": "poole"
    },
    {
        " - Guernsey - Jersey    ": null
    },
    {
        "Portsmouth": "portsmouth"
    },
    {
        " - Guernsey - Jersey    ": null
    },
    {
        "Saint-Malo": "saint-malo"
    },
    {
        " - Jersey - Guernsey         - to St Malo   ": null
    },
    {
        "Condor Ferries": "condor ferries"
    },
    {
        " freight and passenger services: Commodore Goodwill.   Huelin-Renouf Shipping Limited    ": null
    },
    {
        "Channel Island Lines": "channel island lines"
    },
    {
        ", took up the Huelin-Renouf business from September 2013   ": null
    }
]