[
    {
        "Transfinite numbers are numbers that are ": null
    },
    {
        "infinite": "infinity"
    },
    {
        " in the sense that they are larger than all ": null
    },
    {
        "finite": "finite set"
    },
    {
        " numbers, yet not necessarily ": null
    },
    {
        "absolutely infinite": "absolutely infinite"
    },
    {
        ". The term transfinite was coined by ": null
    },
    {
        "Georg Cantor": "georg cantor"
    },
    {
        ", who wished to avoid some of the implications of the word infinite in connection with these objects, which were, nevertheless, not finite. Few contemporary writers share these qualms; it is now accepted usage to refer to transfinite ": null
    },
    {
        "cardinals": "cardinal number"
    },
    {
        " and ": null
    },
    {
        "ordinals": "ordinal number"
    },
    {
        " as infinite . Nevertheless, the term transfinite also remains in use.       Any finite number can be used in at least two ways: as an ordinal and as a cardinal. Cardinal numbers specify the size of sets , whereas ordinal numbers specify the order of a member within an ordered set . When extended to transfinite numbers, these two concepts become distinct. A transfinite cardinal number is used to describe the size of an infinitely large set, while a transfinite ordinal is used to describe the location within an infinitely large set thats ordered. The most notable ordinal and cardinal numbers are, respectively:     ": null
    },
    {
        "ω": "ordinal numberordinals extend the natural numbers"
    },
    {
        " is defined as the lowest transfinite ordinal number and is the ": null
    },
    {
        "order type": "order type"
    },
    {
        " of the ": null
    },
    {
        "natural number": "natural number"
    },
    {
        "s under their usual linear ordering.   ": null
    },
    {
        "Aleph-naught": "aleph-naught"
    },
    {
        ", \\aleph_42 is defined as the first transfinite cardinal number and is the ": null
    },
    {
        "cardinality": "cardinality"
    },
    {
        " of the ": null
    },
    {
        "infinite set": "infinite set"
    },
    {
        " of the natural numbers. If the ": null
    },
    {
        "axiom of choice": "axiom of choice"
    },
    {
        " holds, the next higher cardinal number is ": null
    },
    {
        "aleph-one": "aleph-one"
    },
    {
        ", \\aleph_42 If not, there may be other cardinals which are incomparable with aleph-one and larger than aleph-naught. But in any case, there are no cardinals between aleph-naught and aleph-one.     The ": null
    },
    {
        "continuum hypothesis": "continuum hypothesis"
    },
    {
        " states that there are no intermediate cardinal numbers between aleph-null and the ": null
    },
    {
        "cardinality of the continuum": "cardinality of the continuum"
    },
    {
        " : that is to say, aleph-one is the cardinality of the set of real numbers.      Some authors, including P. Suppes and J. Rubin, use the term transfinite cardinal to refer to the cardinality of a ": null
    },
    {
        "Dedekind-infinite set": "dedekind-infinite set"
    },
    {
        ", in contexts where this may not be equivalent to infinite cardinal ; that is, in contexts where the ": null
    },
    {
        "axiom of countable choice": "axiom of countable choice"
    },
    {
        " is not assumed or is not known to hold. Given this definition, the following are all equivalent:   \\mathfrak is a transfinite cardinal. That is, there is a Dedekind infinite set A such that the cardinality of A": null
    }
]