[
    {
        "   There are four types of public transport in ": null
    },
    {
        "French Guiana": "French Guiana"
    },
    {
        ".   Buses   Air links   The long distance carriers   The taxi boats.       The ": null
    },
    {
        "bus": "Buses"
    },
    {
        " of the Joint Association of Public Transport serve only the municipality of ": null
    },
    {
        "Cayenne": "Cayenne"
    },
    {
        ". There are seven lines. Some lines have 3 or 4 buses. The price of ": null
    },
    {
        "ticket": "T + Ticket"
    },
    {
        ", the normal rate is 1.10 euro for 2011. Note that the SMTC is a ": null
    },
    {
        "public body": "Public Body"
    },
    {
        ", and the lines are restricted. SMTC buses now have a system of ": null
    },
    {
        "air conditioning": "Air Conditioning"
    },
    {
        ". The seats are more comfortable. These buses are also used to transport students from different schools. During the school year, the pregnant woman and senior citizens need to manage to find a place because these buses are always full, especially on market days. Buses only stop at bus stops . The wait time is about 15 to 40 minutes depending on the lines.       Line No. 1 dessert habitat areas such as: CHATENAY, HORTH, GRANT, COULEE D’OR, JARDIN DE ZEPHIR, BOURDA, COLIBRI, et ZEPHIR, and major traffic generators in the Greater Cayenne . With a bus scheduled to arrive every 30 minutes Monday to Saturday, and a bus every hour on Saturday afternoon. Amplitude : 5 h beginning 45, 20 end 14 h.       Line No. 2 dessert habitat areas such as: RESIDENCE UNIVERSITAIRE, STANILAS, PASTEUR, RESIDENCE DE BADUEL, and major traffic generators in the Greater Cayenne . With a bus scheduled to arrive every 35 minutes Monday to Saturday, and a bus every hour on Saturday afternoon. Amplitude : 6 h beginning 15, 01 end 20 h.       Line No. 3 serves residential areas such as: MANGUIER, THEMIRE, MANGO, BONHOMME, NOVA PARC, VENDÔME, CHEMIN TARZAN, MONT-LUCAS, and major traffic generators in the Greater Cayenne . With a bus scheduled to arrive every 22 minutes Monday to Saturday, and a bus every hour on Saturday afternoon. Amplitude : 5 h beginning 45, end 19 h 56Line 4       dessert habitat areas such as: RENOVATION URBAINE, EAU LISETTE, URANUS, ROSERAIE, MORTIN, ZENITH , and major traffic generators in the Greater Cayenne . With a bus scheduled to arrive every 40 minutes Monday to Saturday, and a bus every hour on Saturday afternoon. Amplitude : 5 h beginning 50, 20 end 13 h.       Line No. 5 serves residential areas such as: LES ALIZES, ANATOLE, BRUTUS, CESAIRE, EAU LISETTE, BONHOMME, CABASSOU, and major traffic generators in the town of Cayenne . With a bus scheduled to arrive every 30 minutes Monday to Saturday, and a bus every hour on Saturday afternoon. Amplitude : 6 pm start 00, end 20 h 04.       Line No. 1 PC serves an area of habitat in the Making , downtown, industrial zones and GALMOT Collery, CAF services, other areas activity and corresponds with all lines of the network by structuring ways. With a bus scheduled to arrive every hour from Monday to Saturday. Amplitude : 5 h beginning 55, 19 end 20 h.       Line No. 2 PC , serves the same areas as the Line No. PC 1 but in reverse. With a bus scheduled to arrive every hour from Monday to Saturday. Amplitude : 6 h beginning 10, 20 end 10 h.       Air links, provided by ": null
    },
    {
        "Air Guyane": "Air Guyane"
    },
    {
        ", daily link ": null
    },
    {
        "Cayenne": "Cayenne"
    },
    {
        " to ": null
    },
    {
        "Maripasoula": "Maripasoula"
    },
    {
        " and ": null
    },
    {
        "Saül": "Saül"
    },
    {
        ". Price from 100 € to 120 € return.           The ": null
    },
    {
        "taxi": "Taxicab"
    },
    {
        " group offers travel in ": null
    },
    {
        "minibus": "Minibus"
    },
    {
        "es of nine seats. Their schedules are ": null
    },
    {
        "random": "Random"
    },
    {
        ", based as it only when the minibus is full or nearly so. To connect the ": null
    },
    {
        "Commons": "Common"
    },
    {
        " Saint-Laurent du Maroni": "Saint-Laurent Du Maroni"
    },
    {
        " Mana": "Mana"
    },
    {
        " Organabo": "Organabo"
    },
    {
        " Iracoubo": "Iracoubo"
    },
    {
        " Sinnamary": "Sinnamary"
    },
    {
        ", ": null
    },
    {
        "Kourou": "Kourou"
    },
    {
        " Macouria": "Macouria"
    },
    {
        " Cayenne": "Cayenne"
    },
    {
        " Rémire-Montjoly": "Rémire-Montjoly"
    },
    {
        " Degrad des Cannes": "Degrad Des Cannes"
    },
    {
        " Balata": "Balata, French Guiana"
    },
    {
        " and ": null
    },
    {
        "St. Rose of Lima": "St. Rose Of Lima, French Guiana"
    },
    {
        " Matoury": "Matoury"
    },
    {
        " Cocoa or ": null
    },
    {
        "Stoupan": "Stoupan"
    },
    {
        " , ": null
    },
    {
        "Régina": "Régina"
    },
    {
        " Saint-Georges-de it Oyapock": "Saint-Georges-De It Oyapock"
    },
    {
        ". All taxis are unaware systematically ": null
    },
    {
        "Degrad des Cannes": "Degrad Des Cannes"
    },
    {
        " or ": null
    },
    {
        "St. Rose of Lima": "St. Rose Of Lima, French Guiana"
    },
    {
        ". It is best to ask the driver before boarding. ": null
    },
    {
        "Montsinéry-Tonnegrande": "Montsinéry-Tonnegrande"
    },
    {
        " is the only coastal town not to be served by taxi group. Some example prices are : €10 Cayenne-Kourou, St. Laurent-€25 Kourou, Cayenne-Saint-Georges-de-Oyapock €40.       Since early 2010, an agreement was established between the General Council, responsible for organizing transport between the towns, and some carriers Taxi Co. The new public service became known as TIG . The TIG coexist with Taxi Co. The vehicle types are the same but the Convention requires that transportation TIG have fixed schedules on defined paths . Prices are generally lower than the prices charged by the Taxi Co .       ": null
    },
    {
        "Canoe": "Canoe"
    },
    {
        "-taxis are on the ": null
    },
    {
        "Maroni": "Maroni"
    },
    {
        " between ": null
    },
    {
        "Saint-Laurent du Maroni": "Saint-Laurent Du Maroni"
    },
    {
        " and ": null
    },
    {
        "Apatou": "Apatou"
    },
    {
        ", as well as the ": null
    },
    {
        "Oyapock": "River Oyapock"
    },
    {
        " between ": null
    },
    {
        "Saint-Georges-de-Oyapock": "Saint-Georges-De-Oyapock"
    },
    {
        " and the Brazilian city of ": null
    },
    {
        "Oiapoque": "Oiapoque"
    },
    {
        ". Apatou is located at 3 oclock on the ": null
    },
    {
        "Maroni": "Maroni"
    },
    {
        ". Departures are daily at 11:00 and back to 7 am. The price is 11 € one way. To cross the Maroni , count 5 € each way. Oiapoque is located 15 minutes from St. George. Departures are on demand, usually when a number of passengers is met. Unlike Maroni, there is no curfew on the Oyapock. Canoes are available however, fewer night and the prices are somewhat higher .          A short railway is used within the ": null
    },
    {
        "Guiana Space Centre": "Guiana Space Centre"
    },
    {
        " . The railway is double tracked and used by unpowered rail cars and are towed by rubber wheeled vehicles with railway wheels or bogies to ride along the rail tracks.      From 1880s to sometime after 1926 a steam narrow gauge railway was used for gold mines in Saint-Elie  and two other lines were partially built and never used.      Prison railways were built in the 1890s but the line was abandoned after prisons closed and disappeared sometime after 1946.      There are no other railways in French Guiana and none have existed for revenue passenger service, and there are no connections to neighbouring countries.       total:   1,817  km   paved:   727  km   unpaved:   1,090  km       460  km, navigable by small oceangoing vessels and river and coastal steamers; 3,300  km navigable by native craft       ": null
    },
    {
        "Cayenne": "Cayenne, French Guiana"
    },
    {
        ", ": null
    },
    {
        "Degrad des Cannes": "Degrad Des Cannes"
    },
    {
        ", ": null
    },
    {
        "Saint-Laurent du Maroni": "Saint-Laurent Du Maroni"
    },
    {
        "       none       A 1999 estimate counted 11 airports in the department. The main airport of French Guiana is ": null
    },
    {
        "Cayenne – Félix Eboué Airport": "Cayenne – Félix Eboué Airport"
    },
    {
        ".       total:   4   over 3,047 m:   1   914 to 1,523 m:   2   under 914 m:   1       total:   7   914 to 1,523 m:   2   under 914 m:   5     :See also : ": null
    },
    {
        "French Guiana": "French Guiana"
    }
]