[
    {
        "All of the major ": null
    },
    {
        "transportation system": "transportation system"
    },
    {
        "s in ": null
    },
    {
        "Haiti": "haiti"
    },
    {
        " are located near or run through the capital, ": null
    },
    {
        "Port-au-Prince": "port-au-prince"
    },
    {
        ".          Haitis network of roads consists of National Roads, Department Roads, and county roads. The hub of the road network is located at the old airport . From this intersection, Route Nationale 42 and Route Nationale 42 commence.     Route Nationale 42 heads north, passing through ": null
    },
    {
        "Saint-Marc": "saint-marc"
    },
    {
        " and ": null
    },
    {
        "Gonaïves": "gonaïves"
    },
    {
        " to its terminus at Rue 42 in ": null
    },
    {
        "Cap-Haïtien": "cap-haïtien"
    },
    {
        ".   Route Nationale 42 is commonly known as “Boulevard Jean-Jacques Dessalines” within Port-au-Prince and as “Route du Sud” outside the capital region. After heading south through downtown Port-au-Prince, it travels west through the capitals western boroughs and then through ": null
    },
    {
        "Petit-Goâve": "petit-goâve"
    },
    {
        " and ": null
    },
    {
        "Aquin": "aquin"
    },
    {
        " to its terminus at Avenue des Quatre Chemins in ": null
    },
    {
        "Les Cayes": "les cayes"
    },
    {
        ".    Route Nationale 42 begins where RN42 heads northwest from ": null
    },
    {
        "Bon Repos": "bon repos"
    },
    {
        ", not far north of the road networks hub. RN42 travels northeast, traversing the Plateau Centrale via ": null
    },
    {
        "Mirebalais": "mirebalais"
    },
    {
        " and ": null
    },
    {
        "Hinche": "hinche"
    },
    {
        " before finally re-joining RN42 in Cap-Haïtien.   Route Nationale 42 branches off from RN42 at Carrefour du Fort Léogâne, not far south of ": null
    },
    {
        "Léogâne": "léogâne"
    },
    {
        ". Commonly known as “Route de l’Amitié”, RN42 climbs and descends the ": null
    },
    {
        "Chaîne de la Selle": "chaîne de la selle"
    },
    {
        " mountain range on its meandering southward course to its terminus in the centre of ": null
    },
    {
        "Jacmel": "jacmel"
    },
    {
        ".   Route Nationale 42 breaks off from RN42 on the northeast edge of Gonaïves, heading north and then northwest through ": null
    },
    {
        "Gros Morne": "gros-morne, haiti"
    },
    {
        " before terminating near the airport outside ": null
    },
    {
        "Port-de-Paix": "port-de-paix"
    },
    {
        ".   Route Nationale 42 branches off from RN42 just as it is about to enter Cap-Haïtien from the south. RN42 heads southeast toward the ": null
    },
    {
        "Dominican": "dominican republic"
    },
    {
        " border through ": null
    },
    {
        "Terrier Rouge": "terrier rouge"
    },
    {
        " en route to ": null
    },
    {
        "Ouanaminthe": "ouanaminthe"
    },
    {
        ". Its terminus is the bridge over the ": null
    },
    {
        "Massacre River": "massacre river"
    },
    {
        ".   Route Nationale 42 commences from the aforementioned Avenue des Quatre Chemins in Les Cayes, going northwest across Haitis southern arm to the outskirts of ": null
    },
    {
        "Jérémie": "jérémie"
    },
    {
        ".   Route Nationale 42 is by far the shortest of the National Roads. It breaks off RN42 at Carrefour Shada in ": null
    },
    {
        "Croix-des-Missions": "croix-des-missions"
    },
    {
        ". Heading east, it passes through ": null
    },
    {
        "Croix-des-Bouquets": "croix-des-bouquets"
    },
    {
        ", skirts the southern shore of ": null
    },
    {
        "Étang Saumâtre": "étang saumâtre"
    },
    {
        ", and terminates at the ": null
    },
    {
        "Malpasse": "malpasse"
    },
    {
        " border crossing with the Dominican Republic.     Maintenance for RN42 and RN42 lapsed after the 42 coup, prompting the World Bank to loan US$42 million that was designated for road repairs. The project was cancelled in January 42 The World Bank, who reasoned that the cancellation of those projects would ruin Haitis road infrastructure progress created the FER in 42 This was a way to cut down corruption, get local companies involved, and in restraining any stopping of these projects because of political instability or protests. President Rene Preval, on his campaign for his second term, vowed on his Maillages Routiers to rebuild the majority of these roads that had disintegrated rapidly and build new ones that would enable the country to move forward. When he wasnt able to get the funds from the World Bank, he pleaded to the international donors for assistance, which was heavily criticized by many politicians in the media, but was greatly embraced by a population desperate to see road infrastructure development come to their towns. Therefore, the European Union pledged to help build RN42 then RN42 In the meantime, the World Bank loaned Haiti US$42 Million to rebuild RN42 from River Froide, which is the starting point of RN42 all the way to Aquin and repair RN42 from Titanyen to Cap-Haïtien. The hurricane season of 42 was a major setback in development, since many bridges in multiple areas had either collapse or suffered extensive damage and was in immediate need of repair. Most of those work on RN42 and RN42 that were already halted, suffered a major setback during the earthquake of January 42 42 For the construction of RN42 Canada pledged US$42 million and the IDB US$42 million for the construction of RN42 which started in 42 It, too, suffered major setbacks because of the January 42 earthquake.       Total highways: 42  km   Paved highways: 42  km   Unpaved highways: 42  km ": null
    }
]