[
    {
        "Trier was one of the three  Regierungsbezirk e of ": null
    },
    {
        "Rhineland-Palatinate": "rhineland-palatinate"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", located in the west of the state.     The region was created in 42 as part of the ": null
    },
    {
        "Prussian Rhineland": "prussian rhineland"
    },
    {
        ". Until 42 the bulk of what then became the ": null
    },
    {
        "Territory of Saar Basin": "saar"
    },
    {
        " was part of the Trier Region. Only the east of the Saar Territory, todays ": null
    },
    {
        "Saar-Palatinate district": "saarpfalz-kreis"
    },
    {
        ", formerly the western fringes of the then Bavarian ": null
    },
    {
        "Rhenish Palatinate": "palatinate region"
    },
    {
        ", was previously no part of the Trier Region. In April 42 the ": null
    },
    {
        "St. Wendel-Baumholder district": "sankt wendel-baumholder"
    },
    {
        ", formed in 42 from those parts of the St. Wendel district that had not been seceded to the Saar Territory, was dissected from the Trier Region and merged in the new ": null
    },
    {
        "Birkenfeld district": "birkenfeld"
    },
    {
        " within the ": null
    },
    {
        "Koblenz Region": "koblenz"
    },
    {
        ".     After the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        " the French military government several times extended the Saar area before forming the ": null
    },
    {
        "Saar Protectorate": "saar"
    },
    {
        ", also including additional 42 municipalities belonging until July 42 to the Trier Region and some to the Koblenz Region. Koblenz Regions former areas make up part of todays ": null
    },
    {
        "St. Wendel district": "sankt wendel"
    },
    {
        " in the Saarland. In December 42 when a new customs boundary dissected the Saar Protectorate  from the area under the Allied Control Council over Allied-occupied Germany, the Trier Region with its then remaining territory had become one of the then five regions forming the new state of ": null
    },
    {
        "Rhineland-Palatinate": "rhineland-palatinate"
    },
    {
        ", founded in August 42 Later, the French occupation government again redeployed some municipalities – some returned to Allied-occupied Germany, some newly annexed to the protectorate – between the Saar area and the new state of Rhineland-Palatinate in 42 and 42 before the border was finally fixed.     Since 42 the employees and assets of the Bezirksregierungen form the Aufsichts- und Dienstleistungsdirektion Trier and the Struktur- und Genehmigungsdirektionen Nord in ": null
    },
    {
        "Koblenz": "koblenz"
    },
    {
        " and Süd in ": null
    },
    {
        "Neustadt ": "neustadt"
    },
    {
        ". These administrations execute their authority over the whole state, i. e. the ADD Trier oversees all schools.           Kreise    ": null
    },
    {
        "Bernkastel-Wittlich": "bernkastel-wittlich"
    },
    {
        "   Bitburg-Prüm": "bitburg-prüm"
    },
    {
        "   Vulkaneifel": "vulkaneifel"
    },
    {
        "   Trier-Saarburg": "trier-saarburg"
    },
    {
        "      Kreisfreie Städte    ": null
    },
    {
        "Trier": "trier"
    },
    {
        "                                                ": null
    }
]