[
    {
        "            In ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", the trigonometric functions  are ": null
    },
    {
        "real function": "real function"
    },
    {
        "s which relate an angle of a ": null
    },
    {
        "right-angled triangle": "right-angled triangle"
    },
    {
        " to ratios of two side lengths. They are widely used in all sciences that are related to ": null
    },
    {
        "geometry": "geometry"
    },
    {
        ", such as ": null
    },
    {
        "navigation": "navigation"
    },
    {
        ", ": null
    },
    {
        "solid mechanics": "solid mechanics"
    },
    {
        ", ": null
    },
    {
        "celestial mechanics": "celestial mechanics"
    },
    {
        ", ": null
    },
    {
        "geodesy": "geodesy"
    },
    {
        ", and many others. They are among the simplest ": null
    },
    {
        "periodic function": "periodic function"
    },
    {
        "s, and as such are also widely used for studying periodic phenomena, through ": null
    },
    {
        "Fourier analysis": "fourier analysis"
    },
    {
        ".     The most widely used trigonometric functions are the ": null
    },
    {
        "sine": "sine"
    },
    {
        ", the cosine, and the tangent. Their ": null
    },
    {
        "reciprocal": "multiplicative inverse"
    },
    {
        "s are respectively the cosecant, the secant, and the cotangent, which are less used in modern mathematics.     The oldest definitions of trigonometric functions, related to right-angle triangles, define them only for ": null
    },
    {
        "acute angle": "acute angle"
    },
    {
        "s. For extending these definitions to functions whose ": null
    },
    {
        "domain": "domain of a function"
    },
    {
        " is the whole ": null
    },
    {
        "projectively extended real line": "projectively extended real line"
    },
    {
        ", one can use geometrical definitions using the standard ": null
    },
    {
        "unit circle": "unit circle"
    },
    {
        " . Modern definitions express trigonometric functions as ": null
    },
    {
        "infinite series": "series"
    },
    {
        " or as solutions of ": null
    },
    {
        "differential equation": "differential equation"
    },
    {
        "s. This allows extending the domain of the sine and the cosine functions to the whole ": null
    },
    {
        "complex plane": "complex plane"
    },
    {
        ", and the domain of the other trigonometric functions to the complex plane from which some isolated points are removed.                  In this section, the same upper-case letter denotes a vertex of a triangle and the measure of the corresponding angle; the same lower case letter denotes an edge of the triangle and its length.     Given an ": null
    },
    {
        "acute angle": "acute angle"
    },
    {
        "  of a ": null
    },
    {
        "right-angled triangle": "right-angled triangle"
    },
    {
        " the ": null
    },
    {
        "hypotenuse": "hypotenuse"
    },
    {
        "  is the side that connects the two acute angles. The side  adjacent to  is the side of the triangle that connects  to the right angle. The third side  is said opposite to .     If the angle  is given, then all sides of the right-angled triangle are well defined up to a scaling factor. This means that the ratio of any two side lengths depends only on . These six ratios define thus six functions of , which are the trigonometric functions. More precisely, the six trigonometric functions are:    :   \\begin   & \\text & & \\sin A \\frac a h \\frac \\mathrm\\mathrm \\\\   & \\text & & \\cos A \\frac b h \\frac \\mathrm\\mathrm \\\\   & \\text & & \\tan A \\frac a b \\frac \\mathrm\\mathrm \\\\   & \\text & & \\csc A \\frac h a \\frac \\mathrm\\mathrm \\\\   & \\text & & \\sec A \\frac h b \\frac \\mathrm\\mathrm \\\\   & \\text & & \\cot A \\frac b a \\frac \\mathrm\\mathrm   \\end       In a right angled triangle, the sum of the two acute angles is a right angle, that is 42° or \\frac \\pi 42 ": null
    },
    {
        "radian": "radian"
    },
    {
        "s. This induces relationships between trigonometric functions that are summarized in the following table, where the angle is denoted by \\theta instead of .             In geometric applications, the argument of a trigonometric function is generally the measure of an ": null
    },
    {
        "angle": "angle"
    },
    {
        ". For this purpose, any ": null
    },
    {
        "angular unit": "angular unit"
    },
    {
        " is convenient, and angles are most commonly measured in ": null
    },
    {
        "degrees": "degree"
    },
    {
        ".     When using trigonometric function in ": null
    },
    {
        "calculus": "calculus"
    },
    {
        ", their argument is generally not an angle, but rather a ": null
    },
    {
        "real number": "real number"
    },
    {
        ". In this case, it is more suitable to express the argument of the trigonometric as the length of the ": null
    },
    {
        "arc": "arc"
    },
    {
        " of the ": null
    },
    {
        "unit circle": "unit circle"
    },
    {
        " delimited by an angle with the center of the circle as vertex. Therefore, one uses the ": null
    },
    {
        "radian": "radian"
    },
    {
        " as angular unit: a radian is the angle that delimits an arc of length  on the unit circle. A complete ": null
    },
    {
        "turn": "turn"
    },
    {
        " is thus an angle of  radians.     A great advantage of radians is that many formulas are much simpler when using them, typically all formulas relative to ": null
    },
    {
        "derivative": "derivative"
    },
    {
        "s and ": null
    },
    {
        "integral": "integral"
    },
    {
        "s.     This is thus a general convention that, when the angular unit is not explicitly specified, the arguments of trigonometric functions are always expressed in radians.               The six trigonometric functions can be defined as ": null
    },
    {
        "coordinate values": "cartesian coordinate system"
    },
    {
        " of points on the ": null
    },
    {
        "Euclidean plane": "euclidean plane"
    },
    {
        " that are related to the ": null
    },
    {
        "unit circle": "unit circle"
    },
    {
        ", which is the ": null
    },
    {
        "circle": "circle"
    },
    {
        " of radius one centered at the origin  of this coordinate system. While ": null
    },
    {
        "right-angled triangle definitions": "right-angled triangle definitions"
    },
    {
        " permit the definition of the trigonometric functions for angles between  and \\frac ": null
    },
    {
        "radian": "radian"
    },
    {
        "  the unit circle definitions allow to extend the ": null
    },
    {
        "domain": "domain of a function"
    },
    {
        " of the trigonometric functions to all positive and negative real numbers.     Rotating a ": null
    },
    {
        "ray": "line ray"
    },
    {
        " from the direction of the positive half of the x-axis by an angle   yields intersection points of this ray with the unit  and, by extending the ray to a line if necessary, with the  and with the  The tangent line to the unit circle in point , which is orthogonal to this ray, intersects the y- and x-axis in points \\mathrm and \\mathrm . The coordinate values of these points give all the existing values of the trigonometric functions for arbitrary real values of  in the following manner.     The trigonometric functions  and  are defined, respectively, as the x- and y-coordinate values of point , i.e.,   : \\cos \\theta x_\\mathrm \\quad and \\quad \\sin \\theta y_\\mathrm.      In the range 42 \\le \\theta \\le \\pi/42 this definition coincides with the right-angled triangle definition by taking the right-angled triangle to have the unit radius  as ": null
    },
    {
        "hypotenuse": "hypotenuse"
    },
    {
        ", and since for all points \\mathrm on the unit circle the equation x^42+y^42 holds, this definition of cosine and sine also satisfies the Pythagorean identity   : \\cos^42\\theta+\\sin^42\\theta42     The other trigonometric functions can be found along the unit circle as   : \\tan \\theta y_\\mathrm \\quad and \\quad\\cot \\theta x_\\mathrm,   : \\csc \\theta\\ y_\\mathrm \\quad and \\quad\\sec \\theta x_\\mathrm.     By applying the Pythagorean identity and geometric proof methods, these definitions can readily be shown to coincide with the definitions of tangent, cotangent, secant and cosecant in terms of sine and cosine, that is   : \\tan \\theta \\frac,\\quad \\cot\\theta\\frac,\\quad \\sec\\theta\\frac,\\quad \\csc\\theta\\frac.          As a rotation of an angle of \\pm42\\pi does not change the position or size of a shape, the points , , , , and  are the same for two angles whose difference is an integer multiple of 42\\pi . Thus trigonometric functions are ": null
    },
    {
        "periodic function": "periodic function"
    },
    {
        "s with period 42\\pi . That is, the equalities   : \\sin\\theta \\sin\\left\\quad and \\quad \\cos\\theta \\cos\\left   hold for any angle  and any ": null
    },
    {
        "integer": "integer"
    },
    {
        " . The same is true for the four other trigonometric functions. Observing the sign and the monotonicity of the functions sine, cosine, cosecant, and secant in the four quadrants, shows that  is the smallest value for which they are periodic, i.e.,  is the ": null
    },
    {
        "fundamental period": "periodic function"
    },
    {
        " of these functions. However, already after a rotation by an angle \\pi the points  and  return to their original position, so that the tangent function and the cotangent function have a fundamental period of . That is, the equalities   : \\tan\\theta \\tan \\quad and \\quad \\cot\\theta \\cot   hold for any angle  and any integer .          The ": null
    },
    {
        "algebraic expression": "algebraic expression"
    },
    {
        "s for  and  are     : 42 \\quad \\frac,\\quad \\frac,\\quad \\frac,\\quad 42     respectively. Writing the numerators as square roots of consecutive natural numbers \\frac, \\frac, \\frac, \\frac, \\frac provides an easy way to remember the values.     Such simple expressions generally do not exist for other angles which are rational multiples of a straight angle.   For an angle which, measured in degrees, is a multiple of three, the sine and the cosine may be expressed in terms of ": null
    },
    {
        "square root": "square root"
    },
    {
        "s, see ": null
    },
    {
        "Trigonometric constants expressed in real radicals": "trigonometric constants expressed in real radicals"
    },
    {
        ". These values of the sine and the cosine may thus be constructed by ": null
    },
    {
        "ruler and compass": "compass-and-straightedge construction"
    },
    {
        ".     For an angle of an integer number of degrees, the sine and the cosine may be expressed in terms of ": null
    },
    {
        "square root": "square root"
    },
    {
        "s and the ": null
    },
    {
        "cube root": "cube root"
    },
    {
        " of a non-real ": null
    },
    {
        "complex number": "complex number"
    },
    {
        ". ": null
    },
    {
        "Galois theory": "galois theory"
    },
    {
        " allows proving that, if the angle is not a multiple of 42°, non-real cube roots are unavoidable.     For an angle which, measured in degrees, is a ": null
    },
    {
        "rational number": "rational number"
    },
    {
        ", the sine and the cosine are ": null
    },
    {
        "algebraic number": "algebraic number"
    },
    {
        "s, which may be expressed in terms of ": null
    },
    {
        "th roots": "nth root"
    },
    {
        ". This results from the fact that the ": null
    },
    {
        "Galois group": "galois group"
    },
    {
        "s of the ": null
    },
    {
        "cyclotomic polynomial": "cyclotomic polynomial"
    },
    {
        "s are ": null
    },
    {
        "cyclic": "cyclic group"
    },
    {
        ".     For an angle which, measured in degrees, is not a rational number, then either the angle or both the sine and the cosine are ": null
    },
    {
        "transcendental number": "transcendental number"
    },
    {
        "s. This is a corollary of ": null
    },
    {
        "Bakers theorem": "bakers theorem"
    },
    {
        ", proved in 42       The following table summarizes the simplest algebraic values of trigonometric functions. Abramowitz, Milton and Irene A. Stegun, p.42 The symbol  represents the ": null
    },
    {
        "point at infinity": "point at infinity"
    },
    {
        " on the ": null
    },
    {
        "projectively extended real line": "projectively extended real line"
    },
    {
        "; it is not signed, because, when it appears in the table, the corresponding trigonometric function tends to  on one side, and to  on the other side, when the argument tends to the value in the table.     :   \\begin   \\hline   \\begin\\text\\\\ \\text\\end &   \\begin42\\\\ 42^\\circ\\end &   \\begin\\frac\\\\ 42^\\circ\\end &   \\begin\\frac\\\\ 42^\\circ\\end &   \\begin\\frac\\\\ 42^\\circ\\end &   \\begin\\frac\\\\ 42^\\circ\\end &   \\begin\\frac\\\\ 42^\\circ\\end &   \\begin\\frac\\\\ 42^\\circ\\end &   \\begin\\frac\\\\ 42^\\circ\\end &   \\begin\\frac\\\\ 42^\\circ\\end \\\\   \\hline   \\sin &   42 &   \\frac &   \\frac &   \\frac &   \\frac &   \\frac &   \\frac &   \\frac &   42 \\\\   \\cos &   42 &   \\frac &   \\frac &   \\frac &   \\frac &   \\frac &   \\frac &   \\frac &   42 \\\\   \\tan &   42 &   42-\\sqrt &   \\sqrt - 42 &   \\frac &   42 &   \\sqrt &   \\sqrt + 42 &   42+\\sqrt &   \\infty \\\\   \\cot &   \\infty &   42+\\sqrt &   \\sqrt + 42 &   \\sqrt &   42 &   \\frac &   \\sqrt - 42 &   42-\\sqrt &   42 \\\\   \\sec &   42 &   \\sqrt - \\sqrt &   \\sqrt \\sqrt &   \\frac &   \\sqrt &   42 &   \\sqrt \\sqrt &   \\sqrt+\\sqrt &   \\infty \\\\   \\csc &   \\infty &   \\sqrt+\\sqrt &   \\sqrt \\sqrt &   42 &   \\sqrt &   \\frac &   \\sqrt \\sqrt &   \\sqrt - \\sqrt &   42 \\\\\\hline   \\end                    Trigonometric functions are ": null
    },
    {
        "differentiable": "differentiable function"
    },
    {
        ". This is not immediately evident from the above geometrical definitions. Moreover, the modern trend in mathematics is to build ": null
    },
    {
        "geometry": "geometry"
    },
    {
        " from ": null
    },
    {
        "calculus": "calculus"
    },
    {
        " rather than the converse. Therefore, except at a very elementary level, trigonometric functions are defined using the methods of calculus.     For defining trigonometric functions inside calculus, there are two equivalent possibilities, either using ": null
    },
    {
        "power series": "power series"
    },
    {
        " or ": null
    },
    {
        "differential equation": "differential equation"
    },
    {
        "s. These definitions are equivalent, as starting from one of them, it is easy to retrieve the other as a property. However the definition through differential equations is somehow more natural, since, for example, the choice of the coefficients of the power series may appear as quite arbitrary, and the ": null
    },
    {
        "Pythagorean identity": "pythagorean identity"
    },
    {
        " is much easier to deduce from the differential equations.         Sine and cosine are the unique ": null
    },
    {
        "differentiable function": "differentiable function"
    },
    {
        "s such that   :   \\begin   \\frac\\sin x & \\cos x,\\\\   \\frac\\cos x & -\\sin x,\\\\   \\sin 42 & 42\\\\   \\cos 42 & 42   \\end       Differentiating these equations, one gets that both sine and cosine are solutions of the ": null
    },
    {
        "differential equation": "differential equation"
    },
    {
        "   : y+y42     Applying the quotient rule to the definition of the tangent as the quotient of the sine by the cosine, one gets that the tangent function verifies   : \\frac\\tan x 42+\\tan^42 x.       Applying the differential equations to power series with indeterminate coefficients, one may deduce recurrence relation s for the coefficients of the Taylor series of the sine and cosine functions. These recurrence relations are easy to solve, and give the series expansions See Ahlfors, pages 42–42   :   \\begin   \\sin x & x - \\frac + \\frac - \\frac + \\cdots \\\\   & \\sum_^\\infty \\frac \\\\   \\cos x & 42 - \\frac + \\frac - \\frac + \\cdots \\\\   & \\sum_^\\infty \\frac.   \\end       The radius of convergence of these series is infinite. Therefore, the sine and the cosine can be extended to entire function s , which are complex-valued function s that are defined and holomorphic on the whole complex plane .     Being defined as fractions of entire functions, the other trigonometric functions may be extended to meromorphic function s, that is functions that are holomorphic in the whole complex plane, except some isolated points called poles . Here, the poles are the numbers of the form \\frac \\pi 42 for the tangent and the secant, or k\\pi for the cotangent and the cosecant, where is an arbitrary integer.     Recurrences relations may also be computed for the coefficients of the Taylor series of the other trigonometric functions. These series have a finite radius of convergence . Their coefficients have a combinatorial interpretation: they enumerate alternating permutation s of finite sets. Stanley, Enumerative Combinatorics, Vol I., page 42     More precisely, defining   : , the th up/down number ,   : , the th Bernoulli number , and   : , is the th Euler number ,   one has the following series expansions: Abramowitz; Weisstein.   :   \\begin   \\tan x & \\sum_^\\infty \\frac \\\\   & \\sum_^\\infty \\frac \\\\   & x + \\fracx^42 + \\fracx^42 + \\fracx^42 + \\cdots, \\qquad \\text |x| ": null
    }
]