[
    {
        "     The Trinidad and Tobago Defence Force  is the ": null
    },
    {
        "military organization": "armed forces"
    },
    {
        " responsible for the defence of the twin island Republic of ": null
    },
    {
        "Trinidad and Tobago": "trinidad and tobago"
    },
    {
        ". It consists of the ": null
    },
    {
        "Trinidad and Tobago Regiment": "trinidad and tobago regiment"
    },
    {
        ", the Trinidad and Tobago Coast Guard, the Trinidad and Tobago Air Guard and the Defence Force Reserves.     Established in 1962 after Trinidad and Tobagos independence from ": null
    },
    {
        "Britain": "great britain"
    },
    {
        ", the TTDF is one of the largest Military forces in the English speaking ": null
    },
    {
        "Caribbean": "caribbean"
    },
    {
        ". Its mission statement is to defend the sovereign good of The Republic of Trinidad and Tobago, contribute to the development of the national community and support the State in the fulfillment of its national and international objectives . The Trinidad and Tobago Defence Force is made up of four distinct arms; The Regiment/ Army , the Coast Guard, the Air Guard and the Defence Force Reserves, which all fall under the authority of the Ministry of National Security. The TTDF has the worlds only Military ": null
    },
    {
        "steelband": "steelpan"
    },
    {
        ".     The ": null
    },
    {
        "Commander in Chief": "commander in chief"
    },
    {
        " of the Defence Force is the countrys ": null
    },
    {
        "President": "president of trinidad and tobago"
    },
    {
        ", ": null
    },
    {
        "Paula-Mae Weekes": "paula-mae weekes"
    },
    {
        ". The current Chief of Defence Staff is Air Commodore Darryl Daniel, who replaced Rear Admiral Hayden Pritchard upon his retirement on March 25th, 2019.             The Trinidad and Tobago Regiment is the main ground force element of the Trinidad and Tobago Defence Force. It has approximately 3000 men and women organized into four battalions and a Regiment Headquarters. The regiment has two primary roles; Maintaining the internal security of Trinidad and Tobago and support to civil law enforcement.     Also, as one of the larger military forces in the region, the Trinidad and Tobago Regiment is also one of the main units used in peacekeeping and humanitarian situations from the Caribbean region.     Although it is called the Trinidad & Tobago Regiment, the TTR is in fact structured more like a light infantry brigade, with a pair of infantry battalions, plus engineering and logistic support units:     1st Battalion , Trinidad and Tobago Regiment:   This is a light infantry battalion. It is located at Camp Ogden, Long Circular Road, St James.     2nd Battalion , Trinidad and Tobago Regiment: This is also a light infantry battalion.   Formerly located at Camp Mausica, since then it has been relocated to the Chaguaramas Heliport and La Romain.     3rd Battalion : This provides engineering support, humanitarian assistance and disaster relief.   It is located at Camp Cumuto, Wallerfield.     4th Battalion : This provides logistic and administrative support for the regiment.   It is located at the Teteron Barracks, Teteron Bay, Chaguaramas.     The Regiment also maintains a Camp Omega, also at Chaguaramas, which is used primarily for infantry training.       Trinidad and Tobago has a unique and highly trained group of special forces that is tasked to fulfill counter narcotics and counter terrorism operations. Soldiers are sent to the ": null
    },
    {
        "United States": "united states"
    },
    {
        " or the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " for their training. Their motto is To Find a Way.                  The Trinidad and Tobago Coast Guard is responsible for the maritime capabilities of the TTDF. The Coast Guard consists of a number of vessels designated CG . The current Commanding Officer is Captain Douglas Archer.     Its mission statements is to To Defend the Sovereign Good of the Republic of Trinidad and Tobago and to provide on a continuous basis, quality service for security and safety within the Maritime Boundaries, and in any other area of responsibility agreed to by the State to fulfill its International Obligations .     The Coast Guard is primarily involved with the Drug Trade interdiction as well as Search and Rescue within the waters of Trinidad and Tobago and neighbouring Islands. However the Coast Guard has been involved in major incidents. During the 1970 Army Mutiny in Trinidad and Tobago, the Coast Guard prevented the mutineers from convoying to ": null
    },
    {
        "Port of Spain": "port of spain"
    },
    {
        " by firing on an access road from the Regiment base at Teteron Barracks in ": null
    },
    {
        "Chaguaramas": "chaguaramas, trinidad"
    },
    {
        ". The Coast Guard also played a role during the 1990 ": null
    },
    {
        "Jamaat al Muslimeen coup attempt": "jamaat al muslimeen coup attempt"
    },
    {
        ", providing logistical and naval support to the ground forces of the Regiment, posted outside of the besieged city limits.     National Roles of the Trinidad and Tobago Coast Guard include:   Surveillance of the Waters under T & T Jurisdiction   Logistical Support to T & T Land Forces   Port Security   Assistance in Scientific Research   Aid to Civil Law Enforcement   Anti-Smuggling / Counter-Narcotic Operations   Fisheries Protection and Enforcement   Pollution Surveillance and Enforcement   Safety of Shipping     Operational Tasks   Keeping surveillance of the nations off-shore installations   Environmental protection, minor salvage and local maritime surveys   Cooperating with other naval forces.       The Trinidad and Tobago Coast Guard fleet contained the  TTS Nelson , an ": null
    },
    {
        "Island-class patrol vessel": "island-class patrol vessel"
    },
    {
        " purchased from the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        ", from 2000 to 2016. The Coast Guard planned to acquire three Offshore Patrol Vessels; The , which have been built by ": null
    },
    {
        "BAE Systems Surface Ships": "bae systems surface ships"
    },
    {
        " in the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ". However, in September 2010, the ": null
    },
    {
        "Government of Trinidad and Tobago": "politics of trinidad and tobago"
    },
    {
        " announced it was cancelling the order.  The Government of Brazil has since acquired all the ships built for Trinidad and Tobago and renamed them as ships of the ": null
    },
    {
        "Amazonas class": "amazonas-class corvette"
    },
    {
        ".     On 29 April 2015 the Ministry of National Security contracted with Dutch company ": null
    },
    {
        "Damen Shipbuilders": "damen group"
    },
    {
        " for four 51-metre 28-knot coastal patrol vessels, two 54-metre fast utility boats and six 11-metre 53-knot interceptors.                  The Air Wing of the Trinidad and Tobago Defence force was formed in February 1966, and was initially part of the Coast Guard and was called the Air Wing of the Coast Guard or the Air Wing. In 1977, it was separated as its own entity. In 2005 it was renamed the Trinidad & Tobago Air Guard . Its bases are at ": null
    },
    {
        "Piarco International Airport": "piarco international airport"
    },
    {
        ", ": null
    },
    {
        "Crown Point International Airport": "crown point international airport"
    },
    {
        ", and the Heliport at ": null
    },
    {
        "Chaguaramas": "chaguaramas, trinidad"
    },
    {
        ". Its purposes are to protect and patrol Trinidad and Tobagos airspace, and is also used for transport, search and rescue, and liaison. The current commander of the Air Guard is ": null
    },
    {
        "Group Captain": "group captain"
    },
    {
        " Darryl Daniel. He has taken command of the unit in August 2014, until his promotion to Chief of Defence Staff in March 2019.                 Its former fleet of aircraft included:   One ": null
    },
    {
        "Cessna 337": "cessna 337"
    },
    {
        "  Skymaster , One ": null
    },
    {
        "Cessna 402": "cessna 402"
    },
    {
        " Utililiner , four ": null
    },
    {
        "Aérospatiale Gazelle": "aérospatiale gazelle"
    },
    {
        " , One ": null
    },
    {
        "Cessna 172 Skyhawk": "cessna 172 skyhawk"
    },
    {
        " , Two ": null
    },
    {
        "Piper Navajo": "piper navajo"
    },
    {
        " 2000-2009, One ": null
    },
    {
        "Cessna 310": "cessna 310"
    },
    {
        " 1985-2011     Aircraft ordered: Four Agusta Westland ": null
    },
    {
        "AW139": "aw139"
    },
    {
        " Helicopters. Two of the helicopters were delivered in May 2011, and the other two in July 2012. The helicopters will be used by the Trinidad & Tobago Air Guard for surveillance and reconnaissance missions related to search and rescue, border patrol and drug interdiction.     The Minister of National Security announced that the establishment of a military airfield, construction of an operations/administrative building at the Piarco Air Station and new helicopters would be purchased to equip the Air Guard. The minister also promised training from various international bodies. Cabinet agreed to the change of rank designations from naval to the corresponding aviation designations and the creation of 66 ranks on the establishment of the Air Guard. However even though it is separate TT Air guard still reports to Coast Guard officials.       The Defence Force Reserves, previously called the Volunteer Defence Force, is the non active duty arm of the Trinidad and Tobago Defence Force. Its mission statement is To be a highly professional, well trained combat ready force that will respond effectively in support of our regular forces and the national community . The Defence Force Reserves is capable of providing reinforcement and be a force multiplier in the event that the Defence Force is called upon to carry out its roles of aid to the civil power. Established in September 1963, its primary purpose at that time was to provide essential reinforcements to the regular force. Today, those roles have grown to include assisting in the promotion of hemispheric and international security and development, with a well equipped force, trained in a broad range of disciplines and actively involved in community development. In recent years, the Reserves have been called out to assist with law enforcement and most recently to assist with the security in Trinidads hosting the ": null
    },
    {
        "5th Summit of the Americas": "5th summit of the americas"
    },
    {
        " in 2009.       ": null
    }
]