[
    {
        "             The trombone is a ": null
    },
    {
        "musical instrument": "musical instrument"
    },
    {
        " in the ": null
    },
    {
        "brass": "brass instrument"
    },
    {
        " family. As on all brass instruments, sound is produced when the players vibrating lips  cause the air column inside the instrument to vibrate. Nearly all trombones have a telescoping slide mechanism that varies the length of the instrument to change the pitch. Many modern trombone models also use a valve attachment to lower the pitch of the instrument. Variants such as the ": null
    },
    {
        "valve trombone": "types of trombonesvalve trombone"
    },
    {
        " and ": null
    },
    {
        "superbone": "superbone"
    },
    {
        " have three valves similar to those on the trumpet.     The word trombone derives from Italian tromba and -one , so the name means large trumpet . The trombone has a predominantly cylindrical bore like its valved counterpart the ": null
    },
    {
        "baritone": "baritone horn"
    },
    {
        " and in contrast to its conical valved counterparts, the cornet, the ": null
    },
    {
        "euphonium": "euphonium"
    },
    {
        ", and the French horn. The most frequently encountered trombones are the ": null
    },
    {
        "tenor trombone": "types of trombonestenor trombone"
    },
    {
        " and ": null
    },
    {
        "bass trombone": "types of trombonesbass trombone"
    },
    {
        ". The most common variant, the tenor, is a non-transposing instrument pitched in B, an octave below the B trumpet and an octave above the pedal B tuba. The once common E ": null
    },
    {
        "alto trombone": "types of trombonesalto trombone"
    },
    {
        " became less widely used as improvements in technique extended the upper range of the tenor, but it is now enjoying a resurgence due to its lighter sonority which is appreciated in many classical and early romantic works. Trombone music is usually written in concert pitch in either bass or tenor clef, although exceptions do occur, notably in British brass-band music where the tenor trombone is presented as a B ": null
    },
    {
        "transposing instrument": "transposing instrument"
    },
    {
        ", written in treble clef.     A person who plays the trombone is called a trombonist or trombone player.            The trombone is a predominantly cylindrical tube bent into an elongated S shape. Rather than being completely cylindrical from end to end, the tube is a complex series of tapers with the smallest at the mouthpiece receiver and the largest just before the bell flare. The design of these tapers affects the intonation of the instrument. As with other ": null
    },
    {
        "brass instrument": "brass instrument"
    },
    {
        "s, sound is produced by blowing air through pursed lips producing a vibration that creates a ": null
    },
    {
        "standing wave": "standing wave"
    },
    {
        " in the instrument.     The detachable cup-shaped ": null
    },
    {
        "mouthpiece": "mouthpiece"
    },
    {
        " is similar to that of the ": null
    },
    {
        "baritone horn": "baritone horn"
    },
    {
        " and closely related to that of the ": null
    },
    {
        "trumpet": "trumpet"
    },
    {
        ". It has the ": null
    },
    {
        "venturi": "venturi effect"
    },
    {
        ":  a small constriction of the air column that adds resistance greatly affecting the tone of the instrument and is inserted into the mouthpiece receiver in the slide section. The slide section consists of a ": null
    },
    {
        "leadpipe": "leadpipe"
    },
    {
        ", the inner and outer slide tubes, and the bracing, or stays . Modern stays are soldered, while ": null
    },
    {
        "sackbuts": "sackbut"
    },
    {
        " were made with loose, unsoldered stays.       The slide, the most distinctive feature of the trombone , allows the player to extend the length of the air column, lowering the pitch. To prevent friction from slowing the action of the slide, additional sleeves were developed during the ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        ", and these stocking were soldered onto the ends of the inner slide tubes. Nowadays, the stockings are incorporated into the manufacturing process of the inner slide tubes and represent a fractional widening of the tube to accommodate the necessary method of alleviating friction. This part of the slide must be lubricated frequently. Additional tubing connects the slide to the bell of the instrument through a neckpipe, and bell or back bow . The joint connecting the slide and bell sections is furnished with a ferrule to secure the connection of the two parts of the instrument, though older models from the early 20th century and before were usually equipped with friction joints and no ancillary mechanism to tighten the joint.     The adjustment of intonation is most often accomplished with a tuning slide that is a short slide between the neckpipe and the bell incorporating the bell bow ; this device was designed by the French maker François Riedlocker during the early 19th century and applied to French and British designs and later in the century to German and American models, though German trombones were built without tuning slides well into the 20th century. However, trombonists, unlike other instrumentalists, are not subject to the intonation issues resulting from valved or keyed instruments, since they can adjust intonation on the fly by subtly altering slide ": null
    },
    {
        "positions": "position"
    },
    {
        " when necessary. For example, second position A is not in exactly the same place on the slide as second position E . Many ": null
    },
    {
        "types of trombone": "types of trombones"
    },
    {
        " also include one or more ": null
    },
    {
        "rotary valves": "rotary valves"
    },
    {
        " used to increase the length of the instrument by directing the air flow through additional tubing. This allows the instrument to reach notes that are otherwise not possible without the valve as well as play other notes in alternate positions.     Like the trumpet, the trombone is considered a cylindrical bore instrument since it has extensive sections of tubing, principally in the slide section, that are of unchanging diameter. Tenor trombones typically have a bore of  to   after the leadpipe and through the slide. The bore expands through the gooseneck to the bell, which is typically between . A number of common variations on trombone construction are noted below.         Trombone comes from the Italian word tromba plus the suffix -one , meaning big trumpet .     During the Renaissance, the equivalent English term was ": null
    },
    {
        "sackbut": "sackbut"
    },
    {
        " . The word first appears in court records in 1495 as shakbusshe at about the time King Henry VII married a Portuguese princess who brought musicians with her. Shakbusshe is similar to sacabuche , attested in Spain as early as 1478. The French equivalent saqueboute appears in 1466.      The German Posaune long predates the invention of the slide and could refer to a natural trumpet as late as the early fifteenth century.        Both towns and courts sponsored bands of ": null
    },
    {
        "shawms": "shawm"
    },
    {
        "and trombone. The most famous and influential served the Duke of Burgundy. The trombones principal role was the ": null
    },
    {
        "contratenor": "countertenor"
    },
    {
        " part in a dance band. Herbert , p.  59. The sackbut was used extensively across Europe, from its appearance in the 15th century to a decline in most places by the mid-late 17th century. It was used in outdoor events, in concert, and in liturgical settings. With trumpeters, trombonists in German city-states were employed as civil officials. As officials, these trombonists were often relegated to standing watch ": null
    },
    {
        "in the city towers": "tower music"
    },
    {
        " but would also herald the arrival of important people to the city. This is similar to the role of a military bugler and was used as a sign of wealth and strength in 16th century German cities.     These trombonists were, however, often viewed separately from the more skilled trombonists who played in groups such as the ": null
    },
    {
        "alta capella": "alta capella"
    },
    {
        " wind ensembles and the first orchestral ensembles. These performed in religious settings, such as ": null
    },
    {
        "St Marks Basilica": "st marks basilica"
    },
    {
        " in Venice in the early 17th century.      Composers who wrote for trombone during this period include ": null
    },
    {
        "Claudio Monteverdi": "claudio monteverdi"
    },
    {
        ", ": null
    },
    {
        "Heinrich Schütz": "heinrich schütz"
    },
    {
        ", ": null
    },
    {
        "Giovanni Gabrieli": "giovanni gabrieli"
    },
    {
        " and his uncle ": null
    },
    {
        "Andrea Gabrieli": "andrea gabrieli"
    },
    {
        ". The trombone doubled voice parts in sacred works, but there are also solo pieces written for trombone in the early 17th century.     When the sackbut returned to common use in England in the 18th century, Italian music was so influential that the instrument became known as the trombone ,  although in some countries the same name has been applied throughout its history, viz. Italian ": null
    },
    {
        "trombone": ":it:trombone"
    },
    {
        " and German ": null
    },
    {
        "Posaune": ":de:posaune"
    },
    {
        ". The 17th-century trombone was built in slightly smaller dimensions than modern trombones and had a bell that was more conical and less flared.     During the later Baroque period, ": null
    },
    {
        "Johann Sebastian Bach": "johann sebastian bach"
    },
    {
        " and ": null
    },
    {
        "George Frideric Handel": "george frideric handel"
    },
    {
        " used trombones on a few occasions. Bach used it in some of his ": null
    },
    {
        "cantata": "cantata"
    },
    {
        "s, having written for four trombones . Handel used it in the Death March from  Saul ,  Samson , and  Israel in Egypt . All were examples of an ": null
    },
    {
        "oratorio": "oratorio"
    },
    {
        " style popular during the early 18th century. Score notations are rare because only a few professional Stadtpfeiffer or ": null
    },
    {
        "alta cappella": "alta cappella"
    },
    {
        " musicians were available. Handel, for instance, had to import trombones to England from a Royal court in Hanover, Germany, to perform one of his larger compositions. Therefore, trombone parts were rather seldom given solo roles that were not interchangeable with other instruments.       ": null
    },
    {
        "Christoph Willibald Gluck": "christoph willibald gluck"
    },
    {
        " was the first major composer to use the trombone in an opera overture,  Alceste , but he also used it in operas such as  Orfeo ed Euridice ,  Iphigénie en Tauride  and  Echo et Narcisse .     The construction of the trombone changed relatively little between the Baroque and Classical period. The most obvious change was in the bell, slightly more flared.     The first use of the trombone as an independent instrument in a symphony was in the Symphony in E by Swedish composer ": null
    },
    {
        "Joachim Nicolas Eggert": "joachim nicolas eggert"
    },
    {
        ".  But the composer usually credited with the trombones introduction into the symphony orchestra was ": null
    },
    {
        "Ludwig van Beethoven": "ludwig van beethoven"
    },
    {
        " in ": null
    },
    {
        "Symphony No. 5 in C minor": "symphony no. 5"
    },
    {
        " . Beethoven also used trombones in his ": null
    },
    {
        "Symphony No. 6 in F major ": "symphony no. 6"
    },
    {
        " and ": null
    },
    {
        "Symphony No. 9 ": "symphony no. 9"
    },
    {
        ".           Trombones were included in compositions, operas, and symphonies by ": null
    },
    {
        "Felix Mendelssohn Bartholdy": "felix mendelssohn bartholdy"
    },
    {
        ", ": null
    },
    {
        "Hector Berlioz": "hector berlioz"
    },
    {
        ", ": null
    },
    {
        "Franz Berwald": "franz berwald"
    },
    {
        ", ": null
    },
    {
        "Charles Gounod": "charles gounod"
    },
    {
        ", ": null
    },
    {
        "Franz Liszt": "franz liszt"
    },
    {
        ", ": null
    },
    {
        "Gioacchino Rossini": "gioacchino rossini"
    },
    {
        ", ": null
    },
    {
        "Franz Schubert": "franz schubert"
    },
    {
        ", ": null
    },
    {
        "Robert Schumann": "robert schumann"
    },
    {
        ", ": null
    },
    {
        "Giuseppe Verdi": "giuseppe verdi"
    },
    {
        ", and ": null
    },
    {
        "Richard Wagner": "richard wagner"
    },
    {
        ".     Although the trombone trio had been paired with one or two cornets during the Renaissance and early Baroque periods, the disappearance of the cornet as a partner and replacement by oboe and clarinet left unchanged the trombones purpose: to support the alto, tenor, and bass voices of the chorus where harmonic moving lines were more difficult to pick out than the melodic soprano line. But the introduction of trombones into the orchestra allied them more closely with trumpets, and soon an additional tenor trombone replaced alto. The Germans and Austrians kept alto trombone somewhat longer than the French, who preferred a section of three tenor trombones until after the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ". In other countries, the trio of two tenor trombones and one bass became standard by about the mid 19th century.     Trombonists were employed less by cathedrals and court orchestras and so were expected to provide their own instrument. Military musicians were provided with instruments, and instruments like the long F or E bass trombone remained in military use until around the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ". But as orchestral musicians adopted the trombone version with the widest range that they could easily apply to any of the three trombone parts that typically appeared in scores—the tenor trombone.     Valve trombones in the mid-19th century did little to alter the make-up of the orchestral trombone section; although it was ousted from orchestras in Germany and France, the valve trombone remained popular almost to the exclusion of the slide instrument in countries such as Italy and ": null
    },
    {
        "Bohemia": "bohemia"
    },
    {
        ". Composers such as Giuseppe Verdi, ": null
    },
    {
        "Giacomo Puccini": "giacomo puccini"
    },
    {
        ", ": null
    },
    {
        "Bedřich Smetana": "bedřich smetana"
    },
    {
        ", and ": null
    },
    {
        "Antonín Dvořák": "antonín dvořák"
    },
    {
        " scored for a valve trombone section.          With the ": null
    },
    {
        "ophicleide": "ophicleide"
    },
    {
        " or later, the tuba subjoined to the trombone trio during the 19th century, parts scored for the bass trombone rarely descended as low as parts scored before the addition of either of these new low brass instruments. Only in the early 20th century did it regain a degree of independence. Experiments with the trombone section included Richard Wagners addition of a contrabass trombone in  Der Ring des Nibelungen  and Gustav Mahlers and Richard Strauss augmentation by adding a second bass trombone to the usual trio of two tenor trombones and one bass trombone. The majority of orchestral works are still scored for the usual mid- to late-19th-century low brass section of two tenor trombones, one bass trombone, and one tuba.       Trombones have been a part of the large wind band since its inception as an ensemble during the French Revolution of 1791. During the 19th century wind band traditions were established, including circus bands, military bands, brass bands , and town bands . Some of these, especially military bands in Europe, used rear-facing trombones where the bell section pointed behind the players left shoulder. These bands played a limited repertoire, with few original compositions, that consisted mainly of orchestral transcriptions, arrangements of popular and patriotic tunes, and feature pieces for soloists . A notable work for wind band is Berliozs 1840 ": null
    },
    {
        "Grande symphonie funèbre et triomphale": "grande symphonie funèbre et triomphale"
    },
    {
        ", which uses a trombone solo for the entire second movement.     Toward the end of the 19th century, trombone virtuosi began appearing as soloists in American wind bands. The most notable was ": null
    },
    {
        "Arthur Pryor": "arthur pryor"
    },
    {
        ", who played with the ": null
    },
    {
        "John Philip Sousa": "john philip sousa"
    },
    {
        " band and formed his own.       In the Romantic era, ": null
    },
    {
        "Leipzig": "leipzig"
    },
    {
        " became a center of trombone pedagogy. The trombone began to be taught at the ": null
    },
    {
        "Musikhochschule": "university of music and theatre leipzig"
    },
    {
        " founded by ": null
    },
    {
        "Felix Mendelssohn Bartholdy": "felix mendelssohn bartholdy"
    },
    {
        ". The ": null
    },
    {
        "Paris Conservatory": "paris conservatory"
    },
    {
        " and its yearly exhibition also contributed to trombone education. At the Leipzig academy, Mendelssohns bass trombonist, ": null
    },
    {
        "Karl Traugott Queisser": "karl traugott queisser"
    },
    {
        ", was the first in a long line of distinguished professors of trombone. Several composers wrote works for Quiesser, including ": null
    },
    {
        "Ferdinand David": "ferdinand david"
    },
    {
        " who wrote in 1837 the  Concertino for Trombone and Orchestra , Ernst Sachse and ": null
    },
    {
        "Friedrich August Belcke": "friedrich august belcke"
    },
    {
        ", whose solo works remain popular in Germany. Queisser helped reestablish the reputation of the trombone in Germany. He championed and popularized Christian Friedrich Sattlers tenorbass trombone during the 1840s, leading to its widespread use in orchestras throughout Germany and Austria.       Sattler had a great influence on trombone design. He introduced a significant widening of the bore , the innovations of Schlangenverzierungen , the bell garland, and the wide bell flare—features still found on German-made trombones that were widely copied during the 19th century.     The trombone was further improved in the 19th century with the addition of stockings at the end of the inner slide to reduce friction, the development of the water key to expel condensation from the horn, and the occasional addition of ": null
    },
    {
        "a valve": "f attachment tenor trombone"
    },
    {
        " that, intentionally, only was to be set on or off but later was to become the regular F-valve. Additionally, the valve trombone came around the 1850s shortly after the invention of valves, and was in common use in Italy and Austria in the second half of the century.              In the ": null
    },
    {
        "20th century": "20th-century classical music"
    },
    {
        " the trombone maintained its important place in the orchestra in works by ": null
    },
    {
        "Béla Bartók": "béla bartók"
    },
    {
        ", ": null
    },
    {
        "Alban Berg": "alban berg"
    },
    {
        ", ": null
    },
    {
        "Leonard Bernstein": "leonard bernstein"
    },
    {
        ", ": null
    },
    {
        "Benjamin Britten": "benjamin britten"
    },
    {
        ", ": null
    },
    {
        "Aaron Copland": "aaron copland"
    },
    {
        ", ": null
    },
    {
        "Edward Elgar": "edward elgar"
    },
    {
        ", ": null
    },
    {
        "George Gershwin": "george gershwin"
    },
    {
        ", ": null
    },
    {
        "Gustav Holst": "gustav holst"
    },
    {
        ", ": null
    },
    {
        "Leos Janacek": "leos janacek"
    },
    {
        ", ": null
    },
    {
        "Gustav Mahler": "gustav mahler"
    },
    {
        ", ": null
    },
    {
        "Olivier Messiaen": "olivier messiaen"
    },
    {
        ", ": null
    },
    {
        "Darius Milhaud": "darius milhaud"
    },
    {
        ", ": null
    },
    {
        "Carl Nielsen": "carl nielsen"
    },
    {
        ", ": null
    },
    {
        "Sergei Prokofiev": "sergei prokofiev"
    },
    {
        ", ": null
    },
    {
        "Sergei Rachmaninoff": "sergei rachmaninoff"
    },
    {
        ", ": null
    },
    {
        "Maurice Ravel": "maurice ravel"
    },
    {
        ", ": null
    },
    {
        "Ottorino Respighi": "ottorino respighi"
    },
    {
        ", ": null
    },
    {
        "Arnold Schoenberg": "arnold schoenberg"
    },
    {
        ", ": null
    },
    {
        "Dmitri Shostakovich": "dmitri shostakovich"
    },
    {
        ", ": null
    },
    {
        "Jean Sibelius": "jean sibelius"
    },
    {
        ", ": null
    },
    {
        "Richard Strauss": "richard strauss"
    },
    {
        ", ": null
    },
    {
        "Igor Stravinsky": "igor stravinsky"
    },
    {
        ", ": null
    },
    {
        "William Walton": "william walton"
    },
    {
        ", ": null
    },
    {
        "Ralph Vaughan Williams": "ralph vaughan williams"
    },
    {
        ",     With the rise of recorded music and music schools, orchestral trombone sections around the world began to have a more consistent idea of a standard trombone sound. British orchestras abandoned the use of small bore tenors and G basses in favor of an American/German approach of large bore tenors and B basses in the 1940s. French orchestras did the same in the 1960s.       During the first half of the century, touring and community concert bands lost their popularity in the United States and were greatly reduced in number. However, with the development of music education in the public school system, high school, and university concert bands and marching bands and became ubiquitous in the US. A typical concert band trombone section consists of two tenor trombones and one bass trombone, but using multiple players per part is common practice, especially in public school settings.          In the 1900s the trombone assisted the bass or tuba players job of outlining chords for the other instruments by playing a bass line for the higher-pitched instruments to improvise over. It was not until the swing era of the mid-1920s that the trombone began to be used as a solo instrument. Examples of early trombone soloists are ": null
    },
    {
        "Jack Teagarden": "jack teagarden"
    },
    {
        " and ": null
    },
    {
        "J.J. Johnson": "j.j. johnson"
    },
    {
        ".         Changes in construction have occurred during the 20th century, such as the use of different materials; increases in mouthpiece, bore, and bell dimensions; and in types of mutes and valves. Despite the universal switch to a larger horn, many European trombone makers prefer a slightly smaller bore than their American counterparts.     One of the most significant changes is the popularity of the F-Attachment trigger. Through the mid-20th century, orchestral trombonists used instruments that lacked a trigger because there was no need for one. But as 20th century composers such as Mahler became popular, tenor trombone parts began to extend down into lower ranges that required a trigger. Although some trombonists prefer straight trombone models without triggers, most have added them for convenience and versatility.       The trombone can be found in symphony orchestras, concert bands, marching bands, military bands, brass bands, and brass choirs. In chamber music, it is used in brass quintets, quartets, or trios, or trombone trios, quartets, or choirs. The size of a trombone choir can vary from five or six to twenty or more members. Trombones are also common in swing, jazz, merengue, salsa, R & B, ": null
    },
    {
        "ska": "ska"
    },
    {
        ", and New Orleans brass bands.                    The most frequently encountered type of trombone today is the tenor, followed by the bass, though as with many other Renaissance instruments the trombone has been built in sizes from piccolo to contrabass. Trombones are usually constructed with a slide that is used to change the pitch. ": null
    },
    {
        "Valve trombones": "valve trombone"
    },
    {
        "use three valves instead of the slide. The valves follow the same schema as other valved instruments-the first valve lowers the pitch by one step, the second valve by a half-step, and the third valve by one and a half steps.     A ": null
    },
    {
        "superbone": "superbone"
    },
    {
        " uses a full set of valves and a slide. These differ from trombones with triggers. Some slide trombones have one or two rotary valves operated by a left-hand thumb trigger. The single rotary valve is part of the F attachment, which adds a length of tubing to lower the instruments fundamental pitch from B to F. Some bass trombones have a second trigger with a different length of tubing. The second trigger facilitates playing the otherwise problematic low B. A ": null
    },
    {
        "buccin": "buccin"
    },
    {
        " is a trombone with a round, zoomorphic bell section. They were common in 19th-century military bands.                The modern system has seven chromatic ": null
    },
    {
        "slide positions": "position trombone position"
    },
    {
        " on a tenor trombone in B. It was first described by Andre Braun circa 1795.      In 1811 Joseph Fröhlich wrote on the differences between the modern system and an old system where four diatonic slide positions were used and the trombone was usually keyed to A. Guion , p. 93. To compare between the two styles the chart below may be helpful . In the modern system, each successive position outward  will produce a note which is one ": null
    },
    {
        "semitone": "semitone"
    },
    {
        " lower when played in the same ": null
    },
    {
        "partial": "harmonic series partial"
    },
    {
        ". Tightening and loosening the lips will allow the player to bend the note up or down by a semitone without changing position, so a slightly out-of-position slide may be compensated for by ear.                  As with all brass instruments, progressive tightening of the lips and increased air pressure allow the player to move to different ": null
    },
    {
        "partial": "harmonic series partial"
    },
    {
        " in the ": null
    },
    {
        "harmonic series": "harmonic series"
    },
    {
        ". In the first position on a B trombone, the notes in the harmonic series begin with B 2 , F 3 , B 3 , D 4 , and F 4 .     F 4 marks the sixth partial, or the fifth overtone. Notes on the next partial, for example A 4 in first position, tend to be out of tune in regards to the twelve-tone ": null
    },
    {
        "equal temperament": "equal temperament"
    },
    {
        " scale. A 4 in particular, which is at the seventh partial is nearly always 31 cents, or about one third of a semitone, flat of the minor seventh. On the slide trombone, such deviations from ": null
    },
    {
        "intonation": "intonation"
    },
    {
        " are corrected for by slightly adjusting the slide or by using an alternate position. Although much of Western music has adopted the even-tempered scale, it has been the practice in Germany and Austria to play these notes in position, where they will have ": null
    },
    {
        "just intonation": "just intonation"
    },
    {
        " .     The next higher partials—B 4 , C 5 , D 5 —do not require much adjustment for even-tempered intonation, but E 5  is almost exactly a ": null
    },
    {
        "quarter tone": "quarter tone"
    },
    {
        " higher than it would be in twelve-tone equal temperament. E 5 and F 5 at the next partial are very high notes; a very skilled player with a highly developed ": null
    },
    {
        "facial musculature": "embouchure"
    },
    {
        " and ": null
    },
    {
        "diaphragm": "thoracic diaphragm"
    },
    {
        " can go even higher to G 5 , A 5 , B 5 and beyond.          The higher in the harmonic series any two successive notes are, the closer they tend to be . A byproduct of this is the relatively few motions needed to move between notes in the higher ranges of the trombone. In the lower range, significant movement of the slide is required between positions, which becomes more exaggerated on lower pitched trombones, but for higher notes the player need only use the first four positions of the slide since the partials are closer together, allowing higher notes in alternate positions. As an example, F 4 may be played in first, fourth or sixth position on a B trombone. The note E 1 is the lowest attainable note on a  B tenor trombone, requiring a full  of tubing. On trombones without an F attachment, there is a gap between B 1 and E 2 . Skilled players can produce ": null
    },
    {
        "falset": "falset"
    },
    {
        " notes between these, but the sound is relatively weak and not usually used in performance. The addition of an F attachment allows for intermediate notes to be played with more clarity.            The ": null
    },
    {
        "pedal tone": "pedal tone"
    },
    {
        " on B is frequently seen in commercial scoring but much less often in symphonic music while notes below that are called for only rarely as they become increasingly difficult to produce and insecure in quality with A or G being the bottom limit for most tenor trombonists. However, ": null
    },
    {
        "Richard Wagners": "richard wagner"
    },
    {
        " Das Rheingold calls for a pedal E in the Trombone IV part, in a section referred to as the spear motif.  IMSLP: Das Rheingold, WWV 86A , Trombone IV. pp. 34. Some contemporary orchestral writing, movie or video game scoring, trombone ensemble and solo works will call for notes as low as a pedal C, B, or even double pedal B on the bass trombone.        The trombone is one of the few wind instruments that can produce a true ": null
    },
    {
        "glissando": "glissando"
    },
    {
        ", by moving the slide without interrupting the airflow or sound production. Every pitch in a glissando must have the same harmonic number, and a tritone is the largest interval that can be performed as a glissando.      Harmonic, inverted, broken or false glissandos are those that cross one or more harmonic series, requiring a simulated or faked glissando effect.        ": null
    },
    {
        "Trills": "trill"
    },
    {
        ", though generally simple with valves, are difficult on the slide trombone. Trills tend to be easiest and most effective higher in the harmonic series because the distance between notes is much smaller and slide movement is minimal. For example, a trill on B 3 /C 4 is virtually impossible as the slide must move two positions , however at an octave higher  the notes can both be achieved in 1st position as a lip trill. Thus, the most convincing trills tend to be above the first octave and a half of the tenors ": null
    },
    {
        "range": "range"
    },
    {
        ". Herbert , p. 43. Trills are most commonly found in early Baroque and Classical music for the trombone as a means of ornamentation, however, some more modern pieces will call for trills as well.       Unlike most other brass instruments in an orchestral setting, the trombone is not usually considered a ": null
    },
    {
        "transposing instrument": "transposing instrument"
    },
    {
        ". Prior to the invention of valve systems, most brass instruments were limited to playing one overtone series at a time; altering the pitch of the instrument required manually replacing a section of tubing  or picking up an instrument of different length. Their parts were transposed according to which crook or length-of-instrument they used at any given time, so that a particular note on the staff always corresponded to a particular partial on the instrument. Trombones, on the other hand, have used slides since their inception. As such, they have always been fully chromatic, so no such tradition took hold, and trombone parts have always been notated at concert pitch . Also, it was quite common for trombones to double choir parts; reading in concert pitch meant there was no need for dedicated trombone parts. Note that while the fundamental sounding pitch has remained quite consistent, the conceptual pitch of trombones has changed since their origin .      Trombone parts are typically notated in ": null
    },
    {
        "bass clef": "bass clef"
    },
    {
        ", though sometimes also written in ": null
    },
    {
        "tenor clef": "tenor clef"
    },
    {
        " or ": null
    },
    {
        "alto clef": "alto clef"
    },
    {
        ". The use of alto clef is usually confined to orchestral first trombone parts, with the second trombone part written in tenor clef and the third part in bass clef. As the alto trombone declined in popularity during the 19th century, this practice was gradually abandoned and first trombone parts came to be notated in the tenor or bass clef. Some Russian and Eastern European composers wrote first and second tenor trombone parts on one alto clef staff . Examples of this practice are evident in scores by Igor Stravinsky, Sergei Prokofiev, Dmitri Shostakovich. Trombone parts in band music are nearly exclusively notated in bass clef. The rare exceptions are in contemporary works intended for high-level wind bands.     An accomplished performer today is expected to be proficient in reading parts notated in bass clef, tenor clef, alto clef, and treble clef in C, with the British brass-band performer expected to handle treble clef in B as well.          A variety of ": null
    },
    {
        "mutes": "whispa mute"
    },
    {
        " can be used with the trombone to alter its ": null
    },
    {
        "timbre": "timbre"
    },
    {
        ". Many are held in place with the use of cork grips, including the straight, cup, harmon and pixie mutes. Some fit over the bell, like the bucket mute. In addition to this, mutes can be held in front of the bell and moved to cover more or less area for a ": null
    },
    {
        "wah-wah": "wah-wah"
    },
    {
        " effect. Mutes used in this way include the hat and plunger , a sound featured as the voices of adults in the  Peanuts  cartoons.           Trombone bells may be constructed of different brass mixtures. The most common material is yellow brass , but other materials include rose brass and red brass . Some manufacturers offer interchangeable bells. Tenor trombone bells are usually between  in diameter, the most common being sizes from . The smallest sizes are found in small jazz trombones and older narrow-bore instruments, while the larger sizes are common in orchestral models. Bass trombone bells can be as large as  or more, though usually either  in diameter. The bell may be constructed out of two separate brass sheets or out of one single piece of metal and hammered on a mandrel until the part is shaped correctly. The edge of the bell may be finished with or without a piece of bell wire to secure it, which also affects the tone quality; most bells are built with bell wire. Occasionally, trombone bells are made from solid sterling silver.       Many trombones have valve attachments to aid in increasing the range of the instrument while also allowing alternate slide positions for difficult music passages. In addition, valve attachments make ": null
    },
    {
        "trills": "trill"
    },
    {
        " much easier. Valve attachments appear on alto, tenor, bass, and contrabass trombones. It is rare on the alto, but when the instrument does have it, the valve attachment changes the key of the instrument from E to B, allowing the alto trombone to play in the tenor trombone range. Tenor trombones commonly have valve attachments, the most common being the ": null
    },
    {
        "F-attachment": "f attachment"
    },
    {
        ", which changes the pitch of the instrument from B to F, increasing the range of the instrument downward and allowing alternate slide positions for notes in 6th or 7th position.     Bass trombones also very commonly have F-attachments, which serve exactly the same function as on the tenor trombone. Some single valve bass trombones have E-attachments instead of F-attachments, or sometimes there is extra tubing on the F-attachment to allow it to be used as an E-attachment if desired. However, many bass trombones have a second valve attachment instead, which increases their range downward even more. The most common second valve attachment is the G-attachment, which changes the instruments key to D when used in combination with the F-attachment . There are other configurations other than the G-attachment however.     The two valves on a bass trombone can either be independent or dependent. Double rotor dependent valve bass trombones were created in the late 1950s, and double rotor independent valve bass trombones were created in the late 1960s/early 1970s. Dependent means that the second valve only works when used in combination with the first, as it is located directly on the F- or E-attachment tubing. Newer bass trombones have independent valves instead, meaning that the second valve is located on the neckpipe of the instrument and can therefore operate independently of the other.  Contrabass trombones also can have valve attachments. Contrabass trombones in the key of F typically have two valves tuned to C and D respectively. Contrabass trombones in B on the other hand typically only have one valve, which is tuned to F, though some have a second valve tuned to G.     The most common type of valve seen for valve attachments is the ": null
    },
    {
        "rotary valve": "rotary valve"
    },
    {
        ". Some trombones have ": null
    },
    {
        "piston valves": "piston valves"
    },
    {
        " used instead of rotary valves for valve attachments, but it is very rare and is today considered unconventional. Many variations of the rotary valve have been invented in the past half-century such as the ": null
    },
    {
        "Thayer valve": "thayer valve"
    },
    {
        " or axial-flow valve, the ": null
    },
    {
        "Hagmann valve": "hagmann valve"
    },
    {
        ", the Greenhoe rotor, and several others, all of which were designed to give the trombone a more open, free sound than a conventional rotary valve would allow due to the 180° bend in most conventional rotary valve designs. Many of these new trombone valve designs have enjoyed great success on the market, but the standard rotary valve remains the most common for trombone valve attachments.          Some trombones have valves instead of a slide . These are usually ": null
    },
    {
        "rotary valve": "rotary valve"
    },
    {
        "s, or ": null
    },
    {
        "piston valve": "piston valve"
    },
    {
        "s.          More often than not, tenor trombones with an ": null
    },
    {
        "F attachment": "types of trombonesf attachment"
    },
    {
        ", or trigger, have a larger bore through the attachment than through the straight section . Typically, for orchestral instruments, the slide bore is  and the attachment tubing bore is . A wide variety of valve attachments and combinations are available. Valve attachment tubing usually incorporates a small tuning slide so that the attachment tubing can be tuned separately from the rest of the instrument. Most B/F tenor and bass trombones include a tuning slide long enough to lower the pitch to E with the valve tubing engaged, enabling the production of B 2 .      Whereas older instruments fitted with valve attachments usually had the tubing coiled rather tightly in the bell section , modern instruments usually have the tubing kept as free as possible of tight bends in the tubing , resulting in a freer response with the valve attachment tubing engaged. While open-wrap tubing does offer a more open sound, the tubing sticks out from behind the bell and is more vulnerable to damage. For that reason, closed-wrap tubing remains more popular in trombones used in marching bands or other ensembles where the trombone may be more prone to damage.       Some trombones are tuned through a mechanism in the slide section rather than via a separate tuning slide in the bell section. This method preserves a smoother expansion from the start of the bell section to the bell flare. The tuning slide in the bell section requires two portions of cylindrical tubing in an otherwise conical part of the instrument, which affects the tone quality. Tuning the trombone enables it to play with other instruments which is essential for the trombone.       Common and popular bore sizes for trombone slides are  for tenor trombones, and  for bass trombones. The slide may also be built with a dual-bore configuration, in which the bore of the second leg of the slide is slightly larger than the bore of the first leg, producing a stepwise conical effect. The most common dual-bore combinations are , , , ,  for tenor trombones, and  for bass trombones.          The mouthpiece is a separate part of the trombone and can be interchanged between similarly sized trombones from different manufacturers. Available mouthpieces for trombone vary in material composition, length, diameter, rim shape, cup depth, throat entrance, venturi aperture, venturi profile, outside design and other factors. Variations in mouthpiece construction affect the individual players ability to make a lip seal and produce a reliable tone, the ": null
    },
    {
        "timbre": "timbre"
    },
    {
        " of that tone, its ": null
    },
    {
        "volume": "loudness"
    },
    {
        ", the instruments ": null
    },
    {
        "intonation": "intonation"
    },
    {
        " tendencies, the players subjective level of comfort, and the instruments playability in a given pitch range.     Mouthpiece selection is a highly personal decision. Thus, a symphonic trombonist might prefer a mouthpiece with a deeper cup and sharper inner rim shape in order to produce a rich symphonic tone quality, while a ": null
    },
    {
        "jazz": "jazz"
    },
    {
        " trombonist might choose a shallower cup for brighter tone and easier production of higher notes. Further, for certain compositions, these choices between two such performers could easily be reversed. Some mouthpiece makers now offer mouthpieces that feature removable rims, cups, and shanks allowing players to further customize and adjust their mouthpieces to their preference.          Instruments made mostly from plastic, including the pBone and the Tromba plastic trombone, emerged in the 2010s as a cheaper and more robust alternative to brass.   Plastic instruments could come in almost any colour but the sound plastic instruments produce is different from that of brass. While originally seen as a gimmick, these plastic models have found increasing popularity of the last decade and are now viewed as practice tools that make for more convenient travel as well as a cheaper option for beginning players not wishing to invest so much money in a trombone right away. Manufacturers now produce large-bore models with triggers as well as smaller alto models.           German trombones have been built in a wide variety of bore and bell sizes. The traditional German Konzertposaune can differ substantially from American designs in many aspects. The mouthpiece is typically rather small and is placed into a slide section with a very long leadpipe of at least . The whole instrument is often made of gold brass, and its sound is usually darker compared with British, French or American designs. While their bore sizes were considered large in the 19th century, German trombones have altered very little over the last 150 years and are now typically somewhat smaller than their American counterparts. Bell sizes remain very large in all sizes of German trombone and a bass trombone bell may exceed  in diameter.     Valve attachments in tenor and bass trombones were first seen in the mid 19th century, originally on the tenor B trombone. Before 1850, bass trombone parts were mostly played on a slightly longer F-bass trombone . The first valve was simply a fourth-valve, or in German Quart-ventil , built onto a B tenor trombone, to allow playing in low F. This valve was first built without a return spring, and was only intended to set the instrument in B or F for extended passages. Since the mid-20th century, modern instruments use a trigger to engage the valve while playing.     As with other German and Austrian brass instruments, rotary valves are used to the exclusion of almost all other types of valve, even in valve trombones. Other features often found on German trombones include long ": null
    },
    {
        "water keys": "water key"
    },
    {
        "and snake decorations on the slide and bell U-bows.     Since around 1925, when jazz music became popular, Germany has been selling American trombones as well. Most trombones played in Germany today, especially by amateurs, are built in the American fashion, as those are much more widely available, and thus far cheaper.       French trombones were built in the very smallest bore sizes up to the end of the ": null
    },
    {
        "Second World War": "world war ii"
    },
    {
        " and whilst other sizes were made there, the French usually preferred the tenor trombone to any other size. French music, therefore, usually employed a section of three tenor trombones up to the mid–20th century. Tenor trombones produced in France during the 19th and early 20th centuries featured bore sizes of around , small bells of not more than  in diameter, as well as a funnel-shaped mouthpiece slightly larger than that of the ": null
    },
    {
        "cornet": "cornet"
    },
    {
        " or ": null
    },
    {
        "horn": "french horn"
    },
    {
        ". French tenor trombones were built in both C and B, altos in D, sopranos in F, piccolos in high B, basses in G and E, contrabasses in B.       Several makers have begun to market compact B/C trombones that are especially well suited for young children learning to play the trombone who cannot reach the outer slide positions of full-length instruments. The fundamental note of the unenhanced length is C, but the short valved attachment that puts the instrument in B is open when the trigger is not depressed. While such instruments have no seventh slide position, C and B natural may be comfortably accessed on the first and second positions by using the trigger. A similar design was marketed by ": null
    },
    {
        "C.G. Conn": "c.g. conn"
    },
    {
        " in the 1920s, also under the ": null
    },
    {
        "Wurlitzer": "wurlitzer"
    },
    {
        " label. Currently, B/C trombones are available from many manufacturers, including German makers Günter Frost, Thein and Helmut Voigt, as well as the ": null
    },
    {
        "Yamaha Corporation": "yamaha corporation"
    },
    {
        ".  with ascending Bb/C rotor       Trombones in slide and valve configuration have been made by a vast array of musical instrument manufacturers. For the brass bands of the late 19th and early 20th century, prominent American manufacturers included Graves and Sons, E. G. Wright and Company, ": null
    },
    {
        "Boston Musical Instrument Company": "boston musical instrument company"
    },
    {
        ", ": null
    },
    {
        "E. A. Couturier": "e. a. couturier"
    },
    {
        ", ": null
    },
    {
        "H. N. White Company/King Musical Instruments": "king musical instruments"
    },
    {
        ", ": null
    },
    {
        "J. W. York": "james warren york"
    },
    {
        ", and ": null
    },
    {
        "C.G. Conn": "c.g. conn"
    },
    {
        ". In the 21st century, leading mainstream manufacturers of trombones include ": null
    },
    {
        "Getzen": "getzen"
    },
    {
        " Vincent Bach": "vincent bach"
    },
    {
        ", ": null
    },
    {
        "Conn": "c.g. conn"
    },
    {
        ", Michael Rath, Kanstul, Thein, Greenhoe, Schilke, Courtois, King, ": null
    },
    {
        "Yamaha": "yamaha corporation"
    },
    {
        ", ": null
    },
    {
        "Edwards Instruments": "edwards instruments"
    },
    {
        ", S.E. Shires, and ": null
    },
    {
        "Jupiter Band Instruments": "jupiter band instruments"
    }
]