[
    {
        "              Tuff , also known as volcanic tuff, is a type of ": null
    },
    {
        "rock": "rock"
    },
    {
        " made of ": null
    },
    {
        "volcanic ash": "volcanic ash"
    },
    {
        " ejected from a ": null
    },
    {
        "vent": "volcano"
    },
    {
        " during a ": null
    },
    {
        "volcanic eruption": "volcanic eruption"
    },
    {
        ". Following ejection and deposition, the ash is compacted into a solid rock in a process called ": null
    },
    {
        "consolidation": "consolidation"
    },
    {
        ". Tuff is sometimes erroneously called tufa , particularly when used as construction material, but properly speaking, ": null
    },
    {
        "tufa": "tufa"
    },
    {
        " is a limestone precipitated from groundwater. Rock that contains greater than 42% tuff is considered tuffaceous.     Tuff is a relatively soft rock, so it has been used for construction since ancient times. Since it is common in Italy, the Romans used it often for construction. The ": null
    },
    {
        "Rapa Nui": "rapa nui"
    },
    {
        " people used it to make most of the  moai  statues in ": null
    },
    {
        "Easter Island": "easter island"
    },
    {
        ".     Tuff can be classified as either sedimentary or igneous rock. They are usually studied in the context of igneous petrology, although they are sometimes described using sedimentological terms.       The material that is expelled in a ": null
    },
    {
        "volcanic eruption": "types of volcanic eruptions"
    },
    {
        " can be classified into three types:     ": null
    },
    {
        "Volcanic gas": "volcanic gas"
    },
    {
        "es, a mixture made mostly of ": null
    },
    {
        "steam": "steam"
    },
    {
        ", ": null
    },
    {
        "carbon dioxide": "carbon dioxide"
    },
    {
        ", and a sulfur compound    ": null
    },
    {
        "Lava": "lava"
    },
    {
        ", the name of ": null
    },
    {
        "magma": "magma"
    },
    {
        " when it emerges and flows over the surface   ": null
    },
    {
        "Tephra": "tephra"
    },
    {
        ", chunks of solid material of all shapes and sizes ejected and thrown through the air     Tephra is made when magma inside the volcano is blown apart by the rapid expansion of hot volcanic gases. Magma commonly explodes as the gas dissolved in it comes out of solution as the pressure decreases ": null
    },
    {
        "when it flows to the surface": "extrusion"
    },
    {
        ". These violent explosions produce solid chunks of material that can then fly from the volcano. Chunks smaller than 42  mm in diameter  are called volcanic ash.               Among the loose beds of ash that cover the slopes of many volcanoes, three classes of materials are represented. In addition to true ashes of the kind described above, lumps of the old lavas and tuffs form the walls of the crater, which have been torn away by the violent outbursts of steam, and pieces of ": null
    },
    {
        "sedimentary rock": "sedimentary rock"
    },
    {
        "s from the deeper parts of the volcano that were dislodged by the rising lava and are often intensely baked and ": null
    },
    {
        "recrystallized": "recrystallization"
    },
    {
        " by the heat to which they have been subjected.     In some great volcanic explosions, nothing but lumps of the old lavas and tuffs forming the walls of the crater etc. are emitted, as at ": null
    },
    {
        "Mount Bandai": "mount bandai"
    },
    {
        " in ": null
    },
    {
        "Japan": "japan"
    },
    {
        " in 42 Many eruptions also have occurred in which the quantity of broken sedimentary rocks that mingled with the ash is very great; instances include the volcanoes of the ": null
    },
    {
        "Eifel": "eifel"
    },
    {
        " and the ": null
    },
    {
        "Devonian": "devonian period"
    },
    {
        " tuffs, known as Schalsteins, in ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". In the ": null
    },
    {
        "Scottish": "scotland"
    },
    {
        " coalfields, some old volcanoes are plugged with masses consisting entirely of sedimentary debris; in such cases, supposedly no lava was ejected, but the cause of the eruption was the sudden liberation and expansion of a large quantity of steam. These accessory or adventitious materials, however, as distinguished from the true ash, tend to occur in angular fragments, and when they form a large part of the mass, the rock is more properly a volcanic ": null
    },
    {
        "breccia": "breccia"
    },
    {
        " than a tuff. The ash ": null
    },
    {
        "ejecta": "ejectavolcanology"
    },
    {
        " vary in size from large blocks 42 ft or more in diameter to the minutest impalpable dust. The large masses are called ": null
    },
    {
        "volcanic bomb": "volcanic bomb"
    },
    {
        "s ; they have mostly a rounded, elliptical, or pear-shaped form owing to rotation in the air before they solidified. Many of them have ribbed or nodular surfaces, and sometimes they have a crust intersected by many cracks like the surface of a loaf of bread. Any ash in which they are very abundant is called an ": null
    },
    {
        "agglomerate": "agglomerate"
    },
    {
        ".     In those layers and beds of tuff that have been spread out over considerable tracts of land and which are most frequently encountered among the sedimentary rocks, smaller fragments dominate and bombs more than a few inches in diameter may be absent altogether. A tuff of recent origin is generally loose and incoherent, but the older tuffs have been, in most cases, cemented together by pressure and the action of infiltrating water, making rocks which, while not very hard, are strong enough to be extensively used for building purposes . If they have accumulated ": null
    },
    {
        "subaerial": "subaerial"
    },
    {
        "ly, like the ash beds found on ": null
    },
    {
        "Mt. Etna": "mt. etna"
    },
    {
        " or ": null
    },
    {
        "Vesuvius": "vesuvius"
    },
    {
        " at the present day, tuffs consist almost wholly of volcanic materials of different degrees of fineness with pieces of wood and vegetable matter, land shells, etc., but many volcanoes stand near the sea, and the ash cast out by them is mingled with marine sediments. In this way, ashy ": null
    },
    {
        "mud": "mud"
    },
    {
        "s, ": null
    },
    {
        "sand": "sand"
    },
    {
        "s, or even in some cases ashy ": null
    },
    {
        "limestone": "limestone"
    },
    {
        "s are formed. Most of the tuffs found in the older marine formations contain admixtures of ": null
    },
    {
        "clay": "clay"
    },
    {
        ", sand, and sometimes ": null
    },
    {
        "fossil": "fossil"
    },
    {
        " shell": "animal shell"
    },
    {
        "s, which prove that they were beds spread out under water.     During some volcanic eruptions, a layer of ash several feet in thickness is deposited over a considerable area; such beds thin out rapidly as the distance from the crater increases, and ash deposits covering many square miles are usually very thin. The showers of ash often follow one another after longer or shorter intervals, hence thick masses of tuff, whether of subaerial or of marine origin, have mostly a ": null
    },
    {
        "stratified": "stratigraphy"
    },
    {
        " character. The coarsest materials or agglomerates show this least distinctly; in the fine beds, it is often well developed.          Apart from adventitious material, such as fragments of the older rocks, pieces of trees, etc., the contents of an ash deposit may be described as consisting of more or less ": null
    },
    {
        "crystal": "crystal"
    },
    {
        "line ": null
    },
    {
        "igneous rock": "igneous rock"
    },
    {
        "s. If the lava within the crater has been at such a temperature that solidification has commenced, crystals are usually present. They may be of considerable size like the grey, rounded ": null
    },
    {
        "leucite": "leucite"
    },
    {
        " crystals found on the sides of Vesuvius. Many of these are very perfect and rich in faces because they grew in a medium that was liquid and not very viscous.     Good crystals of ": null
    },
    {
        "augite": "augite"
    },
    {
        " and ": null
    },
    {
        "olivine": "olivine"
    },
    {
        " are also to be obtained in the ash beds of Vesuvius and of many other volcanoes, ancient and modern. Blocks of these crystalline minerals  are common objects in the tuffs of many of the ": null
    },
    {
        "West India": "west indies"
    },
    {
        "n volcanoes. Where crystals are very abundant, the ashes are called crystal tuffs . In St. Vincent and Martinique in 42 much of the dust was composed of minute crystals enclosed in thin films of ": null
    },
    {
        "glass": "glass"
    },
    {
        " because the lava at the moment of eruption had very nearly solidified as a crystalline mass. Some ": null
    },
    {
        "basalt": "basalt"
    },
    {
        "ic volcanoes, though, have ejected great quantities of black glassy ": null
    },
    {
        "scoria": "scoria"
    },
    {
        ", which, after consolidation, weather to a red soft rock known as ": null
    },
    {
        "palagonite": "palagonite"
    },
    {
        "; tuffs of this kind occur in ": null
    },
    {
        "Iceland": "iceland"
    },
    {
        " and ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ".     In the ": null
    },
    {
        "Lipari Islands": "lipari islands"
    },
    {
        " and ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        ", ": null
    },
    {
        "acid": "acid"
    },
    {
        "  tuffs, of pale grey or yellow color, largely composed of lumps and fragments of ": null
    },
    {
        "pumice": "pumice"
    },
    {
        ", occur. Over a large portion of the sea bottom, the beds of fine mud contain small, water-worn, rounded pebbles of very spongy volcanic glass; these have been floated from the shore or cast out by submarine volcanoes, and may have travelled for hundreds of miles before sinking; some kinds of pumice have been shown to float on seawater for more than a year. The deep sea-deposit known as the ": null
    },
    {
        "red clay": "pelagic red clay"
    },
    {
        " is largely of volcanic origin and might be suitably described as a submarine tuff-bed .              Welded tuff is a ": null
    },
    {
        "pyroclastic rock": "pyroclastic rock"
    },
    {
        ", of any origin, that was sufficiently hot at the time of deposition to weld together. Strictly speaking, if the rock contains scattered, pea-sized fragments or ": null
    },
    {
        "fiamme": "fiamme"
    },
    {
        " in it, it is called a welded ": null
    },
    {
        "lapilli": "lapilli"
    },
    {
        "-tuff. Welded tuffs can be of fallout origin, or deposited from pyroclastic density currents, as in the case of ": null
    },
    {
        "ignimbrite": "ignimbrite"
    },
    {
        "s. During welding, the glass shards and pumice fragments adhere together , deform, and compact together, resulting in a ": null
    },
    {
        "eutaxitic fabric": "eutaxitic texture"
    },
    {
        ".     Welded ignimbrites can be highly voluminous, such as the ": null
    },
    {
        "Lava Creek Tuff": "lava creek tuff"
    },
    {
        " erupted from ": null
    },
    {
        "Yellowstone Caldera": "yellowstone caldera"
    },
    {
        " in ": null
    },
    {
        "Wyoming": "wyoming"
    },
    {
        " 42 years ago. Lava Creek tuff is known to be at least 42 times as large as the deposits of the May 42 ": null
    },
    {
        "42 eruption of Mount St. Helens": "1980 eruption of mount st. helens"
    },
    {
        ", and it had a ": null
    },
    {
        "Volcanic Explosivity Index": "volcanic explosivity index"
    },
    {
        " of 42 greater than any eruption known in the last 42 years. The intensity of welding may decrease towards the upper margin of a deposit, towards areas in which the deposit is thinner, and with distance from source. Welded tuff is commonly rhyolitic in composition, but examples of all compositions are known.             For ": null
    },
    {
        "petrographical": "petrology"
    },
    {
        " purposes, tuff is generally classified according to the nature of the volcanic rock of which it consists; this may be the same as the accompanying lavas if any were emitted during an eruption, and if a change occurs in the kind of lava which is poured out, the tuffs also indicate this equally clearly. Rhyolite tuffs contain pumiceous, glassy fragments and small scoriae with ": null
    },
    {
        "quartz": "quartz"
    },
    {
        ", ": null
    },
    {
        "alkali": "alkali"
    },
    {
        " feldspar": "feldspar"
    },
    {
        ", ": null
    },
    {
        "biotite": "biotite"
    },
    {
        ", etc. Iceland, Lipari, Hungary, the ": null
    },
    {
        "Basin and Range": "basin and range province"
    },
    {
        " of the American southwest, and ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        " are among the areas where such tuffs are prominent. The broken pumice is clear and isotropic, and very small particles commonly have crescentic, sickle-shaped, or biconcave outlines, showing that they are produced by the shattering of a vesicular glass, sometimes described as ash-structure. The tiny glass fragments derived from broken pumice are called shards; the glass shards readily deform and flow when the deposits are sufficiently hot, as shown in the accompanying image of welded tuff.     In the ancient rocks of ": null
    },
    {
        "Wales": "wales"
    },
    {
        ", ": null
    },
    {
        "Charnwood": "charnwood forest"
    },
    {
        ", the ": null
    },
    {
        "Pentland Hills": "pentland hills"
    },
    {
        ", etc., similar tuffs are known, but in all cases, they are greatly changed by silicification  and by devitrification. The frequent presence of rounded corroded quartz crystals, such as occur in rhyolitic lavas, helps to demonstrate their real nature.     An example of this tuff,  Rochlitz Porphyr, can be seen in the ": null
    },
    {
        "Mannerist": "mannerism"
    },
    {
        "-style sculpted portal outside the chapel entrance in ": null
    },
    {
        "Colditz Castle": "colditz castle"
    },
    {
        ". ": null
    },
    {
        "Georg Dehio": "georg dehio"
    },
    {
        ": Handbuch der deutschen Kunstdenkmäler, Sachsen II. ": null
    },
    {
        "Deutscher Kunstverlag": "deutscher kunstverlag"
    },
    {
        ", München, Berlin 42 p. 42 The trade name Rochlitz Porphyr is the traditional designation for a ": null
    },
    {
        "dimension stone": "dimension stone"
    },
    {
        " of ": null
    },
    {
        "Saxony": "saxony"
    },
    {
        " with an architectural history over 42 years in Germany. The quarries are located near Rochlitz. Heiner Siedel: Sächsische „Porphyrtuffe“ aus dem Rotliegend als Baugesteine: Vorkommen und Abbau, Anwendung, Eigenschaften und Verwitterung. In: Institut für Steinkonservierung e. V. Bericht Nr. 42 42 p. 4242        Trachyte tuffs contain little or no quartz, but much ": null
    },
    {
        "sanidine": "sanidine"
    },
    {
        " or ": null
    },
    {
        "anorthoclase": "anorthoclase"
    },
    {
        " and sometimes oligoclase feldspar, with occasional biotite, augite, and hornblende. In weathering, they often change to soft red or yellow clay-stones, rich in ": null
    },
    {
        "kaolin": "kaolin"
    },
    {
        " with secondary quartz. Recent trachyte tuffs are found on the ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        " , in ": null
    },
    {
        "Ischia": "ischia"
    },
    {
        ", near ": null
    },
    {
        "Naples": "naples"
    },
    {
        ", Hungary, etc.       Andesitic tuffs are exceedingly common. They occur along the whole chain of the ": null
    },
    {
        "Cordilleras": "american cordillera"
    },
    {
        " and ": null
    },
    {
        "Andes": "andes"
    },
    {
        ", in the ": null
    },
    {
        "West Indies": "west indies"
    },
    {
        ", New Zealand, Japan, etc. In the Lake district, North Wales, Lorne, the Pentland Hills, the Cheviots, and many other districts of ": null
    },
    {
        "Great Britain": "great britain"
    },
    {
        ", ancient rocks of exactly similar nature are abundant. In color, they are red or brown; their scoriae fragments are of all sizes from huge blocks down to minute granular dust. The cavities are filled with many secondary minerals, such as ": null
    },
    {
        "calcite": "calcite"
    },
    {
        ", ": null
    },
    {
        "chlorite": "chlorite group"
    },
    {
        ", quartz, ": null
    },
    {
        "epidote": "epidote"
    },
    {
        ", or chalcedony; in microscopic sections, though, the nature of the original lava can nearly always be made out from the shapes and properties of the little crystals which occur in the decomposed glassy base. Even in the smallest details, these ancient tuffs have a complete resemblance to the modern ash beds of ": null
    },
    {
        "Cotopaxi": "cotopaxi"
    },
    {
        ", ": null
    },
    {
        "Krakatoa": "krakatoa"
    },
    {
        ", and Mont Pelé.            Basaltic tuffs are also of widespread occurrence both in districts where volcanoes are now active and in lands where eruptions have long since ended. They are found in ": null
    },
    {
        "Skye": "isle of skye"
    },
    {
        ", ": null
    },
    {
        "Mull": "isle of mull"
    },
    {
        ", ": null
    },
    {
        "Antrim": "county antrim"
    },
    {
        ", and other places, where ": null
    },
    {
        "Paleogene": "paleogene"
    },
    {
        " volcanic rocks are found; in Scotland, ": null
    },
    {
        "Derbyshire": "derbyshire"
    },
    {
        ", and Ireland among the ": null
    },
    {
        "carboniferous": "carboniferous"
    },
    {
        " strata, and among the still older rocks of the ": null
    },
    {
        "Lake District": "lake district"
    },
    {
        ", the southern uplands of Scotland, and Wales. They are black, dark green, or red in colour; vary greatly in coarseness, some being full of round spongy bombs a foot or more in diameter; and being often submarine, may contain shale, sandstone, grit, and other sedimentary material, and are occasionally fossiliferous. Recent basaltic tuffs are found in ": null
    },
    {
        "Iceland": "iceland"
    },
    {
        ", the ": null
    },
    {
        "Faroe Islands": "faroe islands"
    },
    {
        ", ": null
    },
    {
        "Jan Mayen": "jan mayen"
    },
    {
        ", Sicily, the ": null
    },
    {
        "Hawaiian Islands": "hawaiian islands"
    },
    {
        ", ": null
    },
    {
        "Samoa": "samoa"
    },
    {
        ", etc. When weathered, they are filled with calcite, chlorite, ": null
    },
    {
        "serpentine": "serpentine group"
    },
    {
        ", and especially where the lavas contain ": null
    },
    {
        "nepheline": "nepheline"
    },
    {
        " or ": null
    },
    {
        "leucite": "leucite"
    },
    {
        ", are often rich in ": null
    },
    {
        "zeolite": "zeolite"
    },
    {
        "s, such as ": null
    },
    {
        "analcite": "analcite"
    },
    {
        ", ": null
    },
    {
        "prehnite": "prehnite"
    },
    {
        ", ": null
    },
    {
        "natrolite": "natrolite"
    },
    {
        ", ": null
    },
    {
        "scolecite": "scolecite"
    },
    {
        ", ": null
    },
    {
        "chabazite": "chabazite"
    },
    {
        ", ": null
    },
    {
        "heulandite": "heulandite"
    },
    {
        ", etc.       Ultramafic tuffs are extremely rare; their characteristic is the abundance of ": null
    },
    {
        "olivine": "olivine"
    },
    {
        " or serpentine and the scarcity or absence of ": null
    },
    {
        "feldspar": "feldspar"
    },
    {
        " and ": null
    },
    {
        "quartz": "quartz"
    },
    {
        ". Rare occurrences may include unusual surface deposits of ": null
    },
    {
        "maar": "maar"
    },
    {
        "s of ": null
    },
    {
        "kimberlite": "kimberlite"
    },
    {
        "s of the ": null
    },
    {
        "diamond": "diamond"
    },
    {
        "-fields of southern Africa and other regions. The principal rock of ": null
    },
    {
        "kimberlite": "kimberlite"
    },
    {
        " is a dark bluish-green, serpentine-rich breccia which when thoroughly oxidized and weathered becomes a friable brown or yellow mass . These breccias were emplaced as gas–solid mixtures and are typically preserved and mined in ": null
    },
    {
        "diatreme": "diatreme"
    },
    {
        "s that form intrusive pipe-like structures. At depth, some kimberlite breccias grade into root zones of dikes made of unfragmented rock. At the surface, ultramafic tuffs may occur in maar deposits. Because kimberlites are the most common igneous source of diamonds, the transitions from maar to diatreme to root-zone dikes have been studied in detail. Diatreme-facies kimberlite is more properly called an ultramafic breccia rather than a tuff.            In course of time, changes other than weathering may overtake tuff deposits. Sometimes, they are involved in folding and become sheared and cleaved. Many of the green ": null
    },
    {
        "slate": "slate"
    },
    {
        "s of the lake district in ": null
    },
    {
        "Cumberland": "cumberland, england"
    },
    {
        " are finely cleaved ashes. In ": null
    },
    {
        "Charnwood Forest": "charnwood forest"
    },
    {
        " also, the tuffs are slaty and cleaved. The green color is due to the large development of chlorite. Among the crystalline ": null
    },
    {
        "schist": "schist"
    },
    {
        "s of many regions, green beds or green schists occur, which consist of quartz, hornblende, chlorite or biotite, ": null
    },
    {
        "iron oxide": "iron oxide"
    },
    {
        "s, feldspar, etc., and are probably recrystallized or ": null
    },
    {
        "metamorphosed": "metamorphism"
    },
    {
        " tuffs. They often accompany masses of epidiorite and hornblende – schists which are the corresponding lavas and ": null
    },
    {
        "sill": "sill"
    },
    {
        "s. Some chlorite-schists also are probably altered beds of volcanic tuff. The Schalsteins of ": null
    },
    {
        "Devon": "devon"
    },
    {
        " and Germany include many cleaved and partly recrystallized ash-beds, some of which still retain their fragmental structure, though their lapilli are flattened and drawn out. Their steam cavities are usually filled with calcite, but sometimes with quartz. The more completely altered forms of these rocks are platy, green chloritic schists; in these, however, structures indicating their original volcanic nature only sparingly occur. These are intermediate stages between cleaved tuffs and crystalline schists.            Tuffs primary economic value is as a building material. In the ancient world, tuffs relative softness meant that it was commonly used for construction where it was available. Tuff is common in Italy, and the ": null
    },
    {
        "Romans": "ancient rome"
    },
    {
        " used it for many buildings and bridges. For example, the whole port of the island of ": null
    },
    {
        "Ventotene": "ventotene"
    },
    {
        " , was carved from tuff. The ": null
    },
    {
        "Servian Wall": "servian wall"
    },
    {
        ", built to defend the city of ": null
    },
    {
        "Rome": "rome"
    },
    {
        " in the fourth century BC, is also built almost entirely from tuff. The Romans also cut tuff into small, rectangular stones that they used to create walls in a pattern known as  opus reticulatum .     The Romans thought bees nested in tuff. The substance is mentioned in the  Aeneid  .     The ": null
    },
    {
        "peperino": "peperino"
    },
    {
        ", much used at Rome and Naples as a building stone, is a ": null
    },
    {
        "trachyte": "trachyte"
    },
    {
        " tuff. ": null
    },
    {
        "Pozzolana": "pozzolana"
    },
    {
        " also is a decomposed tuff, but of basic character, originally obtained near ": null
    },
    {
        "Naples": "naples"
    },
    {
        " and used as a ": null
    },
    {
        "cement": "cement"
    },
    {
        ", but this name is now applied to a number of substances not always of identical character. In the ": null
    },
    {
        "Eifel": "eifel"
    },
    {
        " region of Germany, a trachytic, pumiceous tuff called ": null
    },
    {
        "trass": "trass"
    },
    {
        " has been extensively worked as a hydraulic ": null
    },
    {
        "mortar": "mortar"
    },
    {
        ".      ": null
    },
    {
        "Yucca Mountain nuclear waste repository": "yucca mountain nuclear waste repository"
    },
    {
        ", a U.S. Department of Energy terminal storage facility for spent nuclear reactor and other radioactive waste, is in tuff and ignimbrite in the ": null
    },
    {
        "Basin and Range Province": "basin and range province"
    },
    {
        " in ": null
    },
    {
        "Nevada": "nevada"
    },
    {
        ". In ": null
    },
    {
        "Napa Valley": "napa valley"
    },
    {
        " and ": null
    },
    {
        "Sonoma Valley": "sonoma valley"
    },
    {
        ", ": null
    },
    {
        "California": "california"
    },
    {
        ", areas made of tuff are routinely excavated for storage of wine barrels.     Tuff from Rano Raraku was used by the Rapa Nui people of Easter Island to make the vast majority of their famous moai statues.     Tuff is important in ": null
    },
    {
        "Armenian architecture": "armenian architecture"
    },
    {
        ". ": null
    }
]