[
    {
        "      Tunisian crochet, also known as Afghan crochet, is a type of ": null
    },
    {
        "crochet": "crochet"
    },
    {
        " that uses an elongated ": null
    },
    {
        "hook": "crochet hook"
    },
    {
        ", often with a stopper on the handle end, called an Afghan hook. It is sometimes considered to be a mixture of crocheting and ": null
    },
    {
        "knitting": "knitting"
    },
    {
        ". As such, some techniques used in knitting are also applicable in Tunisian crochet. One example is the ": null
    },
    {
        "intarsia": "intarsia"
    },
    {
        " method.     The work is begun with the traditional starting chain, a series of slip stitches. Once the chain is completed, the first row is worked by inserting the hook back into the previous link of the chain, and a loop from the free end of the yarn is grabbed with the hook and pulled back through the link. Unlike traditional crochet, however, this new loop is not then pulled through the initial loop. Both remain on the hook and then the process is repeated, working from right to left, until each link in the chain has been worked. At the end, there will be as many loops on the hook as there are stitches required. This process is called ": null
    },
    {
        "casting on": "casting on"
    },
    {
        ". This is the first of two parts for creating a row.     The work is never turned. Once the correct number of loops is obtained, the process is reversed with each loop being worked off from the hook by pulling a fresh loop of yarn through each stitch, working from left to right. It is both parts of the process which form a completed row. The tension of the yarn is much looser than in standard crochet or knitting.     Tunisian crochet can also be worked in the round, as when making a seamless cap. To work in the round a double-ended crochet hook and two balls of yarn are used. The first hook and ball of yarn are used to add loops . When the process is reversed , the loops are worked off using the second hook and second ball of yarn. When using a flexible cable to connect the two ends of the double-ended crochet hook, a single ball of yarn is sufficient.     There are a variety of stitches that can be created depending on how and where the hook is inserted and how the working yarn is held. Tunisian stitches include variations on knit, purl, post stitch, and entrelac, to name a few.     The fabric created by Tunisian crochet is slightly less elastic than normal crochet and substantially thicker, particularly the knit stitch. This makes it most suitable for blankets and winter knits, but unsuitable for finer items like babywear and socks. The fabric also has a tendency to curl, and usually needs to be shaped by wetting or steaming the fabric upon completion. It is slightly faster to create fabric by Tunisian than normal crochet, and approximately twice the speed of knitting. ": null
    }
]