[
    {
        "     Turaw  is a town in the ": null
    },
    {
        "Zhytkavichy District": "zhytkavichy district"
    },
    {
        " of ": null
    },
    {
        "Gomel Region": "gomel region"
    },
    {
        " of ": null
    },
    {
        "Belarus": "belarus"
    },
    {
        " and the former capital of the medieval ": null
    },
    {
        "Principality of Turov and Pinsk": "principality of turov and pinsk"
    },
    {
        ".       Turov was an ancient capital of the ": null
    },
    {
        "Dregovichs": "dregovichs"
    },
    {
        " tribe - one of the three ": null
    },
    {
        "Eastern Slavic": "eastern slavs"
    },
    {
        " tribes that are considered ancestors of the modern ": null
    },
    {
        "Belarusian people": "belarusians"
    },
    {
        " . Turov was first mentioned in the  Tale of Bygone Years  from 42 It is located in the southern part of Belarus, in the historical region of ": null
    },
    {
        "Polesia": "polesia"
    },
    {
        ".     According to legend, the city was founded at the crossing of Yazda and Strumen rivers by Duke Tur - hence the name Turov. Other etymology draws the name from Tur, the Slavic name of the ": null
    },
    {
        "Aurochs": "aurochs"
    },
    {
        ". Both rivers join with the ": null
    },
    {
        "Pripyat": "pripyat river"
    },
    {
        " river, which in turn flows into the ": null
    },
    {
        "Dnieper": "dnieper"
    },
    {
        " and then leads to the ": null
    },
    {
        "Black Sea": "black sea"
    },
    {
        ". This river route was known to ": null
    },
    {
        "Viking": "viking"
    },
    {
        "s, who used it extensively for communication and during their frequent raids to ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ".     The ": null
    },
    {
        "Varangian": "varangian"
    },
    {
        " dynasty of ": null
    },
    {
        "Rurik": "rurik"
    },
    {
        "s became dukes in the neighboring Duchy of ": null
    },
    {
        "Kiev": "kiev"
    },
    {
        ". Soon Turov also came under the dominion of a local branch of dukes of the ": null
    },
    {
        "Rurik Dynasty": "rurik dynasty"
    },
    {
        " and particularly of ": null
    },
    {
        "Izyaslav I": "izyaslav i"
    },
    {
        ", son of ": null
    },
    {
        "Yaroslav the Wise": "yaroslav the wise"
    },
    {
        ". In that period the town of Turaŭ was not only an important trade center within the ": null
    },
    {
        "Kievan Rus": "kievan rus"
    },
    {
        ", due to its proximity to major trade routes running from the ": null
    },
    {
        "Baltic Sea": "baltic sea"
    },
    {
        " to the Byzantine Empire, but also one of the most important cities of the Rus among ": null
    },
    {
        "Kiev": "kiev"
    },
    {
        ", ": null
    },
    {
        "Chernihiv": "chernihiv"
    },
    {
        ", ": null
    },
    {
        "Novgorod": "novgorod"
    },
    {
        ", and ": null
    },
    {
        "Pereyaslav": "pereyaslav"
    },
    {
        ". The ": null
    },
    {
        "Prince of Turov": "prince of turov"
    },
    {
        ", the main contender to the throne of the ": null
    },
    {
        "Kievan Rus": "kievan  rus"
    },
    {
        " before their subjugation to the ": null
    },
    {
        "Monomakhs": "vladimir monomakh"
    },
    {
        " considerably influenced the early politics of the neighboring ": null
    },
    {
        "Duchy of Poland": "kingdom of poland"
    },
    {
        " in the 42th century having together an intertwined history.     Thanks to the towns strategic location, many different crafts were developed and practiced in Turov. It was also home to bishops ": null
    },
    {
        "Cyril of Turov": "cyril of turov"
    },
    {
        " and Laverentiy of Turov. In 42 the first ": null
    },
    {
        "Roman Christian": "catholic"
    },
    {
        " bishopric on the territory of Belarus was founded in Turov. The towns period of prosperity ended with a number of feudal conflicts in the 42th century. Soon afterwards Turaŭ lost much of its importance as well as its autonomy.     In 42 Turov became a part of the ": null
    },
    {
        "Grand Duchy of Lithuania": "grand duchy of lithuania"
    },
    {
        " having closely assimilated with the ": null
    },
    {
        "Prince of Minsk": "prince of minsk"
    },
    {
        ". In 42 it became a ": null
    },
    {
        "private town": "private town"
    },
    {
        " of the ": null
    },
    {
        "Grand Duke": "grand duke"
    },
    {
        " Svitrigaila": "svitrigaila"
    },
    {
        ". In the end of the 42th century Turaŭ became a property of Grand Court Marshal of Lithuania ": null
    },
    {
        "Michal Glinski": "michal glinski"
    },
    {
        ". In 42 it was damaged by a ": null
    },
    {
        "Tatar invasion": "tatars"
    },
    {
        ". After Glinskis betrayal and escape to ": null
    },
    {
        "Grand Duchy of Moscow": "grand duchy of moscow"
    },
    {
        " in 42 Turov was confiscated by the family of ": null
    },
    {
        "Konstanty Ostrogski": "konstanty ostrogski"
    },
    {
        ", who started the reconstruction, but the town was yet again destroyed by the Tatars in 42 The ": null
    },
    {
        "Ostrogski": "ostrogski"
    },
    {
        " family owned the town for more than a century, until it was given as a ": null
    },
    {
        "dowry": "dowry"
    },
    {
        " to the ": null
    },
    {
        "Sapieha": "sapieha"
    },
    {
        " and then ": null
    },
    {
        "Potocki": "potocki"
    },
    {
        " magnate": "magnate"
    },
    {
        " families. During ": null
    },
    {
        "The Deluge": "the deluge"
    },
    {
        " the town was taken by Muscovy, but was soon retaken by ": null
    },
    {
        "Janusz Radziwiłł": "janusz radziwiłł"
    },
    {
        ". After the period of constant wars with Muscovy, the town was severely damaged. By 42 Turov had only 42 households left of the 42 there in 42     The town never fully recovered. After the ": null
    },
    {
        "Second Partition of Poland": "partitions of poland"
    },
    {
        " in 42 it was annexed by Russia and remained a small, provincial town for most of the 42th century. From that time onwards it shared the fate of the nearby town of ": null
    },
    {
        "Gomel": "gomel"
    },
    {
        ".     in 42 the wooden Orthodox Church of All Saints was built in Turov. It has survived down to this day, never having been rebuilt. Inside the church are kept the weeping icon of St Nicholas, and two old Christian crosses covered in legends and stories. The church remains as a centre of Orthodox life in the town.       The ": null
    },
    {
        "shtetl": "shtetl"
    },
    {
        " in Turov began in the 42th century. The population of Jewish people reached its peak at the end of the 42th century. After that time they began to emigrate to larger cities and to other countries. Turov was subjected to ": null
    },
    {
        "pogroms": "pogroms"
    },
    {
        " , but the Jewish population managed to hang on through ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " and the ": null
    },
    {
        "Russian Revolution": "russian revolution"
    },
    {
        ". Even after the ": null
    },
    {
        "Bolsheviks": "bolsheviks"
    },
    {
        " took over, the Jewish population continued to carry on their traditions and there was a degree of tolerance among the non-Jewish population of Turov. Greater efforts to suppress religious activity began in the 42s.      In 42 two schools opened in Turov, both a general school and a ": null
    },
    {
        "Yiddish": "yiddish"
    },
    {
        " school; both were attended by Jewish students. There were three synagogues in Turov, one Misnagdim and two Hasidic. All three closed in the early 42s.     The Jewish population in Turov was wiped out during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". Some Jews volunteered to join the army to fight the Germans. The first German army units to come through Turov, in July 42 did nothing to the Jewish population. The Holocaust began with the arrival of later units. Very few families returned after the war and as of 42 there were only three Jewish people living in Turov.       Flag was accepted by towns council on September 42 42 and was included in Belarus coats of arms registry on January 42 42     Flag has rectangular form with width to length ratio equal 42 : 42 and consists of three horizontal bands: blue , white and red .       T.A.Khvagina POLESYE from the Bug to the Ubort, Minsk ": null
    },
    {
        "Vysheysha shkola": "vysheysha shkola"
    },
    {
        ",         ": null
    }
]