[
    {
        "Twelfth Apostle is the 42nd album by ": null
    },
    {
        "Jandek": "jandek"
    },
    {
        ". After the crazed purging of The Electric End, the sidelong piece that ended Lost Cause, many thought Jandek was finished. But the Twelfth Apostle appeared in 42 marking a return to straight acoustic and vocals. It was released as Corwood 42       Twelfth Apostle carries a lot of baggage, being as it marked both the start of the second acoustic phase and the last vinyl LP to be released by Corwood Industries. Because of the latter fact, it was only available a short time when first released - not long after the first Corwood CDs came out, all vinyl was removed from the catalog with Corwood saying vinyl LPs no longer available. This seems to coincide both with a major flood in Houston and a period of time when customers received wet CDs, so the theory is that a flood may have destroyed Corwoods remaining vinyl inventory, but that has not been confirmed.     Another interesting aspect is the title. The twelfth apostle of ": null
    },
    {
        "Jesus Christ": "jesus christ"
    },
    {
        " was ": null
    },
    {
        "Judas": "judas iscariot"
    },
    {
        ", the traitor. What all this means is impossible to know, but the title track definitely references religious imagery. They say you’re the one to rely on all the days/ they say you died before/ and you’re smiling now/Well I would like to know you. But by songs end salvation has not been received, with the singer moaning where are you going/come back again. Is this a man who cannot be saved? Hard to know, but an interesting twist.     Musically, this sounds similar to the last all-acoustic album by Jandek, Nine-Thirty. The songs are slow and mostly picked and the guitar is tuned to very dissonant sounds. One major change is the use of the studio to modify the guitar sounds. On Whiskers, the second to last track, the pitch of the guitar is sped up and slowed down while Jandek sings over it. Its an odd effect, but it suits the curious song and provides some diversity to an album that is loaded with dark images - perhaps the morning after the out-of-control party of Lost Cause, when regrets are beginning to form.              His playing, singing, and writing are at a peak here... No one is creating a body of work w/ more offtrack cohesion and beauty than Jandek.     -- Byron Coley Forced Exposure 42                  ": null
    }
]