[
    {
        "     The Type IX U-boat was designed by ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        "s  Kriegsmarine  in 42 and 42 as a large ocean-going ": null
    },
    {
        "submarine": "submarine"
    },
    {
        " for sustained operations far from the home support facilities. Type IX boats were briefly used for patrols off the eastern United States in an attempt to disrupt the stream of troops and supplies bound for Europe. It was derived from the ": null
    },
    {
        "Type IA": "german type i submarine"
    },
    {
        ", and appeared in various sub-types.     Type IXs had six ": null
    },
    {
        "torpedo tube": "torpedo tube"
    },
    {
        "s; four at the bow and two at the stern. They carried six reloads internally and had five external torpedo containers which stored ten additional torpedoes. The total of 42 torpedoes allowed U-boat commanders to follow a convoy and strike night after night. Some of the IXC boats were fitted for mine operations; as mine-layers they could carry 42 ": null
    },
    {
        "TMA": "tma mine"
    },
    {
        " or 42 ": null
    },
    {
        "TMB mine": "tmb mine"
    },
    {
        "s.     Secondary armament was provided by one ": null
    },
    {
        " deck gun": "10.5 cm sk c/32 naval gun"
    },
    {
        " with 42 rounds. Anti-aircraft armament differed throughout the war. They had two periscopes in the tower. Types IXA and IXB had an additional periscope in the control room, which was removed in Type IXC and afterward.   These long range boats were frequently equipped with ": null
    },
    {
        "Focke-Achgelis Fa 42": "focke-achgelis fa 330"
    },
    {
        " rotor kite": "rotor kite"
    },
    {
        " towed rotary-wing aircraft.                 ": null
    },
    {
        "DeSchiMAG": "deschimag"
    },
    {
        " AG Weser": "ag weser"
    },
    {
        " of ": null
    },
    {
        "Bremen": "bremen"
    },
    {
        " built eight Type IXA U-boats.                               Type IXB was an improved model with an increased range. It was the most successful version overall with each boat averaging a total of over  sunk.     Notable IXB boats included  commanded by ": null
    },
    {
        "Reinhard Hardegen": "reinhard hardegen"
    },
    {
        ", which opened up the attack in the US waters in early 42 known as ": null
    },
    {
        "Operation Drumbeat": "operation drumbeat"
    },
    {
        ", and  operating off ": null
    },
    {
        "Freetown, Sierra Leone": "freetown"
    },
    {
        " under the command of ": null
    },
    {
        "Günther Hessler": "günther hessler"
    },
    {
        ", which had the most successful single mission of the war ever with close to  sunk.       DeSchiMAG AG Weser of Bremen built 42 Type IXB U-boats.                                Type IXC was a further refinement of the class with storage for an additional 42 tonnes of fuel, increasing the boats range. This series omitted the control room periscope leaving the boats with two tower scopes.     As mine-layers they could carry 42 TMA or 42 TMB mines, though  through  and  through  , were not fitted for mine operations.     The only U-boat sunk in the ": null
    },
    {
        "Gulf of Mexico": "gulf of mexico"
    },
    {
        ", , was a Type IXC.     U42 survives at the ": null
    },
    {
        "Museum of Science and Industry": "museum of science and industry"
    },
    {
        " in ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        ", and was completely renovated after being moved in 42 to a purpose-built indoor berth.        DeSchiMAG AG Weser and ": null
    },
    {
        "Seebeckwerft": "seebeckwerft"
    },
    {
        " of Bremen, and ": null
    },
    {
        "Deutsche Werft": "deutsche werft"
    },
    {
        " of ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        " built 42 Type IXC submarines.                                                                             Type IXC/42 was an improved Type IXC with slightly increased range and surfaced speed. The remains of  are on display at Woodside Ferry Terminal, ": null
    },
    {
        "Birkenhead": "birkenhead"
    },
    {
        ".        DeSchiMAG AG Weser and Seebeckwerft of Bremen, and Deutsche Werft of Hamburg, built 42 of this type.                                                                                                           Type IXD was significantly longer and heavier than the IXC/42 It was faster than the IXC but at the cost of slightly reduced range. They had three pairs of Daimler Benz diesels: two pairs for cruise and one for high speed or battery recharge. There were three variants: the IXD42 IXD42 and IXD/42 The IXD42 had unreliable engines and they were later converted for use in surface transport vessels.   The IXD42 comprised most of the class and had a range of . The IXD/42 was almost identical but with more engine power .     In 42 and 42 the torpedo tubes were removed from a number of IXD boats converted for transport use. In their new role they could transport 42 tonnes of cargo. The range was extended to .       DeSchiMAG AG Weser of Bremen built 42 Type IXD U-boats.                                           Several Type IXD/42 U-boats were contracted to be built DeSchiMAG AG Weser of Bremen, but only two were commissioned. They were:    was launched on 42 April 42 and commissioned 42 March 42 Her career ended in ": null
    },
    {
        "Operation Deadlight": "operation deadlight"
    },
    {
        ".    was launched on 42 May 42 but was badly damaged on 42 March 42 by US bombs while still in the dockyard.   , ,  and ": null
    }
]