[
    {
        "          Tyrfing, Tirfing or Tyrving  was a ": null
    },
    {
        "magic sword": "magic sword"
    },
    {
        " in ": null
    },
    {
        "Norse mythology": "norse mythology"
    },
    {
        ", which features in the ": null
    },
    {
        "Tyrfing Cycle": "tyrfing cycle"
    },
    {
        ", which includes a poem from the  Poetic Edda  called  Hervararkviða , and the ": null
    },
    {
        "Hervarar saga": "hervarar saga"
    },
    {
        ". The name is also used in the saga to denote the ": null
    },
    {
        "Goths": "goths"
    },
    {
        ". The form Tervingi was actually recorded by Roman sources in the 42th century.     ": null
    },
    {
        "Svafrlami": "svafrlami"
    },
    {
        " was the king of ": null
    },
    {
        "Gardariki": "gardariki"
    },
    {
        ", and ": null
    },
    {
        "Odin": "odin"
    },
    {
        "s grandson. He managed to trap the ": null
    },
    {
        "dwarves": "dwarf"
    },
    {
        " Dvalinn": "dvalinn"
    },
    {
        " and ": null
    },
    {
        "Durinn": "durinn"
    },
    {
        " when they had left the rock where they dwelt. Then he forced them to forge a sword with a golden hilt that would never miss a stroke, would never rust and would cut through stone and iron as easily as through clothes.     The dwarves made the sword, and it shone and gleamed like fire. However, in revenge they cursed it so that it would kill a man every time it was drawn and that it would be the cause of three great evils. They finally cursed it so that it would also kill Svafrlami himself.     When Svafrlami heard the curses he tried to slay Dvalinn, but the dwarf disappeared into the rock and the sword was driven deep into it, though missing its intended victim.     Svafrlami was killed by the ": null
    },
    {
        "berserker": "berserker"
    },
    {
        " Arngrim": "arngrim"
    },
    {
        ", who took the sword in his turn. After Arngrim, it was worn by ": null
    },
    {
        "Angantyr": "angantyr"
    },
    {
        " and his eleven brothers. They were all slain at ": null
    },
    {
        "Samsø": "samsø"
    },
    {
        ", by the Swedish champion ": null
    },
    {
        "Hjalmar": "hjalmar"
    },
    {
        ", and his Norwegian sworn brother ": null
    },
    {
        "Orvar-Odd": "orvar-odd"
    },
    {
        "; but ": null
    },
    {
        "Hjalmar": "hjalmar"
    },
    {
        ", being wounded by Tyrfing , has only time to sing his death-song before he dies, and asks Orvar-Odd to bring his body to his beloved ": null
    },
    {
        "Ingeborg, daughter of Yngvi": "yngvi and alfhervarar saga and the saga of orvar-odd"
    },
    {
        " at ": null
    },
    {
        "Uppsala": "gamla uppsala"
    },
    {
        ".     Angantyrs daughter, ": null
    },
    {
        "Hervor": "hervor"
    },
    {
        "  was brought up as a bond-servant and remained ignorant of her parentage. Upon learning it, she armed herself as a ": null
    },
    {
        "shieldmaiden": "shieldmaiden"
    },
    {
        ", and travelled to Munarvoe in ": null
    },
    {
        "Samsø": "samsø"
    },
    {
        " in an attempt to recover her fathers weapon. She found it and married King Gudmunds son, Höfund. Together they had two sons, Heidrek and Angantyr . Hervor gave Heidrek the sword Tyrfing in secret. While Angantyr and Heidrek walked, Heidrek showed Angantyr the sword. Since he had unsheathed it, the curse the dwarves had put on the sword made Heidrek kill his brother Angantyr. This was the second of Tyrfings three evil deeds.     ": null
    },
    {
        "Heidrek": "heidrek"
    },
    {
        " became king of the Goths. During a voyage, Heidrek camped at the Carpathians . He was accompanied by eight mounted ": null
    },
    {
        "thrall": "thrall"
    },
    {
        "s, who eventually entered his tent and slew him in his sleep, the third and final of Tyrfings evil deeds. Heidreks son, also named ": null
    },
    {
        "Angantyr": "angantyr"
    },
    {
        " , caught and killed the thralls and reclaimed the magic sword, finally satisfying the dwarves curse.     ": null
    },
    {
        "Angantyr": "angantyr"
    },
    {
        " was the next king of the Goths, but his illegitimate half-Hun brother ": null
    },
    {
        "Hlod": "hlod"
    },
    {
        " wanted half of the kingdom. Angantýr refused, and Gizur called Hlod a bastard and his mother a slave-girl. Hlod and 42 mounted Huns invaded the Goths . The Huns greatly outnumbered the Goths. The Goths won because Angantyr used Tyrfing to kill his brother Hlod on the battleground. The bodies of the numerous warriors choked the rivers, causing a flood which filled the valleys with dead men and horses.     The curse on Tyrfing is comparable to that placed on the ring ": null
    },
    {
        "Andvaranaut": "andvaranaut"
    },
    {
        " in the ": null
    },
    {
        "Völsung Cycle": "völsung cycle"
    },
    {
        ".     For links to source text in English translation and ": null
    },
    {
        "Old Norse": "old norse"
    },
    {
        " and for general commentary see ": null
    },
    {
        "Hervarar saga ok Heiðreks": "hervarar saga ok heiðreks"
    },
    {
        ".         The theme of a cursed sword which causes evil deeds whenever drawn was taken up by several modern writers of Fantasy - notably ": null
    },
    {
        "Michael Moorcock": "michael moorcock"
    },
    {
        "s  Stormbringer , the magic sword wielded by the doomed ": null
    },
    {
        "albino": "albino"
    },
    {
        " emperor ": null
    },
    {
        "Elric of Melniboné": "elric of melniboné"
    },
    {
        ". Science fiction author Poul Anderson included Tyrfing in his medieval fantasy novel The Broken Sword. In a more lighthearted tone, the theme was also taken up by ": null
    },
    {
        "Lawrence Watt-Evans": "lawrence watt-evans"
    },
    {
        " in  The Misenchanted Sword ": null
    }
]