[
    {
        "In ": null
    },
    {
        "Aztec mythology": "aztec mythology"
    },
    {
        ", Tecciztecatl  was a ": null
    },
    {
        "lunar deity": "lunar deity"
    },
    {
        ", representing the ": null
    },
    {
        "man-in-the-moon": "man in the moon"
    },
    {
        " .     The Aztecs believed that they were living in a universe dominated by ": null
    },
    {
        "generations of sun gods": "five suns"
    },
    {
        ", the current one, known as ": null
    },
    {
        "Tonatiuh": "tonatiuh"
    },
    {
        ", was the fifth. The first three previous suns perished by wind storms, jaguars and fiery rain. The fourth was wiped out by a flood when people turned into fish and spread through the ocean. After the fourth sun perished, the Aztecs believed that the gods assembled to decide which god was to become the next sun. They built a bonfire to sacrifice the next volunteer. Two gods – Nanahuatzin and Tecciztecatl – vied for the honor. Nanahuatzin , a poor god, was chosen because he could be spared. Proud Tecciztecatl insisted on the honor, but at the last moment hesitated. Nanahuatzin showed more courage and jumped into the fire. Tecciztecatl gained his courage and followed Nanahuatzin , thus forming two suns in the sky. The gods, being somewhat class conscious, were angry that rich and proud Tecciztecatl had to follow humble Nanahuatzin , threw a rabbit at Tecciztecatl leaving an ": null
    },
    {
        "imprint of the rabbits shape": "moon rabbit"
    },
    {
        " and dimming Tecciztecatls brightness to the point where he could only be seen at night.     In some depictions, Tecciztecatl carried a large, white seashell on his back, tēucciztli in Nahuatl, representing the moon itself; in others he had butterfly wings. He was a son of ": null
    },
    {
        "Tlaloc": "tlaloc"
    },
    {
        " and ": null
    },
    {
        "Chalchiuhtlicue": "chalchiuhtlicue"
    },
    {
        ".       ": null
    }
]