[
    {
        "Udo of Aachen  is a fictional ": null
    },
    {
        "monk": "monk"
    },
    {
        ", a creation of British technical writer Ray Girvan, who introduced him in an ": null
    },
    {
        "April Fools": "april fools"
    },
    {
        " hoax article in 42 According to the article, Udo was an illustrator and theologian who discovered the ": null
    },
    {
        "Mandelbrot set": "mandelbrot set"
    },
    {
        " some 42 years before ": null
    },
    {
        "Benoit Mandelbrot": "benoit mandelbrot"
    },
    {
        ".     Additional details of the hoax include the rediscovery of Udos works by the also-fictional Bob Schipke, a ": null
    },
    {
        "Harvard": "harvard university"
    },
    {
        " mathematician, who supposedly saw a picture of the Mandelbrot set in an ": null
    },
    {
        "illumination": "illumination"
    },
    {
        " for a 42th-century ": null
    },
    {
        "carol": "carol"
    },
    {
        ". Girvan also attributed Udo as a mystic and poet whose poetry was set to music by ": null
    },
    {
        "Carl Orff": "carl orff"
    },
    {
        " with the haunting  O Fortuna  in ": null
    },
    {
        "Carmina Burana": "carmina burana"
    },
    {
        ".         The poetry of O Fortuna was actually the work of itinerant ": null
    },
    {
        "goliard": "goliard"
    },
    {
        "s, found in the German Benedictine monastery of ": null
    },
    {
        "Benediktbeuern Abbey": "benediktbeuern abbey"
    },
    {
        ".     The hoax was lent an air of credibility because often ": null
    },
    {
        "medieval monks": "medieval monks"
    },
    {
        " did discover scientific and mathematical theories, only to have them hidden or shelved due to persecution or simply ignored because publication prior to the invention of the printing press was difficult at best. Mr. Girvan adds to this suggestion by associating Udo with several other more legitimate discoveries where an author was considered ahead of his time in terms of a scientific theory of some sort that is now established as a mainstream theory but was considered ": null
    },
    {
        "fringe science": "fringe science"
    },
    {
        " at the time.     Another aspect of the deception was that it was very common for pre42th century mathematicians to spend incredible amounts of time on hand calculations such as a ": null
    },
    {
        "logarithm table": "logarithm table"
    },
    {
        " or ": null
    },
    {
        "trigonometric functions": "trigonometric functions"
    }
]