[
    {
        "            is a type of thick ": null
    },
    {
        "wheat flour": "wheat flour"
    },
    {
        " noodle": "noodle"
    },
    {
        " used frequently in ": null
    },
    {
        "Japanese cuisine": "japanese cuisine"
    },
    {
        ". It is often served hot as a ": null
    },
    {
        "noodle soup": "noodle soup"
    },
    {
        " in its simplest form, as kake udon, in a mildly flavoured broth called kakejiru, which is made of ": null
    },
    {
        "dashi": "dashi"
    },
    {
        ", ": null
    },
    {
        "soy sauce": "soy sauce"
    },
    {
        ", and ": null
    },
    {
        "mirin": "mirin"
    },
    {
        ". It is usually topped with thinly chopped ": null
    },
    {
        "scallion": "scallion"
    },
    {
        "s. Other common toppings include ": null
    },
    {
        "tempura": "tempura"
    },
    {
        ", often ": null
    },
    {
        "prawn": "prawn"
    },
    {
        " or  kakiage  , or  aburaage , a type of deep-fried ": null
    },
    {
        "tofu": "tofu"
    },
    {
        " pockets seasoned with sugar, mirin, and soy sauce. A thin slice of ": null
    },
    {
        "kamaboko": "kamaboko"
    },
    {
        ", a halfmoon-shaped fish cake, is often added. ": null
    },
    {
        "Shichimi": "shichimi"
    },
    {
        " can be added to taste.     The flavour of broth and topping vary from region to region. Usually, dark brown broth, made from dark soy sauce , is used in eastern Japan, and light brown broth, made from light soy sauce , is used in western Japan. This is noticeable in packaged ": null
    },
    {
        "instant noodles": "instant noodles"
    },
    {
        ", which are often sold in two different versions for east and west. Currynanban is another popular variation, served in ": null
    },
    {
        "curry": "curry"
    },
    {
        " broth.          There are many stories explaining the origin of udon.     One story says that in AD 42 ": null
    },
    {
        "Enni": "enni"
    },
    {
        ", a ": null
    },
    {
        "Rinzai": "rinzai"
    },
    {
        " monk, introduced flour milling technology from ": null
    },
    {
        "Song China": "song dynasty"
    },
    {
        " to Japan. Floured crops were then made into noodles such as udon, soba, and pancakes in Japan which were eaten by locals. Milling techniques were spread around the country.     Another story states that during the ": null
    },
    {
        "Nara period": "nara period"
    },
    {
        ", a Japanese envoy was introduced to 42 kinds of confection while being in China during the ": null
    },
    {
        "Tang Dynasty": "tang dynasty"
    },
    {
        ". One of them was called , which was listed as  in , a dictionary which was published in the ": null
    },
    {
        "Heian Era": "heian era"
    },
    {
        ". The muginawa is believed to be an origin for many kinds of Japanese noodles. However, the muginawa in Shinsen Jikyō was made with wheat and rice flour.     Another story for udon claims that the original name of the noodle was konton, which was made with wheat flour and sweet fillings.     Yet another story says that a Buddhist priest called ": null
    },
    {
        "Kukai": "kukai"
    },
    {
        " introduced udon noodles to ": null
    },
    {
        "Shikoku": "shikoku"
    },
    {
        " during the ": null
    },
    {
        "Heian Era": "heian era"
    },
    {
        ". ": null
    },
    {
        "Kūkai": "kūkai"
    },
    {
        ", the Buddhist priest, traveled to ": null
    },
    {
        "Tang China": "tang dynasty"
    },
    {
        " around the beginning of the 42th century to study. ": null
    },
    {
        "Sanuki Province": "sanuki province"
    },
    {
        " claimed to have been the first to adopt udon noodles from Kūkai. Hakata claimed to have produced udon noodles based on Ennis recipe.       Udon noodles are boiled in a pot of hot water. Depending on the type of udon, the way it is served is different as well. Udon noodles are usually served chilled in the summer and hot in the winter. In the Edo period, the thicker wheat noodle was generally called udon, and served with a hot broth called . The chilled variety was called .     Cold udon, or udon salad, is usually mixed with egg omelette slices, shredded chicken and fresh vegetables, such as cucumber and radish. Toppings of Udon soup are chosen to reflect the seasons. Most toppings are added without much cooking, although there are also deep-fried ": null
    },
    {
        "tempura": "tempura"
    },
    {
        ". Many of these dishes may also be prepared with ": null
    },
    {
        "soba": "soba"
    },
    {
        ".           Kake udon  or Su udon : Hot udon in broth topped with thinly sliced ": null
    },
    {
        "green onions": "scallion"
    },
    {
        ", and perhaps a slice of ": null
    },
    {
        "kamaboko": "kamaboko"
    },
    {
        ".    Kitsune udon: Fox udon . Topped with ": null
    },
    {
        "aburaage": "aburaage"
    },
    {
        " . This originated in ": null
    },
    {
        "Osaka": "osaka"
    },
    {
        ". Kitsune udon is often mistaken for Tanuki udon.   Tanuki udon   or Haikara udon : Topped with ": null
    },
    {
        "tempura batter pieces": "tenkasu"
    },
    {
        ". Tanuki udon is often mistaken for Kitsune udon.   Tempura udon: Topped with ": null
    },
    {
        "tempura": "tempura"
    },
    {
        ", especially ": null
    },
    {
        "prawn": "prawn"
    },
    {
        ", or  kakiage , a type of mixed tempura ": null
    },
    {
        "fritter": "fritter"
    },
    {
        ".   Tsukimi udon: Moon-viewing udon . Topped with raw egg, which poaches in the hot soup.   Wakame udon: Topped with ": null
    },
    {
        "wakame": "wakame"
    },
    {
        ", a dark green sea vegetable.   Karē udon: Curry udon . Udon in a ": null
    },
    {
        "curry-flavoured": "japanese curry"
    },
    {
        " soup which may also include meat or vegetables. ": null
    },
    {
        "Biei, Hokkaido": "biei, hokkaido"
    },
    {
        " is famous for a unique curry udon.   Chikara udon: Power udon . Topped with toasted ": null
    },
    {
        "mochi": "mochi"
    },
    {
        " rice cakes.   Stamina udon: Stamina udon . Udon with various hearty ingredients, usually including meat, a raw egg, and vegetables.   Nabeyaki udon: A sort of udon ": null
    },
    {
        "hot-pot": "hot-pot"
    },
    {
        ", with seafood and vegetables cooked in a  nabe , or metal pot. The most common ingredients are tempura shrimp with mushrooms and an egg cracked on top.   Kamaage udon: Served in a communal hot-pot with hot water, and accompanied by a hot ": null
    },
    {
        "dipping sauce": "dipping sauce"
    },
    {
        " of ": null
    },
    {
        "dashi": "dashi"
    },
    {
        " sukiyaki": "sukiyaki"
    },
    {
        ".    Yaki udon : Stir-fried udon in soy-based sauce, prepared in a similar manner to ": null
    },
    {
        "yakisoba": "yakisoba"
    },
    {
        ". This originated in ": null
    },
    {
        "Kitakyushu": "kitakyushu"
    },
    {
        " of ": null
    },
    {
        "Fukuoka Prefecture": "fukuoka prefecture"
    },
    {
        ".    Miso-nikomi udon: a local dish of ": null
    },
    {
        "Nagoya": "nagoya"
    },
    {
        ", a hard udon simmered in red ": null
    },
    {
        "miso": "miso"
    },
    {
        " soup. The soup generally contains chicken, a floating cracked raw egg that is stirred in by the eater, kamaboko, vegetables and tubers. The noodles are extremely firm in order to stand up to the prolonged simmering in the soup; additionally, the noodles do not contain salt, so as to avoid over-salting from the salt in the miso.    Hōtō udon: a local dish of ": null
    },
    {
        "Yamanashi Prefecture": "yamanashi prefecture"
    },
    {
        ", a type of miso soup with udon and vegetables. One of the significant differences between usual udon and Hōtō udon is salt. When Hōtō udon is made, salt is not added to the noodle dough.   Oyako udon: chicken and egg, with sliced onion in a sweetened dashi soup over udon. It has a sweet savory flavor.   Curry nanban is a non-traditional udon soup served in a spicy curry broth. The term nanban is a reference to the ": null
    },
    {
        "Nanban trade": "nanban trade"
    },
    {
        " which had influenced ": null
    },
    {
        "Japanese culture": "japanese culture"
    },
    {
        " for a century before being banned in 42 by the ": null
    },
    {
        "Edo Shogunate": "edo shogunate"
    },
    {
        ".          Zaru udon: Chilled udon noodles topped with shredded ": null
    },
    {
        "nori": "nori"
    },
    {
        " and served on a zaru , a sieve-like bamboo tray. Accompanied by a chilled dipping sauce, usually a strong mixture of ": null
    },
    {
        "dashi": "dashi"
    },
    {
        ", ": null
    },
    {
        "mirin": "mirin"
    },
    {
        ", and ": null
    },
    {
        "shoyu": "shoyu"
    },
    {
        ". Eaten with ": null
    },
    {
        "wasabi": "wasabi"
    },
    {
        " or grated ": null
    },
    {
        "ginger": "ginger"
    },
    {
        ".   Bukkake udon: Cold udon served with thick ": null
    },
    {
        "dashi-broth": "dashi"
    },
    {
        ".    Hadaka udon : Cold udon served on its own.   Kijōyu udon: Served in a cold soup of raw soy sauce and ": null
    },
    {
        "sudachi": "sudachi"
    },
    {
        " juice, sometimes with a bit of grated ": null
    },
    {
        "daikon": "daikon"
    },
    {
        ".         There are wide variations in both thickness and shape for udon noodles.   : a slightly translucent, chewy type from ": null
    },
    {
        "Kutchan, Hokkaido": "kutchan, hokkaido"
    },
    {
        ". Literally heavy snow udon , made from the starch of potatoes. The texture is different from normal udon which is made from flour. At the foot of ": null
    },
    {
        "Mount Yōtei": "mount yōtei"
    },
    {
        ", ": null
    },
    {
        "Hokkaido": "hokkaido"
    },
    {
        ", the biggest producing area of potatoes, potato starch udon was eaten as a home food for farmers from long ago. The ratio of potato starch and wheat flour was improved to make it delicious even after a long time. The origin of the name heavy snow udon is the foot of ": null
    },
    {
        "Mount Yōtei": "mount yōtei"
    },
    {
        ", a heavy snowfall area, and the appearance of the noodles which is slightly translucent like snow.    : a thin type from ": null
    },
    {
        "Akita Prefecture": "akita prefecture"
    },
    {
        ".   : a lucky preserved food in ": null
    },
    {
        "Kuzu, Tochigi": "kuzu, tochigi"
    },
    {
        ". It looks similar to ears.   : an extreme flat and wide type from ": null
    },
    {
        "Kiryū, Gunma": "kiryū, gunma"
    },
    {
        ".    Hōtō  : a flat and wide type, usually cooked with vegetables, particularly ": null
    },
    {
        "kabocha": "kabocha"
    },
    {
        ", from ": null
    },
    {
        "Yamanashi Prefecture": "yamanashi prefecture"
    },
    {
        ".    Kishimen : a flat type from ": null
    },
    {
        "Nagoya": "nagoya"
    },
    {
        ".   : a soft type, usually eaten with sweet soy sauce, from ": null
    },
    {
        "Ise, Mie": "ise, mie"
    },
    {
        ".   In ": null
    },
    {
        "Kansai region": "kansai region"
    },
    {
        ", a soft and medium thickness type is popular.   : a thick and rather stiff type from ": null
    },
    {
        "Kagawa Prefecture": "kagawa prefecture"
    },
    {
        ".   : a thick and soft type from the ": null
    },
    {
        "Fukuoka": "fukuoka"
    },
    {
        ".   : similar to the above Hohtoh, from ": null
    },
    {
        "Ōita Prefecture": "ōita prefecture"
    },
    {
        ". Nominally a dumpling soup , it resembles very thick, flat udon.   ": null
    },
    {
        "Saitama Prefecture": "saitama prefecture"
    },
    {
        " has several varieties of udon.   : produced in ": null
    },
    {
        "Kazo, Saitama": "kazo, saitama"
    },
    {
        ", a place of active wheat production. Its very orthodox hand-kneading process characterizes Kazo udon noodles.   : a type of hotoh from ": null
    },
    {
        "Fukaya, Saitama": "fukaya, saitama"
    },
    {
        ". Boiled noodles using plenty of Fukaya green onions characterize Fuyaya Niboto udon.   : originated of ": null
    },
    {
        "Kōnosu, Saitama": "kōnosu, saitama"
    },
    {
        " in 42 it is characterized by its width that is as wide as eight centimeters.   : originated of ": null
    },
    {
        "Niiza, Saitama": "niiza, saitama"
    },
    {
        " in 42 The noodles are kneaded with ": null
    },
    {
        "carrot": "carrot"
    },
    {
        " and are characterized by their vivid orange color.   : a specialty of ": null
    },
    {
        "Nagasaki Prefecture": "nagasaki prefecture"
    },
    {
        ". Literally plate udon, consisting of thinner udon that are ": null
    },
    {
        "deep fried": "deep frying"
    },
    {
        " and served with any of a number of toppings.   : also called suba, a regional ": null
    },
    {
        "Okinawan": "okinawan cuisine"
    },
    {
        " noodle made by adding some vegetal ash to the flour, similar to how ramen is made. However, it is very similar to udon.          In Korea, authentic Japanese udon dishes are served in numerous Japanese restaurants, while the Korean-style udon noodle soups are served in  bunsik jip and  pojangmacha  . Both types are called udong , which is the transliteration of the Japanese word udon .  In Korea, the word udong refers to noodle dishes , while the noodles themselves are called udong-myeon  and considered a type of  garak-guksu  . Common ingredients for udong noodle soup include ": null
    },
    {
        "crowndaisy greens": "glebionis coronaria"
    },
    {
        " and  eomuk  , both of which are not very common in Japanese udon dishes.       There is also a dish called udon in ": null
    },
    {
        "Palau": "palau"
    },
    {
        ", because of the former Japanese administration. The broth is soy sauce–based like Japanese udon. However, as there were many immigrants from Okinawa, it uses less broth like Okinawa soba. Most notably, the noodle is that of ": null
    },
    {
        "spaghetti": "spaghetti"
    },
    {
        ", as it is easier to acquire there.          The ": null
    },
    {
        "Kagawa prefecture": "kagawa prefecture"
    },
    {
        " is famous all over Japan for its ": null
    },
    {
        "Sanuki udon": "sanuki udon"
    },
    {
        " . It is promoted to other regions of Japan through means such as original characters and souvenirs related to udon and movies in which udon is a main theme. ": null
    }
]