[
    {
        "     Ulm  is a ": null
    },
    {
        "city": "list of cities and towns in germany"
    },
    {
        " in the federal German state of ": null
    },
    {
        "Baden-Württemberg": "baden-württemberg"
    },
    {
        ", situated on the ": null
    },
    {
        "River Danube": "river danube"
    },
    {
        ". The city, whose population is estimated at almost 42 , forms an urban district of its own  and is the administrative seat of the ": null
    },
    {
        "Alb-Donau district": "alb-donau"
    },
    {
        ". Founded around 42 Ulm is rich in history and traditions as a former ": null
    },
    {
        "free imperial city": "free imperial city"
    },
    {
        " . Today, it is an economic centre due to its varied industries, and it is the seat of the ": null
    },
    {
        "University of Ulm": "university of ulm"
    },
    {
        ". Internationally, Ulm is primarily known for having the church with the tallest steeple in the world , the Gothic minster , and as the birthplace of ": null
    },
    {
        "Albert Einstein": "albert einstein"
    },
    {
        ".          Ulm lies at the point where the rivers ": null
    },
    {
        "Blau": "blau"
    },
    {
        " and ": null
    },
    {
        "Iller": "iller"
    },
    {
        " join the ": null
    },
    {
        "Danube": "danube"
    },
    {
        ", at an altitude of  ": null
    },
    {
        "above sea level": "above mean sea level"
    },
    {
        ". Most parts of the city, including the old town, are situated on the left bank of the Danube; only the districts of Wiblingen, Gögglingen, Donaustetten and Unterweiler lie on the right bank. Across from the old town, on the other side of the river, lies the ": null
    },
    {
        "twin city": "twin cities"
    },
    {
        " of ": null
    },
    {
        "Neu-Ulm": "neu-ulm"
    },
    {
        " in the state of ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ", smaller than Ulm and, until 42 a part of it .     Except for the Danube in the south, the city is surrounded by forests and hills which rise to altitudes of over , some of them part of the ": null
    },
    {
        "Swabian Alb": "swabian alb"
    },
    {
        ". South of the Danube, plains and hills finally end in the northern edge of the ": null
    },
    {
        "Alps": "alps"
    },
    {
        ", which are approximately  from Ulm and are visible from the city on clear days.     The city of Ulm is situated in the northern part of the North Alpine ": null
    },
    {
        "Foreland basin": "foreland basin"
    },
    {
        ", where the basin reaches the ": null
    },
    {
        "Swabian Alb": "swabian alb"
    },
    {
        ". The ": null
    },
    {
        "Turritellenplatte": "turritellenplatte"
    },
    {
        " of Ermingen is a famous palaeontological site of ": null
    },
    {
        "Burdigalian": "burdigalian"
    },
    {
        " age.          On the right side of Danube and Iller there is the Bavarian district town ": null
    },
    {
        "Neu-Ulm": "neu-ulm"
    },
    {
        ". On the left side Ulm is almost completely surrounded by the Alb-Danube district. The neighboring communes of Baden-Württemberg are the following: ": null
    },
    {
        "Illerkirchberg": "illerkirchberg"
    },
    {
        ", ": null
    },
    {
        "Staig": "staig"
    },
    {
        ", ": null
    },
    {
        "Hüttisheim": "hüttisheim"
    },
    {
        ", ": null
    },
    {
        "Erbach ": "erbach an der donau"
    },
    {
        ", ": null
    },
    {
        "Blaubeuren": "blaubeuren"
    },
    {
        ", ": null
    },
    {
        "Blaustein": "blaustein"
    },
    {
        ", ": null
    },
    {
        "Dornstadt": "dornstadt"
    },
    {
        ", ": null
    },
    {
        "Beimerstetten": "beimerstetten"
    },
    {
        " and ": null
    },
    {
        "Langenau": "langenau"
    },
    {
        " as well as the eastern neighboring community ": null
    },
    {
        "Elchingen": "elchingen"
    },
    {
        ".       The  city  is  divided into 42 districts : Ulm-Mitte, Böfingen, Donaustetten, Donautal, Eggingen, Einsingen, Ermingen, Eselsberg, Gögglingen, Grimmelfingen, Jungingen, Lehr, Mähringen, Oststadt, Söflingen , Unterweiler, Weststadt, and Wiblingen.     Nine districts that were integrated during the latest municipality reform in the 42s . They have own local councils which acquire an important consulting position to the whole city council concerning issues that are related to the prevailing districts. But at the end, final decisions can only be made by the city council of the entire city of Ulm.             The oldest traceable settlement of the Ulm area began in the early ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " period, around 42 BC. Settlements of this time have been identified at the villages of Eggingen and Lehr, today districts of the city. In the city area of Ulm proper, the oldest find dates from the late Neolithic period. The earliest written mention of Ulm is dated 42 July 42 AD, when King ": null
    },
    {
        "Louis the German": "louis the german"
    },
    {
        " signed a document in the Kings palace of Hulma in the ": null
    },
    {
        "Duchy of Swabia": "duchy of swabia"
    },
    {
        ".  The city was declared an ": null
    },
    {
        "Imperial City": "imperial free city"
    },
    {
        "  by ": null
    },
    {
        "Friedrich Barbarossa": "frederick i, holy roman emperor"
    },
    {
        " in 42     At  first,  Ulms significance was due to the privilege of a Königspfalz, a place of accommodation for the medieval German kings and emperors on their frequent travels. Later, Ulm became a city of traders and craftsmen. One of the most important legal documents of the city, an agreement between the Ulm patricians and the trade guilds , dates from 42 This document, considered an early city constitution, and the beginning of the construction of an enormous church , financed by the inhabitants of Ulm themselves rather than by the church, demonstrate the assertiveness of Ulms medieval citizens. Ulm blossomed during the 42th and 42th centuries, mostly due to the export of high-quality ": null
    },
    {
        "textiles": "textiles"
    },
    {
        ". The city was situated at the crossroads of important trade routes extending to Italy. These centuries, during which many important buildings were erected, also represented the zenith of art in Ulm, especially for ": null
    },
    {
        "painter": "painting"
    },
    {
        "s and ": null
    },
    {
        "sculptors": "sculpture"
    },
    {
        " like ": null
    },
    {
        "Hans Multscher": "hans multscher"
    },
    {
        " and ": null
    },
    {
        "Jörg Syrlin the Elder": "jörg syrlin the elder"
    },
    {
        ". During the ": null
    },
    {
        "Reformation": "protestant reformation"
    },
    {
        ", Ulm became Protestant . With the establishment of new trade routes following the discovery of the ": null
    },
    {
        "New World": "new world"
    },
    {
        " and the outbreak and consequences of the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        " , the city began to decline gradually. During the ": null
    },
    {
        "War of the Spanish Succession": "war of the spanish succession"
    },
    {
        " , it was alternately invaded several times by ": null
    },
    {
        "French": "france"
    },
    {
        " and ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        "n soldiers.        In the wars following the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ", the city was alternately occupied by French and ": null
    },
    {
        "Austria": "austria"
    },
    {
        "n forces, with the former ones destroying the city fortifications. In 42 it lost the status of Imperial City and was absorbed into ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ". During the campaign of 42 ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " managed to trap the invading Austrian army of ": null
    },
    {
        "General Mack": "karl freiherr mack von leiberich"
    },
    {
        " and forced it to surrender in the ": null
    },
    {
        "Battle of Ulm": "battle of ulm"
    },
    {
        ". In 42 Ulm was incorporated into the ": null
    },
    {
        "Kingdom of Württemberg": "kingdom of württemberg"
    },
    {
        " and lost its districts on the other bank of the Danube, which came to be known as ": null
    },
    {
        "Neu-Ulm": "neu-ulm"
    },
    {
        " .     In the mid42th century, the city was ": null
    },
    {
        "designated a fortress": "fortresses of the german confederation"
    },
    {
        " of the ": null
    },
    {
        "German Confederation": "german confederation"
    },
    {
        " with huge military construction works directed primarily against the threat of a French invasion. The city became an important centre of ": null
    },
    {
        "industrialisation": "industrialisation"
    },
    {
        " in southern Germany in the second half of the 42th century, its built-up area now being extended beyond the medieval walls. The construction of the huge minster, which had been interrupted in the 42th century for economic reasons, was resumed and eventually finished in a wave of German national enthusiasm for the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ".     From 42 to 42 a ": null
    },
    {
        "concentration camp": "concentration camp"
    },
    {
        " primarily for political opponents of the regime was established on the Kuhberg, one of the hills surrounding Ulm. The ": null
    },
    {
        "Jews": "jews"
    },
    {
        " of Ulm, around 42 people, were first discriminated against and later persecuted; their ": null
    },
    {
        "synagogue": "synagogue"
    },
    {
        " was torn down after ": null
    },
    {
        "Kristallnacht": "kristallnacht"
    },
    {
        " in November 42 The sole RAF ": null
    },
    {
        "strategic bombing during World War II": "strategic bombing during world war ii"
    },
    {
        " against Ulm occurred on December 42 42 against the two large ": null
    },
    {
        "lorry factories": "transportation plan"
    },
    {
        " of ": null
    },
    {
        "Magirus": "meillerwagen"
    },
    {
        "-Deutz and ": null
    },
    {
        "Kässbohrer": "karl kässbohrer fahrzeugwerke"
    },
    {
        ", as well as other industries, barracks, and depots in Ulm. The Gallwitz Barracks and several military hospitals were among 42 Wehrmacht establishments destroyed.  The raid killed 42 Ulm inhabitants and left 42 homeless and after all the bombings, over 42% of the medieval city centre lay in ruins.     Most of the city was rebuilt in the plain and simple style of the 42s and 42s, but some of the historic landmark buildings have been restored. Due to its almost complete destruction in 42 the Hirschstraße part of the city primarily consists of modern architecture. Ulm experienced substantial growth in the decades following World War II, with the establishment of large new housing projects and new industrial zones. In 42 ": null
    },
    {
        "Ulm University": "ulm university"
    },
    {
        " was founded, which proved to be of great importance for the development of the city. Particularly since the 42s, the transition from classical industry towards the high-tech sector has accelerated, with, for example, the establishment of research centres of companies like ": null
    },
    {
        "Daimler": "daimler ag"
    },
    {
        ", ": null
    },
    {
        "Siemens": "siemens ag"
    },
    {
        " and ": null
    },
    {
        "Nokia": "nokia"
    },
    {
        " and a number of small applied research institutes near the university campus. The city today is still growing, forming a ": null
    },
    {
        "twin city": "twin cities"
    },
    {
        " of 42 inhabitants together with its neighbouring Bavarian city of ": null
    },
    {
        "Neu-Ulm": "neu-ulm"
    },
    {
        ", and seems to benefit from its central position between the cities of ": null
    },
    {
        "Stuttgart": "stuttgart"
    },
    {
        " and ": null
    },
    {
        "Munich": "munich"
    },
    {
        " and thus between the cultural and economic hubs of southern Germany.                             The city has very old trading traditions dating from medieval times and a long history of industrialisation, beginning with the establishment of a ": null
    },
    {
        "railway station": "railway station"
    },
    {
        " in 42 The most important sector is still classical industry . The establishment of the ": null
    },
    {
        "University of Ulm": "university of ulm"
    },
    {
        " in 42 which focuses on ": null
    },
    {
        "biomedicine": "biomedicine"
    },
    {
        ", the sciences, and engineering, helped support a transition to high-tech industry, especially after the crisis of classical industries in the 42s.      Companies with headquarters in Ulm include:   ": null
    },
    {
        "Britax": "britax"
    },
    {
        "      Gardena AG": "gardena ag"
    },
    {
        "      Iveco Magirus AG": "magirus"
    },
    {
        " J. G. Anschütz": "j. g. anschütz"
    },
    {
        "   Liqui Moly": "liqui moly"
    },
    {
        "   Müller Ltd. & Co. KG": "müller"
    },
    {
        "   Ratiopharm": "ratiopharm"
    },
    {
        "    Walther Arms": "walther arms"
    },
    {
        "      Zwick Roell Group": "zwick roell group"
    },
    {
        " www.zwick.de   Seeberger     Companies with important sites in Ulm include:   ": null
    },
    {
        "AEG": "aeg"
    },
    {
        " Atmel": "atmel"
    },
    {
        "    Continental AG": "continental ag"
    },
    {
        " Daimler": "daimler ag"
    },
    {
        ": Daimler Forschungszentrum and Daimler TSS   ": null
    },
    {
        "Deutsche Telekom AG": "deutsche telekom ag"
    },
    {
        " EADS": "eads"
    },
    {
        ", European Aeronautic Defence and Space Company   ": null
    },
    {
        "Nokia Networks": "nokia networks"
    },
    {
        "    Nuance Communications": "nuance communications"
    },
    {
        " Speech Recognition   ": null
    },
    {
        "Siemens AG": "siemens ag"
    },
    {
        " Harman International Industries": "harman international industries"
    },
    {
        "       In 42 the City of Ulm was awarded the European Energy Award for its remarkable local energy management and its efforts to combat climate change.  Examples of these efforts are a ": null
    },
    {
        "biomass": "biomass"
    },
    {
        " power plant operated by the Fernwärme Ulm GmbH , and the worlds biggest ": null
    },
    {
        "passive house": "passive house"
    },
    {
        " office building, the so-called Energon, located in the Science City near the university campus. Moreover, the city of Ulm boasts the second largest ": null
    },
    {
        "solar power": "solar power"
    },
    {
        " production in Germany.  For all new buildings, a strict energy standard has been mandatory since April 42 Ulm Minster has been fully powered by renewables since January 42 , Stadtwerke Ulm, visited 42 Mai 42 Until the end of 42 as a European pilot project a self-sustaining ": null
    },
    {
        "data-centre": "data-centre"
    },
    {
        " will be constructed in the west-city of Ulm.  There is a solar-powered ferry that crosses the Danube 42 days a week in summer.  The Bündnis 42% Erneuerbare Energien was founded in February 42 with the aim of bringing together the people and organisations seeking to promote the transition to ": null
    },
    {
        "42% renewable energy": "100% renewable energy"
    },
    {
        " in Ulm and Neu-Ulm by 42           Ulm is situated at the crossroads of the ": null
    },
    {
        "A42 motorway": "bundesautobahn 8"
    },
    {
        " , and the ": null
    },
    {
        "A42 motorway": "bundesautobahn 7"
    },
    {
        " .     ": null
    },
    {
        "The citys railway station": "ulm hauptbahnhof"
    },
    {
        " is served, among other lines, by one of the European train routes . Direct connections to ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        " are also available.     Ulms public transport system is based on several bus lines and two tram lines. Several streets in the old town are for the use of pedestrians and cyclists only. Ulm was the first area to be served by the ": null
    },
    {
        "Daimler AG": "daimler ag"
    },
    {
        "s ": null
    },
    {
        "Car42Go": "car2go"
    },
    {
        " carsharing": "carsharing"
    },
    {
        " service in 42 However, the service in Ulm was discontinued at the end of 42          The ": null
    },
    {
        "University of Ulm": "university of ulm"
    },
    {
        " was founded in 42 and focuses on the sciences, medicine, engineering, and mathematics / economics. With about 42 students, it is one of the smaller universities in Germany.      Ulm is also the seat of the citys ": null
    },
    {
        "University of Applied Sciences": "fachhochschule"
    },
    {
        " , founded in 42 as a public school of engineering. The school also houses numerous students from around the world as part of an international study abroad programme.     In 42 ": null
    },
    {
        "Inge Aicher-Scholl": "inge scholl"
    },
    {
        ", ": null
    },
    {
        "Otl Aicher": "otl aicher"
    },
    {
        " and ": null
    },
    {
        "Max Bill": "max bill"
    },
    {
        " founded the ": null
    },
    {
        "Ulm School of Design": "ulm school of design"
    },
    {
        " , a design school in the tradition of the ": null
    },
    {
        "Bauhaus": "bauhaus"
    },
    {
        ", which was, however, closed in 42      Ulms public library features over 42 print media. The city has a public theatre with drama, opera and ballet,  several small theatres,  and a professional philharmonic orchestra.         ": null
    },
    {
        "SSV Ulm 42": "ssv ulm 1846"
    },
    {
        ", multi-sports club, former football Bundesliga club, now Regionalliga Süd   ": null
    },
    {
        "Ratiopharm Ulm": "ratiopharm ulm"
    },
    {
        ", basketball club, ": null
    },
    {
        "Basketball Bundesliga": "basketball bundesliga"
    },
    {
        "                          Ulm Minster": "ulm minster"
    },
    {
        " with the worlds highest church ": null
    },
    {
        "steeple": "steeple"
    },
    {
        " . Choir stalls by Jörg Syrlin the Elder , famous sculpture  Schmerzensmann  by Hans Multscher .   The old Fischerviertel on the ": null
    },
    {
        "River Blau": "blau"
    },
    {
        ", with ": null
    },
    {
        "half-timbered houses": "timber framing"
    },
    {
        ", cobblestone streets, and picturesque footbridges. Interesting sights here are the  , a 42th-century house today used as a hotel, and the Alte Münz , a mediaeval building extended in the 42th and 42th centuries in ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " style.   The remaining section of the city walls, along the river, with the 42th-century Metzgerturm .   The  Rathaus  , built in 42 featuring some brilliantly coloured murals dating from the mid42th century. On the gable is an astronomical clock dating from 42 Restored after serious damage in 42 Photos of the Rathaus can be seen at ": null
    },
    {
        "Tripadvisor.com": "tripadvisor.com"
    },
    {
        "    The Krone inn, a medieval complex of several houses , where German kings and emperors were accommodated during their travels.   Several large buildings from the late Middle Ages / renaissance used for various purposes , e.g. Schwörhaus, Kornhaus, Salzstadel, Büchsenstadel, Zeughaus, Neuer Bau.   Ulm Federal Fortifications are the largest preserved fortifications and were built from 42 to 42 to protect from attacks by France.   The historic district Auf dem Kreuz, a residential area with many buildings from before 42    Wiblingen Abbey , a former benedictine abbey in the suburb of Wiblingen in the south of Ulm. The church shows characteristics of late ": null
    },
    {
        "baroque": "baroque"
    },
    {
        " and early ": null
    },
    {
        "classicism": "classicism"
    },
    {
        ". Its library is a masterpiece of ": null
    },
    {
        "rococo": "rococo"
    },
    {
        ".        Building of the ": null
    },
    {
        "Ulm School of Design": "ulm school of design"
    },
    {
        ", , an important school of design in the succession of the ": null
    },
    {
        "Bauhaus": "bauhaus"
    },
    {
        ".   Stadthaus, a house for public events built by ": null
    },
    {
        "Richard Meier": "richard meier"
    },
    {
        ", directly adjacent to the minster.   Stadtbibliothek, the building of the ": null
    },
    {
        "public library": "public library"
    },
    {
        " of Ulm was erected by ": null
    },
    {
        "Gottfried Böhm": "gottfried böhm"
    },
    {
        " in the form of a glass pyramid and is situated directly adjacent to the town hall.    is the highlight in Ulms New Centre         The private Collection shows modern art from 42 in an extraordinary surrounding.    http://www.tourismus.ulm.de/tourismus/en/sehenswert/museen_und_co/ulmer_museum/ulmer_museum.php houses a significant collection of art and craftwork from the Middle Ages, the Löwenmensch figurine - a 42-year-old lion-headed figurine which is the oldest known human/animal shaped sculpture in the world - and various European and American art from the years after 42 The museum has alternating exhibitions.   offers a permanent exhibition about the history of grain, baking, milling and bread culture.   The exhibitions in the http://www.dzm-museum.de/english/dzm_en.html follow the varied history of the Danube Swabians emigrants.       Albert Einstein Memorial - A small memorial at the site of the house where Albert Einstein was born in Bahnhofstraße, between the present-day newspaper offices and the bank. The house itself and the whole district were destroyed in the firebombing of 42   Memorial to Hans and Sophie Scholl - A small memorial on the Münsterplatz in memory of these two members of the Weiße Rose , who spent their youth in Ulm. Their familys house near the memorial was destroyed in the firebombing of 42   The Memorial to Deserters - Located near the Universitys botanical garden, it commemorates those who deserted from the Wehrmacht during World War II. It was originally erected on September 42 42 and was moved to its current location in July 42 The Monument represents the idea: Desertion is not reprehensible, war is .       The Botanischer Garten der Universität Ulm , the universitys botanical garden   Silo tower of the mill company Schapfenmühle     Mediumwave transmission mast Ulm-Jungingen   FM and TV mast Ulm-Kuhberg   The Tiergarten Ulm, the zoo. It was opened in 42 closed in 42 and reopened in 42               Otl Aicher , graphic designer, co-founder of Ulm School of Design , , and creator of Rotis font   Ernst Bauer , resistance fighter and publisher   Max Bentele , mechanical engineer, jet-engine pioneer, and father of the Wankel rotary engine in the US   Albrecht Berblinger , , flight pioneer   Dieter Braun , , Motorcycle Grand Prix racer   Hermann Duckek , riding master and Olympic equestrian arena designer   Albert Einstein , , physicist, philosopher, Nobel Prize winner   Helmut Ensslin , Protestant parson and father of RAF-member Gudrun Ensslin   Anna Essinger , educator; co-founder and headmistress of Bunce Court School   Johann Faulhaber , , mathematician, inventor of Faulhabers formula .   Nikolaus Federmann , adventurer and conquistador in Venezuela and Colombia   Eugen Haile , composer   Fritz Hartnagel , officer and jurist, fiancé of Sophie Scholl   Hellmut Hattler , jazz and rock bass player   Max Hattler , artist filmmaker   Johann Christoph Heilbronner , mathematical historian   Leo Hepp , officer of the Wehrmacht and General of the Bundeswehr   Dieter Hoeneß , , former football player, former general manager of Hertha BSC and VfL Wolfsburg football club   Uli Hoeneß , , former football player, president of Bayern Munich football club   Annemarie Huste , , Chef to Jackie Kennedy, Executive Chef Gourmet Magazine, Author of 42 Cookbooks   Otto Kässbohrer , entrepreneur and constructor   Hildegard Knef , , actress, singer and writer   Mike Krüger , comedian   Hellmuth Laegeler , major general in the Wehrmacht   Hans Maler zu Schwaz , painter of the 42th century   Erwin Piscator , theatre director and innovator   Sam Rosen , American sportscaster   Claudia Roth , , politician, chairman of the German Green Party   Wilhelm Schuler , chemist, inventor and entrepreneur in the second half of the 42th century.         Max Bill , architect and artist, co-founder and director of the Ulm School of Design   Robert Bosch , industrialist, engineer and inventor, founder of Robert Bosch GmbH   , stonemason and master builder, involved in the construction of Ulm Minster   In 42 philosopher Rene Descartes experienced a powerful vision near Ulm.   Ulrich Ensingen , master builder, involved in the construction of the Ulm Minster and Strasbourg Minster   Hermann Fressant , 42th-century author   Leonhard Hutter   Herbert von Karajan , conductor, Kapellmeister in Ulm   Johannes Kepler , a German mathematician, astronomer, astrologer and a key figure in the 42th century scientific revolution, lived for a while in Ulm   Hans Multscher , 42th-century sculptor   Erwin Rommel   Hans Scholl and Sophie Scholl , founders of the White Rose , spent their youth in Ulm   Carl Teike , who composed the military march ": null
    },
    {
        "Alte Kameraden": "alte kameraden"
    }
]