[
    {
        "In ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", a unique factorization domain   is a ": null
    },
    {
        "ring": "ring"
    },
    {
        " in which a statement analogous to the ": null
    },
    {
        "fundamental theorem of arithmetic": "fundamental theorem of arithmetic"
    },
    {
        " holds. Specifically, a UFD is an ": null
    },
    {
        "integral domain": "integral domain"
    },
    {
        "  in which every non-zero non-": null
    },
    {
        "unit": "unit"
    },
    {
        " element can be written as a product of ": null
    },
    {
        "prime element": "prime element"
    },
    {
        "s , uniquely up to order and units.     Important examples of UFDs are the integers and ": null
    },
    {
        "polynomial rings": "polynomial ring"
    },
    {
        " in one or more variables with coefficients coming from the integers or from a ": null
    },
    {
        "field": "field"
    },
    {
        ".     Unique factorization domains appear in the following chain of ": null
    },
    {
        "class inclusions": "subclass"
    },
    {
        ":             Formally, a unique factorization domain is defined to be an ": null
    },
    {
        "integral domain": "integral domain"
    },
    {
        " R in which every non-zero element x of R can be written as a product  of ": null
    },
    {
        "irreducible element": "irreducible element"
    },
    {
        "s p i of R and a ": null
    },
    {
        "unit": "unit"
    },
    {
        " u:     :x u p 42 p 42 ⋅⋅⋅ p n with n & ge; 42     and this representation is unique in the following sense:   If q 42 , ..., q m are irreducible elements of R and w is a unit such that     :x w q 42 q 42 ⋅⋅⋅ q m with m & ge; 42     then m n, and there exists a ": null
    },
    {
        "bijective map": "bijective"
    },
    {
        "  & phi; :  →  such that p i is ": null
    },
    {
        "associated": "associated element"
    },
    {
        " to q  & phi; for i & isin; .     The uniqueness part is usually hard to verify, which is why the following equivalent definition is useful:   :A unique factorization domain is an integral domain R in which every non-zero element can be written as a product of a unit and ": null
    },
    {
        "prime element": "prime element"
    },
    {
        "s of R.         Most rings familiar from elementary mathematics are UFDs:     All ": null
    },
    {
        "principal ideal domain": "principal ideal domain"
    },
    {
        "s, hence all ": null
    },
    {
        "Euclidean domain": "euclidean domain"
    },
    {
        "s, are UFDs. In particular, the ": null
    },
    {
        "integers": "integers"
    },
    {
        " , the ": null
    },
    {
        "Gaussian integer": "gaussian integer"
    },
    {
        "s and the ": null
    },
    {
        "Eisenstein integer": "eisenstein integer"
    },
    {
        "s are UFDs.   If R is a UFD, then so is RX, the ": null
    },
    {
        "ring of polynomials": "polynomial ring"
    },
    {
        " with coefficients in R. Unless R is a field, RX is not a principal ideal domain. By induction, a polynomial ring in any number of variables over any UFD is a UFD.   The ": null
    },
    {
        "formal power series": "formal power series"
    },
    {
        " ring K X 42 ,...,X n over a field K is a UFD. On the other hand, the formal power series ring over a UFD need not be a UFD, even if the UFD is local. For example, if R is the localization of kx,y,z/ at the ": null
    },
    {
        "prime ideal": "prime ideal"
    },
    {
        "  then R is a local ring that is a UFD, but the formal power series ring R X over R is not a UFD.   The ": null
    },
    {
        "Auslander–Buchsbaum theorem": "auslander–buchsbaum theorem"
    },
    {
        " states that every ": null
    },
    {
        "regular local ring": "regular local ring"
    },
    {
        " is a UFD.   \\mathbb is a UFD for all integers 42 ≤ n ≤ 42 but not for n 42     Mori showed that if the completion of a ": null
    },
    {
        "Zariski ring": "zariski ring"
    },
    {
        ", such as a ": null
    },
    {
        "Noetherian local ring": "noetherian ring"
    },
    {
        ", is a UFD, then the ring is a UFD. Bourbaki, 42, no 42 Proposition 42 The converse of this is not true: there are Noetherian local rings that are UFDs but whose completions are not. The question of when this happens is rather subtle: for example, for the ": null
    },
    {
        "localization": "localization of a ring"
    },
    {
        " of kx,y,z/ at the prime ideal , both the local ring and its completion are UFDs, but in the apparently similar example of the localization of kx,y,z/ at the prime ideal  the local ring is a UFD but its completion is not.   Let R be any field of characteristic not 42 Klein and Nagata showed that the ring RX 42 ,...,X n /Q is a UFD whenever Q is a nonsingular quadratic form in the Xs and n is at least 42 When n42 the ring need not be a UFD. For example, R is not a UFD, because the element XY equals the element ZW so that XY and ZW are two different factorizations of the same element into irreducibles.   The ring Q is a UFD, but the ring Q is not. On the other hand, The ring Q is not a UFD, but the ring Q is . Similarly the coordinate ring R of the 42-dimensional real sphere is a UFD, but the coordinate ring CX,Y,Z/ of the complex sphere is not.   Suppose that the variables X i are given weights w i , and F is a homogeneous polynomial of weight w. Then if c is coprime to w and R is a UFD and either every finitely generated projective module over R is free or c is 42 mod w, the ring RX 42 ,...,X n ,Z/ is a UFD .       The quadratic integer ring \\mathbb Z of all complex numbers of the form a+b\\sqrt , where a and b": null
    }
]