[
    {
        "            United States naval reactors are ": null
    },
    {
        "nuclear reactor": "nuclear reactor"
    },
    {
        "s used by the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " aboard certain ships to generate the ": null
    },
    {
        "steam": "steam"
    },
    {
        " used to produce ": null
    },
    {
        "power": "power"
    },
    {
        " for ": null
    },
    {
        "propulsion": "marine nuclear propulsion"
    },
    {
        ", ": null
    },
    {
        "electric power": "electric power"
    },
    {
        ", catapulting airplanes in ": null
    },
    {
        "aircraft carrier": "aircraft carrier"
    },
    {
        "s, and a few more minor uses. Such naval nuclear reactors have a complete ": null
    },
    {
        "power plant": "power plant"
    },
    {
        " associated with them. All U.S. Navy ": null
    },
    {
        "submarine": "submarine"
    },
    {
        "s and ": null
    },
    {
        "supercarrier": "supercarrier"
    },
    {
        "s built since 42 are ": null
    },
    {
        "nuclear-powered": "nuclear power"
    },
    {
        " by such reactors. There are no commissioned conventional submarines or aircraft carriers left in the U.S. Navy, since the last conventional carrier, , was decommissioned in May 42 The U.S. Navy had nine nuclear-powered ": null
    },
    {
        "cruiser": "cruiser"
    },
    {
        "s with such reactors also, but they have since been decommissioned. Reactors are designed by a variety of contractors, then developed and tested at one of several government -owned and prime contractor-operated facilities. These facilities include ": null
    },
    {
        "Bettis Atomic Power Laboratory": "bettis atomic power laboratory"
    },
    {
        " in ": null
    },
    {
        "West Mifflin, Pennsylvania": "west mifflin, pennsylvania"
    },
    {
        " and its associated ": null
    },
    {
        "Naval Reactors Facility": "naval reactors facility"
    },
    {
        " in ": null
    },
    {
        "Idaho": "idaho"
    },
    {
        ", and ": null
    },
    {
        "Knolls Atomic Power Laboratory": "knolls atomic power laboratory"
    },
    {
        " in ": null
    },
    {
        "Niskayuna, New York": "niskayuna, new york"
    },
    {
        " and its associated Kesselring site in ": null
    },
    {
        "West Milton, New York": "west milton, new york"
    },
    {
        ", all under the management of the office of ": null
    },
    {
        "Naval Reactors": "naval reactors"
    },
    {
        ". Sometimes there were full-scale nuclear-powered ": null
    },
    {
        "prototype": "prototype"
    },
    {
        " plants built at the Naval Reactors Facility, Kesselring, and Windsor  to test the nuclear plants, which were operated for years to train nuclear-qualified sailors.       Each reactor design is given a three-character designation consisting of:   A letter for the type of ship the reactor is intended for    A consecutive generation number   A letter for the reactors designer      For example, a ": null
    },
    {
        "S42G reactor": "s9g reactor"
    },
    {
        " represents a submarine , ninth-generation , General Electric designed reactor .       Conceptual analysis of nuclear marine propulsion started in the 42s. Research on developing nuclear reactors for the Navy was done at ": null
    },
    {
        "Bettis Atomic Power Laboratory": "bettis atomic power laboratory"
    },
    {
        " in ": null
    },
    {
        "West Mifflin, Pennsylvania": "west mifflin, pennsylvania"
    },
    {
        " starting in 42 Under the long-term leadership of Admiral ": null
    },
    {
        "Hyman G. Rickover": "hyman g. rickover"
    },
    {
        ", the first test reactor plant, a ": null
    },
    {
        "prototype": "prototype"
    },
    {
        " referred to as ": null
    },
    {
        "S42W": "s1w reactor"
    },
    {
        ", started up in U.S. in 42 at the ": null
    },
    {
        "Naval Reactors Facility": "naval reactors facility"
    },
    {
        " in ": null
    },
    {
        "Idaho": "idaho"
    },
    {
        ". Bettis Laboratory and Naval Reactors Facility were operated initially and for many decades afterwards by ": null
    },
    {
        "Westinghouse": "westinghouse electric corporation"
    },
    {
        ". The first nuclear-powered vessel, the ": null
    },
    {
        "submarine": "submarine"
    },
    {
        " , put to sea in 42 USS Nautilus marked the beginning of the transition of submarines from relatively slow and short-ranged ": null
    },
    {
        "conventional submarine": "conventional submarine"
    },
    {
        "s to ones capable of sustaining  submerged for weeks on end.     Much of the early development work on naval reactors was done at the Naval Reactors Facility on the campus of the ": null
    },
    {
        "Idaho National Laboratory": "idaho national laboratory"
    },
    {
        " . USS Nautilus was powered by the ": null
    },
    {
        "S42W reactor": "s2w reactor"
    },
    {
        ", and crew were trained on the land-based ": null
    },
    {
        "S42W reactor": "s1w reactor"
    },
    {
        " at INL.     The second nuclear submarine was , which was initially powered by a ": null
    },
    {
        "sodium-cooled": "liquid metal fast reactor"
    },
    {
        " S42G reactor": "s2g reactor"
    },
    {
        ", and supported by the land-based ": null
    },
    {
        "S42G reactor": "s1g reactor"
    },
    {
        " at the Kesselring site under ": null
    },
    {
        "Knolls Atomic Power Laboratory": "knolls atomic power laboratory"
    },
    {
        " operated by ": null
    },
    {
        "General Electric": "general electric"
    },
    {
        ". A spare S42G was also built but never used.     USS Seawolf was plagued by superheater problems, with the result that USS Nautilus delivered far superior performance. This and the risks posed by liquid sodium in the event of an accident at sea led Admiral Rickover to select the ": null
    },
    {
        "pressurized water reactor": "pressurized water reactor"
    },
    {
        " as the standard U.S. naval reactor type. The S42G was removed from USS Seawolf and replaced by the ": null
    },
    {
        "S42Wa reactor": "s2wa reactor"
    },
    {
        ", using components from the spare S42W that was part of the USS Nautilus program. All subsequent U.S. naval reactors have been PWRs, while the ": null
    },
    {
        "Soviet Navy": "soviet navy"
    },
    {
        " used mainly PWRs, but also used lead-bismuth cooled ": null
    },
    {
        "liquid metal cooled reactor": "liquid metal cooled reactor"
    },
    {
        "s of three types in eight submarines:  and the seven-member .     Experience with USS Nautilus led to the parallel development of further  submarines, powered by single reactors, and an ": null
    },
    {
        "aircraft carrier": "aircraft carrier"
    },
    {
        ", , powered by eight ": null
    },
    {
        "A42W": "a2w"
    },
    {
        " reactor units in 42 A cruiser, , followed in 42 and was powered by two ": null
    },
    {
        "C42W": "c1w"
    },
    {
        " reactor units. USS Enterprise remained in service for over 42 years, and was inactivated in 42     Full-scale land-based prototype plants in Idaho, New York, and Connecticut preceded development of several types of U.S. naval nuclear reactors, although not all of them. After initial construction, some engineering testing was done and the prototypes were used to train nuclear-qualified sailors for many years afterwards. For example, the ": null
    },
    {
        "A42W": "a1w"
    },
    {
        " prototype at Naval Reactors Facility led to development of ": null
    },
    {
        "A42W": "a2w"
    },
    {
        " reactors used in USS Enterprise. By 42 the US Navy had 42 nuclear submarines operational and 42 under construction. Nuclear power had revolutionized the U.S. Navy.     The technology was shared with the United Kingdom, while technological development in France, China and the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " proceeded separately.     After the Skate-class vessels, reactor development proceeded and in the U.S. a single series of standardized designs was built by both ": null
    },
    {
        "Westinghouse": "westinghouse electric corporation"
    },
    {
        " and General Electric, with one reactor powering each vessel. ": null
    },
    {
        "Rolls Royce": "rolls-royce plc"
    },
    {
        " built similar units for ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " submarines and then developed the design further to the PWR42 Numerous submarines with an ": null
    },
    {
        "S42W": "s5w"
    },
    {
        " reactor plant were built.     At the end of the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " in 42 there were over 42 nuclear-powered submarines operational or being built. Some 42 of these submarines have now been scrapped and some on order canceled, due to weapons reduction programs. The ": null
    },
    {
        "Russian Navy": "russian navy"
    },
    {
        " and United States Navy had over one hundred each, with the United Kingdom and France less than twenty each and China six. The total today is about 42     The United States is the main navy with nuclear-powered aircraft carriers , while Russia has nuclear-powered cruisers. Russia has eight ": null
    },
    {
        "nuclear icebreakers": "nuclear-powered icebreaker"
    },
    {
        " in service or building. Since its inception in 42 the U.S. Navy nuclear program has developed 42 different plant designs, installed them in 42 nuclear-powered ships, taken 42 reactor cores into operation, and accumulated over 42 reactor years of operation and 42,42 miles safely steamed. Additionally, 42 nuclear submarines and six nuclear cruisers have been recycled. The U.S. Navy has never experienced a reactor accident.       Note that all nine of the U.S. Navy nuclear-powered cruisers have now been stricken from the ": null
    },
    {
        "Naval Vessel Register": "naval vessel register"
    },
    {
        ", and those not already scrapped by recycling are scheduled to be recycled. While reactor accidents have not sunk any U.S. Navy ships or submarines, two nuclear-powered submarines,  and  were lost at sea. The condition of these reactors has not been publicly released, although both wrecks have been investigated by ": null
    },
    {
        "Robert Ballard": "robert ballard"
    },
    {
        " on behalf of the Navy using ": null
    },
    {
        "remotely operated vehicles": "remotely operated underwater vehicle"
    },
    {
        " .     Congress has mandated that the U.S. Navy consider nuclear power as an option on all large surface combatants  and ": null
    },
    {
        "amphibious assault ship": "amphibious assault ship"
    },
    {
        "s. If proven cost-effective in a ": null
    },
    {
        "life cycle cost": "whole-life cost"
    },
    {
        " analysis during the ": null
    },
    {
        "Analysis of Alternatives": "analysis of alternatives"
    },
    {
        " phase of preliminary ship design, new ship classes could proceed with nuclear propulsion.       Current U.S. naval reactors are all pressurized water reactors, which are identical to PWR commercial reactors producing electricity, except that:     They have a high power density in a small volume and run either on low-enriched uranium or on highly ": null
    },
    {
        "enriched uranium": "enriched uranium"
    },
    {
        " ref  /ref ": null
    }
]