[
    {
        "           The Universal House of Justice  is the nine-member supreme ruling body of the ": null
    },
    {
        "Baháí Faith": "baháí faith"
    },
    {
        ". It was envisioned by ": null
    },
    {
        "Baháulláh": "baháulláh"
    },
    {
        ", the founder of the Baháí Faith, as an institution that could legislate on issues not already addressed in the Baháí writings, providing flexibility for the Baháí Faith to adapt to changing conditions. It was first elected in 42 and subsequently every five years, by delegates consisting of the members of Baháí ": null
    },
    {
        "National Spiritual Assemblies": "spiritual assembly"
    },
    {
        " throughout the world.     The Universal House of Justice, as the head of the religion, has provided direction to the worldwide Baháí community primarily through a series of multi-year plans, as well as through annual messages delivered during the ": null
    },
    {
        "Ridván": "ridván"
    },
    {
        " festival. The messages have focused on increasing the number of ": null
    },
    {
        "Local Spiritual Assemblies": "spiritual assembly"
    },
    {
        ", translating Baháí literature, establishing Baháí Centres, completing ": null
    },
    {
        "Baháí Houses of Worship": "baháí house of worship"
    },
    {
        ", holding international conferences, and developing educational systems to enhance literacy, the role of women, spirituality for children and youth, family life, social and economic development, and communal worship. The Universal House of Justice has also played a role in responding to systemic persecution of Baháís in Iran by garnering worldwide media attention.     The books and documents published by the Universal House of Justice are considered authoritative and its legislative decisions are considered infallible by Baháís. While empowered to legislate on matters that are not explicitly stated in the Bahai holy writings, the Universal House of Justice has, since its inception, limited its exercise of this function.     The ": null
    },
    {
        "Seat of the Universal House of Justice": "baháí world centre buildingsseat of the universal house of justice"
    },
    {
        " and its members reside in ": null
    },
    {
        "Haifa, Israel": "haifa"
    },
    {
        ", on the slope of ": null
    },
    {
        "Mount Carmel": "mount carmel"
    },
    {
        ". The most recent election was 42 April 42 Although all other elected and appointed roles in the Baháí Faith are open to men and women, membership on the Universal House of Justice is male-only, providing an exception to the basic Baháí principle of the ": null
    },
    {
        "equality of men and women": "baháí faith and gender equality"
    },
    {
        ". The Baháí writings do not give a reason for this exception, but that the reason will become clear with time.       Baháulláh, the founder of the Baháí Faith, in his book the  Kitáb-i-Aqdas  first ordains the institution of the House of Justice and defines its functions. The institutions responsibilities are also expanded on and referred to in several other of Baháulláhs writings including in his  Tablets of Baháulláh . In those writings Baháulláh writes that the Universal House of Justice would assume authority over the religion, and would consider matters that had not been covered by himself; he stated that the members of the institution would be assured of divine inspiration, and have the regard for all peoples and safe-guard their honour.     Later, ": null
    },
    {
        "Abdul-Bahá": "abdul-bahá"
    },
    {
        ", Baháulláhs son and successor, in his ": null
    },
    {
        "Will and Testament": "will and testament of abdul-bahá"
    },
    {
        ", elaborated on its functioning, its composition and outlined the method for its election. He wrote that the Universal House of Justice would be under Baháulláhs protection, that it would be freed of error, and that obedience to it would be obligatory. Abdul-Bahá first used the term Universal House of Justice to distinguish the supreme body from those local Houses of Justice to be established in each community, and the secondary Houses of Justice . He also stated that the institutions decisions could be by majority vote, but that unanimous decisions were preferred, and that it would be elected by the members of the secondary Houses of Justice. He also confirmed Baháulláhs statements that its membership would be confined to men, and that the reason behind this decision would become apparent in the future.     While both Abdul-Bahá and ": null
    },
    {
        "Shoghi Effendi": "shoghi effendi"
    },
    {
        ", heads of the religion after Baháulláh, considered establishing the Universal House of Justice, they both declined to do so. Shoghi Effendis reason was due to his belief in the weakness of the existing Baháí institutions — there were a very limited number of national spiritual assemblies and local spiritual assemblies. Thus during his lifetime, Shoghi Effendi prepared for the election of the Universal House of Justice, by establishing a strong administrative structure at the local and national levels. In 42 when there were 42 National Spiritual Assemblies, ": null
    },
    {
        "Shoghi Effendi": "shoghi effendi"
    },
    {
        " appointed members to the ": null
    },
    {
        "International Baháí Council": "international baháí council"
    },
    {
        ", and described it as an embryonic international House of Justice. After Shoghi Effendis unexpected death in 42 the ": null
    },
    {
        "Hands of the Cause": "hands of the cause"
    },
    {
        " directed the affairs of the religion and announced that the election of the Universal House of Justice would occur in 42 at the end of the ": null
    },
    {
        "Ten Year Crusade": "ten year crusade"
    },
    {
        ", an international teaching plan instituted by Shoghi Effendi.     In 42 the International Baháí Council was changed to an elected body, with members of all National Spiritual Assemblies voting for its members. Then in April 42 the first Universal House of Justice was elected, six years after the passing of Shoghi Effendi, by 42 National Spiritual Assemblies. The date of the election coincided with the completion of the Ten Year Crusade and also with the first centenary anniversary of the ": null
    },
    {
        "public declaration": "ridván"
    },
    {
        " of Baháulláh in the ": null
    },
    {
        "Garden of Ridván": "garden of ridván, baghdad"
    },
    {
        " in April 42 Since then the Universal House of Justice has acted as the head of the religion -- individual members have no authority, only as an assembly do they have authority. In 42 it published its constitution.       The Universal House of Justice is elected through secret ballot and plurality vote in a three-stage election by adult Baháís throughout the world. The House of Justice is elected without nominations or campaigning and all adult male members of the Baháí Faith are eligible for election to the House. The body is elected every five years during a convention of the members of the various ": null
    },
    {
        "National or Regional Spiritual Assemblies": "national spiritual assembly"
    },
    {
        " across the world. Each member of the various NSAs, who were themselves elected by the Baháís of their country, votes for nine adult male Baháís. ": null
    },
    {
        "Absentee ballot": "absentee ballot"
    },
    {
        "s are mailed or carried by delegates. The nine people who have the most votes are elected onto the Universal House of Justice. Women are not eligible for election to the Universal House of Justice. Abdul-Bahá stated that the wisdom for this will become clear in the future, and that women and men are spiritually equal. For more on this issue see ": null
    },
    {
        "Baháí Faith and gender equality": "baháí faith and gender equality"
    },
    {
        ".     The most recent full election was on 42 April 42.          The Universal House of Justice today guides the growth and development of the global Baháí community. The general functions of the Universal House of Justice, as stated by Baháulláh, include to promulgate the cause of God, to preserve the law, to administer social affairs, to educate the peoples ": null
    },
    {
        "soul": "soul"
    },
    {
        "s, to guarantee the education of children, to make the entire world prosperous , and to care for the elderly and the ill who are in poverty. According to its constitution, the Universal House of Justice itself states that The provenance, the authority, the duties, the sphere of action of the Universal House of Justice all derive from the revealed Word of Baháulláh which, together with the interpretations and expositions of Abdul-Bahá and of Shoghi Effendi ... constitute the binding terms of reference of the Universal House of Justice and are its bedrock foundation.  Some of the powers and duties according to the constitution include: ": null
    },
    {
        "Baháí sacred texts": "baháí literature"
    },
    {
        " persecution": "persecution of baháís"
    },
    {
        " spiritual and administrative centre": "baháí world centre"
    },
    {
        " of the Baháí Faith   Encouraging the growth and maturation of the Baháí community and ": null
    },
    {
        "administration": "baháí administration"
    },
    {
        " Baháí law": "baháí laws"
    },
    {
        " Huqúqulláh": "huqúqulláh"
    },
    {
        " that are entrusted to its care     Furthermore, the Universal House of Justice is instructed by Baháulláh to exert a positive influence on the general welfare of humankind, to promote a permanent peace among the nations of the world, ensure the training of peoples, the up building of nations, the protection of man and the safeguarding of his honour . The Universal House of Justice is supported by the elected national and local governing bodies of the Baháí Faith, . It has, furthermore, created several appointed institutions to support its work around the world; among these are the ": null
    },
    {
        "Continental Board of Counsellors": "institution of the counsellors"
    },
    {
        " and the ": null
    },
    {
        "International Teaching Centre": "international teaching centre"
    },
    {
        ".            The Universal House of Justice is also given the responsibility of adapting the Baháí Faith as society progresses, and is thus given the power to legislate on matters not explicitly covered in the Baháí sacred texts. While the Universal House of Justice is authorized to change or repeal its own legislation as conditions change, it cannot dissolve or change any of the laws which are explicitly written in the sacred texts. Shoghi Effendi has written:        In the same book, Shoghi Effendi mentions that certain issues were left intentionally for the House of Justice to apply and legislate on as time progressed:            While being empowered to legislate on matters, the Universal House of Justice has, since its inception in 42 limited its exercise of this function. Instead, it has provided general guidance to Baháís around the world, and not specific laws; this guidance has generally been through the form of letters and messages, much like Shoghi Effendis communications. Many of these letters have been published in compilations and are regarded as divinely empowered and authoritative; its legislative decisions are considered infallible to Baháís. The letters cover a range of subjects including teaching, ": null
    },
    {
        "prayer": "prayer in the baháí faith"
    },
    {
        ", family life, education and Baháí administration. Each year on the first day of ": null
    },
    {
        "Ridván": "ridván"
    },
    {
        " , the Universal House of Justice addresses a message to the worldwide Bahá’í community, known as Ridván messages.      The institution has also collected and published extracts from the writings of the ": null
    },
    {
        "Báb": "báb"
    },
    {
        ", Baháulláh and Abdul-Bahá. In 42 they published the ": null
    },
    {
        "Kitáb-i-Aqdas": "kitáb-i-aqdas"
    },
    {
        ", Baháulláhs book of laws in ": null
    },
    {
        "English": "english language"
    },
    {
        ", and further translations have since been published. During these endeavours, they established departments of research and archives at the ": null
    },
    {
        "Baháí World Centre": "baháí world centre"
    },
    {
        ", and, as of 42 have collected over 42 letters of Baháulláh, Abdul-Bahá and Shoghi Effendi. These collected works have been used as a base in the deliberations of the Universal House of Justice. ": null
    },
    {
        "The Promise of World Peace": "the promise of world peace"
    },
    {
        "   :Statement addressed To the Peoples of the World , presented to over 42 heads of state and government. It outlines the major prerequisites for, as well as the obstacles working against, the establishment of world peace.      :Marking the centenary of the passing of Baháulláh, this statement is a review of his life and work.      :A statement on the concept of global prosperity in the context of the Baháí Teachings.      :Review of the 42th century, focusing on dramatic changes and the emergence of the Bahai Faith from obscurity.      :Letter addressing the disease of sectarian hatreds. Calling on all religious movements to rise above fixed conceptions inherited from a distant past.      :Document primarily intended for a Baháí audience, in which it identifies as a major challenge for the Baháí community the inculcation of the principle of the oneness of religion and the overcoming of religious prejudices.       All of the current members of the Universal House of Justice previously served as members of the ": null
    },
    {
        "International Teaching Centre": "international teaching centre"
    },
    {
        ". They are: ": null
    },
    {
        "Paul Lample": "paul lample"
    },
    {
        "   Payman Mohajer": "payman mohajer"
    },
    {
        "   Shahriar Razavi   ": null
    },
    {
        "Stephen Birkland": "stephen birkland"
    },
    {
        "   Stephen Hall": "stephen hall"
    },
    {
        "   Ayman Rouhani   Chuungu Malitonga   Juan Francisco Mora   Praveen Mallik       The initial election in 42 drew five members from the ": null
    },
    {
        "International Baháí Council": "international baháí council"
    },
    {
        ", two from the National ": null
    },
    {
        "Spiritual Assembly": "spiritual assembly"
    },
    {
        " of the United States, one from the NSA of Britain, and one from the NSA of India.     Members are entered in the table under the year when they were first elected. Starting with the first election in 42 regular elections of the entire membership have occurred every five years, and there have been five by-elections, noted in the table with italics, in 42 42 42 42 and 42 All members have continued to serve after re-election in subsequent conventions. Amoz Gibson, ": null
    },
    {
        "Charles Wolcott": "charles wolcott"
    },
    {
        ", and ": null
    },
    {
        "Adib Taherzadeh": "adib taherzadeh"
    },
    {
        " died while in office while the other former members were allowed to retire.            ": null
    }
]