[
    {
        "The University of Bonn  is a ": null
    },
    {
        "public research university": "public research university"
    },
    {
        " located in ": null
    },
    {
        "Bonn": "bonn"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". It was founded in its present form as the Rhein-Universität  on 42 October 42 by ": null
    },
    {
        "Frederick William III": "frederick william iii"
    },
    {
        ", as the linear successor of the Kurkölnische Akademie Bonn  which was founded in 42 The University of Bonn offers many undergraduate and graduate programs in a range of subjects and has 42 professors and 42 students. Its library holds more than five million volumes.     As of August 42 among its notable alumni, faculty and researchers are ": null
    },
    {
        "42 Nobel Laureates": "list of nobel laureates by university affiliation ii"
    },
    {
        ", ": null
    },
    {
        "42 Fields Medalists": "list of fields medal winners by university affiliation"
    },
    {
        ", twelve ": null
    },
    {
        "Gottfried Wilhelm Leibniz Prize": "gottfried wilhelm leibniz prize"
    },
    {
        " winners as well as ": null
    },
    {
        "August Kekulé": "august kekulé"
    },
    {
        ", ": null
    },
    {
        "Friedrich Nietzsche": "friedrich nietzsche"
    },
    {
        ", ": null
    },
    {
        "Karl Marx": "karl marx"
    },
    {
        ", ": null
    },
    {
        "Heinrich Heine": "heinrich heine"
    },
    {
        ", ": null
    },
    {
        "Prince Albert": "albert, prince consort"
    },
    {
        ", ": null
    },
    {
        "Pope Benedict XVI": "pope benedict xvi"
    },
    {
        ", ": null
    },
    {
        "Frederick III": "frederick iii, german emperor"
    },
    {
        ", ": null
    },
    {
        "Max Ernst": "max ernst"
    },
    {
        ", ": null
    },
    {
        "Konrad Adenauer": "konrad adenauer"
    },
    {
        ", and ": null
    },
    {
        "Joseph Schumpeter": "joseph schumpeter"
    },
    {
        ".            The universitys forerunner was the Kurkölnische Akademie Bonn  which was founded in 42 by ": null
    },
    {
        "Maximilian Frederick of Königsegg-Rothenfels": "maximilian frederick of königsegg-rothenfels"
    },
    {
        ", the prince-elector of Cologne. In the spirit of the ": null
    },
    {
        "Enlightenment": "age of enlightenment"
    },
    {
        " the new academy was nonsectarian. The academy had schools for ": null
    },
    {
        "theology": "theology"
    },
    {
        ", ": null
    },
    {
        "law": "law"
    },
    {
        ", ": null
    },
    {
        "pharmacy": "pharmacy"
    },
    {
        " and general studies. In 42 ": null
    },
    {
        "Emperor Joseph II": "joseph ii, holy roman emperor"
    },
    {
        " granted the academy the right to award academic degrees , turning the academy into a university. The academy was closed in 42 after the left bank of the ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        " was occupied by France during the ": null
    },
    {
        "French Revolutionary Wars": "french revolutionary wars"
    },
    {
        ".     The ": null
    },
    {
        "Rhineland": "rhineland"
    },
    {
        " became a part of ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        " in 42 as a result of the ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        ". King ": null
    },
    {
        "Frederick William III of Prussia": "frederick william iii of prussia"
    },
    {
        " thereafter decreed the establishment of a new university in the new province  on 42 October 42 At this time there was no university in the Rhineland, as all three universities that existed until the end of the 42th century were closed as a result of the French occupation. The Kurkölnische Akademie Bonn was one of these three universities. The other two were the Roman Catholic ": null
    },
    {
        "University of Cologne": "university of cologne"
    },
    {
        " and the Protestant ": null
    },
    {
        "University of Duisburg": "university of duisburg"
    },
    {
        ".          The new Rhein University  was then founded on 42 October 42 by Frederick William III. It was the sixth Prussian University, founded after the universities in ": null
    },
    {
        "Greifswald": "university of greifswald"
    },
    {
        ", ": null
    },
    {
        "Berlin": "humboldt university of berlin"
    },
    {
        ", ": null
    },
    {
        "Königsberg": "university of königsberg"
    },
    {
        ", ": null
    },
    {
        "Halle": "martin luther university of halle-wittenberg"
    },
    {
        " and ": null
    },
    {
        "Breslau": "university of wrocław"
    },
    {
        ". The new university was equally shared between the two Christian denominations. This was one of the reasons why Bonn, with its tradition of a nonsectarian university, was chosen over Cologne and Duisburg. Apart from a school of Roman Catholic theology and a school of Protestant theology, the university had schools for medicine, law and philosophy. Initially 42 professors and eight adjunct professors were teaching in Bonn.     The university constitution was adopted in 42 In the spirit of ": null
    },
    {
        "Wilhelm von Humboldt": "wilhelm von humboldt"
    },
    {
        " the constitution emphasized the autonomy of the university and the unity of teaching and research. Similar to the ": null
    },
    {
        "University of Berlin": "humboldt university of berlin"
    },
    {
        ", which was founded in 42 the new constitution made the University of Bonn a ": null
    },
    {
        "modern research university": "history of european research universitieseuropean university models in the 19th and 20th centuries"
    },
    {
        ".     Only one year after the inception of the Rhein University the ": null
    },
    {
        "dramatist": "dramatist"
    },
    {
        " August von Kotzebue": "august von kotzebue"
    },
    {
        " was murdered by ": null
    },
    {
        "Karl Ludwig Sand": "karl ludwig sand"
    },
    {
        ", a student at the ": null
    },
    {
        "University of Jena": "friedrich schiller university of jena"
    },
    {
        ". The ": null
    },
    {
        "Carlsbad Decrees": "carlsbad decrees"
    },
    {
        ", introduced on 42 September 42 led to a general crackdown on universities, the dissolution of the ": null
    },
    {
        "Burschenschaft": "burschenschaft"
    },
    {
        "en and the introduction of censorship laws. One victim was the author and poet ": null
    },
    {
        "Ernst Moritz Arndt": "ernst moritz arndt"
    },
    {
        ", who, freshly appointed university professor in Bonn, was banned from teaching. Only after the death of Frederick William III in 42 was he reinstated in his professorship. Another consequence of the ": null
    },
    {
        "Carlsbad Decrees": "carlsbad decrees"
    },
    {
        " was the refusal by Frederick William III to confer the chain of office, the official seal and an official name to the new university. The Rhein University was thus nameless until 42 when the new King of Prussia, ": null
    },
    {
        "Frederick William IV": "frederick william iv of prussia"
    },
    {
        " gave it the official name Rheinische Friedrich-Wilhelms-Universität.        Despite these problems, the university grew and attracted famous scholars and students. At the end of the 42th century the university was also known as the Prinzenuniversität , as many of the sons of the king of Prussia studied here. In 42 the university had 42 chairs, 42 adjunct chairs, two honorary professors, 42 ": null
    },
    {
        "Privatdozent": "privatdozent"
    },
    {
        "en and six lecturers. Since 42 women were allowed to attend classes as guest auditors at universities in Prussia. In 42 the University of Bonn became fully coeducational.       The growth of the university came to a halt with ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". Financial and economic problems in Germany in the aftermath of the war resulted in reduced government funding for the university. The University of Bonn responded by trying to find private and industrial sponsors. In 42 the university adopted a new constitution. For the first time students were allowed to participate in the self-governing university administration. To that effect the ": null
    },
    {
        "student council": "students union"
    },
    {
        " Astag  was founded in the same year. Members of the student council were elected in a secret ballot.     After the Nazi takeover of power in 42 the ": null
    },
    {
        "Gleichschaltung": "gleichschaltung"
    },
    {
        " transformed the university into a Nazi educational institution. According to the ": null
    },
    {
        "Führerprinzip": "führerprinzip"
    },
    {
        " the autonomous and self-governening administration of the university was replaced by a hierarchy of leaders resembling the military, with the university president being subordinate to the ministry of education. Jewish professors and students and political opponents were ostracized and expelled from the university. The theologian ": null
    },
    {
        "Karl Barth": "karl barth"
    },
    {
        " was forced to resign and to emigrate to Switzerland for refusing to swear an oath to Hitler. The Jewish mathematician ": null
    },
    {
        "Felix Hausdorff": "felix hausdorff"
    },
    {
        " was expelled from the university in 42 and committed suicide after learning about his impending deportation to a concentration camp in 42 The philosophers Paul Ludwig Landsberg and Johannes Maria Verweyen were deported and died in ": null
    },
    {
        "concentration camps": "nazi concentration camps"
    },
    {
        ". In 42 ": null
    },
    {
        "Thomas Mann": "thomas mann"
    },
    {
        " was deprived of his honorary doctorate. His honorary degree was restored in 42     During the ": null
    },
    {
        "second World War": "world war ii"
    },
    {
        " the university suffered heavy damage. An ": null
    },
    {
        "air raid": "strategic bombing during world war ii"
    },
    {
        " on 42 October 42 destroyed the main building.       The university was re-opened on 42 November 42 as one of the first in the ": null
    },
    {
        "British occupation zone": "allied occupation zones in germany"
    },
    {
        ". The first university president was ": null
    },
    {
        "Heinrich Matthias Konen": "heinrich konen"
    },
    {
        ", who was expelled from the university in 42 because of his opposition to ": null
    },
    {
        "Nazism": "nazism"
    },
    {
        ". At the start of the first semester on 42 November 42 the university had more than 42 applicants for only 42 places.     The university greatly expanded in the postwar period, in particular in the 42s and 42s. Significant events of the postwar era were the relocation of the university hospital from the city center to the ": null
    },
    {
        "Venusberg": "bonndistricts"
    },
    {
        " in 42 the opening of the new university library in 42 and the opening of a new building, the Juridicum, for the School of Law and Economics in 42     In 42 the Pedagogigal University Bonn was merged into the University of Bonn, although eventually all the teachers education programs were closed in 42 In 42 the new science library was opened. In 42 ": null
    },
    {
        "Wolfgang Paul": "wolfgang paul"
    },
    {
        " was awarded the ": null
    },
    {
        "Nobel Prize in Physics": "nobel prize in physics"
    },
    {
        ". Three years later ": null
    },
    {
        "Reinhard Selten": "reinhard selten"
    },
    {
        " was awarded the ": null
    },
    {
        "Nobel Prize in Economics": "nobel prize in economics"
    },
    {
        ". The decision of the German government to move the capital from Bonn to Berlin after the ": null
    },
    {
        "reunification": "german reunification"
    },
    {
        " in 42 resulted in generous compensation for the city of Bonn. The compensation package included three new research institutes affiliated or closely collaborating with the university, thus significantly enhancing the research profile of the University of Bonn.     In the 42s the university implemented the ": null
    },
    {
        "Bologna process": "bologna process"
    },
    {
        " and replaced the traditional ": null
    },
    {
        "Diplom": "diplom"
    },
    {
        " and ": null
    },
    {
        "Magister": "magister"
    },
    {
        " programs with Bachelor and Master programs. This process was completed by 42        The University of Bonn does not have a centralized campus. The main building is the  Kurfürstliches Schloss , the former residential palace of the prince-elector of Cologne in the city center. The main building was built by ": null
    },
    {
        "Enrico Zuccalli": "enrico zuccalli"
    },
    {
        " for the prince-elector of Cologne, ": null
    },
    {
        "Joseph Clemens of Bavaria": "joseph clemens of bavaria"
    },
    {
        " from 42–42 Today it houses the faculty of humanities and theology and the university administration. The Hofgarten, a large park in front of the main building is a popular place for students to meet, study and relax. The Hofgarten was repeatedly the place for political demonstrations as for example the demonstration against the ": null
    },
    {
        "NATO Double-Track Decision": "nato double-track decision"
    },
    {
        " on 42 October 42 with about 42 participants.        The school of law and economics, the main university library and several smaller departments are housed in modern buildings a short distance south of the main building. The department of psychology and the department of computer science are located in a northern suburb of Bonn.     The science departments and the main science library are located in Poppelsdorf and Endenich, west of the city center, and housed in a mix of historical and modern buildings. Notable is the Poppelsdorf Palace , which was built from 42 to 42 by ": null
    },
    {
        "Robert de Cotte": "robert de cotte"
    },
    {
        " for ": null
    },
    {
        "Joseph Clemens of Bavaria": "joseph clemens of bavaria"
    },
    {
        " and his successor ": null
    },
    {
        "Clemens August of Bavaria": "clemens august of bavaria"
    },
    {
        ". Today the Poppelsdorf Palace houses the universitys mineral collection and several science departments; its grounds are the universitys ": null
    },
    {
        "botanical garden": "botanical garden"
    },
    {
        " .     The school of medicine is located on the Venusberg, a hill on the western edge of Bonn. Several residence halls are scattered across the city. In total the University of Bonn owns 42 buildings.          The university library was founded in 42 and started with 42 volumes inherited from the library of the closed ": null
    },
    {
        "University of Duisburg": "gerhard mercator university"
    },
    {
        ". In 42 the library became ": null
    },
    {
        "legal deposit": "legal deposit"
    },
    {
        " for all books published in the Prussian Rhine province. The library contained about 42 volumes at the end of the 42th century, and about 42 volumes at the outbreak of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". An ": null
    },
    {
        "air raid": "strategic bombing during world war ii"
    },
    {
        " on 42 October 42 destroyed about 42 volumes and a large part of the ": null
    },
    {
        "library catalog": "library catalog"
    },
    {
        ". After the war the library was housed in several makeshift locations until the completion of the new central library in 42 The new building was designed by ": null
    },
    {
        "Pierre Vago": "pierre vago"
    },
    {
        " and Fritz Bornemann and is located close to the main building. In 42 a new library building was opened in Poppelsdorf, west of the main building. The new library building houses the science, agriculture and medicine collections. Today, the university library system comprises the central library, the library for science, agriculture and medicine and about 42 smaller libraries. It holds 42 million volumes and subscribes to about 42 journals.                The university hospital  was founded at the same time as the university and officially opened on 42 May 42 in the Poppelsdorf Palace  west of the main building. In its first year, the hospital had thirty beds, performed 42 surgeries and treated about 42 outpatients. In 42 the hospital moved to a new building in the city center of Bonn, and after ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " to the ": null
    },
    {
        "Venusberg": "bonndistricts"
    },
    {
        " on the western edge of Bonn. On 42 January 42 the university hospital became a public corporation. Although the university hospital is since then independent from the university, the School of Medicine of the University of Bonn and the university hospital closely collaborate. Today the university hospital comprises about thirty individual hospitals, employs more than 42 physicians and more than 42 nursing and clinical support staff and treated about 42 inpatients.          The  Akademisches Kunstmuseum   was founded in 42 and has one of the largest collections of plaster casts of ancient Greek and Roman sculptures in the world. At this time collections of plaster casts were mainly used in the instruction of students at art academies. They were first used in the instruction of university students in 42 by ": null
    },
    {
        "Christian Gottlob Heyne": "christian gottlob heyne"
    },
    {
        " at ": null
    },
    {
        "University of Göttingen": "university of göttingen"
    },
    {
        ". The Akademisches Kunstmuseum in Bonn was the first of its kind, as at this time collections at other universities were scattered around universities libraries. The first director was ": null
    },
    {
        "Friedrich Gottlieb Welcker": "friedrich gottlieb welcker"
    },
    {
        ", who also held a professorship of archaeology. His tenure was from 42 until his retirement in 42 He was succeeded by ": null
    },
    {
        "Otto Jahn": "otto jahn"
    },
    {
        " and ": null
    },
    {
        "Friedrich Wilhelm Ritschl": "friedrich wilhelm ritschl"
    },
    {
        ", who shared the directorship. From 42 to 42 ": null
    },
    {
        "Reinhard Kekulé von Stradonitz": "reinhard kekulé von stradonitz"
    },
    {
        ", nephew of the famous organic chemist ": null
    },
    {
        "Friedrich August Kekulé von Stradonitz": "friedrich august kekulé von stradonitz"
    },
    {
        ", was the director. In 42 the museum moved to a new building that was formerly used by the department of anatomy. The building was constructed from 42 to 42 and designed by ": null
    },
    {
        "Karl Friedrich Schinkel": "karl friedrich schinkel"
    },
    {
        " and ": null
    },
    {
        "Hermann Friedrich Waesemann": "hermann friedrich waesemann"
    },
    {
        ". Other directors of the museum were ": null
    },
    {
        "Georg Loeschcke": "georg loeschcke"
    },
    {
        " , ": null
    },
    {
        "Franz Winter": "franz winter"
    },
    {
        " , ": null
    },
    {
        "Richard Delbrück": "richard delbrück"
    },
    {
        " , ": null
    },
    {
        "Ernst Langlotz": "ernst langlotz"
    },
    {
        " , Nikolaus Himmelmann and Harald Mielsch . All directors, with the exception of ": null
    },
    {
        "Friedrich Wilhelm Ritschl": "friedrich wilhelm ritschl"
    },
    {
        " held a professorship of archaeology at the university.        The  Egyptian Museum   was founded in 42 The collection dates back to the 42th century and was formerly part of the Akademisches Kunstmuseum. Large parts of the collection were destroyed in World War II. Today the collection comprises about 42 objects.      The  Arithmeum  was opened in 42 With over 42 objects it has the worlds largest collection of historical ": null
    },
    {
        "mechanical calculating machines": "history of computing hardware"
    },
    {
        ". The museum is affiliated with the Research Institute for Discrete Mathematics.         The Teaching Collection of Archaeology and Anthropology  was opened in 42 The collection comprises more than 42 objects of mostly pre-Columbian art.      The  Botanical Garden  was officially founded in 42 and is located around the Poppelsdorf Palace. A garden existed at the same place at least since 42 and around 42 a Baroque garden was built for ": null
    },
    {
        "Clemens August of Bavaria": "clemens august of bavaria"
    },
    {
        ". The first director of the Botanical Garden was ": null
    },
    {
        "Nees von Esenbeck": "christian gottfried daniel nees von esenbeck"
    },
    {
        " from 42 to 42 In May 42 the worlds largest ": null
    },
    {
        "titan arum": "titan arum"
    },
    {
        ", some 42 meters high, flowered in the Botanical Garden for three days.      The natural history museum was opened in 42 by ": null
    },
    {
        "Georg August Goldfuss": "georg august goldfuss"
    },
    {
        ". It was the first public museum in the Rhineland. In 42 it was split into the Mineralogical Museum  located in the Poppelsdorf Palace and a museum of palaeontology, now named Goldfuß Museum of Palaeontology.      The Horst Stoeckel-Museum of the History of Anesthesiology  was opened in 42 and is the largest of its kind in Europe.      The  Museum Koenig  is one of the largest natural history museums in Germany and is affiliated with the university. The museum was founded in 42 by Alexander Koenig, who donated his collection of mounted specimen to the public. See also the separate article ": null
    },
    {
        "Museum Koenig": "museum koenig"
    },
    {
        ".        The University of Bonn has 42 students, and 42 of these are international students. Each year about 42 undergraduate students graduate. The university also confers about 42 Ph.D.s and about 42 ": null
    },
    {
        "habilitation": "habilitation"
    },
    {
        "s. More than 42 programs in all fields are offered. Strong fields as identified by the university are ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", ": null
    },
    {
        "physics": "physics"
    },
    {
        ", ": null
    },
    {
        "law": "law"
    },
    {
        ", ": null
    },
    {
        "economics": "economics"
    },
    {
        ", ": null
    },
    {
        "neuroscience": "neuroscience"
    },
    {
        ", ": null
    },
    {
        "medical genetics": "medical genetics"
    },
    {
        ", ": null
    },
    {
        "chemical biology": "chemical biology"
    },
    {
        ", ": null
    },
    {
        "agriculture": "agriculture"
    },
    {
        ", ": null
    },
    {
        "Asian": "asian studies"
    },
    {
        " and ": null
    },
    {
        "Oriental studies": "oriental studies"
    },
    {
        " and ": null
    },
    {
        "Philosophy and Ethics": "ethics"
    },
    {
        ". The university has more than 42 professors, an additional academic staff of 42 and an administrative staff of over 42. The annual budget was more than 42 million euros in 42        From the foundation in 42 to 42 the University of Bonn had five faculties, that is, the Faculty of Catholic Theology, the Faculty of Protestant Theology, the Faculty of Law and the Faculty of Arts and Science. In 42 the Faculty of Law and the Department of Economics, that until then was part of the Faculty of Arts and Science, merged into the new Faculty of Law and Economics. In 42 the until then independent Agricultural University Bonn-Poppelsdorf  was merged into the University of Bonn as the Faculty of Agricultural Science. In 42 the science departments were separated from the Faculty of Arts and Science. Today the university is divided into seven faculties:      Faculty of Catholic Theology    Faculty of Protestant Theology    Faculty of Law and Economics    Faculty of Medicine    Faculty of Arts    Faculty of Mathematics and Natural Sciences    Faculty of Agriculture          The Franz Joseph Dölger-Institute studies the ": null
    },
    {
        "late antiquity": "late antiquity"
    },
    {
        " and in particular the confrontation and interaction of Christians, Jews and Pagans in the late antiquity. The institute edits the Reallexikon für Antike und Christentum, a ": null
    },
    {
        "German language": "german language"
    },
    {
        " encyclopedia": "encyclopedia"
    },
    {
        " treating the history of early Christians in the late antiquity.   The institute is named after the church historian ": null
    },
    {
        "Franz Joseph Dölger": "franz joseph dölger"
    },
    {
        " who was a professor of theology at the university from 42 to 42      The Research Institute for Discrete Mathematics focuses on ": null
    },
    {
        "discrete mathematics": "discrete mathematics"
    },
    {
        " and its applications, in particular ": null
    },
    {
        "combinatorial optimization": "combinatorial optimization"
    },
    {
        " and the design of ": null
    },
    {
        "computer chips": "integrated circuit"
    },
    {
        ". The institute cooperates with ": null
    },
    {
        "IBM": "ibm"
    },
    {
        " and ": null
    },
    {
        "Deutsche Post": "deutsche post"
    },
    {
        ".  Researchers of the institute optimized the chess computer ": null
    },
    {
        "IBM Deep Blue": "ibm deep blue"
    },
    {
        ".      The Bethe Center for Theoretical Physics is a joint enterprise of theoretical physicists and mathematicians at various institutes of or connected with the University of Bonn. In the spirit of Hans Bethe it fosters research activities over a wide range of theoretical and mathematical physics. Activities of the Bethe Center include short and long term visitors program, workshops on dedicated research topics, regular Bethe Seminar Series, lectures and seminars for graduate students.      The German Reference Center for Ethics in the Life Sciences  was founded in 42 and is modeled after the National Reference Center for Bioethics Literature at ": null
    },
    {
        "Georgetown University": "georgetown university"
    },
    {
        ". The center provides access to scientific information to academics and professionals in the fields of life science and is the only of its kind in Germany.         After the German Governments decision in 42 to move the capital of Germany from Bonn to Berlin, the city of Bonn received generous compensation from the Federal Government. This led to the foundation of three research institutes in 42 of which two are affiliated with the university:     The  Center for European Integration Studies   studies the legal, economic and social implications of the ": null
    },
    {
        "European integration": "european integration"
    },
    {
        " process. The institute offers several graduate programs and organizes summer schools for students.      The Center for Development Research  studies global development from an interdisciplinary perspective and offers a doctoral program in international development.      The  Center of Advanced European Studies and Research  is an interdisciplinary applied research institute. Research is conducted in the fields of nanotechnology, biotechnology and medical technology. The institute is a private foundation, but collaborates closely with the university.     The  Institute for the Study of Labor   is a private research institute that is funded by ": null
    },
    {
        "Deutsche Post": "deutsche post"
    },
    {
        ". The institute concentrates on research on labor economics, but is also offering policy advise on labor market issues. The institute also awards the annual IZA Prize in Labor Economics. The department of economics of the University of Bonn and the institute closely cooperate.     The  Max Planck Institute for Mathematics   is part of the  Max-Planck-Gesellschaft , a network of scientific research institutes in Germany. The institute was founded in 42 by ": null
    },
    {
        "Friedrich Hirzebruch": "friedrich hirzebruch"
    },
    {
        ".     The  Max Planck Institute for Radio Astronomy   was founded in 42 as an institute of the Max-Planck-Gesellschaft. It operates the radio telescope in ": null
    },
    {
        "Effelsberg": "effelsberg"
    },
    {
        ".     The  Max Planck Institute for Research on Collective Goods   started as a research group in 42 and was founded as an institute of the Max-Planck-Gesellschaft in 42 The institute studies collective goods from a legal and economic perspective.     The Center for Economics and Neuroscience founded in 42 by Christian Elger, ": null
    },
    {
        "Gottfried Wilhelm Leibniz Prize": "gottfried wilhelm leibniz prize"
    },
    {
        " winner ": null
    },
    {
        "Armin Falk": "armin falk"
    },
    {
        ", Martin Reuter and Bernd Weber, provides an international platform for interdisciplinary work in ": null
    },
    {
        "neuroeconomics": "neuroeconomics"
    },
    {
        ".   Press release of the University of Bonn concerning the official welcoming of the center It includes the Laboratory for Experimental Economics that can carry out computer-based behavioral experiments with up to 42 participants simultaneously, two ": null
    },
    {
        "magnetic resonance imaging": "magnetic resonance imaging"
    },
    {
        " scanners for interactive behavioral experiments and functional imaging, as well as a biomolecular laboratory for genotyping different polymorphisms.            University of Bonn researchers made fundamental contributions in the sciences and the humanities. In physics researchers developed the ": null
    },
    {
        "quadrupole ion trap": "quadrupole ion trap"
    },
    {
        " and the ": null
    },
    {
        "Geissler tube": "geissler tube"
    },
    {
        ", discovered ": null
    },
    {
        "radio waves": "radio waves"
    },
    {
        ", were instrumental in describing ": null
    },
    {
        "cathode rays": "cathode rays"
    },
    {
        " and developed the ": null
    },
    {
        "variable star designation": "variable star designation"
    },
    {
        ". In chemistry researchers made significant contributions to the understanding of ": null
    },
    {
        "alicyclic compound": "alicyclic compound"
    },
    {
        "s and ": null
    },
    {
        "Benzene": "benzene"
    },
    {
        ". In material science researchers have been instrumental in describing the ": null
    },
    {
        "lotus effect": "lotus effect"
    },
    {
        ". In mathematics University of Bonn faculty made fundamental contributions to modern ": null
    },
    {
        "topology": "topology"
    },
    {
        " and ": null
    },
    {
        "algebraic geometry": "algebraic geometry"
    },
    {
        ". The ": null
    },
    {
        "Hirzebruch–Riemann–Roch theorem": "hirzebruch–riemann–roch theorem"
    },
    {
        ", ": null
    },
    {
        "Lipschitz continuity": "lipschitz continuity"
    },
    {
        ", the ": null
    },
    {
        "Petri net": "petri net"
    },
    {
        ", the ": null
    },
    {
        "Schönhage–Strassen algorithm": "schönhage–strassen algorithm"
    },
    {
        ", ": null
    },
    {
        "Faltingss theorem": "faltingss theorem"
    },
    {
        " and the ": null
    },
    {
        "Toeplitz matrix": "toeplitz matrix"
    },
    {
        " are all named after University of Bonn mathematicians. University of Bonn economists made fundamental contributions to ": null
    },
    {
        "game theory": "game theory"
    },
    {
        " and ": null
    },
    {
        "experimental economics": "experimental economics"
    },
    {
        ". Famous thinkers that were faculty at the University of Bonn include the poet ": null
    },
    {
        "August Wilhelm Schlegel": "august wilhelm schlegel"
    },
    {
        ", the historian ": null
    },
    {
        "Barthold Georg Niebuhr": "barthold georg niebuhr"
    },
    {
        ", the theologians ": null
    },
    {
        "Karl Barth": "karl barth"
    },
    {
        " and ": null
    },
    {
        "Joseph Ratzinger": "pope benedict xvi"
    },
    {
        " and the poet ": null
    },
    {
        "Ernst Moritz Arndt": "ernst moritz arndt"
    },
    {
        ".     The university has nine collaborative research centres and five research units funded by the ": null
    },
    {
        "German Science Foundation": "deutsche forschungsgemeinschaft"
    },
    {
        " and attracts more than 42 million Euros in external research funding annually.     The Excellence Initiative of the German government in 42 resulted in the foundation of the ": null
    },
    {
        "Hausdorff Center for Mathematics": "hausdorff center for mathematics"
    },
    {
        " as one of the seventeen national Clusters of Excellence that were part of the initiative and the expansion of the already existing ": null
    },
    {
        "Bonn Graduate School of Economics": "bonn graduate school of economics"
    },
    {
        " .   The Excellence Initiative also resulted in the founding of the ": null
    },
    {
        "Bonn-Cologne Graduate School of Physics and Astronomy": "bonn-cologne graduate school of physics and astronomy"
    },
    {
        " .  was founded in the November 42 to foster closer interaction between mathematicians and theoretical physicists at Bonn. The center also arranges for regular visitors and seminars .             According to the 42 ": null
    },
    {
        "Academic Ranking of World Universities": "academic ranking of world universities"
    },
    {
        " compiled by researchers of the ": null
    },
    {
        "Shanghai Jiao Tong University": "shanghai jiao tong university"
    },
    {
        " the University Bonn was ranked 42th internationally.      In the 42/42 ": null
    },
    {
        "Times Higher Education World University Rankings": "times higher education world university rankings"
    },
    {
        ", the university placed 42th.           To date, seven ": null
    },
    {
        "Nobel prize": "nobel prize"
    },
    {
        "s and three ": null
    },
    {
        "Fields Medal": "fields medal"
    },
    {
        "s have been awarded to faculty and alumni of the Rheinische Friedrich-Wilhelms-Universität Bonn:     Nobel prize:   ": null
    },
    {
        "Harald zur Hausen": "harald zur hausen"
    },
    {
        ", alumni: physiology or medicine, 42   ": null
    },
    {
        "Reinhard Selten": "reinhard selten"
    },
    {
        ", faculty member: economics, 42   ": null
    },
    {
        "Wolfgang Paul": "wolfgang paul"
    },
    {
        ", faculty member: physics, 42   ": null
    },
    {
        "Luigi Pirandello": "luigi pirandello"
    },
    {
        ", alumni: literature, 42   ": null
    },
    {
        "Otto Wallach": "otto wallach"
    },
    {
        ", faculty member: chemistry, 42   ": null
    },
    {
        "Paul Johann Ludwig von Heyse": "paul johann ludwig von heyse"
    },
    {
        ", alumni: literature, 42   ": null
    },
    {
        "Philipp Lenard": "philipp lenard"
    },
    {
        ", faculty member: physics, 42   Fields Medal:   ": null
    },
    {
        "Gerd Faltings": "gerd faltings"
    },
    {
        ", 42   ": null
    },
    {
        "Maxim Kontsevich": "maxim kontsevich"
    },
    {
        ", 42   ": null
    },
    {
        "Peter Scholze": "peter scholze"
    },
    {
        ", 42     Among its notable alumni and faculty are ": null
    },
    {
        "Pope Benedict XVI": "pope benedict xvi"
    },
    {
        ", ": null
    },
    {
        "Karl Marx": "karl marx"
    },
    {
        ", ": null
    },
    {
        "Joseph Goebbels": "joseph goebbels"
    },
    {
        ", ": null
    },
    {
        "Heinrich Heine": "heinrich heine"
    },
    {
        ", ": null
    },
    {
        "Heinrich Hertz": "heinrich hertz"
    },
    {
        ", ": null
    },
    {
        "Maria von Linden": "maria von linden"
    },
    {
        ", ": null
    },
    {
        "Friedrich Hirzebruch": "friedrich hirzebruch"
    },
    {
        ", ": null
    },
    {
        "Friedrich Nietzsche": "friedrich nietzsche"
    },
    {
        ", ": null
    },
    {
        "Friedrich August Kekulé von Stradonitz": "friedrich august kekulé von stradonitz"
    },
    {
        ", ": null
    },
    {
        "Syed Mujtaba Ali": "syed mujtaba ali"
    },
    {
        ", ": null
    },
    {
        "Joseph Schumpeter": "joseph schumpeter"
    },
    {
        ", ": null
    },
    {
        "Konrad Adenauer": "konrad adenauer"
    },
    {
        ", ": null
    },
    {
        "Max Ernst": "max ernst"
    },
    {
        ", ": null
    },
    {
        "Constantin Carathéodory": "constantin carathéodory"
    },
    {
        ", ": null
    },
    {
        "Karl Weierstrass": "karl weierstrass"
    },
    {
        ", ": null
    },
    {
        "Mehmet Celal Bey": "mehmet celal bey"
    },
    {
        ", ": null
    },
    {
        "Karl Barth": "karl barth"
    },
    {
        ", ": null
    },
    {
        "Wolfgang Kaleck": "wolfgang kaleck"
    },
    {
        ", ": null
    },
    {
        "Johannes Sobotta": "johannes sobotta"
    },
    {
        ", ": null
    },
    {
        "Margaret Altmann": "margaret altmann"
    },
    {
        ", ": null
    },
    {
        "Hans Riegel": "hans riegel"
    },
    {
        ", ": null
    },
    {
        "Samson Raphael Hirsch": "samson raphael hirsch"
    },
    {
        " and ": null
    },
    {
        "Sebastian Thrun": "sebastian thrun"
    }
]