[
    {
        "Universal algebra  is the field of ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        " that studies ": null
    },
    {
        "algebraic structure": "algebraic structure"
    },
    {
        "s themselves, not examples of algebraic structures.   For instance, rather than take particular groups as the object of study, in universal algebra one takes the class of groups as an object of study.       In universal algebra, an algebra  is a ": null
    },
    {
        "set": "set"
    },
    {
        " A together with a collection of operations on A. An n- ary operation  on A is a ": null
    },
    {
        "function": "function"
    },
    {
        " that takes n elements of A and returns a single element of A. Thus, a 42-ary operation  can be represented simply as an element of A, or a  constant , often denoted by a letter like a. A 42-ary operation  is simply a function from A to A, often denoted by a symbol placed in front of its argument, like ~x. A 42-ary operation  is often denoted by a symbol placed between its arguments, like x  ∗  y. Operations of higher or unspecified  arity  are usually denoted by function symbols, with the arguments placed in parentheses and separated by commas, like f or f. Some researchers allow ": null
    },
    {
        "infinitary": "infinitary"
    },
    {
        " operations, such as \\textstyle\\bigwedge_ x_\\alpha where J is an infinite ": null
    },
    {
        "index set": "index set"
    },
    {
        ", thus leading into the algebraic theory of ": null
    },
    {
        "complete lattice": "complete lattice"
    },
    {
        "s. One way of talking about an algebra, then, is by referring to it as an ": null
    },
    {
        "algebra of a certain type": "outline of algebraic structurestypes of algebraic structures"
    },
    {
        " \\Omega , where \\Omega is an ordered sequence of natural numbers representing the arity of the operations of the algebra.       After the operations have been specified, the nature of the algebra is further defined by ": null
    },
    {
        "axiom": "axiom"
    },
    {
        "s, which in universal algebra often take the form of ": null
    },
    {
        "identities": "identity"
    },
    {
        ", or equational laws. An example is the ": null
    },
    {
        "associative": "associative"
    },
    {
        " axiom for a binary operation, which is given by the equation x  ∗       ∗  z. The axiom is intended to hold for all elements x, y, and z of the set A.            A collection of algebraic structures defined by identities is called a ": null
    },
    {
        "variety": "variety"
    },
    {
        " or equational class. Some authors consider varieties to be the main focus of universal algebra.     Restricting ones study to varieties rules out:     ": null
    },
    {
        "quantification": "quantification"
    },
    {
        ", including ": null
    },
    {
        "universal quantification": "universal quantification"
    },
    {
        " except before an equation, and ": null
    },
    {
        "existential quantification": "existential quantification"
    },
    {
        " , as well as ": null
    },
    {
        "predicate logic": "predicate logic"
    },
    {
        " relations": "finitary relation"
    },
    {
        " other than equality, in particular ": null
    },
    {
        "inequalities": "inequality"
    },
    {
        ", both  and ": null
    },
    {
        "order relations": "order theory"
    },
    {
        "     The study of equational classes can be seen as a special branch of ": null
    },
    {
        "model theory": "model theory"
    },
    {
        ", typically dealing with structures having operations only , and in which the language used to talk about these structures uses equations only.     Not all ": null
    },
    {
        "algebraic structure": "algebraic structure"
    },
    {
        "s in a wider sense fall into this scope. For example, ": null
    },
    {
        "ordered group": "ordered group"
    },
    {
        "s involve an ordering relation, so would not fall within this scope.     The class of ": null
    },
    {
        "field": "field"
    },
    {
        "s is not an equational class because there is no type in which all field laws can be written as equations .     One advantage of this restriction is that the structures studied in universal algebra can be defined in any ": null
    },
    {
        "category": "category theory"
    },
    {
        " that has finite product s. For example, a ": null
    },
    {
        "topological group": "topological group"
    },
    {
        " is just a group in the category of ": null
    },
    {
        "topological space": "topological space"
    },
    {
        "s.       Most of the usual algebraic systems of mathematics are examples of varieties, but not always in an obvious way, since the usual definitions often involve quantification or inequalities.       As an example, consider the definition of a ": null
    },
    {
        "group": "group"
    },
    {
        ". Usually a group is defined in terms of a single binary operation ∗, subject to the axioms:     ": null
    },
    {
        "Associativity": "associative"
    },
    {
        " : x  ∗           ∗  z;   formally: ∀x,y,z. x∗∗z.   ": null
    },
    {
        "Identity element": "identity element"
    },
    {
        ": There exists an element e such that for each element x, one has e  ∗  x       x       x  ∗  e;   formally: ∃e ∀x. e∗xxx∗e.   ": null
    },
    {
        "Inverse element": "inverse element"
    },
    {
        ": The identity element is easily seen to be unique, and is usually denoted by e. Then for each x, there exists an element i such that x  ∗  i       e       i  ∗  x;   formally: ∀x ∃i. x∗iei∗x.          This definition of a group does not immediately fit the point of view of universal algebra, because the axioms of the identity element and inversion are not stated purely in terms of equational laws which hold universally for all ... elements, but also involve the existential quantifier there exists ... . The group axioms can be phrased as universally quantified equations by specifying, in addition to the binary operation ∗, a nullary operation e and a unary operation ~, with ~x usually written as x −42 . The axioms become:     Associativity:  .   Identity element:   ; formally: ∀x. e∗xxx∗e.   Inverse element:      formally: ∀x. x∗~xe~x∗x.     To summarize, the usual definition has:     a single binary operation    42 equational law   42 quantified laws   while the universal algebra definition has:   42 operations: one binary, one unary, and one nullary    42 equational laws   no quantified laws     A key point is that the extra operations do not add information, but follow uniquely from the usual definition of a group. Although the usual definition did not uniquely specify the identity element e, an easy exercise shows it is unique, as is each ": null
    },
    {
        "inverse element": "inverse element"
    },
    {
        ".     The universal algebra point of view is well adapted to category theory. For example, when defining a ": null
    },
    {
        "group object": "group object"
    },
    {
        " in category theory, where the object in question may not be a set, one must use equational laws , rather than quantified laws . Further, the inverse and identity are specified as morphisms in the category. For example, in a ": null
    },
    {
        "topological group": "topological group"
    },
    {
        ", the inverse must not only exist element-wise, but must give a continuous mapping . Some authors also require the identity map to be a ": null
    },
    {
        "closed inclusion": "closed inclusion"
    },
    {
        " .       Most algebraic structures are examples of universal algebras.     ": null
    },
    {
        "Rings": "ring"
    },
    {
        ", ": null
    },
    {
        "semigroup": "semigroup"
    },
    {
        "s, ": null
    },
    {
        "quasigroup": "quasigroup"
    },
    {
        "s, ": null
    },
    {
        "groupoid": "groupoid"
    },
    {
        "s, ": null
    },
    {
        "magmas": "magma"
    },
    {
        ", ": null
    },
    {
        "loops": "loop"
    },
    {
        ", and others.   ": null
    },
    {
        "Vector space": "vector space"
    },
    {
        "s over a fixed field and ": null
    },
    {
        "modules": "module"
    },
    {
        " over a fixed ring are universal algebras. These have a binary addition and a family of unary scalar multiplication operators, one for each element of the field or ring.     Examples of relational algebras include ": null
    },
    {
        "semilattice": "semilattice"
    },
    {
        "s, ": null
    },
    {
        "lattices": "lattice"
    },
    {
        ", and ": null
    },
    {
        "Boolean algebra": "boolean algebra"
    },
    {
        "s.       We assume that the type, \\Omega , has been fixed. Then there are three basic constructions in universal algebra: homomorphic image, subalgebra, and product.     A ": null
    },
    {
        "homomorphism": "homomorphism"
    },
    {
        " between two algebras A and B is a ": null
    },
    {
        "function": "function"
    },
    {
        " h: A  →  B from the set A to the set B such that, for every operation f A of A and corresponding f B of B , h   f B .  For example, if e is a constant , then h    e B . If ~ is a unary operation, then h   ~h. If ∗ is a binary operation, then h   h  ∗  h. And so on. A few of the things that can be done with homomorphisms, as well as definitions of certain special kinds of homomorphisms, are listed under the entry ": null
    },
    {
        "Homomorphism": "homomorphism"
    },
    {
        ". In particular, we can take the homomorphic image of an algebra, h.     A subalgebra of A is a subset of A that is closed under all the operations of A. A product of some set of algebraic structures is the ": null
    },
    {
        "cartesian product": "cartesian product"
    },
    {
        " of the sets with the operations defined coordinatewise.       The ": null
    },
    {
        "isomorphism theorems": "isomorphism theorems"
    },
    {
        ", which encompass the isomorphism theorems of ": null
    },
    {
        "groups": "group"
    },
    {
        ", ": null
    },
    {
        "rings": "ring"
    },
    {
        ", ": null
    },
    {
        "modules": "module"
    },
    {
        ", etc.   ": null
    },
    {
        "Birkhoffs HSP Theorem": "variety birkhoffs theorem"
    },
    {
        ", which states that a class of algebras is a ": null
    },
    {
        "variety": "variety"
    },
    {
        " if and only if it is closed under homomorphic images, subalgebras, and arbitrary direct products.            In addition to its unifying approach, universal algebra also gives deep theorems and important examples and counterexamples. It provides a useful framework for those who intend to start the study of new classes of algebras.   It can enable the use of methods invented for some particular classes of algebras to other classes of algebras, by recasting the methods in terms of universal algebra , and then interpreting these as applied to other classes. It has also provided conceptual clarification; as J.D.H. Smith puts it,  What looks messy and complicated in a particular framework may turn out to be simple and obvious in the proper general one.      In particular, universal algebra can be applied to the study of ": null
    },
    {
        "monoid": "monoid"
    },
    {
        "s, ": null
    },
    {
        "rings": "ring"
    },
    {
        ", and ": null
    },
    {
        "lattice": "lattice"
    },
    {
        "s. Before universal algebra came along, many theorems  were proved separately in all of these classes, but with universal algebra, they can be proven once and for all for every kind of algebraic system.     The 42 paper by Higgins referenced below has been well followed up for its framework for a range of particular algebraic systems, while his 42 paper is notable for its discussion of algebras with operations which are only partially defined, typical examples for this being categories and groupoids. This leads on to the subject of ": null
    },
    {
        "higher-dimensional algebra": "higher-dimensional algebra"
    },
    {
        " which can be defined as the study of algebraic theories with partial operations whose domains are defined under geometric conditions. Notable examples of these are various forms of higher-dimensional categories and groupoids.            Universal algebra provides a natural language for the ": null
    },
    {
        "constraint satisfaction problem ": "constraint satisfaction problem"
    },
    {
        ". CSP refers to an important class of computational problems where, given a relational algebra  and an existential ": null
    },
    {
        "sentence": "sentence"
    },
    {
        " \\varphi over this algebra, the question is to find out whether \\varphi can be satisfied in . The algebra  is often fixed, so that  refers to the problem whose instance is only the existential sentence \\varphi .     It is proved that every computational problem can be formulated as  for some algebra .     For example, the ": null
    },
    {
        "n-coloring": "graph coloring"
    },
    {
        " problem can be stated as CSP of the algebra \\big , i.e. an algebra with n elements and a single relation, inequality.     The dichotomy conjecture states that if  is a finite algebra, then  is either ": null
    },
    {
        "P": "p"
    },
    {
        " or ": null
    },
    {
        "NP-complete": "np-completeness"
    },
    {
        ".             Universal algebra has also been studied using the techniques of ": null
    },
    {
        "category theory": "category theory"
    },
    {
        ". In this approach, instead of writing a list of operations and equations obeyed by those operations, one can describe an algebraic structure using categories of a special sort, known as ": null
    },
    {
        "Lawvere theories": "lawvere theory"
    },
    {
        " or more generally ": null
    },
    {
        "algebraic theories": "algebraic theory"
    },
    {
        ". Alternatively, one can describe algebraic structures using ": null
    },
    {
        "monad": "monad"
    },
    {
        "s. The two approaches are closely related, with each having their own advantages.      In particularly, every Lawvere theory gives a monad on the category of sets, while any finitary monad on the category of sets arises from a Lawvere theory. However, a monad describes algebraic structures within one particular category , while algebraic theories describe structure within any of a large class of categories .     A more recent development in category theory is ": null
    },
    {
        "operad theory": "operad theory"
    },
    {
        "  – an operad is a set of operations, similar to a universal algebra, but restricted in that equations are only allowed between expressions with the variables, with no duplication or omission of variables allowed. Thus, rings can be described as the so-called algebras of some operad, but not groups, since the law g g^ 42 duplicates the variable g on the left side and omits it on the right side. At first this may seem to be a troublesome restriction, but the payoff is that operads have certain advantages: for example, one can hybridize the concepts of ring and vector space to obtain the concept of ": null
    },
    {
        "associative algebra": "associative algebra"
    },
    {
        ", but one cannot form a similar hybrid of the concepts of group and vector space.     Another development is ": null
    },
    {
        "partial algebra": "partial algebra"
    },
    {
        " where the operators can be ": null
    },
    {
        "partial function": "partial function"
    },
    {
        "s. Certain partial functions can also be handled by a generalization of Lawvere theories known as ": null
    },
    {
        "essentially algebraic theories": "essentially algebraic theory"
    },
    {
        ".      Another generalization of universal algebra is ": null
    },
    {
        "model theory": "model theory"
    },
    {
        ", which is sometimes described as universal algebra + logic .        In ": null
    },
    {
        "Alfred North Whitehead": "alfred north whitehead"
    },
    {
        "s book A Treatise on Universal Algebra, published in 42 the term universal algebra had essentially the same meaning that it has today. Whitehead credits ": null
    },
    {
        "William Rowan Hamilton": "william rowan hamilton"
    },
    {
        " and ": null
    },
    {
        "Augustus De Morgan": "augustus de morgan"
    },
    {
        " as originators of the subject matter, and ": null
    },
    {
        "James Joseph Sylvester": "james joseph sylvester"
    },
    {
        " with coining the term itself.       At the time structures such as ": null
    },
    {
        "Lie algebra": "lie algebra"
    },
    {
        "s and ": null
    },
    {
        "hyperbolic quaternion": "hyperbolic quaternion"
    },
    {
        "s drew attention to the need to expand algebraic structures beyond the associatively multiplicative class. In a review ": null
    },
    {
        "Alexander Macfarlane": "alexander macfarlane"
    },
    {
        " wrote: The main idea of the work is not unification of the several methods, nor generalization of ordinary algebra so as to include them, but rather the comparative study of their several structures. ": null
    },
    {
        "Alexander Macfarlane": "alexander macfarlane"
    },
    {
        " , ": null
    },
    {
        "Science": "science"
    },
    {
        " 42: 42–42 via ": null
    },
    {
        "Internet Archive": "internet archive"
    },
    {
        " At the time ": null
    },
    {
        "George Boole": "george boole"
    },
    {
        "s algebra of logic made a strong counterpoint to ordinary number algebra, so the term universal served to calm strained sensibilities.     Whiteheads early work sought to unify ": null
    },
    {
        "quaternions": "quaternions"
    },
    {
        " , ": null
    },
    {
        "Grassmann": "grassmann"
    },
    {
        "s ": null
    },
    {
        "Ausdehnungslehre": "exterior algebrahistory"
    },
    {
        ", and Booles algebra of logic. Whitehead wrote in his book:   : Such algebras have an intrinsic value for separate detailed study; also they are worthy of comparative study, for the sake of the light thereby thrown on the general theory of symbolic reasoning, and on algebraic symbolism in particular. The comparative study necessarily presupposes some previous separate study, comparison being impossible without knowledge.      Whitehead, however, had no results of a general nature. Work on the subject was minimal until the early 42s, when ": null
    },
    {
        "Garrett Birkhoff": "garrett birkhoff"
    },
    {
        " and ": null
    },
    {
        "Øystein Ore": "øystein ore"
    },
    {
        " began publishing on universal algebras. Developments in ": null
    },
    {
        "metamathematics": "metamathematics"
    },
    {
        " and ": null
    },
    {
        "category theory": "category theory"
    },
    {
        " in the 42s and 42s furthered the field, particularly the work of ": null
    },
    {
        "Abraham Robinson": "abraham robinson"
    },
    {
        ", ": null
    },
    {
        "Alfred Tarski": "alfred tarski"
    },
    {
        ", ": null
    },
    {
        "Andrzej Mostowski": "andrzej mostowski"
    },
    {
        ", and their students .     In the period between 42 and 42 most papers were written along the lines suggested by Birkhoffs papers, dealing with ": null
    },
    {
        "free algebras": "free object"
    },
    {
        ", congruence and subalgebra lattices, and homomorphism theorems. Although the development of mathematical logic had made applications to algebra possible, they came about slowly; results published by ": null
    },
    {
        "Anatoly Maltsev": "anatoly maltsev"
    },
    {
        " in the 42s went unnoticed because of the war. Tarskis lecture at the 42 ": null
    },
    {
        "International Congress of Mathematicians": "international congress of mathematicians"
    },
    {
        " in Cambridge ushered in a new period in which model-theoretic aspects were developed, mainly by Tarski himself, as well as C.C. Chang, ": null
    },
    {
        "Leon Henkin": "leon henkin"
    },
    {
        ", ": null
    },
    {
        "Bjarni Jónsson": "bjarni jónsson"
    },
    {
        ", ": null
    },
    {
        "Roger Lyndon": "roger lyndon"
    },
    {
        ", and others.     In the late 42s, ": null
    },
    {
        "Edward Marczewski": "edward marczewski"
    },
    {
        " Marczewski, E. A general scheme of the notions of independence in mathematics. Bull. Acad. Polon. Sci. Ser. Sci. Math. Astronom. Phys. 42 , 42–42 emphasized the importance of free algebras, leading to the publication of more than 42 papers on the algebraic theory of free algebras by Marczewski himself, together with ": null
    },
    {
        "Jan Mycielski": "jan mycielski"
    },
    {
        ", Władysław Narkiewicz, Witold Nitka, J. Płonka, S. Świerczkowski, ": null
    },
    {
        "K. Urbanik": "kazimierz urbanik"
    },
    {
        ", and others.     Starting with ": null
    },
    {
        "William Lawvere": "william lawvere"
    },
    {
        "s thesis in 42 techniques from category theory have become important in universal algebra. ": null
    }
]