[
    {
        "      In ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", especially in ": null
    },
    {
        "order theory": "order theory"
    },
    {
        ", an upper bound of a ": null
    },
    {
        "subset": "subset"
    },
    {
        " S of some ": null
    },
    {
        "partially ordered set": "partially ordered set"
    },
    {
        "  is an element of K which is ": null
    },
    {
        "greater than or equal to": "greater than or equal to"
    },
    {
        " every element of S. The term lower bound is defined ": null
    },
    {
        "dually": "duality"
    },
    {
        " as an element of K which is less than or equal to every element of S. A set with an upper bound is said to be bounded from above by that bound, a set with a lower bound is said to be bounded from below by that bound. The terms bounded above  are also used in the mathematical literature for sets that have upper bounds.         For example, 42 is a lower bound for the set S ; so is 42 if 42 belongs to the set K; but 42 is not as it is not smaller than every element in S.     Another example: for the set S , the number 42 is both an upper bound and a lower bound; all other real numbers are either an upper bound or a lower bound for that set.     Every subset of the ": null
    },
    {
        "natural number": "natural number"
    },
    {
        "s has a lower bound, since the natural numbers have a least element . An infinite subset of the natural numbers cannot be bounded from above. An infinite subset of the ": null
    },
    {
        "integer": "integer"
    },
    {
        "s may be bounded from below or bounded from above, but not both. An infinite subset of the ": null
    },
    {
        "rational number": "rational number"
    },
    {
        "s may or may not be bounded from below and may or may not be bounded from above.     Every finite subset of a non-empty ": null
    },
    {
        "totally ordered set": "totally ordered set"
    },
    {
        " has both upper and lower bounds.         The definitions can be generalized to ": null
    },
    {
        "functions": "function"
    },
    {
        " and even sets of functions.     Given a function  with ": null
    },
    {
        "domain": "domain"
    },
    {
        "  and a partially ordered set  as ": null
    },
    {
        "codomain": "codomain"
    },
    {
        ", an element  of  is an upper bound of  if  for each  in . The upper bound is called  sharp  if equality holds for at least one value of .     Function  defined on domain  and having the same codomain  is an upper bound of  if  for each  in .     Function  is further said to be an upper bound of a set of functions if it is an upper bound of each function in that set.     The notion of lower bound for functions is defined analogously, with ≤ replacing ≥.         An upper bound is said to be a tight upper bound, a least upper bound, or a  supremum  if no smaller value is an upper bound.   Similarly a lower bound is said to be a tight lower bound, a greatest lower bound, or an  infimum ": null
    }
]