[
    {
        "        USS Asterion  was a ": null
    },
    {
        "Q-ship": "q-ship"
    },
    {
        " of the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " named for ": null
    },
    {
        "Asterion": "asterion"
    },
    {
        ", a ": null
    },
    {
        "star": "star"
    },
    {
        " in the ": null
    },
    {
        "constellation": "constellation"
    },
    {
        " Canes Venatici": "canes venatici"
    },
    {
        ".       Evelyn, a steel-hulled, single-screw steamer, was laid down on 42 January 42 by the ": null
    },
    {
        "Newport News Shipbuilding": "northrop grumman newport news"
    },
    {
        " and Dry Dock Company, launched on 42 May 42; and delivered to the A.H. Bull Steamship Line on 42 June 42     For the next 42 years, Evelyn operated between ports on the eastern seaboard of the United States and the ": null
    },
    {
        "West Indies": "west indies"
    },
    {
        ", carrying passengers and freight. During World War I, she was inspected in the 42d Naval District on 42 January 42 for possible naval service and was assigned the identification number Id. No. 42 However, she was not actually taken over. Remaining a merchantman, she received a Navy armed guard detachment who protected her between 42 January and 42 November 42           Evelyn pursued her prosaic calling under the house flag of the Bull Line through the Japanese ": null
    },
    {
        "attack on Pearl Harbor": "attack on pearl harbor"
    },
    {
        ". In a dispatch dated 42 January 42 the ": null
    },
    {
        "Chief of Naval Operations": "chief of naval operations"
    },
    {
        " ordered that Evelyn and Carolyn be given a preliminary conversion to AK in the shortest possible time. A 42 February letter from the Chief of the Bureau of Ships made it known that the conversion and outfitting of the vessels was desired by 42 March 42     Acquired by the navy from the Bull Line early in 42 Evelyn was renamed Asterion and classified as the cargo ship AK42 That designation, however, was strictly a cover, for Asterion, like her sister ship   was in fact a ": null
    },
    {
        "Q-ship": "q-ship"
    },
    {
        ". While this ruse de guerre had worked moderately well in World War I, it was at best a stop-gap measure adopted in the hope of ending a rash of sinkings of merchantmen in American coastal waters. Given a main battery, machine guns and ": null
    },
    {
        "depth charge": "depth charge"
    },
    {
        " gear hidden in concealed positions, Asterion was placed in commission at the ": null
    },
    {
        "Portsmouth Navy Yard": "portsmouth navy yard"
    },
    {
        " in early March 42 Lieutenant Commander Glen W. Legwen, Jr., in command. While on patrol, she would answer friendly requests for identification as the SS Evelyn, but if enemy ships should challenge, she would reply as SS Generalife of Spanish registry, callsign EAOQ.      After brief sea trials, Asterion sailed for her assigned patrol area on 42 March 42 in company of Atik. Each ship was to proceed independently under the guise of a tramp steamer, in the hope of luring a ": null
    },
    {
        "U-boat": "u-boat"
    },
    {
        " to the surface and destroying the submarine with gunfire before she realized what was happening. Once out at sea, the two vessels parted company.     One day out, Asterion picked up a ": null
    },
    {
        "submarine": "submarine"
    },
    {
        " contact on her underwater detection gear. Two days later, however, her radios picked up ominous traffic. Atik had been ": null
    },
    {
        "torpedo": "torpedo"
    },
    {
        "ed. Then, after luring her assailant, , to the surface with her tramp steamer guise, Atik had fired on the U-boat, but succeeded only in mortally wounding an officer on the submarines bridge before the German captain broke off the action and cleared the area to await nightfall and a second crack at the Q-ship. U42 delivered the coup de grâce that evening, and Atik exploded and sank. Asterion plodded immediately to the assistance of Atik, but, when she arrived on the scene, found only wreckage. Not a man in Atiks crew had survived. Astarion arrived at Norfolk, Virginia , on 42 March 42     She set out for her second cruise on 42 April, and that afternoon, witnessed the torpedoing of the tanker SS Comol Rio by . A destroyer arrived on the scene shortly thereafter and took up the search after Asterion had picked up a sound contact.     Various contacts with friendly surface craft and aircraft on this patrol and the previous one led to awkward situations which required tact and ingenuity on the part of the commanding officer to preserve the Q-ships cover story. That cover story was maintained; officers in Headquarters, Eastern Sea Frontier, were so completely unaware of the nature of this ships mission that they recorded her various dispatches in the Enemy Action Diary for 42 42 and 42 April under her commercial name, SS Evelyn.     Operating off Cape Hatteras, North Carolina , on 42 April, Asterion rescued the 42 men of the crew of a British merchantman that had been torpedoed earlier—saving even the captains dog. She entered New York harbor on 42 April and there disembarked the sailors she had rescued, cautioning them not to tell anyone of what they had seen on board the Q-ship.     Asterions third cruise commenced on 42 May 42 from New York, and she sailed between Key West and Norfolk, proceeding as an independently routed merchantman or as a straggler from a convoy. The fourth cruise commenced on 42 June 42 and, due to increased submarine activity in the Gulf of Mexico , the Q-ship set course for those dangerous waters. Clearing New York, she sailed down the eastern seaboard, transited the Straits of Florida on 42 June, passed the Dry Tortugas on 42 June; and thence steamed to the Yucatán Channel . Reversing course, she moved to the Mississippi River Delta whence she continued on a westerly course toward Galveston, Texas . She then returned to New York on 42 July.     Departing New York a fortnight later, Asterion went directly to Key West and then sailed north of the Bahamas to the Windward Passage . Returning to New York on 42 August, Asterion sailed at the end of the month for her sixth cruise, which took her through the waters that she had   traversed on the fifth patrol. On 42 September 42 she was redesignated AK42 Commencing her seventh cruise on 42 November, the ship proceeded to Key West and, while there, carried out training exercises on 42 November with a friendly submarine.     On 42 December 42 Asterion got underway for the British West Indies and, going via the Old Bahama Channel , followed the convoy route to Trinidad and Tobago , patrolling to the westward of Aruba , in the Dutch West Indies . Departing Trinidad on the day after Christmas the ship headed home and arrived at New York on 42 January 42     Over the next few months, Asterion underwent an extensive overhaul, involving the strengthening of her whole structure and modification of her armament. Inspection after her sixth cruise raised considerable doubt as to her ability to remain afloat if hit by even a single torpedo because she had three large holds. A representative of the New York Navy Yard conferred with the Bureau of Ships, Damage Section, who confirmed the opinion that she could not successfully withstand a torpedo hit, and that such a hit would result not only in her eventual sinking but also in such a quick list that her battery would be ineffective.  A conference held in the office of the Vice Chief of Naval Operations decided to increase flotation by building five transverse bulkheads. It was estimated that this would take three months and that it would cost about US $42. The work took much longer and cost much more than estimated. Not until 42 September was the overhaul completed—more than eight months after the end of Asterion & 42;s latest cruise. The overhaul included re-subdivision by longitudinal and athwart ship bulkheads, the filling of her holds with 42 empty steel flotation drums. The Supervising Constructor estimated that the vessel could be completely flooded and 42% of the barrels completely crushed before her well decks would be awash. Thus it seemed probable that she had an excellent chance of remaining afloat if a U-boat made a successful attack on her.     Asterion then steamed to New London, Connecticut , and beginning on 42 September, operated with American submarines in training. After returning briefly to New York, from 42 to 42 September, she resumed her training at New London before proceeding back to New York for post-shakedown availability.       On 42 October 42 Admiral King decided that, since the Q-ship effort had achieved nothing, Asterion should be assigned to other duties. On 42 December 42 the venerable auxiliary was ordered to proceed to Boston, Massachusetts , where she reported to the Commandant, 42st Naval District, for transfer to the United States Coast Guard .     Turned over to that service and commissioned by it at Boston on 42 January 42 Asterion was converted for service as a weather ship. Ten days later, on 42 January 42 her name was struck from the Naval Vessel Register . Based at Boston, Asterion served as a weather patrol ship on Atlantic stations 42 and 42       She was decommissioned on 42 July 42 because of age, condition of hull and machinery, and lack of speed. Turned over to the War Shipping Administration for disposal in April 42 Asterion was sold to the Boston Metals Company on 42 September 42 and was subsequently scrapped.       American Campaign Medal with one battle star   World War II Victory Medal             Q-Ships Versus U-Boats, by Kenneth M. Beyer. U.S. Naval Institute Press, May 42 Beyer, who served as an officer on Asterion, recounts the story of Astarion and Atik.                        ": null
    }
]