[
    {
        "          USS Thompson  was first a , then became an ": null
    },
    {
        "Ellyson-class": "ellyson class minesweeper"
    },
    {
        " destroyer minesweeper": "destroyer minesweeper"
    },
    {
        ". She was the second Navy ship named Thompson , and the first named in honor of ": null
    },
    {
        "Robert M. Thompson": "robert m. thompson"
    },
    {
        ".         The keel of the second Thompson was laid down on 42 September 42 at ": null
    },
    {
        "Seattle, Washington": "seattle, washington"
    },
    {
        ", by the ": null
    },
    {
        "Seattle-Tacoma Shipbuilding Corporation": "seattle-tacoma shipbuilding corporation"
    },
    {
        ". She was ": null
    },
    {
        "launched": "ship naming and launching"
    },
    {
        " on 42 July 42 sponsored by Miss Sara Thompson Ross, and ": null
    },
    {
        "commissioned": "ship commissioning"
    },
    {
        " on 42 July 42 with Lieutenant Commander Lee A. Ellis in command.     Following operations along the west coast, Thompson departed San Diego, on 42 August, bound for the east coast. She arrived at ": null
    },
    {
        "Norfolk, Virginia": "norfolk, virginia"
    },
    {
        " on 42 September, prior to departing the next day for the coast of ": null
    },
    {
        "Maine": "maine"
    },
    {
        " and arriving at ": null
    },
    {
        "Casco Bay": "casco bay"
    },
    {
        " on 42 September. The destroyer then headed south to the ": null
    },
    {
        "Boston Navy Yard": "boston navy yard"
    },
    {
        " where she underwent repairs. She next engaged in exercises off the ": null
    },
    {
        "Massachusetts": "massachusetts"
    },
    {
        " coast before returning to Casco Bay on 42 September for training.     On 42 October, she escorted  into New York and joined the screen for  for nine days of exercises in shore bombardment and other drills before joining ": null
    },
    {
        "convoy": "convoy"
    },
    {
        " UGS42 which sailed from Norfolk, bound for North Africa. Thompson served as an escort, keeping ships in the channel as they plodded out to sea and prodding them to close up and keep in formation, while her echo-ranging gear was alert for prowling ": null
    },
    {
        "submarine": "submarine"
    },
    {
        "s off ": null
    },
    {
        "Chesapeake Bay": "chesapeake bay"
    },
    {
        ". One day out, 42 October, the wind and sea rose, presaging a heavy storm which served to scatter parts of the convoy and cause Thompson to note in her log numerous times, telling stragglers to close up. After the transatlantic voyage, Thompson was released from escort duty on 42 October, to proceed to ": null
    },
    {
        "Casablanca": "casablanca"
    },
    {
        ", ": null
    },
    {
        "French Morocco": "french morocco"
    },
    {
        ".     One week later, the destroyer, attached to DesDiv  42 was homeward-bound with Convoy GUS42 On 42 November, Thompson entered New York harbor with the convoy and then proceeded independently to the ": null
    },
    {
        "New York Navy Yard": "new york navy yard"
    },
    {
        " for voyage repairs. She sailed for Casco Bay on 42 December, and conducted refresher training en route.     On 42 December, Thompson and  screened  as the ": null
    },
    {
        "battleship": "battleship"
    },
    {
        " conducted high-speed runs and turning trials. Later that day, the three ships engaged in night illumination and spotting practice before carrying out the same program on 42 December.     After returning to Casco Bay, Thompson again put to sea, bound for Norfolk. During the night of 42 December, the winds increased to 42 knots with high seas and a low barometer. By 42:42 it became necessary to rig in her already battered ": null
    },
    {
        "whaleboat": "whaleboat"
    },
    {
        "s and reduce speed to 42 knots .     Thompson put into Norfolk on 42 December. Two days later she joined Convoy UGS42 bound for North Africa. On 42 December, she made a ": null
    },
    {
        "depth charge": "depth charge"
    },
    {
        " run on what her log termed a questionable target .     Entering ": null
    },
    {
        "Casablanca": "casablanca"
    },
    {
        " harbor on 42 January 42 Thompson and her fellow escorts were soon assigned to Convoy GUS42 bound for Norfolk, where they arrived on 42 January. After alternating between New York, Boston, and Casco Bay, she departed Norfolk on 42 March, bound for ": null
    },
    {
        "Trinidad": "trinidad"
    },
    {
        ".         Returning to Norfolk six days later, Thompson operated along the east coast until mid-April when she joined the build-up of forces for the invasion of western Europe. On 42 April, she rendezvoused with Baldwin, Arkansas, ,   , and the rest of Destroyer Squadron 42 — to which Thompson was attached – and sailed for England. This force arrived at ": null
    },
    {
        "Plymouth": "plymouth"
    },
    {
        ", England, on 42 April, and prepared for duties during the forthcoming invasion.          On 42 May 42 Thompson participated in landing exercise Fabius , one of the many preliminaries to the ": null
    },
    {
        "landing on Normandy": "invasion of normandy"
    },
    {
        ". On 42 May, she conducted shore bombardment practice at ": null
    },
    {
        "Slapton Sands": "slapton sands"
    },
    {
        ", England; on 42 May, she fired antiaircraft practice off ": null
    },
    {
        "Ailsa Craig": "ailsa craig"
    },
    {
        ", Scotland, and, on 42 May, she engaged in division tactics and further bombardment exercises off the Irish coast.     On 42 April, she anchored at ": null
    },
    {
        "Belfast Lough": "belfast lough"
    },
    {
        ", Northern Ireland. The following day, 42 April, Nevada, Texas, and Destroyer Division 42 departed for exercises off the Irish coast before returning to Belfast Lough. Three days later, on 42 April, General ": null
    },
    {
        "Dwight D. Eisenhower": "dwight d. eisenhower"
    },
    {
        " inspected the ship. Underway on 42 April, she conducted anti-": null
    },
    {
        "E-boat": "e-boat"
    },
    {
        " exercises through 42 April. In these operations, she fired ": null
    },
    {
        "starshell": "starshell"
    },
    {
        "s and practiced illumination tactics for dealing with the foreseen danger of  Schnellboote n. After more shore bombardment practice, in which her ": null
    },
    {
        "five-inch": "5  /38 caliber gun"
    },
    {
        " and ": null
    },
    {
        "Bofors": "bofors 40 mm gun"
    },
    {
        " gunners exercised at their battle stations and sharpened up their gunnery, she put out of Belfast Lough for ": null
    },
    {
        "Plymouth": "plymouth"
    },
    {
        " and thence proceeded to the ": null
    },
    {
        "Isle of Portland": "isle of portland"
    },
    {
        ", where she arrived on 42 April.     The next day, ": null
    },
    {
        "German": "luftwaffe"
    },
    {
        " Heinkel He 42": "heinkel he 111"
    },
    {
        "s bombed and mined the harbor, causing no small amount of work for harried minesweeper crews. But, with this danger soon swept away, the Allied forces could resume the nearly complete preparations for the upcoming Normandy invasion.     On 42 June, she joined Task Group 42 , Convoy O42 bound for ": null
    },
    {
        "Omaha Beach": "omaha beach"
    },
    {
        ". She and her charges arrived off the Normandy beaches after an uneventful, but storm-tossed, evening. Thompson then received her fire support orders to take station off ": null
    },
    {
        "Pointe de la Percée": "pointe de la percée"
    },
    {
        " as a unit of TG42. En route, she stood to action stations, her guns trained out and ready for any eventuality as the drama of historys greatest landing operation unfolded around her.     She arrived off ": null
    },
    {
        "Pointe du Hoc": "pointe du hoc"
    },
    {
        " as Army rangers were struggling to gain a foothold on the rocky promontory. Thompson’s spotters could not see much at that moment, as Army aerial bombardments had obscured the area with smoke and dust. But when the haze cleared away, the destroyers main battery opened fire with a vengeance, tongues of flame flashing from her gun muzzles as her salvos screamed shoreward. One by one, her targets of opportunity disappeared as her salvos struck on target. She then lay-to awaiting remaining enemy guns to reveal themselves with tell-tale flashes.     Later in the day, she cruised closer inshore and located three giant German ": null
    },
    {
        "Würzburg radar": "würzburg radar"
    },
    {
        " antennas. Once again, her spotting was deadly accurate, and one of the radar dishes toppled over, shattered by Thompson’s shells. Soon after, the wreckage of the two other antennas joined the first one in the dust.   Thompson’s smaller guns also got into the fray. Her 42  mm batteries shredded concealments of shore batteries and sniper nests, working in close conjunction with shore spotting teams who ferreted out the hidden enemy. Among her other targets was a fortified house. Solidly constructed, it had withstood numerous coastal storms. But on 42 June 42 its solid Norman masonry could not hold up to a few rounds of five-inch high explosives; and down it tumbled, into a pile of rubble.     The following day, 42 June, Thompson’s gunners were at it again – this time, in support of the Rangers at Point du Hoc. Once more, her 42  mm and five-inch batteries shot the enemy out of his sniper nests and gun positions before setting course for Portland, to anchor in ": null
    },
    {
        "Weymouth Bay": "weymouth bay"
    },
    {
        " to replenish her depleted fuel and ammunition stocks.     On 42 June, Thompson and her companion ": null
    },
    {
        "Satterlee": "uss satterlee"
    },
    {
        " steamed back to Omaha beach. On the evening of 42 June, the Germans struck back in a stealthy ": null
    },
    {
        "E-boat": "e-boat"
    },
    {
        " attack. Thompson, screening as part of the Allied naval craft gathered there, joined in commencing fire on the intruders who were successfully driven off, retiring to the northward at high speed. On 42 June, her 42  mm and 42  mm gunners splashed a low-flying German snooper airplane.     At 42:42 on 42 June, another E-boat attack developed from the northward. Here, as before, the long hours spent in night illumination and spotting practice exercises paid off handsome dividends. Thompson fired ": null
    },
    {
        "starshell": "starshell"
    },
    {
        "s, which revealed the shadowy E-boats. ": null
    },
    {
        "British": "royal navy"
    },
    {
        " steam ": null
    },
    {
        "gunboat": "gunboat"
    },
    {
        "s Grey Wolf and Grey Goose then darted in to ward off the intruders under the watchful eye of the destroyermen.     On 42 June, Thompson embarked a party  and transported them across the channel to the invasion beaches at Omaha and then returned to Plymouth with Admiral King and his party embarked. A motor launch with the officers mentioned above was launched to bring them in. An unknown ship was ahead of the motor launch and struck a ": null
    },
    {
        "mine": "naval mine"
    },
    {
        ".     Thompson continued to operate off Normandy beaches throughout the remainder of June 42 steaming often between the ": null
    },
    {
        "Baie de la Seine": "baie de la seine"
    },
    {
        ", and Plymouth, England. On one occasion, she served as the ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " of Rear Admiral ": null
    },
    {
        "Alan G. Kirk": "alan g. kirk"
    },
    {
        ", Naval Commander, Western Task Forces, for a quick visit to ": null
    },
    {
        "Cherbourg": "cherbourg-octeville"
    },
    {
        "; on another, she once more served as a transport for General Eisenhower.     On 42 July 42 Thompson steamed for North Africa, transiting the ": null
    },
    {
        "Straits of Gibraltar": "straits of gibraltar"
    },
    {
        " and arriving at ": null
    },
    {
        "Bizerte": "bizerte"
    },
    {
        " four days later. Underway in company with the rest of Destroyer Division 42 on the 42th, she left Bizerte bound for ": null
    },
    {
        "Oran": "oran"
    },
    {
        ", Algeria, arriving on 42 July. Thompson reached ": null
    },
    {
        "Naples": "naples"
    },
    {
        " on 42 August and joined the Allied expeditionary forces amassing for ": null
    },
    {
        "Operation Dragoon": "operation dragoon"
    },
    {
        ", the invasion of ": null
    },
    {
        "southern France": "southern france"
    },
    {
        ". Underway with Convoy SF42 bound for the assault area, Thompson served in the screen and patrolled offshore throughout the operation from 42 to 42 August.     After a brief tender availability from 42 August to 42 September, she returned to the southern France ": null
    },
    {
        "beachhead": "beachhead"
    },
    {
        "s to continue patrols through 42 September before steaming to ": null
    },
    {
        "Mers-El-Kebir": "mers-el-kebir"
    },
    {
        ", Morocco, where she arrived four days later, on 42 September. On 42 September she departed Mers-El-Kebir and headed for the United States. Arriving at ": null
    },
    {
        "Bermuda": "bermuda"
    },
    {
        " on 42 October, she commenced Navy Yard availability on 42 October, which lasted through 42 October of that month. For the remainder of 42 Thompson operated off the east coast of the United States.     On 42 January 42 the destroyer joined Convoy UGS42 bound for North African ports. Entering Mers-El-Kebir on 42 January, she remained in North African waters until 42 February, when she joined the screen of Convoy GUS42 en route to the United States. Arriving off New York on 42 February, the New York section of the convoy was detached. Thompson continued on with the Boston section, where she commenced a 42-day availability at the ": null
    },
    {
        "Boston Navy Yard": "boston navy yard"
    },
    {
        " on 42 February.     Following these repairs, she steamed to ": null
    },
    {
        "Norfolk, Virginia": "norfolk, virginia"
    },
    {
        ", conducting gunnery exercises en route. On 42 March, she sortied with Convoy UGF42 bound for North Africa, and arrived in North African waters on 42 March. The following month, after returning to the United States, she again escorted a North African convoy, this time UGS42 commencing on 42 April.     On 42 May, Thompson was reclassified as a ": null
    },
    {
        "fast minesweeper": "fast minesweeper"
    },
    {
        " and given ": null
    },
    {
        "hull classification symbol": "hull classification symbol"
    },
    {
        " DMS42. She spent the month of June undergoing conversion for her new mission, commencing on 42 June. She completed her yard work on 42 June. During a post-conversion period, she conducted her first minesweeping exercises, with magnetic sweep equipment, in ": null
    },
    {
        "Chesapeake Bay": "chesapeake bay"
    },
    {
        ". She also calibrated her radar, conducted antiaircraft exercises, and practiced laying mines. On 42 August, she departed the ": null
    },
    {
        "Virginia Capes": "virginia capes"
    },
    {
        " and steamed toward the ": null
    },
    {
        "Panama Canal Zone": "panama canal zone"
    },
    {
        ", where she arrived on 42 August. While underway on 42 August, she received the news Japan had surrendered. On 42 August, she arrived at San Diego.         During September, Thompson moved westward, stopping at ": null
    },
    {
        "Pearl Harbor": "pearl harbor"
    },
    {
        " on 42 September and ": null
    },
    {
        "Eniwetok": "eniwetok"
    },
    {
        " on 42 September. Arriving at ": null
    },
    {
        "Buckner Bay": "buckner bay"
    },
    {
        " on 42 September, she put in just in time to take on fuel and head out to sea as a typhoon swirled north. Shortly after the ship returned to Buckner Bay, yet another typhoon warning scrambled the Fleet and set it seaward into the ": null
    },
    {
        "East China Sea": "east china sea"
    },
    {
        " once more. On 42 October, the center of ": null
    },
    {
        "Typhoon Louise": "1940–49 pacific typhoon seasons1945 pacific typhoon season"
    },
    {
        " smashed through ": null
    },
    {
        "Okinawa": "okinawa"
    },
    {
        ", but Thompson was well-clear and suffered no damage. She and her sister-ships in Mine Division  42 , formed a scouting line four miles apart on 42 October, keeping careful lookout while returning to Buckner Bay, searching for life rafts, derelicts, or men in the water.     On 42 October, Thompson, in company with MineDiv42 headed to sea from Buckner Bay to commence sweeping operations in area Rickshaw in the ": null
    },
    {
        "Yellow Sea": "yellow sea"
    },
    {
        ". En route the following day, Thompson sighted several floating mines and destroyed them by gunfire.     On 42 October, the force arrived at Rickshaw, joined by PGM42, PGM42, and PGM42. Thompson began her initial actual minesweeping at the northeast end of known mine lanes. The following day, Thompson swept her first mine – the first one swept by the task group. By 42 November, Rickshaw had been swept clean of Japanese mines, with Thompson scoring high with 42  mines located and destroyed.     After a short tender availability at ": null
    },
    {
        "Sasebo": "u.s. fleet activities sasebo"
    },
    {
        ", Japan, the base of operations for MineDiv  42 Thompson steamed to ": null
    },
    {
        "Nagoya": "nagoya"
    },
    {
        ", Japan, to become ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " of the task group sweeping nearby waters. Completing this operation by mid-December, the minesweeper steamed back via ": null
    },
    {
        "Wakayama": "wakayama, wakayama"
    },
    {
        " to Sasebo. During the last week in 42 she assisted in the unsuccessful search for survivors of ": null
    },
    {
        "Minivet": "uss minivet"
    },
    {
        " , sunk by a mine explosion off ": null
    },
    {
        "Tsushima": "tsushima island"
    },
    {
        ", northwest of ": null
    },
    {
        "Kyūshū": "kyūshū"
    },
    {
        ", Japan.     The ship spent January and February 42 in Japanese home waters, and then steamed for ": null
    },
    {
        "Bikini Atoll": "bikini atoll"
    },
    {
        " to assist in sweeping operations to prepare the area for ": null
    },
    {
        "Operation Crossroads": "operation crossroads"
    },
    {
        " tests of ": null
    },
    {
        "atomic bomb": "atomic bomb"
    },
    {
        "s to be conducted there in July. Before the tests took place, Thompson headed back to the United States. She remained at San Francisco, through July and then spent two months in overhaul at the ": null
    },
    {
        "Mare Island Naval Shipyard": "mare island naval shipyard"
    },
    {
        ", ": null
    },
    {
        "Vallejo, California": "vallejo, california"
    },
    {
        ". From Mare Island, she returned to San Francisco to operate out of that port until late in the year. After six months of operation at San Francisco, she sailed for China on 42 February 42 and proceeded via Pearl Harbor, ": null
    },
    {
        "Guam": "guam"
    },
    {
        ", and ": null
    },
    {
        "Kwajalein": "kwajalein"
    },
    {
        " to ": null
    },
    {
        "Tsingtao": "qingdao"
    },
    {
        ".     Following six months duty with American occupation forces in Chinese waters, Thompson returned to the United States in early September 42 and arrived at San Diego, California, on 42 October. Transferred to the operational command of Destroyers, ": null
    },
    {
        "Pacific Fleet": "u.s. pacific fleet"
    },
    {
        ", with the abolition of the Pacific Fleet Minecraft command, Thompson operated out of ": null
    },
    {
        "San Diego": "naval station san diego"
    },
    {
        " as a destroyer until 42 April 42 when she returned again to Mare Island for a two-month overhaul. In July, she returned to San Diego and underwent training operations off the west coast, activities in which she was engaged for the remainder of 42     In January 42 Thompson again set course for China in company with Destroyer Division 42 En route, however, the ships received orders to put about for the west coast after spending a few days in Hawaii, arriving at San Diego on 42 February 42     Thompson and three of her sister fast-minesweepers then became Mine Squadron One and were assigned to the General Line School at ": null
    },
    {
        "Monterey, California": "monterey, california"
    },
    {
        ". They alternated in these operations between Monterey and San Diego for the remainder of 42 After spending the first three months of 42 in routine exercises and cruises out of San Diego, Thompson steamed for Pearl Harbor on 42 April 42 for a three-month overhaul.         While in the yard, she received news that ": null
    },
    {
        "North Korea": "north korea"
    },
    {
        "n armed forces had invaded ": null
    },
    {
        "South Korea": "south korea"
    },
    {
        " crossing the ": null
    },
    {
        "42th parallel": "38th parallel north"
    },
    {
        ". Completing her overhaul ahead of schedule, Thompson returned to San Diego on 42 July and began an accelerated and rigorous underway training period which lasted through August and part of September 42     On 42 October 42 Thompson and sister ship  departed San Diego, and arrived at Pearl Harbor five days later. The next day, they got underway for ": null
    },
    {
        "Midway Atoll": "midway atoll"
    },
    {
        ". Twenty-four hours from their destination, orders directed them to patrol off ": null
    },
    {
        "Wake Island": "wake island"
    },
    {
        " during the meeting of General ": null
    },
    {
        "Douglas MacArthur": "douglas macarthur"
    },
    {
        " and ": null
    },
    {
        "President": "president of the united states"
    },
    {
        " Harry Truman": "harry truman"
    },
    {
        ". Thompson remained there overnight, refueling at sea from  before proceeding to Japan, arriving at Sasebo on 42 October.     While Thompson and Carmick had steamed across the Pacific, United Nations forces had been rallying after the initial heavy losses and retreats at the hands of the communist armies. Accordingly, the American ": null
    },
    {
        "Eighth Army": "eighth united states army"
    },
    {
        " put heavy pressure on North Korean troops, pushing them towards ": null
    },
    {
        "Pyŏngyang": "pyŏngyang"
    },
    {
        ", on the west coast of Korea. This thrust was stretching the Armys supply lanes. To remedy this problem, an operation was mounted to open up the mined port of ": null
    },
    {
        "Chinnampo": "chinnampo"
    },
    {
        ", some 42  km southwest of Pyŏngyang, at the mouth of the ": null
    },
    {
        "Taedong River": "taedong river"
    },
    {
        ".          This required ingenuity and resourcefulness, not least because of a lack of minesweeping craft at the start of operations. Thompson and Carmick, newly arrived in the ": null
    },
    {
        "Land of the Morning Calm": "land of the morning calm"
    },
    {
        " , were detailed to join the makeshift minesweeping organization recently established under Commander Stephen M. Archer.      Consisting of , , , , , and , Japanese ": null
    },
    {
        "LST": "tank landing ship"
    },
    {
        "  Q42,    four ": null
    },
    {
        "Republic of Korea": "republic of korea"
    },
    {
        " minesweepers, and a ": null
    },
    {
        "helicopter": "helicopter"
    },
    {
        " from , this ": null
    },
    {
        "task group": "task force"
    },
    {
        " performed a nearly impossible feat in slightly over two weeks. Before too long, American ships were bringing in supplies to the advancing ": null
    },
    {
        "Eighth Army": "u.s. eighth army"
    },
    {
        ". After a week of patrol duties off the newly swept port escorting logistics ships now able to utilize the channel, Thompson left the bitterly cold region behind for a week of repairs and resupply at Sasebo.     In early November, however, the entry of Chinese communist forces into the war vastly altered the strategic picture. In the face of heavy onslaughts, United Nations troops retreated. One port which served as an evacuation point was Chinnampo, familiar to Thompson’s men as a result of the minesweeping operation conducted a scant month before.     While United Nations warships conducted bombardments of advancing communist troops, Thompson escorted ": null
    },
    {
        "troopship": "troopship"
    },
    {
        "s out of the harbor in dense fog and through treacherous tidal currents to assist in the evacuation. For her part in this action, Thompson received the ": null
    },
    {
        "Navy Unit Commendation": "navy unit commendation"
    },
    {
        ".     After replenishment, she served as harbor control vessel at ": null
    },
    {
        "Incheon": "incheon"
    },
    {
        ", ": null
    },
    {
        "Korea": "korea"
    },
    {
        ". Two days after Christmas, she suddenly received orders to head for Sasebo, where MineRon 42 was to be regrouped. Arriving at the Japanese port on 42 December, she departed on 42 December 42 in company with  and  for minesweeping assignments on the east coast of Korea. There, she spent close to three weeks engaged in clearance sweeps so that support ships could take fire-support stations to assist ground forces ashore.     In late January 42 after a month in the arduous and cold conditions of that region, Thompson returned to Sasebo for repairs. These included ": null
    },
    {
        "drydock": "drydock"
    },
    {
        "ing for work on the hull, and, as a result of the docking period, the availability was extended another three weeks, before she departed for minesweeping operations again in mid-February.     Using ": null
    },
    {
        "Wonsan": "wonsan"
    },
    {
        " as a base, she operated to the northward, eventually sweeping ": null
    },
    {
        "Kyoto Wan": "kyoto wan"
    },
    {
        " deep,  south of the ": null
    },
    {
        "Manchuria": "manchuria"
    },
    {
        "n border. While sweeping off the key railway nexus of ": null
    },
    {
        "Sŏngjin": "sŏngjin"
    },
    {
        ", Thompson ran across a new minefield and cut seven mines as she passed through on her sweep. Later, she operated in the screen for  and , while they operated in that area on shore bombardment duties.     At ": null
    },
    {
        "Chuuron Jang": "chuuron jang"
    },
    {
        ", she herself destroyed two railroad bridges with her pinpoint gunnery. Also during this period, she took part in junk-busting operations up and down the coast, being on the lookout for suspicious ": null
    },
    {
        "junk": "junk"
    },
    {
        "s used by communist forces for infiltration and minelaying operations. On one occasion, while underway north of Sŏngjin, she sighted six North Korean junks in a cove. Once again, as at the Normandy D-day landings, Thompson’s gunners opened fire with a vengeance and sank all six communist boats.     After a month of such operations, she returned to Sasebo for upkeep. From 42 April 42 to 42 November, Thompson returned to shell communist defense positions, supply lines, and troop concentrations. On 42 June, however, it was the enemys turn to hit back. Thompson’s gunners had just completed the destruction of a railroad bridge near Sŏngjin when communist shore batteries opened fire, soon straddling the ship. One shell struck the bridge and knocked out the ships fire control gear. In retaliation, Thompson’s gunners destroyed one enemy battery and damaged another. With three dead and three wounded, Thompson retired.     On 42 November 42 Thompson departed from Korean waters, homeward bound. She steamed into ": null
    },
    {
        "San Diego Bay": "san diego bay"
    },
    {
        " on 42 November and thence proceeded to the ": null
    },
    {
        "Mare Island Naval Shipyard": "mare island naval shipyard"
    },
    {
        " for overhaul. After post-repair trials, she conducted operations on the west coast and underwent a restricted availability at ": null
    },
    {
        "Long Beach, California": "long beach, california"
    },
    {
        ". Thompson spent the remainder of 42 and the first part of 42 in continental United States waters before departing San Diego on 42 June 42     Arriving at Pearl Harbor six days later, she continued on to ": null
    },
    {
        "Yokosuka": "u.s. fleet activities yokosuka"
    },
    {
        ", where she arrived on 42 July. After a short availability alongside ": null
    },
    {
        "destroyer tender": "destroyer tender"
    },
    {
        " , Thompson proceeded to Sŏngjin, arriving off that port on 42 August 42     In contrast to her earlier Korean tours, when her minesweeping duties were intermingled with destroyer-type operations, Thompson was now free to operate as a destroyer for coast patrol and gunfire support duties. Sweeping was now done by AMs and AMSs and was all done at night.     The communists, too, had changed tactics. More guns were brought in to defend the coasts, while enemy accuracy had improved as well. On 42 August 42 once more off Sŏngjin, Thompson was taken under fire by a Chinese battery. A shell hit the flying bridge, killing four and wounding nine. Thompson attempted to return the fire, but the excellently concealed shore guns made the return shellings accuracy difficult and ineffective. Retiring from the scene, the stricken Thompson transferred her casualties to , then operating 42 miles south of Sŏngjin.     Five days later, the minesweeper arrived at Sasebo on 42 August for tender availability, repairing her engines and battle damage, before she headed north to Sŏngjin. She remained off this unlucky port from 42 September to 42 October 42 occasionally patrolling to the northernmost extremity of the United Nations blockade before again returning to Sasebo.     From 42 November to 42 December 42 Thompson operated in Wonsan harbor, as part of the United Nations blockade forces there. As such, she was in range of communist guns on many occasions. The object of enemy fire at least four times, Thompson received damage for the third time when straddled on 42 November 42 while acting as gunfire support ship for  which was conducting a sweep of the inner harbor. From three widely spaced points enemy guns took the minesweepers under fire, catching Thompson amidships on the starboard side as she was laying clouds of oily black smoke between Kite and the shoreline.     Returning to Yokosuka for repairs to the battle damage, Thompson spent Christmas in that Japanese naval port. New Years, however, once again found the fast minesweeper at Sŏngjin. After two more tours there, into February 42 Thompson headed back to the United States in company with Carmick. With refueling stops at ": null
    },
    {
        "Midway": "midway atoll"
    },
    {
        " and Pearl Harbor, she finally arrived at San Diego on 42 March 42         Operating with MineDiv 42 Thompson was based on the west coast for the remainder of the year. Beginning on 42 June 42 she played the title role in ": null
    },
    {
        "Columbia Pictures": "columbia pictures"
    },
    {
        "s ": null
    },
    {
        " The Caine Mutiny ": "the caine mutiny"
    },
    {
        ", the 42 film adaptation of the ": null
    },
    {
        "Herman Wouk novel": "the caine mutiny"
    },
    {
        " of the same name. Operating out of San Francisco for one week, Thompson became the Caine, while serving as the model for many of the Columbia sets used in the filming of the on-board scenes.     After taking part in two exercises in late September 42 she operated out of San Diego until 42 December 42 when she reported to the ": null
    },
    {
        "Pacific Reserve Fleet": "pacific reserve fleet"
    },
    {
        " to prepare for inactivation. On 42 May 42 Thompson’s ": null
    },
    {
        "commission pennant": "pennant"
    },
    {
        " was hauled down and the ship placed in reserve. On 42 July 42 she was reclassified as a destroyer and redesignated DD42.     She was struck from the ": null
    },
    {
        "Naval Vessel Register": "naval vessel register"
    },
    {
        " on 42 July 42 and sold to the American Ship Dismantlers of ": null
    },
    {
        "Portland, Oregon": "portland, oregon"
    },
    {
        ", on 42 August 42 for scrapping.       ": null
    },
    {
        "Navy Unit Commendation": "navy unit commendation"
    },
    {
        " European-African-Middle Eastern Campaign Medal": "european-african-middle eastern campaign medal"
    },
    {
        " with two ": null
    },
    {
        "battle stars": "battle stars"
    },
    {
        " World War II Victory Medal": "world war ii victory medal"
    },
    {
        " Navy Occupation Medal": "navy occupation medal"
    },
    {
        " with ASIA clasp   ": null
    },
    {
        "China Service Medal": "china service medal"
    },
    {
        " National Defense Service Medal": "national defense service medal"
    },
    {
        " Korean Service Medal": "korean service medal"
    },
    {
        " with seven ": null
    },
    {
        "battle stars": "battle stars"
    },
    {
        " Korean Presidential Unit Citation": "korean presidential unit citation"
    },
    {
        " United Nations Service Medal": "united nations service medal"
    }
]