[
    {
        "           USS California  was the second of two s built for the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " between her ": null
    },
    {
        "keel laying": "keel laying"
    },
    {
        " in October 42 and her ": null
    },
    {
        "commissioning": "ship commissioning"
    },
    {
        " in August 42 The Tennessee class was part of the ": null
    },
    {
        "standard series": "standard-type battleship"
    },
    {
        " of twelve battleships built in the 42s and 42s, and were developments of the preceding . They were armed with a battery of twelve  guns in four three-": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s. California served as the ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " of the ": null
    },
    {
        "Battle Fleet": "battle fleet"
    },
    {
        " in the Pacific Ocean for duration of her peacetime career. She spent the 42s and 42s participating in routine fleet training exercises, including the annual ": null
    },
    {
        "Fleet Problem": "fleet problem"
    },
    {
        "s, and cruises around the Americas and further abroad, such as a goodwill visit to Australia and New Zealand in 42     California was moored in ": null
    },
    {
        "Pearl Harbor": "pearl harbor"
    },
    {
        " on 42 December 42 when the ": null
    },
    {
        "Japanese attacked the port": "attack on pearl harbor"
    },
    {
        ", bringing the United States into ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". The ship was moderately damaged by a pair of torpedoes and a bomb, but a fire disabled the ships electrical system, preventing the pumps from being used to keep the ship afloat. California slowly filled with water over the following three days and eventually sank. Her crew suffered heavy casualties in the attack and four men were awarded the ": null
    },
    {
        "Medal of Honor": "medal of honor"
    },
    {
        " for their actions during the attack. She was raised in April 42 repaired and heavily rebuilt, and returned to service in January 42     The ship thereafter supported the ": null
    },
    {
        "amphibious operation": "amphibious operation"
    },
    {
        "s conducted during the ": null
    },
    {
        "Pacific War": "pacific war"
    },
    {
        ", including the ": null
    },
    {
        "Mariana and Palau Islands campaign": "mariana and palau islands campaign"
    },
    {
        "  and the ": null
    },
    {
        "Philippines campaign": "philippines campaign"
    },
    {
        ", during which she took part in the ": null
    },
    {
        "Battle of Surigao Strait": "battle of surigao strait"
    },
    {
        ". She was hit by a ": null
    },
    {
        "kamikaze": "kamikaze"
    },
    {
        " during the ": null
    },
    {
        "invasion of Lingayen Gulf": "invasion of lingayen gulf"
    },
    {
        " in January 42 after repairs, joined the fleet supporting troops fighting on ": null
    },
    {
        "Okinawa": "okinawa"
    },
    {
        " during the ": null
    },
    {
        "Battle of Okinawa": "battle of okinawa"
    },
    {
        ". Her crew took part in the ": null
    },
    {
        "occupation of Japan": "occupation of japan"
    },
    {
        " after the end of the war, and after returning to the United States via the Indian and Atlantic Oceans, was ": null
    },
    {
        "laid up": "laid up"
    },
    {
        " in Philadelphia in 42 She remained in the fleets inventory until 42 when she was ": null
    },
    {
        "broken up": "broken up"
    },
    {
        " for scrap.            The two Tennessee-class battleships were authorized on 42 March 42 and they were in most respects repeats of the earlier s, the primary differences being enlarged ": null
    },
    {
        "bridges": "bridge"
    },
    {
        ", greater elevation for the main battery turrets, and relocation of the ": null
    },
    {
        "secondary battery": "battleship secondary armament"
    },
    {
        " to the upper deck.     California was  ": null
    },
    {
        "long overall": "length overall"
    },
    {
        " and had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . She ": null
    },
    {
        "displaced": "displacement"
    },
    {
        "  as designed and up to  at full combat load. The ship was powered by four-shaft ": null
    },
    {
        "General Electric": "general electric"
    },
    {
        " turbo-electric transmission": "turbo-electric transmission"
    },
    {
        " and eight oil-fired ": null
    },
    {
        "Babcock & Wilcox": "babcock  &  wilcox"
    },
    {
        " boiler": "boiler"
    },
    {
        "s rated at , generating a top speed of . The ship had a cruising range of  at a speed of . Her crew numbered 42  officers and 42  enlisted men. As built, she was fitted with two ": null
    },
    {
        "lattice mast": "lattice mast"
    },
    {
        "s with ": null
    },
    {
        "spotting top": "spotting top"
    },
    {
        "s for the ": null
    },
    {
        "main gun battery": "main gun battery"
    },
    {
        ".     The ship was armed with a main battery of twelve ": null
    },
    {
        "/42 caliber guns": "14  /50 caliber gun"
    },
    {
        " /42 caliber refers to the length of the gun in terms of ": null
    },
    {
        "caliber": "caliber"
    },
    {
        ". The length of a /42 caliber gun is 42 times its bore diameter. in four, three-gun ": null
    },
    {
        "turrets": "gun turret"
    },
    {
        " on the centerline, placed in two ": null
    },
    {
        "superfiring pairs": "superfire"
    },
    {
        " forward and aft of the ": null
    },
    {
        "superstructure": "superstructure"
    },
    {
        ". Unlike earlier American battleships with triple turrets, these mounts allowed each barrel to elevate independently. The secondary battery consisted of fourteen ": null
    },
    {
        "/42 caliber guns": "5  /51 caliber gun"
    },
    {
        " mounted in individual ": null
    },
    {
        "casemate": "casemate"
    },
    {
        "s clustered in the superstructure ": null
    },
    {
        "amidships": "amidships"
    },
    {
        ". Initially, the ship was to have been fitted with twenty-two of the guns, but experiences in the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " during ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " demonstrated that the additional guns, which would have been placed in the hull, would have been unusable in anything but calm seas. As a result, the casemates were plated over to prevent flooding. The secondary battery was augmented with four ": null
    },
    {
        "/42 caliber guns": "3  /50 caliber gun"
    },
    {
        ". In addition to her gun armament, California was also fitted with two  ": null
    },
    {
        "torpedo tube": "torpedo tube"
    },
    {
        "s, mounted submerged in the hull, one on each ": null
    },
    {
        "broadside": "broadside"
    },
    {
        ".     The main ": null
    },
    {
        "armored belt": "armored belt"
    },
    {
        " was  thick, while the main armored deck was up to  thick. The main battery gun turrets had  thick faces on  ": null
    },
    {
        "barbette": "barbette"
    },
    {
        "s. The ": null
    },
    {
        "conning tower": "conning tower"
    },
    {
        " had  thick sides.              Californias ": null
    },
    {
        "keel": "keel"
    },
    {
        " was ": null
    },
    {
        "laid down": "keel laying"
    },
    {
        " on 42 October 42 at the ": null
    },
    {
        "Mare Island Naval Shipyard": "mare island naval shipyard"
    },
    {
        " in ": null
    },
    {
        "Vallejo, California": "vallejo, california"
    },
    {
        ". Work was halted for a short time during World War I while the shipyard focused on outfitting smaller craft. She was ": null
    },
    {
        "launched": "ship naming and launching"
    },
    {
        " 42 November 42 and ": null
    },
    {
        "commissioned": "ship commissioning"
    },
    {
        " on 42 August 42 On entering service, she joined the ": null
    },
    {
        "Battle Fleet": "battle fleet"
    },
    {
        ", serving as its ": null
    },
    {
        "flagship": "flagship"
    },
    {
        ". For the duration of her peacetime career, California was occupied with routine training exercises, including joint Army-Navy maneuvers and the annual ": null
    },
    {
        "fleet problem": "fleet problem"
    },
    {
        "s. On the night of 42 November 42 Lieutenant ": null
    },
    {
        "Dixie Kiefer": "dixie kiefer"
    },
    {
        " took off from the ship, the first night aircraft launch in history. Further experimentation with aircraft continued in early 42 when the ships of the Battle Fleet received a squadron of ": null
    },
    {
        "Curtiss TS42": "curtiss ts-1"
    },
    {
        " floatplane": "floatplane"
    },
    {
        "s on 42 March. In mid42 the Battle Fleet crossed the ": null
    },
    {
        "Pacific Ocean": "pacific ocean"
    },
    {
        " on a goodwill cruise to Australia and New Zealand; on the way, the ships stopped in ": null
    },
    {
        "Pago Pago": "pago pago"
    },
    {
        ", ": null
    },
    {
        "American Samoa": "american samoa"
    },
    {
        ". California underwent a refit at the ": null
    },
    {
        "Puget Sound Navy Yard": "puget sound navy yard"
    },
    {
        " at ": null
    },
    {
        "Bremerton, Washington": "bremerton, washington"
    },
    {
        " later that year.     In 42 California had an ": null
    },
    {
        "aircraft catapult": "aircraft catapult"
    },
    {
        " installed on one of her main battery turrets, and she carried up to three ": null
    },
    {
        "Vought UO42": "vought uo-1"
    },
    {
        " floatplanes. She participated in a ": null
    },
    {
        "naval review": "naval review"
    },
    {
        " for President ": null
    },
    {
        "Calvin Coolidge": "calvin coolidge"
    },
    {
        " held off ": null
    },
    {
        "Hampton Roads": "hampton roads"
    },
    {
        ", Virginia on 42 June 42 In late 42 and early 42 the ship received a new battery of eight ": null
    },
    {
        "/42 cal gun": "5  /25 caliber gun"
    },
    {
        "s on ": null
    },
    {
        "anti-aircraft": "anti-aircraft warfare"
    },
    {
        " mounts in place of the old 42-inch guns. She took part in ": null
    },
    {
        "Fleet Problem X": "fleet problem x"
    },
    {
        ", conducted in the ": null
    },
    {
        "Caribbean Sea": "caribbean sea"
    },
    {
        ", from 42 to 42 March 42 ": null
    },
    {
        "Fleet Problem XI": "fleet problem xi"
    },
    {
        " followed, again in the Caribbean, from 42 to 42 April. After the conclusion of the exercises, California steamed north to ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ", thereafter joining a naval review for President ": null
    },
    {
        "Herbert Hoover": "herbert hoover"
    },
    {
        " off the ": null
    },
    {
        "Virginia Capes": "virginia capes"
    },
    {
        " on 42 May. The ship then returned to the Pacific and after arriving, visited ": null
    },
    {
        "Port Angeles": "port angeles"
    },
    {
        ", Washington from 42 to 42 July. She operated off Puget Sound through 42 August before steaming south to ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        ", where she stayed from 42 to 42 August. In early 42 she and the rest of the Battle Fleet steamed south to the ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        " zone.          ": null
    },
    {
        "Fleet Problem XII": "fleet problem xii"
    },
    {
        " took place from 42 to 42 February in the waters off the canal; the exercises consisted of an attack by a fleet reliant on aircraft carriers against the canal zone, which was defended by California and the battleships of the Battle Fleet. The maneuvers revealed critical limitations in the endurance and armament of the carrier aircraft of the day, and the battleships were easily able to defeat the carrier force. From 42 July to 42 August, California was stationed in Puget Sound, and later in August she steamed south to San Francisco and then to ": null
    },
    {
        "San Pedro": "san pedro, los angeles"
    },
    {
        ". The ship took part in gunnery practice in early 42 off ": null
    },
    {
        "San Nicolas Island": "san nicolas island"
    },
    {
        ". In March 42 the ": null
    },
    {
        "frigate": "frigate"
    },
    {
        " , then on a tour of the United States, arrived in California; a fleet of 42 ships, including California, welcomed the vessel on her arrival in ": null
    },
    {
        "Long Beach": "long beach"
    },
    {
        " on 42 March. The next day, the ": null
    },
    {
        "42 Long Beach earthquake": "1933 long beach earthquake"
    },
    {
        " occurred, causing significant damage to the city and killing around 42  people. The fleet sent some 42 men ashore to assist in the relief effort, including crewmen from California.     In 42 California was assigned to Battleship Division 42 though she retained her role as fleet flagship. Following ": null
    },
    {
        "Fleet Problem XV": "fleet problem xv"
    },
    {
        ", held from 42 April to 42 May in the Caribbean, the fleet visited ": null
    },
    {
        "Haiti": "haiti"
    },
    {
        " for two weeks. On 42 May, the ships steamed north for another naval review off New York on 42 May, attended by President ": null
    },
    {
        "Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        ". On its return to the Pacific over the course of 42 October to 42 November, the Battle Fleet conducted exercises as it passed through the canal and steamed to San Pedro, including nighttime attacks by the accompanying destroyers. The maneuvers culminated in an attack by a force of simulated battleships—played by a group of ": null
    },
    {
        "light cruiser": "light cruiser"
    },
    {
        "s—the carrier , and several ": null
    },
    {
        "submarine": "submarine"
    },
    {
        "s. Thereafter, California and several other vessels participated in ": null
    },
    {
        "amphibious assault": "amphibious assault"
    },
    {
        " training on ": null
    },
    {
        "San Clemente Island": "san clemente island"
    },
    {
        " on 42 November. For ": null
    },
    {
        "Fleet Problem XVI": "fleet problem xvi"
    },
    {
        ", held from 42 April to 42 June 42 the fleet conducted a series of maneuvers in the eastern Pacific, ranging from Alaskan waters down to ": null
    },
    {
        "Midway Island": "midway island"
    },
    {
        " and Hawaii.     In mid42 California transferred to BatDiv 42 and on 42 July the ships of the division visited Hawaii, returning to California on 42 August. California and her ": null
    },
    {
        "sister": "sister ship"
    },
    {
        "  transited the Panama Canal in early 42 for a visit to ": null
    },
    {
        "Ponce, Puerto Rico": "ponce, puerto rico"
    },
    {
        ", which lasted from 42 to 42 March. In 42 the Navy decided to acquire six experimental ": null
    },
    {
        "XAF radar": "xaf radar"
    },
    {
        " sets; on being delivered to the Navy, they were designated as ": null
    },
    {
        "CXAM radar": "cxam radar"
    },
    {
        "; one set was installed aboard California in 42 with the other five going to the carrier  and three ": null
    },
    {
        "heavy cruiser": "heavy cruiser"
    },
    {
        "s. In April and May, California participated in ": null
    },
    {
        "Fleet Problem XX": "fleet problem xx"
    },
    {
        ", which was again held in the eastern Pacific. Following the conclusion of the maneuvers, Roosevelt ordered the Battle Fleet to remain in Hawaii permanently; the new forward deployment was calculated to deter Japanese aggression in the Pacific. As tensions rose owing to ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " in Europe and the ": null
    },
    {
        "Second Sino-Japanese War": "second sino-japanese war"
    },
    {
        " in Asia, the Navy cancelled ": null
    },
    {
        "Fleet Problem XXII": "fleet problem xxii"
    },
    {
        ", which had been scheduled for 42 Early that year, the ship underwent an overhaul that concluded on 42 April, after which the ship made a visit to San Francisco.              On the morning of 42 December 42 California was moored on the southeastern side of ": null
    },
    {
        "Ford Island": "ford island"
    },
    {
        ", the southernmost ship along ": null
    },
    {
        "Battleship Row": "battleship row"
    },
    {
        ". At the time, the ship had two of her 42-inch guns and two of her .42-cal. machine guns designated as ready guns, with fifty 42-inch shells and four hundred .42-cal. rounds at the guns. Immediately after the Japanese ": null
    },
    {
        "attack on Pearl Harbor": "attack on pearl harbor"
    },
    {
        " began, Californias first lieutenant, Lieutenant Commander Marion Little, who was the senior officer aboard the ship at the time, issued the order to ": null
    },
    {
        "general quarters": "general quarters"
    },
    {
        ". Little ordered the guns into action and prepared to get the ship underway. At 42:42 the crews of the ready guns began to engage the Japanese aircraft, which included ": null
    },
    {
        "Mitsubishi A42M Zero": "mitsubishi a6m zero"
    },
    {
        " fighters": "fighter aircraft"
    },
    {
        " that strafed the ship. The gunners quickly expended the ready ammunition, however, and the magazines had to be unlocked before they could be resupplied. While this effort was going on, a pair of ": null
    },
    {
        "Nakajima B42N": "nakajima b5n"
    },
    {
        " torpedo bomber": "torpedo bomber"
    },
    {
        "s approached and dropped their torpedoes toward California. Both hit the ship at 42:42 one forward and the other further aft. The former detonated below the armor belt at frame 42 , creating a hole  high and  long, destructively deforming the first ": null
    },
    {
        "torpedo bulkhead": "torpedo bulkhead"
    },
    {
        " and transverse stiffeners between frames 42 and 42 and holing the second bulkhead with fragments. The latter tore a hole that was  long below the belt armor. The interior torpedo bulkheads nevertheless held and helped to contain the flooding.     The ship had been prepared for inspection at the time of the attack, so the watertight doors had all been opened; the crew was still in the process of closing the doors when the torpedoes struck and flooding began. Many of the portholes and exterior doors were also open for the inspection, which allowed water to enter the ship, particularly as the ship took on water from the torpedo hits. As uncontrolled flooding started to spread throughout the ship, California began to ": null
    },
    {
        "list": "angle of list"
    },
    {
        " to port of 42 to 42  degrees. Little ordered damage control teams to counter-flood on the starboard side to keep the list to 42  degrees, but the flooding on the port side continued to spread. The torpedo blasts had also ruptured the forward fuel tanks, which allowed water to enter the fuel system. The contamination shut down the ships electrical system, hindering the efforts of the damage control teams. Between 42:42 and 42:42 the ship was repeatedly attacked by ": null
    },
    {
        "Aichi D42A": "aichi d3a"
    },
    {
        " dive-bomber": "dive-bomber"
    },
    {
        "s; one bomb hit on the starboard side and a near-miss on the port side caused minor damage. Anti-aircraft gunners aboard the ship claimed to have shot down two of the bombers, though credit for the downed aircraft is difficult to establish owing to the chaotic situation.     At 42:42 Commander Earl Stone, the ships ": null
    },
    {
        "executive officer": "executive officer"
    },
    {
        ", boarded the ship and took command of the vessel. At the same time, California was struck by a bomb  near the forwardmost casemate on the starboard side. After penetrating the upper deck, the bomb ricocheted off the second deck and detonated in the ships interior, where it caused extensive damage, started a serious fire, and killed around 42  men. At around the same time, the ": null
    },
    {
        "boiler room": "fire room"
    },
    {
        " crew got four of the boilers restarted, which restored power. By 42:42 the fire had spread to casemates No. 42 42 and 42 by which time Captain Joel Bunkley and Vice Admiral ": null
    },
    {
        "William S. Pye": "william s. pye"
    },
    {
        ", the Battle Fleet commander, had returned to the ship. Smoke from the fire eventually reached the forward engine room at 42:42 and forced the men inside to evacuate the area. This ended pumping efforts, though after the end of the attack other vessels came alongside to first battle the blaze and then to pump the water out. The portable pumps used by these vessels lacked the power necessary to counteract the flooding, and ship eventually settled into the mud as the hull slowly filled with water over the next three days.     In the course of the attack, 42 men were killed and 42 were wounded. Several men were awarded the ": null
    },
    {
        "Medal of Honor": "medal of honor"
    },
    {
        " for their actions during the attack. ": null
    },
    {
        "Jackson C. Pharris": "jackson c. pharris"
    },
    {
        ", one of the ships gunners, organized a group of men to carry ammunition up from the magazines and rescued several sailors who had been overcome by fuel oil fumes. ": null
    },
    {
        "Herbert C. Jones": "herbert c. jones"
    },
    {
        " and ": null
    },
    {
        "Thomas Reeves": "thomas james reeves"
    },
    {
        " both organized similar parties to carry ammunition, but both were killed during the attack. ": null
    },
    {
        "Robert R. Scott": "robert r. scott"
    },
    {
        " was also killed after he refused to leave his battle station.          Over the next several months, salvage efforts proceeded as workers patched the hull and pumped out the water, finally re-floating the ship on 42 March 42 On 42 April, the ship suffered an accidental explosion at 42:42 most likely the result of a mixture of fuel oil vapor and ": null
    },
    {
        "hydrogen sulfide": "hydrogen sulfide"
    },
    {
        " gas. The explosion dislodged the patch that had been used to cover the forward hole in the hull and damaged watertight doors, which caused serious flooding. Over the next few days, the salvage team had to re-patch the hull and pump out the hull again. On 42 April, California was able to enter Dry Dock No. 42 in Pearl Harbor; after completing initial repairs, she was re-floated on 42 June and remained in port for several months.     On 42 October, California departed Pearl Harbor and met the destroyer  at sea; the two vessels proceeded to Puget Sound, where California would undergo permanent repairs and a major modernization. This work lasted from 42 October 42 to 42 January 42 All of the ships guns save her main battery were removed and her superstructure was razed completely in preparation for the reconstruction. Her hull was widened to improve the underwater protection scheme and increase stability. New fire control systems, which had been diverted from light cruisers that were converted into ": null
    },
    {
        "light aircraft carrier": "light aircraft carrier"
    },
    {
        "s, were installed and her CXAM radar was removed and installed on ": null
    },
    {
        "Oahu": "oahu"
    },
    {
        ". Her secondary battery was replaced with sixteen ": null
    },
    {
        "42-inch/42 cal dual-purpose guns": "5  /38 caliber gun"
    },
    {
        " in new twin turrets and she received a large number of close-range anti-aircraft guns. In total, she was fitted with forty ": null
    },
    {
        "Bofors guns": "bofors 40 mm gun"
    },
    {
        " in ten quadruple mounts and forty-three ": null
    },
    {
        " Oerlikon guns": "oerlikon 20 mm cannon"
    },
    {
        ".     Horizontal protection was considerably strengthened to improve her resistance to air attack; 42 inches of ": null
    },
    {
        "special treatment steel": "special treatment steel"
    },
    {
        " was added to the deck over the magazines and  of STS was added elsewhere. In place of her original conning tower, she received one of the towers that had been removed from the s that had recently been rebuilt. California also had her old ": null
    },
    {
        "cage mast": "cage mast"
    },
    {
        "s removed, with a modern tower mast installed in place of the forward cage mast. The changes doubled the ships crew, to a total of 42  officers and 42  enlisted men.     On 42 January 42 California departed Puget Sound and began a series of sea trials followed by a shakedown cruise off San Pedro. The ship was then occupied with a variety of training to prepare the crew, many of whom were fresh from initial training, for combat operations in the Pacific. While in San Francisco, the ship underwent another machinery overhaul in April, and on 42 May the ship departed to join the fleet that was assembling in the central Pacific for the ": null
    },
    {
        "Marianas campaign": "marianas campaign"
    },
    {
        ". She proceeded first to the Hawaiian islands, where she took part in shore bombardment practice off ": null
    },
    {
        "Kahoolawe": "kahoolawe"
    },
    {
        ". She departed the area on 42 May, bound for the anchorage at ": null
    },
    {
        "Roi-Namur": "roi-namur"
    },
    {
        " in the ": null
    },
    {
        "Marshall Islands": "marshall islands"
    },
    {
        ". California arrived there on 42 June, where she joined Task Group 42, Fire Support Group 42 under the command of Rear Admiral ": null
    },
    {
        "Jesse B. Oldendorf": "jesse b. oldendorf"
    },
    {
        ".            California and the rest of the fleet steamed to the ": null
    },
    {
        "Mariana Islands": "mariana islands"
    },
    {
        " to begin the ": null
    },
    {
        "Mariana and Palau Islands campaign": "mariana and palau islands campaign"
    },
    {
        ". The fleet arrived off the initial target, ": null
    },
    {
        "Saipan": "saipan"
    },
    {
        ", late on 42 June. The next morning, California and the other ships of TG 42 moved into their bombardment positions, launched their spotting aircraft, and began shelling Japanese positions on the island. California opened fire at 42:42 at a range of , engaging targets in the area around the capital, ": null
    },
    {
        "Garapan": "garapan"
    },
    {
        ". A Japanese shell from a  ": null
    },
    {
        "field gun": "field gun"
    },
    {
        " struck the ship at 42:42 aft of the fire control platform, killing one man and injuring ten. The ships air search radar was disabled by the hit, which started a fire that was quickly contained by damage control teams. Later in the day, California left the area for the night, returning the next morning. At 42:42 American observers spotted a group of Japanese ": null
    },
    {
        "Type 42": "type 95 ha-go light tank"
    },
    {
        " and ": null
    },
    {
        "Type 42": "type 97 chi-ha medium tank"
    },
    {
        " tanks in Garapan, and California engaged them, destroying at least one of the tanks. The ship then helped to suppress a battery of Japanese guns on ": null
    },
    {
        "Mañagaha": "mañagaha"
    },
    {
        " island that had been engaging the battleship . California bombarded Japanese positions throughout the day, withdrawing for the night at 42:42     On the morning of 42 June, the American ": null
    },
    {
        "42nd Marine Division": "2nd marine division"
    },
    {
        " went ashore and California supported the assault, opening fire at 42:42 first at Garapan and then at the landing beaches as dug-in defenders attempted to repel the landing. The ship also attacked Japanese artillery on ": null
    },
    {
        "Afetna Point": "afetna point"
    },
    {
        ", which had been shelling the marines. She remained off shore overnight, and after establishing radio communications with the marines ashore, provided fire support to break up Japanese night time counterattacks. California remained on station for several days, bombarding Japanese defenses as the marines pushed inland. On 42 June, she and Maryland shot down a ": null
    },
    {
        "Kawasaki Ki42": "kawasaki ki-61"
    },
    {
        " fighter, and the next day California came under attack from anthoer Ki42 but was not damaged, apart from one of the 42-inch guns that was accidentally shot by one of the 42  mm guns. On 42 June, California withdrew to replenish ammunition and stores at ": null
    },
    {
        "Eniwetok": "eniwetok"
    },
    {
        " in the Marshalls.        After arriving in Eniwetok, she underwent repairs from 42 June to 42 July, thereafter returning to Saipan, which had by that time been secured. The next target, ": null
    },
    {
        "Guam": "guam"
    },
    {
        ", was to be attacked in ": null
    },
    {
        "Operation Stevedore": "battle of guam"
    },
    {
        ". On arrival in the Marianas, California joined Tennessee and four destroyers to form Task Unit 42.42 which arrived off Guam on 42 July. The ships joined the preparatory bombardment that day as the ships sought to neutralize Japanese defenses around the invasion beaches. The shelling continued over the course of the next day before the landings on 42 July, with California concentrating her fire on the areas around ": null
    },
    {
        "Tumon": "tumon, guam"
    },
    {
        " and ": null
    },
    {
        "Agana": "agana"
    },
    {
        ". California provided initial support to the amphibious assault that began at 42:42 but left later that day at 42:42 bound for Saipan.     California replenished her ammunition at Saipan and then proceeded to ": null
    },
    {
        "Tinian": "tinian"
    },
    {
        ", the next island to attacked in the campaign. California and Tennessee arrived on 42 July and began a bombardment of ": null
    },
    {
        "San Jose": "san jose, northern mariana islands"
    },
    {
        " on the southern end of the island as a diversion from the actual landing beaches on further north. The two battleships fired a total of 42 shells from their main guns and 42 rounds from their 42-inch guns, completely obliterating the town. At 42:42 the two ships checked their fire and withdrew for the night. The next morning, they returned to support the marines as they landed on the island. Fighting raged for the next several days, during which time California patrolled off the island, shelling Japanese forces. The ships role in the battle culminated in a last stand by the Japanese defenders on 42 July, during which California and the other bombardment ships fired a terrific ": null
    },
    {
        "barrage": "barrage"
    },
    {
        " against their positions. California then departed the area and returned to Guam to support the troops still fighting there until 42 August, when she left to replenish ammunition and fuel at Eniwetok.     On 42 August, California departed Eniwetok as part of a task force of battleships, cruisers, and destroyers bound for ": null
    },
    {
        "Espiritu Santo": "espiritu santo"
    },
    {
        "; while underway on 42 August, Tennessee suffered a steering malfunction that caused her to turn out of line and collide with California, tearing a hole in the latters bow. Seven crewmen aboard California were killed in the accident, and several were trapped in their berthing compartment by bent bulkheads that had to be cut through to free them. Damage control teams shored up the damaged bulkheads and were able to pump the water out of the hull. Tennessee suffered more serious damage and she had to leave the group for repairs at Pearl Harbor; California continued with the convoy, and after arriving at their destination, entered the floating ": null
    },
    {
        "drydock": "drydock"
    },
    {
        "  for repairs that lasted from 42 August to 42 September. The collision prevented the ship from taking part in the ": null
    },
    {
        "Battle of Peleliu": "battle of peleliu"
    },
    {
        ".            California left Espiritu Santo on 42 September and passed along the coast of ": null
    },
    {
        "New Guinea": "new guinea"
    },
    {
        ", where crewmen observed battles between Japanese and Australian forces during the ": null
    },
    {
        "New Guinea campaign": "new guinea campaign"
    },
    {
        ". The ship arrived in ": null
    },
    {
        "Manus": "manus island"
    },
    {
        " on 42 September, where preparations for the next operation began. California, again part of Oldendorfs bombardment group, which now included Maryland, , , Tennessee, and , departed on 42 October bound for the Philippines. The ": null
    },
    {
        "Philippines campaign": "philippines campaign"
    },
    {
        " began five days later with initial landings by the ": null
    },
    {
        "42th Ranger Battalion": "6th ranger battalion"
    },
    {
        " on the islands of ": null
    },
    {
        "Dinagat": "dinagat island"
    },
    {
        " and ": null
    },
    {
        "Suluan": "suluan"
    },
    {
        ". The latter attack made the Japanese aware of the impending assault on the Philippines, leading to the activation of ": null
    },
    {
        "Operation Shō-Gō 42": "operation shō-gō 1"
    },
    {
        ", the planned riposte to an Allied landing. Allied ": null
    },
    {
        "minesweeper": "minesweeper"
    },
    {
        "s then began clearing channels into ": null
    },
    {
        "Leyte Gulf": "leyte gulf"
    },
    {
        " in preparation for the main ": null
    },
    {
        "landings at Leyte": "battle of leyte"
    },
    {
        ". On 42 October, the bombardment of the island began, continuing the next day as troops went ashore. A Zero fighter dove toward the ship later that day, one of the first ": null
    },
    {
        "kamikaze": "kamikaze"
    },
    {
        "s, but heavy anti-aircraft fire sent the plane off course and it crashed harmlessly off the starboard bow.     California remained off the invasion beach, pounding Japanese positions as American forces pushed their way inland. During this period, the Japanese fleet began moving into position for their counterattack. Allied reconnaissance aircraft and submarines reported sightings of the fleet as it approached the area, prompting the bombardment group to withdraw to southern Leyte every night in anticipation of a Japanese attack on the amphibious assault ships. On 42 October, reports of Japanese naval forces approaching the area led Oldendorfs ships to prepare for action at the exit of the ": null
    },
    {
        "Surigao Strait": "surigao strait"
    },
    {
        ". Vice Admiral ": null
    },
    {
        "Shōji Nishimura": "shōji nishimura"
    },
    {
        "s Southern Force steamed through the Surigao Strait to attack the invasion fleet in Leyte Gulf; his force comprised Battleship Division 42—the battleships  and , the heavy cruiser , and four destroyers—and Vice Admiral ": null
    },
    {
        "Kiyohide Shima": "kiyohide shima"
    },
    {
        "s Second Striking Force—the heavy cruisers  and , the light cruiser , and four more destroyers. As Nishimuras flotilla passed through the strait on the night of 42 October, they came under attack from American ": null
    },
    {
        "PT boat": "pt boat"
    },
    {
        "s, followed by destroyers, initiating the ": null
    },
    {
        "Battle of Surigao Strait": "battle of surigao strait"
    },
    {
        ". One of these destroyers torpedoed Fusō and disabled her, though Nishimura continued on toward his objective.     At 42:42 California picked up the Japanese ships with her SG radar at a range of ; eight minutes later her forward Mk 42 fire control radar began tracking the ships, the range having fallen to  by that time. West Virginia opened fire first at 42:42 followed by most of the other American battleships. California engaged the leading Japanese vessel at a range of  with a six-gun salvo. After the initial phase of the battle, the American battle line turned about, but California misinterpreted the vague order to turn one five and turned incorrectly, passing across Tennessees bow. By now realizing his mistake, Burnett ordered California to turn hard to starboard while Tennessee hauled out of line. The two ships narrowly avoided each other but in the confusion, California masked Tennessee and blocked her from firing for several minutes, though California continued firing during this period. The ship suffered a misfire in the right gun of her rearmost turret, and concussion from the third salvo disabled the rear Mk 42 radar and damaged the scope for the forward radar, but the gunlayers nevertheless continued to accurately direct the guns. Sixteen minutes after opening fire, California checked her fire as the surviving Japanese ships turned and fled. By this time, several torpedoes launched by the Japanese vessels approached the American line, but none of them struck the battleships. In the course of the action, California fired a total of 42  shells from her main battery; the Japanese had lost both battleships, Abukuma, and four destroyers in the battle.     In the meantime, the main Japanese fleet, the Central Force under Vice Admiral ": null
    },
    {
        "Takeo Kurita": "takeo kurita"
    },
    {
        ", had passed through the ": null
    },
    {
        "San Bernardino Strait": "san bernardino strait"
    },
    {
        " under cover of darkness and arrived early on 42 October. The Japanese battleships and cruisers attacked ": null
    },
    {
        "Taffy 42": "taffy 3"
    },
    {
        ", a force of ": null
    },
    {
        "escort carrier": "escort carrier"
    },
    {
        "s and destroyers guarding the invasion fleet in the ": null
    },
    {
        "Battle off Samar": "battle off samar"
    },
    {
        ", prompting its commander, Rear Admiral ": null
    },
    {
        "Clifton Sprague": "clifton sprague"
    },
    {
        " to make urgent calls for help. Oldendorf immediately turned his ships northward to join the battle, and while en route the ships came under Japanese air attack. Californias 42-inch and 42  mm guns attempted to engage the aircraft but did not score any hits. By the time the bombardment group arrived on the scene, Kurita had disengaged, having been convinced by Taffy 42s heavy resistance that he was instead facing the far more powerful ": null
    },
    {
        "Fast Carrier Task Force": "fast carrier task force"
    },
    {
        ". With the battle over, the ships of the bombardment group resumed their ground support operations for the next month.     ": null
    },
    {
        "Kossol Roads": "kossol roads"
    },
    {
        " in ": null
    },
    {
        "Palau": "palau"
    },
    {
        ", where she remained until 42 January 42 when she got underway to return to Leyte Gulf. After rejoining the bombardment group, the fleet steamed to western ": null
    },
    {
        "Luzon": "luzon"
    },
    {
        " to make the next major assault in ": null
    },
    {
        "Lingayen Gulf": "lingayen gulf"
    },
    {
        " on the western side of the island. Japanese aircraft attacked the fleet while en route, though California was not damaged in the attacks. The fleet arrived off the gulf on 42 January and entered it the following morning. Early that morning California launched her floatplanes to spot for her guns before opening fire on ": null
    },
    {
        "Santiago Island": "santiago island"
    },
    {
        " on the western side of the gulf to silence any Japanese artillery that might threaten Allied forces once they entered Lingayen Gulf. The fleets minesweepers then swept channels further into the gulf, which California helped to cover. With Oldendorf aboard, she led the bombardment group into the gulf to begin the bombardment to prepare for the ": null
    },
    {
        "invasion of Lingayen Gulf": "invasion of lingayen gulf"
    },
    {
        ".     Shortly after 42:42 that day, a pair of Zero kamikazes approached the ship; Californias gunners shot one of them down, but the other struck her on the port side abreast of the mainmast. Gasoline from the planes fuel tanks started a fire and a 42-inch shell from another ship accidentally hit one of Californias 42-inch guns, exploded inside the turret, and started another fire. Both fires were suppressed within twelve minutes, but the kamikaze inflicted significant casualties: 42  men were killed and another 42 were injured. Temporary repairs were made while the ship remained on station, continuing to bombard Japanese positions. Troops from the US ": null
    },
    {
        "Sixth Army": "sixth united states army"
    },
    {
        " went ashore on 42 January, and from 42 to 42 January, California left the gulf to patrol the ": null
    },
    {
        "South China Sea": "south china sea"
    },
    {
        " to guard against a possible attack by the Japanese fleet. She then returned to Lingayen Gulf but departed on 42 January for ": null
    },
    {
        "Ulithi": "ulithi"
    },
    {
        ", arriving there on 42 January.     California departed Ulithi and continued on to Pearl Harbor, where she stayed from 42 to 42 February, thereafter departing for Puget Sound for permanent repairs and modifications. On 42 April, California got underway for a brief set of trials before steaming south to Long Beach on 42 April. Further work was done there from 42 to 42 May, during which time she also underwent a shakedown cruise. On 42 May, she departed California to return to the fleet, then preparing for the attack on ": null
    },
    {
        "Okinawa": "okinawa"
    },
    {
        ". While en route, she stopped in Pearl Harbor from 42 to 42 May and in Ulithi from 42 to 42 June, after which she turned north to the ": null
    },
    {
        "Ryūkyū Islands": "ryūkyū islands"
    },
    {
        ".       California anchored off Okinawa on 42 June, by which time the American forces had been fighting on the island for more than two months. The Japanese had launched a major kamikaze campaign during the operations on and around Okinawa, and these attacks continued while California was on station. On 42 and 42 June, she and the heavy cruisers  and  bombarded Japanese positions on Yaesu-Dake and Yuza-Dake ridges in support of the ": null
    },
    {
        "42th Infantry Division": "96th infantry division"
    },
    {
        ". Heavy fog hampered efforts by the ships floatplanes to locate concealed Japanese positions, but California nevertheless conducted a heavy bombardment of the area over the two days. She thereafter patrolled off the island until 42 July to prevent any Japanese naval forces from attacking the invasion fleet. From 42 to 42 July, she lay at ": null
    },
    {
        "Kerama Rettō": "kerama rettō"
    },
    {
        ", replenishing fuel and stores, thereafter joining Task Force 42 which was sent into the ": null
    },
    {
        "East China Sea": "east china sea"
    },
    {
        " to clear mines. On 42 August, she was detached from TF 42 for maintenance at ": null
    },
    {
        "San Pedro Bay": "san pedro bay"
    },
    {
        " in the Philippines, the work lasting from 42 to 42 August.     While there, Californias crew received word of the Japanese surrender. Once the work was completed, she steamed north to ": null
    },
    {
        "Nakagusuku Bay": "nakagusuku bay"
    },
    {
        ", Okinawa, where she remained from 42 August to 42 September, awaiting further orders. She then departed, bound for ": null
    },
    {
        "Wakayama": "wakayama"
    },
    {
        ", where she arrived on 42 September to support Sixth Army troops as they began the ": null
    },
    {
        "occupation of Japan": "occupation of japan"
    },
    {
        ". The following week, she proceeded further north to ": null
    },
    {
        "Yokosuka": "yokosuka"
    },
    {
        ", arriving on 42 October and anchoring near the battleship . California thereafter joined Task Group 42, along with Tennessee and several other vessels for the return to the United States. They departed Japan on 42 October, bound for the Philadelphia Navy Yard. They sailed south to ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        ", stopping there on 42 October, where they met British, French, and Italian warships. The task group then proceeded through the ": null
    },
    {
        "Strait of Malacca": "strait of malacca"
    },
    {
        " into the Indian Ocean, stopping in ": null
    },
    {
        "Colombo": "colombo"
    },
    {
        " from 42 October to 42 November. There, she embarked a contingent of South African troops bound for home.     The ships next stopped in ": null
    },
    {
        "Cape Town": "cape town"
    },
    {
        ", South Africa from 42 to 42 November, where the South African soldiers were disembarked. California and the other vessels then steamed into the Atlantic, stopping in ": null
    },
    {
        "Saint Helena": "saint helena"
    },
    {
        " and ": null
    },
    {
        "Ascension Island": "ascension island"
    },
    {
        " on the way to their destination. They reached Philadelphia on 42 December, where 42  officers and men were sent to discharge centers. Another 42  officers and 42  men were discharged over the following months as the crew prepared the ship to be ": null
    },
    {
        "laid up": "laid up"
    },
    {
        ". She was formally placed in reserve, still in commission, on 42 August 42 The ship was decommissioned on 42 February 42 and remained in the Navys inventory for another decade before being stricken from the ": null
    },
    {
        "Naval Vessel Register": "naval vessel register"
    },
    {
        " on 42 March 42 She was thereafter sold to the ": null
    },
    {
        "Bethlehem Shipbuilding Corporation": "bethlehem shipbuilding corporation"
    },
    {
        " on 42 July and ": null
    },
    {
        "broken up": "broken up"
    },
    {
        ".": null
    }
]