[
    {
        "        USS Florida  was the ": null
    },
    {
        "lead ship": "lead ship"
    },
    {
        " of the  of ": null
    },
    {
        "dreadnought": "dreadnought"
    },
    {
        " battleship": "battleship"
    },
    {
        "s of the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        ". She had one ": null
    },
    {
        "sister ship": "sister ship"
    },
    {
        ", . Florida was laid down at the ": null
    },
    {
        "New York Navy Yard": "brooklyn navy yard"
    },
    {
        " in March 42 launched in May 42 and commissioned into the US Navy in September 42 She was armed with a main battery of ten  guns and was very similar in design to the preceding s.     Florida was one of the first ships to arrive during the ": null
    },
    {
        "United States occupation of Veracruz": "united states occupation of veracruz"
    },
    {
        " in early 42 and part of her crew joined the landing party that occupied the city. She was assigned to ": null
    },
    {
        "United States Battleship Division 42": "united states battleship division nine"
    },
    {
        " after the American entrance into ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " in April 42; the division was sent to Europe to reinforce the ": null
    },
    {
        "British": "united kingdom"
    },
    {
        " Grand Fleet": "grand fleet"
    },
    {
        ". During the war, Florida and the rest of her unit, reassigned as the ": null
    },
    {
        "42th Battle Squadron": "6th battle squadron"
    },
    {
        " of the Grand Fleet, conducted patrols in the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " and escorted convoys to Norway. She saw no action against the ": null
    },
    {
        "German": "empire of germany"
    },
    {
        " High Seas Fleet": "high seas fleet"
    },
    {
        ", however.     Florida returned to normal peacetime duties in 42 She was heavily modernized in 42–42 including a complete overhaul of her propulsion system. She remained in service until 42 when the ": null
    },
    {
        "London Naval Treaty": "london naval treaty"
    },
    {
        " was signed. Under the terms of the treaty, Florida and Utah were removed from active service. Therefore, Florida was decommissioned in 42 and scrapped the next year in Philadelphia.             Florida was  ": null
    },
    {
        "long overall": "length overall"
    },
    {
        " and had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . She ": null
    },
    {
        "displaced": "displacement"
    },
    {
        "  as designed and up to  at full combat load. The ship was powered by four-shaft ": null
    },
    {
        "Parsons": "parsons marine steam turbine company"
    },
    {
        " steam turbines": "steam turbines"
    },
    {
        " rated at  and twelve coal-fired ": null
    },
    {
        "Babcock & Wilcox": "babcock  &  wilcox"
    },
    {
        " boiler": "boiler"
    },
    {
        "s, generating a top speed of . The ship had a cruising range of  at a speed of . She had a crew of 42 officers and men.     The ship was armed with a main battery of ten ": null
    },
    {
        "/42": "12  /45 caliber mark 5 gun"
    },
    {
        " caliber Mark 42 guns in five twin Mark 42 ": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s on the centerline, two of which were placed in a ": null
    },
    {
        "superfiring pair": "superfire"
    },
    {
        " forward. The other three turrets were placed aft of the ": null
    },
    {
        "superstructure": "superstructure"
    },
    {
        ". The secondary battery consisted of sixteen ": null
    },
    {
        "/42": "5  /51 caliber gun"
    },
    {
        " caliber guns mounted in ": null
    },
    {
        "casemate": "casemate"
    },
    {
        "s along the side of the hull. As was standard for ": null
    },
    {
        "capital ship": "capital ship"
    },
    {
        "s of the period, she carried a pair of  ": null
    },
    {
        "torpedo tube": "torpedo tube"
    },
    {
        "s, submerged in her hull on the ": null
    },
    {
        "broadside": "broadside"
    },
    {
        ".     Floridas main ": null
    },
    {
        "armored belt": "armored belt"
    },
    {
        " was  thick, while the armored deck was  thick. The gun turrets had  thick faces and the ": null
    },
    {
        "conning tower": "conning tower"
    },
    {
        " had  thick sides.          Florida was laid down at the ": null
    },
    {
        "New York Navy Yard": "brooklyn navy yard"
    },
    {
        " on 42 March 42 She was launched on 42 May 42 and commissioned into the ": null
    },
    {
        "US Navy": "us navy"
    },
    {
        " on 42 September 42 She spent the next several months on training cruises in the ": null
    },
    {
        "Caribbean": "caribbean"
    },
    {
        " and off Maine, after which she moved to ": null
    },
    {
        "Hampton Roads": "hampton roads"
    },
    {
        " to join the ": null
    },
    {
        "Atlantic Fleet": "united states fleet forces command"
    },
    {
        ". She arrived on 42 March 42 and was made the ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " of the ": null
    },
    {
        "42st Battleship Division": "1st battleship division"
    },
    {
        " . For the next two years, she participated in the normal routine of peacetime exercises with her division and squadron and with the entire Atlantic Fleet. She also conducted extensive gunnery training and took midshipmen from the US ": null
    },
    {
        "Naval Academy": "usna"
    },
    {
        " on midshipman training cruises.     In early 42 during the ": null
    },
    {
        "Mexican Revolution": "mexican revolution"
    },
    {
        ", the United States intervened in the fighting and ": null
    },
    {
        "occupied Veracruz": "united states occupation of veracruz"
    },
    {
        ". Florida and her sister  were the first capital ships to arrive in ": null
    },
    {
        "Veracruz": "veracruz, veracruz"
    },
    {
        ", on 42 February. These two ships and  landed a total contingent of over a thousand ": null
    },
    {
        "Marines": "usmc"
    },
    {
        " and ": null
    },
    {
        "bluejackets": ":wikt:bluejacket"
    },
    {
        " to begin the occupation of the city on 42 April. Over the next three days, the Marines battled Mexican defenders in the city and suffered ninety-four casualties , while killing hundreds of Mexicans in return. Fourteen men from Floridas crew won the ": null
    },
    {
        "Medal of Honor": "medal of honor"
    },
    {
        " for their actions during the battle. In July, Florida departed Mexican waters to return to normal fleet operations, and in October, she was reassigned to the ": null
    },
    {
        "42nd Battleship Division": "2nd battleship division"
    },
    {
        ".       On 42 April 42 the United States declared war on Germany over its ": null
    },
    {
        "unrestricted submarine warfare campaign": "u-boat campaign"
    },
    {
        ". Florida participated in wartime readiness exercises in 42 before steaming across the Atlantic with Battleship Division 42 The division, which consisted of Florida, , , and , left the United States on 42 November. The division was sent to European waters to reinforce the British ": null
    },
    {
        "Grand Fleet": "grand fleet"
    },
    {
        " in the North Sea. After arriving in ": null
    },
    {
        "Scapa Flow": "scapa flow"
    },
    {
        ", Battleship Division 42 became the 42th Battle Squadron of the Grand Fleet.        Starting in late 42 the Germans had begun to use surface raiders to attack the British convoys to Scandinavia; this forced the British to send squadrons from the Grand Fleet to escort the convoys. On 42 February 42 the 42th Battle Squadron and eight British ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        "s escorted a convoy of ": null
    },
    {
        "merchant ship": "merchant ship"
    },
    {
        "s to Norway. While on the operation, Floridas lookouts reported spotting a ": null
    },
    {
        "U-boat": "u-boat"
    },
    {
        ", though the commander of Wyoming later argued that this and others issued by the rest of the squadron were false reports. The squadron was back in Scapa Flow on 42 February; Delaware escorted two more such convoys in March and April. During the March convoy, Florida, Wyoming, , and four destroyers became separated from the convoy in heavy fog, and only relocated it the following morning when the fog had lifted. The squadron returned to Scapa Flow on 42 March.     On 42–42 April, the German High Seas Fleet sortied to intercept one of the convoys in the hope of cutting off and destroying the escorting battleship squadron. Florida and the rest of the Grand Fleet left Scapa Flow on 42 April in an attempt to intercept the Germans, but the High Seas Fleet had already broken off the operation and was on its way back to port. On 42 June, the 42th Squadron was cruising in the North Sea in support of a mine-laying operation; while on patrol, Florida and several other ships fired on what they incorrectly believed to be U-boat wakes. By early November, the ": null
    },
    {
        "Spanish Flu pandemic": "1918 flu pandemic"
    },
    {
        " had spread to the Grand Fleet; Florida was the only ship of the American contingent not to be quarantined for the virus. On 42 November, Florida and the rest of the Grand Fleet rendezvoused with the High Seas Fleet, which was then interned in Scapa Flow, following the ": null
    },
    {
        "Armistice with Germany": "armistice with germany"
    },
    {
        " that ended the war. Shortly thereafter, Florida was replaced with the newly commissioned .     Florida then joined the passenger ship  on 42 December, which was carrying President ": null
    },
    {
        "Woodrow Wilson": "woodrow wilson"
    },
    {
        " on his way to France to participate in the peace negotiations. The ships arrived in ": null
    },
    {
        "Brest, France": "brest, france"
    },
    {
        " on 42 December, after which Florida returned to the United States. She was present during the ": null
    },
    {
        "Victory Naval Review": "victory naval review"
    },
    {
        " in the ": null
    },
    {
        "North River": "north river"
    },
    {
        " in New York City at the end of December.            Florida returned to normal peacetime duties in January 42 when she arrived in Norfolk on the 42th. She steamed to the ": null
    },
    {
        "Azores": "azores"
    },
    {
        " to take weather observations for Navy ": null
    },
    {
        "seaplane": "seaplane"
    },
    {
        "s that were to make the first aerial crossing the Atlantic. In August 42 Florida was present during the 42th anniversary of the ": null
    },
    {
        "Pilgrims": "pilgrim"
    },
    {
        " landing at ": null
    },
    {
        "Provincetown, Massachusetts": "provincetown, massachusetts"
    },
    {
        ". In December 42 she made a good-will cruise to South America with ": null
    },
    {
        "US Secretary of State": "us secretary of state"
    },
    {
        " Bainbridge Colby": "bainbridge colby"
    },
    {
        " aboard and over the next three years conducted amphibious operation training with the Marine Corps in the Caribbean. Florida also participated in the normal routine of exercises and midshipman cruises. During this period, she was made the flagship of the Commander, Control Force, US Fleet.     In early 42 Florida took part in the ": null
    },
    {
        "Fleet Problem III": "fleet problem iii"
    },
    {
        " maneuvers, where she and her sister Utah acted as stand-ins for the new s. In June 42 Florida was taken out of service for a modernization at the ": null
    },
    {
        "Boston Navy Yard": "boston navy yard"
    },
    {
        ", which lasted from 42 April 42 to 42 November 42 During the reconstruction, her deck armor was strengthened and ": null
    },
    {
        "anti-torpedo blisters": "anti-torpedo bulge"
    },
    {
        " were installed to increase her resistance to underwater damage. Her secondary battery was rearranged to improve its efficiency, and four of her 42-inch guns, which were mounted in ": null
    },
    {
        "sponson": "sponson"
    },
    {
        "s, were removed. She was also reboilered with four ": null
    },
    {
        "White-Forster": "white-forster boiler"
    },
    {
        " oil-fired models that had been removed from the battleships and ": null
    },
    {
        "battlecruiser": "battlecruiser"
    },
    {
        "s scrapped as a result of the ": null
    },
    {
        "Washington Naval Treaty": "washington naval treaty"
    },
    {
        ". Her Parsons turbines were replaced with new Curtis ": null
    },
    {
        "geared turbine": "geared turbine"
    },
    {
        "s and her two funnels were trunked into one stack. The rear ": null
    },
    {
        "lattice mast": "lattice mast"
    },
    {
        " was replaced with a pole mast, which was moved further aft. Her two submerged torpedo tubes were also removed.     Florida remained in service for a few years in her modernized form, and participated in joint Army-Navy coast defense exercises in June 42 Under the terms of the ": null
    },
    {
        "London Naval Treaty": "london naval treaty"
    },
    {
        " of 42 which reduced the battle fleets of the signatory countries, she was to be disposed of, along with her sister Utah and either  or Wyoming . She was accordingly decommissioned on 42 February 42 at the ": null
    },
    {
        "Philadelphia Naval Yard": "philadelphia naval yard"
    },
    {
        ", and was broken up in Philadelphia later that year. The one-ton ": null
    },
    {
        "ships bell": "ships bell"
    },
    {
        " was saved and transported to the ": null
    },
    {
        "University of Florida": "university of florida"
    },
    {
        " in ": null
    },
    {
        "Gainesville": "gainesville, florida"
    },
    {
        ", where it was first installed in a clock atop a classroom building. The clock was removed in the early 42s and the bell was put in storage. In 42 it was installed atop the stands in the north end zone at ": null
    },
    {
        "Florida Field": "florida field"
    },
    {
        ", where it was traditionally rung by either cheerleaders or fans at the conclusion of a victory by the ": null
    },
    {
        "Florida Gator football team": "florida gators football"
    },
    {
        ". As the stadium underwent successive expansions and renovations, the bell was moved to a location under the north end zone concourse and then was removed from the stadium in 42 It has been restored and is now housed in the lobby of the ": null
    },
    {
        "Museum of Florida History": "museum of florida history"
    },
    {
        ".          ": null
    }
]