[
    {
        "        USS New York  was a ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " battleship": "battleship"
    },
    {
        ", the ": null
    },
    {
        "lead ship": "lead ship"
    },
    {
        " of her ": null
    },
    {
        "class": "new york-class battleship"
    },
    {
        ". Named for ": null
    },
    {
        "New York State": "new york state"
    },
    {
        ", she was designed as the first ship to carry the ": null
    },
    {
        "/42-caliber gun": "14  /45 caliber gun"
    },
    {
        ".     Entering service in 42 she was part of the U.S. Navy force which was sent to reinforce the ": null
    },
    {
        "British Grand Fleet": "british grand fleet"
    },
    {
        " in the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " near the end of ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". During that time, she was involved in at least two incidents with ": null
    },
    {
        "German U-boat": "german u-boat"
    },
    {
        "s, and is believed to have been the only US ship to have sunk one in the war, during an accidental collision in October 42 Following the war, she was sent on a litany of training exercises and cruises in both the Atlantic and the Pacific, and saw several overhauls to increase her armament, aircraft handling and armor.     She entered the ": null
    },
    {
        "Neutrality Patrol": "neutrality patrol"
    },
    {
        " at the beginning of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", and served as a convoy escort for ships to ": null
    },
    {
        "Iceland": "iceland"
    },
    {
        " and ": null
    },
    {
        "Great Britain": "great britain"
    },
    {
        " in the early phase of the war. She saw her first combat against coastal artillery during ": null
    },
    {
        "Operation Torch": "operation torch"
    },
    {
        " around ": null
    },
    {
        "Casablanca": "casablanca"
    },
    {
        " in ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        ", and later became a training ship. Late in the war, she moved to the ": null
    },
    {
        "Pacific": "united states pacific fleet"
    },
    {
        ", and provided naval gunfire support for the ": null
    },
    {
        "invasion of Iwo Jima": "battle of iwo jima"
    },
    {
        " and later the ": null
    },
    {
        "invasion of Okinawa": "battle of okinawa"
    },
    {
        ". Returning to ": null
    },
    {
        "Pearl Harbor": "pearl harbor"
    },
    {
        " for repairs until the end of the war, she was classified obsolete and was chosen to take part in the ": null
    },
    {
        "Operation Crossroads": "operation crossroads"
    },
    {
        " nuclear weapon test": "nuclear weapon test"
    },
    {
        "s at ": null
    },
    {
        "Bikini Atoll": "bikini atoll"
    },
    {
        " in 42 She survived both explosions and the effects of ": null
    },
    {
        "radiation": "radiation"
    },
    {
        " on the ship were studied for several years. She was eventually sunk as a target in 42 She received three ": null
    },
    {
        "battle star": "battle star"
    },
    {
        "s for her service.          New York was the first of two planned s, though construction on her began after her sister, . She was ordered in ": null
    },
    {
        "fiscal year": "fiscal year"
    },
    {
        " 42 as the first class of ": null
    },
    {
        "battleship": "battleship"
    },
    {
        " in the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " to carry the 42-inch": null
    },
    {
        "/42-caliber": "caliber"
    },
    {
        " gun.        She had a ": null
    },
    {
        "standard displacement": "standard displacement"
    },
    {
        " of  and a ": null
    },
    {
        "full-load displacement": "full-load displacement"
    },
    {
        " of . She was  in ": null
    },
    {
        "length overall": "length overall"
    },
    {
        ",  ": null
    },
    {
        "at the waterline": "length at the waterline"
    },
    {
        ", and had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of .     She was powered by 42 ": null
    },
    {
        "Babcock & Wilcox": "babcock  &  wilcox"
    },
    {
        " boilers driving two dual-acting ": null
    },
    {
        "vertical triple expansion": "vertical triple expansion"
    },
    {
        " reciprocating steam engines, with , with a maximum speed of . She had a ": null
    },
    {
        "range": "range"
    },
    {
        " of  at .     Armor on New York consisted of a ": null
    },
    {
        "belt": "belt armor"
    },
    {
        " from  thick. Her lower ": null
    },
    {
        "casemate": "casemate"
    },
    {
        " had between  of armor, and her upper casemate had  of armor. Deck armor was  thick, and turret armor was  on the face,  on the top, 42 inches on the sides, and  on the rear. Armor on her ": null
    },
    {
        "barbettes": "barbettes"
    },
    {
        " was between 42 and 42 inches. Her conning tower was protected by 42 inches of armor, with 42 inches of armor on its top.        Her armament consisted of ten 42-inch/42-caliber guns which could be elevated to 42 degrees, and arrayed in five double mounts designated, from bow to stern, 42 42 42 42 and 42 The class was the last to feature a turret mounted amidships. As built, she also carried twenty-one ": null
    },
    {
        "/42-caliber guns": "5  /51 caliber gun"
    },
    {
        ", primarily for defense against ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        "s and ": null
    },
    {
        "torpedo boat": "torpedo boat"
    },
    {
        "s. The 42-inch guns were poor in accuracy in rough seas due to the open casemates mounted in the hull, so the 42-inch armament was reduced to 42 guns in 42 by removal of the least useful positions near the ends of the ship. The ship was not designed with ": null
    },
    {
        "anti-aircraft": "anti-aircraft"
    },
    {
        " defense in mind, but two ": null
    },
    {
        "/42 caliber AA gun": "3  /50 caliber gun"
    },
    {
        "s were added in 42 She also had four  ": null
    },
    {
        "torpedo tube": "torpedo tube"
    },
    {
        "s, 42 each on the port side bow and stern and starboard bow and stern, for the ": null
    },
    {
        "Bliss-Leavitt Mark 42 torpedo": "bliss-leavitt mark 3 torpedo"
    },
    {
        ". The torpedo rooms held 42 ": null
    },
    {
        "torpedoes": "torpedo"
    },
    {
        " total, plus 42 ": null
    },
    {
        "naval defense mines": "naval mine"
    },
    {
        ". Her crew consisted of 42 officers and enlisted men.     New York was laid down on 42 September 42 in ": null
    },
    {
        "New York Navy Yard": "new york navy yard"
    },
    {
        " in ": null
    },
    {
        "Brooklyn": "brooklyn"
    },
    {
        ". The New York class was constructed under new labor laws that limited the working hours of her construction crews. It was also stipulated that each ship cost less than $42,42 excluding cost of armor and armament. She was launched on 42 October 42 and ": null
    },
    {
        "commissioned": "ship commissioning"
    },
    {
        " on 42 May 42 The fifth ship to be named for ": null
    },
    {
        "New York State": "new york state"
    },
    {
        ", she was sponsored by Elsie Calder, the daughter of New York politician ": null
    },
    {
        "William M. Calder": "william m. calder"
    },
    {
        ". The fourth , an ": null
    },
    {
        "armored cruiser": "armored cruiser"
    },
    {
        ", was renamed Rochester, to free the name for this battleship, and was later ": null
    },
    {
        "scuttled": "scuttled"
    },
    {
        " in ": null
    },
    {
        "Subic Bay": "subic bay"
    },
    {
        " in 42 However, the wreck site for that ship, which has become a popular ": null
    },
    {
        "recreational dive site": "recreational dive site"
    },
    {
        ", is still commonly referred to as USS New York.       Under the command of Captain ": null
    },
    {
        "Thomas S. Rodgers": "thomas s. rodgers"
    },
    {
        ", New York headed straight for ": null
    },
    {
        "Veracruz": "veracruz"
    },
    {
        " following its commissioning. She was designated ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " for ": null
    },
    {
        "Rear Admiral": "rear admiral"
    },
    {
        " Frank Friday Fletcher": "frank friday fletcher"
    },
    {
        " in July 42 commanding the fleet occupying and blockading Veracruz to prevent arms shipments from arriving there to support the government of ": null
    },
    {
        "Victoriano Huerta": "victoriano huerta"
    },
    {
        ". The ": null
    },
    {
        "United States occupation of Veracruz": "united states occupation of veracruz"
    },
    {
        " ultimately ended and New York resumed her ": null
    },
    {
        "shakedown cruise": "shakedown cruise"
    },
    {
        " along the ": null
    },
    {
        "East Coast of the United States": "east coast of the united states"
    },
    {
        ". She also undertook several goodwill duties, and in December 42 she held a high-profile Christmas party and dinner for several hundred orphans from New York City, at the suggestion of her crew. It later became a tradition on the ship to help the underprivileged when possible, earning it the nickname Christmas Ship. Following this duty, she undertook a number of training exercises off the Atlantic coast.          Following the United States entry into ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", New York, under the command of Captain ": null
    },
    {
        "Edward L. Beach, Sr.": "edward l. beach, sr."
    },
    {
        ", became flagship of ": null
    },
    {
        "Battleship Division 42": "united states battleship division nine"
    },
    {
        " , commanded by Rear Admiral ": null
    },
    {
        "Hugh Rodman": "hugh rodman"
    },
    {
        ". She was sent to reinforce the ": null
    },
    {
        "British Grand Fleet": "british grand fleet"
    },
    {
        " in the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        ", arriving at ": null
    },
    {
        "Scapa Flow": "scapa flow"
    },
    {
        " on 42 December 42 The ships of the U.S. fleet were assigned to the ": null
    },
    {
        "42th Battle Squadron": "6th battle squadron"
    },
    {
        " in the Grand Fleet, the American ships joined in ": null
    },
    {
        "blockade": "blockade"
    },
    {
        " and ": null
    },
    {
        "escort": "convoy"
    },
    {
        ". In December 42 New York and the other U.S. battleships took part in several gunnery exercises. New York scored the highest score of the ships for her main battery, with an accuracy of 42 percent. Ultimately the New York was the best performer in these exercises, the only ship rated as excellent while many of her sisters received mediocre performance reviews.     She did not fire any shots during the war, but during at least two occasions, the convoy she was escorting came under attack by German U-boats. On the evening of 42 October 42 as New York led a group of battleships into the ": null
    },
    {
        "Pentland Firth": "pentland firth"
    },
    {
        ", she was rocked by a violent underwater collision on her starboard side, followed shortly after by another to the stern that broke off two blades on one of her ": null
    },
    {
        "propeller": "propeller"
    },
    {
        "s, reducing the ship to one engine and a speed of . It was immediately clear to the men on board that she had struck an underwater object, but the depth of the channel meant it could not have been a ": null
    },
    {
        "shipwreck": "shipwreck"
    },
    {
        ". Commanders concluded that New York must have accidentally collided with a submerged U-boat. They agreed that the submarine had rammed its bow into the ships side, then been struck moments later by the ships propeller. In their opinion, the damage would have been fatal to the German craft. Postwar examination of German records revealed that the submarine lost may have been  or . This strange—and accidental—encounter marked the only time in all of Battleship Division Nines service with the Grand Fleet that one of its ships sank a German vessel.     Badly damaged by the loss of a propeller, the ship sailed to ": null
    },
    {
        "Rosyth": "rosyth"
    },
    {
        " under heavy escort for repairs on 42 October. At 42:42 the next morning, a U-boat launched three torpedoes at the damaged vessel, all of which passed ahead of her. Unlike in previous cases, sufficient evidence existed to suppose that this torpedo attack was not a false alarm—a number of officers and men aboard New York clearly saw the wakes of the torpedoes in the full ": null
    },
    {
        "moonlight": "moonlight"
    },
    {
        ", and a submarine was spotted in the immediate vicinity by a patrol shortly after the attack. Ironically, the battleships wounded condition is possibly what saved her: although standard procedure was to steam at , New York could make only  on her one operable propeller. Due to this, historian Jerry Jones believes that the U-boat captain misjudged the ships speed. With no further damage, however, the battleship arrived safely at a ": null
    },
    {
        "drydock": "drydock"
    },
    {
        " in Rosyth. As she was lifted clear of the water, a large dent commensurate with a submarine bow was found in her hull.        New York was also frequently host to foreign dignitaries, including King ": null
    },
    {
        "George V": "george v"
    },
    {
        " of the United Kingdom and the future ": null
    },
    {
        "Edward VIII": "edward viii"
    },
    {
        ", as well as then-prince ": null
    },
    {
        "Hirohito": "hirohito"
    },
    {
        " of the ": null
    },
    {
        "Empire of Japan": "empire of japan"
    },
    {
        ". The ship was of great interest to other European powers, as it was in many cases a first chance to see an American ": null
    },
    {
        "dreadnought": "dreadnought"
    },
    {
        " up close. She was on hand for the surrender of the German ": null
    },
    {
        "High Seas Fleet": "high seas fleet"
    },
    {
        " on 42 November 42 in the ": null
    },
    {
        "Firth of Forth": "firth of forth"
    },
    {
        ", several days after the signing of the ": null
    },
    {
        "Armistice": "armistice with germany"
    },
    {
        ", after which she returned to the United States briefly. She then served as an escort for , carrying President ": null
    },
    {
        "Woodrow Wilson": "woodrow wilson"
    },
    {
        ", on his trip from the United States to ": null
    },
    {
        "Brest, France": "brest, france"
    },
    {
        " en route to the ": null
    },
    {
        "Versailles Peace Conference": "paris peace conference, 1919"
    },
    {
        ".       Arriving back in the United States in 42 she began to undertake training and patrol duties, including at one point to the ": null
    },
    {
        "Caribbean": "caribbean"
    },
    {
        " with a number of other U.S. ships. During this year, she also saw a refit in ": null
    },
    {
        "Norfolk Navy Yard": "norfolk navy yard"
    },
    {
        " where five 42-inch guns were removed and three additional 42-inch/42 caliber AA guns were added, bringing the total to five. The secondary battery was reduced to sixteen 42-inch/42 caliber guns. In late 42 she sailed to the ": null
    },
    {
        "Pacific Ocean": "pacific ocean"
    },
    {
        " and joined the newly formed ": null
    },
    {
        "United States Pacific Fleet": "united states pacific fleet"
    },
    {
        ". She continued to conduct training and patrol duties in the Pacific until the mid42s when she was transferred again to the ": null
    },
    {
        "Atlantic": "united states atlantic fleet"
    },
    {
        ", and began operating out of the ": null
    },
    {
        "North Atlantic": "north atlantic"
    },
    {
        ", with the exception of several occasional trips to the ": null
    },
    {
        "West Coast of the United States": "west coast of the united states"
    },
    {
        ".        In 42 New York was considered obsolete compared with other battleships in service, so she steamed to Norfolk Navy Yard for a complete refit. While several other battleships in service, including  and  were converted to training ships or scrapped, New York and Texas were chosen to be overhauled to increase their speed, armor, armament, and propulsion systems as allowed by the ": null
    },
    {
        "Washington Naval Treaty": "washington naval treaty"
    },
    {
        " of 42 An additional  were added to her for defense against aerial targets and submarines. The number of 42-inch AA guns was increased to 42 and six of the 42-inch guns were relocated to new casemates on the main deck. The torpedo tubes were removed at this time. Her 42 Babcock & Wilcox ": null
    },
    {
        "coal-fired": "coal-fired"
    },
    {
        " boilers": "boilers"
    },
    {
        " were replaced with six Bureau Express oil-fired boilers and the twin funnels were trunked into one, aft of the forward superstructure. Tripods were fitted in place of lattice masts, and atop the forward tripod a control tower was installed. A tower was built amidships that contained additional fire control to backup the system on the foremast. A new ": null
    },
    {
        "aircraft catapult": "aircraft catapult"
    },
    {
        " was installed atop turret Number 42 and cranes were installed on either side of the funnel for boat and aircraft handling. Additional deck protection was added, and her beam was widened to . She was fitted with ": null
    },
    {
        "anti-torpedo bulge": "anti-torpedo bulge"
    },
    {
        "s. However, these bulges made maneuvering harder at low speeds, she rolled badly, and her gunfire accuracy was reduced in rough seas. On 42 September 42 she left for short-range battle drills with , and from 42 to 42 November the ships traveled to ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        " together with . On 42 April 42 she undertook anti-aircraft practice with Arizona, and then the two ships and Pennsylvania steamed for ": null
    },
    {
        "Cuba": "cuba"
    },
    {
        ", where they stayed until steaming for ": null
    },
    {
        "Hampton Roads": "hampton roads"
    },
    {
        " on 42 May.     She remained with the Pacific Fleet training as part of the series of ": null
    },
    {
        "Fleet Problem": "fleet problem"
    },
    {
        "s until 42 That year she was selected to carry Admiral ": null
    },
    {
        "Hugh Rodman": "hugh rodman"
    },
    {
        ", the Presidents personal representative for the ": null
    },
    {
        "coronation of King George VI and Queen Elizabeth": "coronation of king george vi and queen elizabeth"
    },
    {
        ", and New York took part in the ": null
    },
    {
        "Grand Naval Review": "fleet review, royal navy"
    },
    {
        " of 42 May 42 as sole U.S. Navy representative. In 42 eight ": null
    },
    {
        "/42 caliber": "1.1  /75 caliber gun"
    },
    {
        " AA guns in two quadruple mounts were added to improve the light AA armament. New York was fitted with ": null
    },
    {
        "XAF radar": "xaf radar"
    },
    {
        " in February 42 including the first United States ": null
    },
    {
        "duplexer": "duplexer"
    },
    {
        " so a single antenna could both send and receive. This made her the second ship to be outfitted with radar after the destroyer . The tests conducted on New York led to similar radars being installed on the  and  ": null
    },
    {
        "cruisers": "cruisers"
    },
    {
        " as well as newer battleship . For several years, she served primarily as a training ship for midshipmen and newly enlisted sailors.     In September 42 New York joined the ": null
    },
    {
        "Neutrality Patrol": "neutrality patrol"
    },
    {
        ", safeguarding sea lanes in the North Atlantic, and served as flagship with the Atlantic Squadron, later redesignated the United States Atlantic Fleet, for the next 42 months. In July 42 she protected a convoy of U.S. troops moving to ": null
    },
    {
        "garrison Iceland": "invasion of icelandunited states occupation force"
    },
    {
        ". She was in the midst of a refit on 42 December 42 when the ": null
    },
    {
        "Imperial Japanese": "japan"
    },
    {
        " Navy": "imperial japanese navy"
    },
    {
        " attacked Pearl Harbor": "attack on pearl harbor"
    },
    {
        ", sinking many of the battleships in the U.S. Pacific Fleet and bringing the United States into ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ".       With the outbreak of war, New Yorks overhaul was sped up and completed four weeks after the attack on Pearl Harbor. She returned to duty escorting cargo and troop ships to Iceland and ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ". She continued on patrol duty for the next year. In her first series of escorts, she left Norfolk 42 February, arrived in New York 42 February, Nova Scotia 42 February, and Iceland 42 March, returning to Norfolk on 42 March. She left there on her second patrol 42 April and arrived at New York the next day, Nova Scotia 42 May, ": null
    },
    {
        "Newfoundland": "newfoundland"
    },
    {
        " 42 May, and Iceland 42 May, returning to New York on 42 May. The next day she left for a third escort, arriving again at Nova Scotia on 42 June and Scotland on 42 June, returning to Norfolk on 42 June. Following these three escort missions, she put in for overhaul in Norfolk. The secondary battery was reduced to six 42-inch guns and the anti-aircraft armament was increased to ten 42-inch/42 caliber guns, 42 ": null
    },
    {
        " Bofors guns": "bofors 40 mm"
    },
    {
        " in quadruple mounts, and 42 ": null
    },
    {
        " Oerlikon cannons": "oerlikon 20 mm cannon"
    },
    {
        ". She departed Norfolk on 42 August and arrived the next day at New York. From there, she escorted a convoy to ": null
    },
    {
        "Nova Scotia": "nova scotia"
    },
    {
        " where she remained until 42 August, then departed for Scotland where she was from 42 August to 42 September. She returned to Norfolk on 42 September.        New York saw her first major action during ": null
    },
    {
        "Operation Torch": "operation torch"
    },
    {
        ", the ": null
    },
    {
        "Allied": "allies of world war ii"
    },
    {
        " invasion of ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        " in November 42 She left Norfolk on 42 October in order to join the Allied fleet. Attached to the Southern Attack Group, on 42 November, New York and the cruiser , screened by six destroyers, attacked Safi harbor in Morocco, supporting landings by the ": null
    },
    {
        "U.S. 42th Infantry Divisions 42th Infantry Regiment": "9th infantry division"
    },
    {
        ", and defended the transports  and  which came under attack by  ": null
    },
    {
        "shore batteries": "shore batteries"
    },
    {
        " at Point De La Tour. New York fired several salvoes with her  guns, with one of them striking the base of the battery and ricocheting into a bunker, destroying the range finder and killing the battery commander and neutralizing the battery. Other shore batteries were destroyed by Philadelphias guns and aircraft from ": null
    },
    {
        "escort carrier": "escort carrier"
    },
    {
        " . New York remained on station until the port was secure, then steamed north to support the Center Group off ": null
    },
    {
        "Fedhala": "fedhala"
    },
    {
        " and ": null
    },
    {
        "Casablanca": "casablanca"
    },
    {
        ", specifically to deal with the threat of the ": null
    },
    {
        "Vichy French": "vichy france"
    },
    {
        " battleship ": null
    },
    {
        "Jean Bart": "french battleship jean bart"
    },
    {
        ", but by the time she arrived, that battleship had been disabled by  and other Vichy French ships had been driven off by  and . New York remained on off the coast of North Africa until the beaches were secure, then retired on 42 November. She had expended a total of sixty  rounds. She returned to Norfolk on 42 November.     New York next returned to convoy patrol. She escorted two convoys to Casablanca from the United States during late 42 leaving Norfolk on 42 November and in New York from 42 November to 42 December, Casablanca from 42 to 42 December, and back in Norfolk on 42 January 42 She left Norfolk on the second escort on 42 February, in New York from 42 February to 42 March, in Casablanca from 42 to 42 March, and back to New York from 42 April to 42 May. In 42 she was selected for a refit to become a main battery and escort training center. She arrived in ": null
    },
    {
        "Portland, Maine": "portland, maine"
    },
    {
        " on 42 May, where she remained until 42 July. During her fourth and final refit in early 42 her anti-aircraft battery was increased to ten 42-inch/42 caliber guns, forty 42mm and thirty-six 42mm guns. Improved fire control was added as well, and this ultimately increased her displacement to  standard and  full-load. She returned to Norfolk on 42 August 42 She was used to train crews from the US Navy, ": null
    },
    {
        "US Coast Guard": "us coast guard"
    },
    {
        ", and Allied navies on the 42-inch/42 caliber gun, the 42-inch/42 caliber gun, and the 42mm and 42mm guns, primarily because many newer ships used these weapons. Between July 42 and June 42 about 42 enlisted men and 42 officers trained on her in this capacity. However, the duty lowered morale among the crew and a large number of requests for transfer were put in. Following this duty, she was sent to the ": null
    },
    {
        "US Naval Academy": "us naval academy"
    },
    {
        " and undertook three consecutive Midshipmen cruises ferrying a total of 42 ": null
    },
    {
        "Midshipmen": "midshipmen"
    },
    {
        " from Annapolis to ": null
    },
    {
        "Trinidad": "trinidad"
    },
    {
        " between June and August 42          Selected to return to action in the ": null
    },
    {
        "Pacific Theater": "pacific theater of world war ii"
    },
    {
        " in late 42 she transited the ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        " on 42 November, and arrived in ": null
    },
    {
        "Long Beach, California": "long beach, california"
    },
    {
        " on 42 December, breaking down at least once along the way and losing an observation plane in bad weather. She conducted refresher training off ": null
    },
    {
        "Southern California": "southern california"
    },
    {
        " in December 42 and January 42 New York departed 42 January and rendezvoused with , , , Texas, and , forming a support force for the ": null
    },
    {
        "invasion of Iwo Jima": "battle of iwo jima"
    },
    {
        ". New York lost a blade off her port screw just before the invasion began and briefly put in for temporary repairs at ": null
    },
    {
        "Eniwetok": "eniwetok"
    },
    {
        " from 42 to 42 February. She returned to the group, which was near ": null
    },
    {
        "Saipan": "saipan"
    },
    {
        ", on 42 February. Together, they arrived at Iwo Jima on 42 February and began the pre-invasion bombardment. During the three days of shore bombardment that followed, New York expended 42 rounds, including 42 42-inch rounds. One of her salvoes struck the primary ammunition dump on the island, causing the most spectacular secondary explosion in the campaign.  She retired from the area on 42 February and arrived at ": null
    },
    {
        "Ulithi": "ulithi"
    },
    {
        " on 42 February.        After a permanent repair to her port propeller at ": null
    },
    {
        "Manus": "manus island"
    },
    {
        " from 42 February to 42 March, she rejoined ": null
    },
    {
        "Task Force 42": "task force 54"
    },
    {
        " at Ulithi on 42 March in preparation for the ": null
    },
    {
        "invasion of Okinawa": "battle of okinawa"
    },
    {
        ". Joined by , , and West Virginia, the fleet of battleships began its bombardment of ": null
    },
    {
        "Okinawa": "okinawa"
    },
    {
        " on 42 March. Providing shore bombardment, and later ": null
    },
    {
        "naval artillery support": "naval artillery support"
    },
    {
        " for ground forces, New York was on station for 42 consecutive days, during which she expended 42 rounds of 42-inch ammunition and 42 rounds of 42-inch ammunition. She was subjected to a  kamikaze  attack on 42 April which destroyed one spotting plane on its catapult, but the Japanese aircraft crashed  from the ship and New York received only superficial damage, suffering two men injured. She was detached on 42 June, her gun barrels having been worn out by fire, and proceeded to Pearl Harbor to have her guns relined in preparation for ": null
    },
    {
        "the invasion of mainland Japan": "operation downfall"
    },
    {
        ". She stopped by ": null
    },
    {
        "Leyte": "leyte"
    },
    {
        " on 42 June and arrived at Pearl Harbor on 42 July. She was in the harbor on 42 August, the end of the war.     During World War II, New York spent 42 days with the Atlantic Fleet from December 42 to November 42 and 42 days with the Pacific Fleet. She expended a total of 42 rounds of all types totaling , traveled , spent 42 days underway, and consumed  of fuel oil.            Following the end of the war, New York entered the ": null
    },
    {
        "Operation Magic Carpet": "operation magic carpet"
    },
    {
        " fleet, leaving Pearl Harbor on 42 September and arriving at ": null
    },
    {
        "San Pedro": "san pedro bay"
    },
    {
        " on 42 September with a load of veterans embarked. She then proceeded to New York City to take part in ": null
    },
    {
        "Navy Day": "navy day"
    },
    {
        " celebrations.        Selected as a test ship for ": null
    },
    {
        "Operation Crossroads": "operation crossroads"
    },
    {
        ", she was used in nuclear bomb tests at ": null
    },
    {
        "Bikini Atoll": "bikini atoll"
    },
    {
        " in July 42 with about 42 other ships, surviving both the Able and Baker tests. Following these tests, she was towed to Pearl Harbor to study the effects of the bomb blasts on her. On 42 July 42 she was towed out to sea and used as target practice, and was sunk by several naval aircraft and ships.         New York received three ": null
    },
    {
        "battle stars": "battle starnavy warships"
    },
    {
        " for her wartime service. ": null
    },
    {
        "World War I Victory Medal": "world war i victory medal"
    },
    {
        " American Defense Service Medal": "american defense service medal"
    },
    {
        " American Campaign Medal": "american campaign medal"
    },
    {
        " European-African-Middle Eastern Campaign Medal": "european-african-middle eastern campaign medal"
    },
    {
        " with one ": null
    },
    {
        "battle star": "battle star"
    },
    {
        " Asiatic-Pacific Campaign Medal": "asiatic-pacific campaign medal"
    },
    {
        " with two ": null
    },
    {
        "battle stars": "battle stars"
    },
    {
        " World War II Victory Medal": "world war ii victory medal"
    }
]