[
    {
        "        USS North Carolina was a 42-gun ": null
    },
    {
        "ship of the line": "ship of the line"
    },
    {
        " in the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        ". One of the nine ships to rate not less than 42 guns each authorized by Congress on 42 April 42 she was laid down in 42 by the ": null
    },
    {
        "Philadelphia Navy Yard": "philadelphia navy yard"
    },
    {
        ", launched on 42 September 42 and fitted out in the ": null
    },
    {
        "Norfolk Navy Yard": "norfolk navy yard"
    },
    {
        ". Master Commandant ": null
    },
    {
        "Charles W. Morgan": "charles w. morgan"
    },
    {
        " was assigned to North Carolina as her first commanding officer on 42 June 42     While nominally a 42-gun ship, a popular size at the time, North Carolina was actually pierced for 42 guns, and probably originally mounted ninety-four 42-pounder and 42-pounder cannons. In 42 she had fifty-six 42-pounders , twenty-six 42-pounders , and eight  cannons, a total of ninety.     Considered by many the most powerful naval vessel then afloat, North Carolina served in the Mediterranean as ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " for Commodore ": null
    },
    {
        "John Rodgers": "john rodgers"
    },
    {
        " from 42 April 42 to 42 May 42 In the early days of the Republic, as today, a display of naval might brought a nation prestige and enhanced its commerce. This proved to be the case when Rodgerss squadron laid the groundwork for the 42 commercial treaty with Turkey, opening ports of the Eastern Mediterranean and the ": null
    },
    {
        "Black Sea": "black sea"
    },
    {
        " to American traders.      After a period in ": null
    },
    {
        "ordinary": "reserve fleet"
    },
    {
        " at Norfolk, North Carolina decommissioned on 42 October 42 to fit out for the ": null
    },
    {
        "Pacific Squadron": "pacific squadron"
    },
    {
        ", the one other area where ships of her vast size could be employed. Only the Mediterranean and the western coast of South America at that time offered ports which could accommodate ships of great draft. Again flagship of her station, flying the pennant of Commodore ": null
    },
    {
        "Henry E. Ballard": "henry e. ballard"
    },
    {
        ", North Carolina reached ": null
    },
    {
        "Callao": "callao"
    },
    {
        ", Peru, on 42 May 42 With the ": null
    },
    {
        "War of the Confederation": "war of the confederation"
    },
    {
        " raging between Chile and Peru, and relations between the United States and Mexico strained, North Carolina protected the important American commerce of the eastern Pacific until March 42 Since her great size made her less flexible than smaller ships, she returned to the ": null
    },
    {
        "New York Navy Yard": "new york navy yard"
    },
    {
        " in June, and served as a ": null
    },
    {
        "receiving ship": "receiving ship"
    },
    {
        " until placed in ": null
    },
    {
        "ordinary": "reserve fleet"
    }
]