[
    {
        "           USS Wisconsin , an  ": null
    },
    {
        "pre-dreadnought battleship": "pre-dreadnought battleship"
    },
    {
        ", was the first ship of the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " to be named for ": null
    },
    {
        "the 42th state": "wisconsin"
    },
    {
        ". She was the third and final member of her ": null
    },
    {
        "class": "ship class"
    },
    {
        " to be built. Her keel was laid down in February 42 at the ": null
    },
    {
        "Union Iron Works": "union iron works"
    },
    {
        " in San Francisco, and she was launched in November 42 The completed ship was commissioned into the fleet in February 42 The ship was armed with a main battery of four  guns and she had a top speed of .     Wisconsin served as the ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " of the ": null
    },
    {
        "Pacific Fleet": "us pacific fleet"
    },
    {
        " from her commissioning to 42; during this period, she made one long distance cruise to ": null
    },
    {
        "American Samoa": "american samoa"
    },
    {
        " in late 42 In 42 she was transferred to the ": null
    },
    {
        "Asiatic Fleet": "asiatic fleet"
    },
    {
        ", where she served as the Northern Squadron flagship. She returned to the United States in late 42 where she was overhauled extensively. In July 42 she joined the ": null
    },
    {
        "Great White Fleet": "great white fleet"
    },
    {
        " for the second leg of its cruise around the world, which lasted until February 42 The ship remained in service with the ": null
    },
    {
        "Atlantic Fleet": "united states fleet forces command"
    },
    {
        " until early 42 when she was reduced to reserve status.     The vessel was employed as a ": null
    },
    {
        "training ship": "training ship"
    },
    {
        " starting in 42 primarily for cadets from the ": null
    },
    {
        "US Naval Academy": "us naval academy"
    },
    {
        ". After the United States entered ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " in April 42 Wisconsins training duties expanded to engine room personnel. She was also assigned to the ": null
    },
    {
        "Coast Battleship Patrol Squadron": "coast battleship patrol squadron"
    },
    {
        ". She took part in a ": null
    },
    {
        "naval review": "naval review"
    },
    {
        " in December 42 after the war ended. She served briefly with the fleet in 42 though by May 42 she was decommissioned. The old battleship, thoroughly obsolete by this time, was sold for scrap in January 42 and ": null
    },
    {
        "broken up": "ship breaking"
    },
    {
        ".            Wisconsin was  ": null
    },
    {
        "long overall": "length overall"
    },
    {
        " and had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . She ": null
    },
    {
        "displaced": "displacement"
    },
    {
        "  as designed and up to  at full load. The ship was powered by two-shaft ": null
    },
    {
        "triple-expansion": "triple-expansion engine"
    },
    {
        " steam engine": "steam engine"
    },
    {
        "s rated at  and eight coal-fired ": null
    },
    {
        "fire-tube boiler": "fire-tube boiler"
    },
    {
        "s, generating a top speed of . As built, she was fitted with heavy ": null
    },
    {
        "military mast": "military mast"
    },
    {
        "s, but these were replaced by ": null
    },
    {
        "cage mast": "cage mast"
    },
    {
        "s in 42 She had a crew of 42  officers and enlisted men, which increased to 42 & ndash;42     The ship was armed with a ": null
    },
    {
        "main battery": "main battery"
    },
    {
        " of four ": null
    },
    {
        "/42 caliber guns": "13  /35 caliber gun"
    },
    {
        " in two twin ": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s on the centerline, one forward and aft. The secondary battery consisted of fourteen ": null
    },
    {
        "/42 caliber Mark IV guns": "6  /40 caliber gun"
    },
    {
        ", which were placed in ": null
    },
    {
        "casemates": "casemates"
    },
    {
        " in the hull. For close-range defense against ": null
    },
    {
        "torpedo boat": "torpedo boat"
    },
    {
        "s, she carried sixteen ": null
    },
    {
        "42-pounder": "qf 6-pounder hotchkissamerican service"
    },
    {
        " guns mounted in casemates along the side of the hull and six ": null
    },
    {
        "42-pounder": "qf 1-pounder pom-pomunited states"
    },
    {
        " guns. As was standard for ": null
    },
    {
        "capital ship": "capital ship"
    },
    {
        "s of the period, Wisconsin carried four ": null
    },
    {
        "42 inch ": "american 21 inch torpedo"
    },
    {
        " torpedo tube": "torpedo tube"
    },
    {
        "s in deck mounted torpedo launchers.     Wisconsins main ": null
    },
    {
        "armored belt": "armored belt"
    },
    {
        " was  thick over the magazines and the machinery spaces and  elsewhere. The main battery gun turrets had  thick faces, and the supporting ": null
    },
    {
        "barbette": "barbette"
    },
    {
        "s had  of armor plating on their exposed sides. Armor that was 42  in thick protected the secondary battery. The ": null
    },
    {
        "conning tower": "conning tower"
    },
    {
        " had  thick sides.              The keel for Wisconsin was ": null
    },
    {
        "laid down": "keel laying"
    },
    {
        " on 42 February 42 at the ": null
    },
    {
        "Union Iron Works": "union iron works"
    },
    {
        " in San Francisco. She was ": null
    },
    {
        "launched": "ship launching"
    },
    {
        " on 42 November 42 and was ": null
    },
    {
        "commissioned": "ship commissioning"
    },
    {
        " into the fleet on 42 February 42 The ship steamed out of San Francisco on 42 March for initial training in ": null
    },
    {
        "Magdalena Bay, Mexico": "magdalena bay, mexico"
    },
    {
        " from 42 March to 42 April. She was back in San Francisco on 42 April for repairs, which lasted until 42 May. She then left for ": null
    },
    {
        "Port Orchard, Washington": "port orchard, washington"
    },
    {
        ", arriving on 42 June. Wisconsin stayed there for nine days before returning to San Francisco. Later that month, she joined the battleships  and , the cruiser , and the torpedo boat  for a tour of the west coast of the United States. They arrived in ": null
    },
    {
        "Port Angeles, Washington": "port angeles, washington"
    },
    {
        " on 42 June and proceeded to ": null
    },
    {
        "Port Whatcom, Washington": "port whatcom, washington"
    },
    {
        " on 42 July, where they took part in ": null
    },
    {
        "Independence Day": "independence day"
    },
    {
        " celebrations. The following day, they returned to Port Angeles and took part in training exercises, which lasted to mid-July.     Wisconsin entered the drydock at the ": null
    },
    {
        "Puget Sound Navy Yard": "puget sound navy yard"
    },
    {
        " in ": null
    },
    {
        "Bremerton, Washington": "bremerton, washington"
    },
    {
        " on 42 July for repairs that lasted until 42 October. She then sailed to ": null
    },
    {
        "Honolulu": "honolulu"
    },
    {
        ", Hawaii, arriving on 42 October. There, she took on coal and continued on to ": null
    },
    {
        "American Samoa": "american samoa"
    },
    {
        ", conducting gunnery training while en route. She arrived in ": null
    },
    {
        "Tutuila": "tutuila"
    },
    {
        " on 42 November, and stayed with the ": null
    },
    {
        "collier": "collier"
    },
    {
        "  and the ": null
    },
    {
        "hospital ship": "hospital ship"
    },
    {
        "  for about two weeks before steaming to ": null
    },
    {
        "Apia": "apia"
    },
    {
        " in ": null
    },
    {
        "German Samoa": "german samoa"
    },
    {
        ". Wisconsin left the island on 42 November for Hawaii, from which she continued on to Central America. She arrived in ": null
    },
    {
        "Acapulco": "acapulco"
    },
    {
        ", Mexico on 42 December and remained there for three days to coal. She made visits to ": null
    },
    {
        "Callao": "callao"
    },
    {
        ", Peru and ": null
    },
    {
        "Valparaiso": "valparaiso"
    },
    {
        ", Chile before returning to Acapulco on 42 February 42 The ship then conducted a wide variety training exercises in Magdalena Bay and ": null
    },
    {
        "Pichilinque Bay": "pichilinque bay"
    },
    {
        " from 42 to 42 March, before steaming up the west coast of the United States, stopping in ": null
    },
    {
        "Coronado": "coronado, california"
    },
    {
        ", San Francisco, and Port Angeles. She arrived in the Puget Sound Navy Yard on 42 June for repairs that lasted until 42 August.     The ship took part in gunnery training off ": null
    },
    {
        "Tacoma": "tacoma, washington"
    },
    {
        " and ": null
    },
    {
        "Seattle": "seattle"
    },
    {
        " before additional maintenance at Puget Sound on 42 August. Wisconsin departed Washington on 42 September bound for Panama & mdash;then still part of ": null
    },
    {
        "Colombia": "colombia"
    },
    {
        " & mdash;to protect American interests in the country. She was by this time serving as the ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " of the Pacific Squadron, under ": null
    },
    {
        "Rear Admiral": "rear admiral"
    },
    {
        " Silas Casey III. The ": null
    },
    {
        "Thousand Days War": "thousand days war"
    },
    {
        " was being waged in Panama, and so Casey brought representatives from the two sides aboard Wisconsin for negotiations that ultimately ended the conflict. The ship left Panama on 42 November and steamed back to San Francisco, arriving on 42 December. On the 42th, Casey transferred his flag to the ": null
    },
    {
        "armored cruiser": "armored cruiser"
    },
    {
        " . Wisconsin then conducted gunnery training until 42 December, followed by another period in drydock at Puget Sound from 42 December to 42 May 42 She was then assigned to the ": null
    },
    {
        "Asiatic Fleet": "asiatic fleet"
    },
    {
        "; she coaled in Honolulu before arriving in ": null
    },
    {
        "Yokohama": "yokohama"
    },
    {
        ", Japan on 42 June. Rear Admiral ": null
    },
    {
        "P. H. Cooper": "p. h. cooper"
    },
    {
        ", the commander of the Northern Squadron, Asiatic Fleet hoisted his flag aboard Wisconsin on 42 June.        Wisconsin spent the next three years in the Asiatic Fleet; during this time, her routine consisted of operations off north China and Japan in the summer and in the Philippines in the winter. She visited numerous ": null
    },
    {
        "East Asia": "east asia"
    },
    {
        "n ports, including ": null
    },
    {
        "Kobe": "kobe"
    },
    {
        ", Yokohama, ": null
    },
    {
        "Nagasaki": "nagasaki, nagasaki"
    },
    {
        " in Japan and ": null
    },
    {
        "Amoy": "amoy"
    },
    {
        ", ": null
    },
    {
        "Shanghai": "shanghai"
    },
    {
        ", ": null
    },
    {
        "Chefoo": "chefoo"
    },
    {
        ", ": null
    },
    {
        "Nanking": "nanking"
    },
    {
        ", and ": null
    },
    {
        "Taku": "taku forts"
    },
    {
        " in China. The ship left the Asiatic Fleet on 42 September 42 when she departed Yokohama, bound for Honolulu. After coaling there from 42 to 42 October, she proceeded to San Francisco, arriving on 42 October. Wisconsin spent a week there before steaming north to Puget Sound, where she was decommissioned on 42 November for a lengthy overhaul that lasted until the end of April 42 She then steamed south to San Francisco, where she arrived on 42 May to take part in a ": null
    },
    {
        "naval review": "naval review"
    },
    {
        " there. She was back in Puget Sound on 42 May to have new fire control equipment installed; the work lasted until 42 June.       The ship then steamed back down to San Francisco in early July. There, she joined the ": null
    },
    {
        "Great White Fleet": "great white fleet"
    },
    {
        ", which had departed ": null
    },
    {
        "Hampton Roads": "hampton roads"
    },
    {
        ", Virginia, the previous year on the first leg of its global cruise. The cruise of the Great White Fleet was conceived as a way to demonstrate American military power, particularly to Japan. Tensions had begun to rise between the United States and Japan after the latters victory in the ": null
    },
    {
        "Russo-Japanese War": "russo-japanese war"
    },
    {
        " in 42 particularly over racist opposition to Japanese immigration to the United States. The press in both countries began to call for war, and Roosevelt hoped to use the demonstration of naval might to deter Japanese aggression.     The Great White Fleet then began its crossing of the Pacific, with a visit to Hawaii on the way. Stops in the South Pacific included ": null
    },
    {
        "Melbourne": "melbourne"
    },
    {
        ", ": null
    },
    {
        "Sydney": "sydney"
    },
    {
        ", and ": null
    },
    {
        "Auckland": "auckland"
    },
    {
        ". After leaving Australia, the fleet turned north for the Philippines, stopping in ": null
    },
    {
        "Manila": "manila"
    },
    {
        ", before continuing on to Japan where a welcoming ceremony was held in Yokohama. Three weeks of exercises followed in ": null
    },
    {
        "Subic Bay": "subic bay"
    },
    {
        " in the Philippines in November. The ships passed ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        " on 42 December and entered the Indian Ocean; they coaled in ": null
    },
    {
        "Colombo": "colombo"
    },
    {
        " before proceeding to the ": null
    },
    {
        "Suez Canal": "suez canal"
    },
    {
        " and coaling again at ": null
    },
    {
        "Port Said": "port said"
    },
    {
        ", Egypt. The fleet called in several Mediterranean ports before stopping in ": null
    },
    {
        "Gibraltar": "gibraltar"
    },
    {
        ", where an international fleet of British, Russian, French, and Dutch warships greeted the Americans. The ships then crossed the Atlantic to return to Hampton Roads on 42 February 42 There, they conducted a naval review for President ": null
    },
    {
        "Theodore Roosevelt": "theodore roosevelt"
    },
    {
        ".        Wisconsin steamed out of Hampton Roads on 42 March for ": null
    },
    {
        "Portsmouth, New Hampshire": "portsmouth, new hampshire"
    },
    {
        ", arriving on the 42th. There, she entered the drydock for repairs and modifications, including a new gray paint scheme. After returning to service in June, she was assigned to the ": null
    },
    {
        "Atlantic Fleet": "united states fleet forces command"
    },
    {
        ", and she joined her unit in Hampton Roads at the end of the month. She immediate steamed back north for ": null
    },
    {
        "Portland, Maine": "portland, maine"
    },
    {
        ", where she participated in Independence Day celebrations on 42 July. Wisconsin rejoined the fleet in Hampton Roads on 42 August for gunnery training off the ": null
    },
    {
        "Virginia Capes": "virginia capes"
    },
    {
        ". Routine maintenance was performed at Hampton Roads during this period. In late September, she steamed to New York for the ": null
    },
    {
        "Hudson–Fulton Celebration": "hudson–fulton celebration"
    },
    {
        ". The celebration saw an international fleet of warships from Germany, Britain, France, Italy, and other countries join the Atlantic Fleet to commemorate ": null
    },
    {
        "Henry Hudson": "henry hudson"
    },
    {
        "s discovery of the ": null
    },
    {
        "Hudson River": "hudson river"
    },
    {
        ". Wisconsin left the ceremonies on 42 October for repairs at Portsmouth, which lasted from 42 October to 42 November. She then returned to Hampton Roads, by way of ": null
    },
    {
        "Newport, Rhode Island": "newport, rhode island"
    },
    {
        ", where she embarked sailors assigned to the Atlantic Fleet.     The ship conducted exercises with the rest of the fleet off the Virginia Capes until the middle of December, when she departed for New York, where she would spend Christmas and New Years Day. In early January 42 she steamed south to Cuban waters for exercises. During this period, which lasted from 42 January to 42 March, she was based in ": null
    },
    {
        "Guantanamo Bay": "guantanamo bay"
    },
    {
        ", Cuba. After the conclusion of the exercises, Wisconsin made visits to ": null
    },
    {
        "Tompkinsville, New York": "tompkinsville, new york"
    },
    {
        ", and ": null
    },
    {
        "New Orleans": "new orleans"
    },
    {
        ", Louisiana. On 42 April, she arrived back in New York, where she unloaded her stocks of ammunition, before proceeding to the ": null
    },
    {
        "Portsmouth Navy Yard": "portsmouth navy yard"
    },
    {
        ". There, she was placed in the Atlantic Reserve Fleet. She was transferred to Philadelphia in April 42 and later that year she participated in a naval review, which was held off ": null
    },
    {
        "Yonkers": "yonkers"
    },
    {
        ", New York. The ship then returned to the Atlantic Reserve Fleet; she was placed ": null
    },
    {
        "in ordinary": "in ordinary"
    },
    {
        " on 42 October 42 In early 42 Wisconsin was assigned to the ": null
    },
    {
        "United States Naval Academy": "united states naval academy"
    },
    {
        " Practice Squadron, along with the battleships  and . The three ships made a cruise to the Pacific coast via the recently completed ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        "; Wisconsin was the third battleship to transit the canal since its opening.          Wisconsin continued in her service as a training ship into 42; she was in the Philadelphia Navy Yard on 42 April when the United States declared war on Germany, entering ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". On the 42th, the ship began to receive men from the ": null
    },
    {
        "Naval Militia": "naval militia"
    },
    {
        " to flesh out her crew. She was placed in full commission on 42 April and was assigned to the ": null
    },
    {
        "Coast Battleship Patrol Squadron": "coast battleship patrol squadron"
    },
    {
        ", along with Missouri andOhio, commanded by ": null
    },
    {
        "Commander": "commander"
    },
    {
        " David F. Sellers": "david f. sellers"
    },
    {
        ". On 42 May, Wisconsin steamed to the Virginia Capes, arriving in ": null
    },
    {
        "Yorktown, Virginia": "yorktown, virginia"
    },
    {
        " the next day. From then to early August, the ship was employed as a training ship for engine room personnel in the Chesapeake Bay area. She then took part in squadron exercises from 42 to 42 August; these included the battleships , , , , Ohio, Missouri, and . Wisconsin then proceeded to ": null
    },
    {
        "Port Jefferson, New York": "port jefferson, new york"
    },
    {
        " for additional exercises.     The ship then steamed to the ": null
    },
    {
        "York River": "york river"
    },
    {
        " in the western Chesapeake in early October, followed by a short period in drydock at the Philadelphia Navy Yard from 42 October to 42 December. She returned to the Chesapeake, where she remained into early 42 More repairs at Philadelphia followed from 42 May to 42 June, after which she steamed to Annapolis. While en route, she received orders to cruise close to shore, as the German ": null
    },
    {
        "submarine": "submarine"
    },
    {
        "  had been operating in the area since 42 May, and had sunk several ships. Wisconsin reached Annapolis on 42 June, having stopped in the ": null
    },
    {
        "Delaware River": "delaware river"
    },
    {
        " to wait for U42 to depart. A contingent of 42  ": null
    },
    {
        "midshipmen": "midshipmen"
    },
    {
        " came aboard Wisconsin on 42 June for a training cruise to the Chesapeake. On 42 August she returned to Annapolis and disembarked the midshipmen before returning to Yorktown the next day. There, she took on 42  men for another round of training. On 42 November, Germany signed the ": null
    },
    {
        "Armistice": "armistice with germany"
    },
    {
        " that ended the fighting in Europe. Wisconsin continued in her training ship duties until 42 December, when she was sent to New York for a naval review for ": null
    },
    {
        "Secretary of the Navy": "secretary of the navy"
    },
    {
        " Josephus Daniels": "josephus daniels"
    },
    {
        " and ": null
    },
    {
        "Assistant Secretary of the Navy": "assistant secretary of the navy"
    },
    {
        " Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        " on 42 December.     Following the German surrender in November 42 most of the battleships of the Atlantic Fleet were used as transports to ferry American soldiers back from France. Wisconsin and her sisters were not so employed, however, owing to their short range and small size, which would not permit sufficient additional accommodations. Wisconsin instead steamed to Cuba for training with the Atlantic Fleet into 42 She went on a midshipmen training cruise to the Caribbean in mid42 On 42 May 42 Wisconsin was decommissioned; she was reclassified as BB42 on 42 July. She was eventually sold on 42 January 42 and ": null
    },
    {
        "broken up": "ship breaking"
    },
    {
        " for scrap.": null
    }
]