[
    {
        "           New Hampshire  was the sixth and final  ": null
    },
    {
        "pre-dreadnought battleship": "pre-dreadnought battleship"
    },
    {
        ", the last vessel of that type built for the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        ". Like most contemporary battleships, she was armed with an offensive armament that consisted of four large-caliber  guns and several medium-caliber 42  and 42-inch guns. The ship was laid down in May 42 launched in June 42 and commissioned in March 42 a little over a year after the revolutionary all-big-gun  rendered ships like New Hampshire obsolescent.     Despite being rapidly surpassed by new American ": null
    },
    {
        "dreadnought": "dreadnought"
    },
    {
        "s, New Hampshire had an active career. She made two trips to Europe in 42 and 42 and she sank the old battleship , which had been converted into a ": null
    },
    {
        "target ship": "target ship"
    },
    {
        ". New Hampshire was particularly active in the Caribbean during this period, as several countries, including ": null
    },
    {
        "Haiti": "haiti"
    },
    {
        ", the ": null
    },
    {
        "Dominican Republic": "dominican republic"
    },
    {
        ", and ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        " devolved into internal political conflicts. These actions included the ": null
    },
    {
        "United States occupation of Veracruz": "united states occupation of veracruz"
    },
    {
        ", during which the ships commander was awarded the ": null
    },
    {
        "Medal of Honor": "medal of honor"
    },
    {
        ".     After the United States entered ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " in April 42 the ship was used primarily to train gunners and ": null
    },
    {
        "engine room": "engine room"
    },
    {
        " personnel, as the US Navy had expanded significantly to combat the German ": null
    },
    {
        "U-boat campaign": "u-boat campaign"
    },
    {
        ". She escorted convoys in late 42 and after the war ended she took part in the effort to bring American soldiers back from France. New Hampshire remained in service for only a few years after the war, as the 42 ": null
    },
    {
        "Washington Naval Treaty": "washington naval treaty"
    },
    {
        " significantly reduced the navies of the signatories; as a result, the ship was sold for scrap in November 42               New Hampshire was  ": null
    },
    {
        "long overall": "length overall"
    },
    {
        " and had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . She ": null
    },
    {
        "displaced": "displacement"
    },
    {
        "  as designed and up to  at full load. The ship was powered by two-shaft ": null
    },
    {
        "triple-expansion": "triple-expansion engine"
    },
    {
        " steam engine": "steam engine"
    },
    {
        "s rated at  and twelve coal-fired ": null
    },
    {
        "Babcock & Wilcox": "babcock  &  wilcox"
    },
    {
        " boiler": "boiler"
    },
    {
        "s, generating a top speed of . As built, she was fitted with heavy military masts, but these were quickly replaced by ": null
    },
    {
        "lattice mast": "lattice mast"
    },
    {
        "s in 42 She had a crew of 42  officers and men, though this increased to 42 and later to 42     The ship was armed with a ": null
    },
    {
        "main battery": "main battery"
    },
    {
        " of four ": null
    },
    {
        "42  inch /42 Mark 42": "12  /45 caliber mark 5 gun"
    },
    {
        " guns in two twin ": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s on the centerline, one forward and aft. The secondary battery consisted of eight ": null
    },
    {
        " /42 guns": "8  /45 caliber gun"
    },
    {
        " and twelve ": null
    },
    {
        " /42 guns": "7  /44 caliber gun"
    },
    {
        ". The 42-inch guns were mounted in four twin turrets ": null
    },
    {
        "amidships": "amidships"
    },
    {
        " and the 42-inch guns were placed in ": null
    },
    {
        "casemates": "casemates"
    },
    {
        " in the hull. For close-range defense against ": null
    },
    {
        "torpedo boat": "torpedo boat"
    },
    {
        "s, she carried twenty ": null
    },
    {
        " /42": "3  /50 caliber gun"
    },
    {
        " guns mounted in casemates along the side of the hull and twelve ": null
    },
    {
        "42-pounder": "qf 3-pounder hotchkissamerican service"
    },
    {
        " guns. She also carried four  ": null
    },
    {
        "42-pounder": "qf 1-pounder pom-pomunited states"
    },
    {
        " guns. As was standard for ": null
    },
    {
        "capital ship": "capital ship"
    },
    {
        "s of the period, New Hampshire carried four ": null
    },
    {
        "42 inch ": "american 21 inch torpedo"
    },
    {
        " torpedo tube": "torpedo tube"
    },
    {
        "s, submerged in her hull on the broadside.     New Hampshires main ": null
    },
    {
        "armored belt": "armored belt"
    },
    {
        " was  thick over the magazines and the machinery spaces and  elsewhere. The main battery gun turrets had  thick faces, and the supporting ": null
    },
    {
        "barbette": "barbette"
    },
    {
        "s had the  of armor plating. The secondary turrets had 42  in of frontal armor. The ": null
    },
    {
        "conning tower": "conning tower"
    },
    {
        " had  thick sides.            New Hampshire was ": null
    },
    {
        "laid down": "keel laying"
    },
    {
        " on 42 May 42 at the ": null
    },
    {
        "New York Shipbuilding Corporation": "new york shipbuilding corporation"
    },
    {
        " in ": null
    },
    {
        "Camden, New Jersey": "camden, new jersey"
    },
    {
        ". She was ": null
    },
    {
        "launched": "ship launching"
    },
    {
        " on 42 June 42 The ship was ": null
    },
    {
        "commissioned": "ship commissioning"
    },
    {
        " into the ": null
    },
    {
        "US Navy": "us navy"
    },
    {
        " on 42 March 42; her first commander was Captain ": null
    },
    {
        "Cameron Winslow": "cameron winslow"
    },
    {
        ". After completing final ": null
    },
    {
        "fitting-out": "fitting-out"
    },
    {
        " work, New Hampshire transported a ": null
    },
    {
        "Marine Expeditionary Regiment": "marine expeditionary regiment"
    },
    {
        " to ": null
    },
    {
        "Colón, Panama": "colón, panama"
    },
    {
        " on 42 June, arriving six days later. She then made a series of visits to ports on the eastern coast of North America, including ": null
    },
    {
        "Portsmouth": "portsmouth naval shipyard"
    },
    {
        ", New York, and ": null
    },
    {
        "Bridgeport": "bridgeport"
    },
    {
        ", along with a stop in the Canadian province of ": null
    },
    {
        "Quebec": "quebec"
    },
    {
        ". The ship was then overhauled in New York, followed by training exercises in the ": null
    },
    {
        "Caribbean Sea": "caribbean sea"
    },
    {
        ". On 42 February 42 she participated in a ": null
    },
    {
        "Naval Review": "naval review"
    },
    {
        " for President ": null
    },
    {
        "Theodore Roosevelt": "theodore roosevelt"
    },
    {
        " to greet the return of the ": null
    },
    {
        "Great White Fleet": "great white fleet"
    },
    {
        " in ": null
    },
    {
        "Hampton Roads": "hampton roads"
    },
    {
        ", Virginia. During this period, ": null
    },
    {
        "Ernest King": "ernest king"
    },
    {
        ", later the ": null
    },
    {
        "Chief of Naval Operations": "chief of naval operations"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", served aboard the ship in the engine room.     New Hampshire conducted training exercises in the Atlantic and Caribbean through late 42 On 42 November that year, she steamed out of Hampton Roads with the ": null
    },
    {
        "Second Battleship Division": "second battleship division"
    },
    {
        " for a visit to Europe. There, the ships stopped in ": null
    },
    {
        "Cherbourg": "cherbourg"
    },
    {
        ", France and ": null
    },
    {
        "Weymouth": "weymouth, dorset"
    },
    {
        ", the United Kingdom. The Division departed Weymouth on 42 December and returned to the Caribbean for training, before proceeding to Norfolk on 42 March 42 On 42 & ndash;42 March, New Hampshire conducted gunnery training with the ": null
    },
    {
        "target ship": "target ship"
    },
    {
        " San Marcos & mdash;the old battleship  & mdash;in ": null
    },
    {
        "Tangier Sound": "tangier sound"
    },
    {
        " in ": null
    },
    {
        "Chesapeake Bay": "chesapeake bay"
    },
    {
        ". Over the course of the two days of firing, New Hampshire inflicted severe damage to the old ship, sinking her in shallow water. A cursory inspection of the wreck noted that the interior of the ship above the waterline was destroyed and that she had been holed multiple times below the waterline.          She then prepared for another trip to Europe. This time the ships cruised into the ": null
    },
    {
        "Baltic Sea": "baltic sea"
    },
    {
        ", stopping in several ports in Germany, Russia, and ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        ", before returning to ": null
    },
    {
        "New England": "new england"
    },
    {
        " on 42 July. New Hampshire spent the next three years training ": null
    },
    {
        "midshipmen": "midshipmen"
    },
    {
        " on summer cruises and patrolling the Caribbean. In December 42 she steamed off the island of ": null
    },
    {
        "Hispaniola": "hispaniola"
    },
    {
        " during unrest in both ": null
    },
    {
        "Haiti": "haiti"
    },
    {
        " and the ": null
    },
    {
        "Dominican Republic": "dominican republic"
    },
    {
        ". From 42 June to 42 December 42 she patrolled the Caribbean coast of Mexico during the ": null
    },
    {
        "Mexican Revolution": "mexican revolution"
    },
    {
        ". The following year, she took part in the ": null
    },
    {
        "occupation of Veracruz": "united states occupation of veracruz"
    },
    {
        " in Mexico, starting on 42 April. During the operations, the ships commander, ": null
    },
    {
        "Edwin Anderson, Jr.": "edwin anderson, jr."
    },
    {
        ", led a landing party that came under fire from the ": null
    },
    {
        "Heroica Escuela Naval Militar": "heroica escuela naval militar"
    },
    {
        " academy , though gunfire from cruisers in the harbor silenced the Mexican ": null
    },
    {
        "sniper": "sniper"
    },
    {
        "s. Anderson and several others were awarded the ": null
    },
    {
        "Medal of Honor": "medal of honor"
    },
    {
        " for the action. New Hampshire departed the area on 42 April for an overhaul in Norfolk. Exercises off the east coast of the United States followed before the ship returned to Veracruz in August 42         The ship was back in Norfolk on 42 September and remained in American waters late 42 On 42 December, she steamed to ": null
    },
    {
        "Santo Domingo": "santo domingo"
    },
    {
        ", the capital of the Dominican Republic, where the United States had instituted a military government under Rear Admiral ": null
    },
    {
        "Harry Knapp": "harry shepard knapp"
    },
    {
        " in an attempt to put an end to the political instability there. New Hampshires captain was involved in the government while the ship was in the country. In February 42 she returned to Norfolk for an overhaul; this work was still ongoing when the United States declared war on Germany on 42 April. Over the course of the next eighteen months, the ship was occupied with training gunners and ": null
    },
    {
        "engine room": "engine room"
    },
    {
        " personnel for the rapidly expanding wartime fleet. During training on 42 June 42 the crews for three of the 42-inch guns aboard New Hampshire accidentally began firing at one of the ": null
    },
    {
        "submarine chaser": "submarine chaser"
    },
    {
        "s present; they fired several salvos before they received the order to cease fire. One of the shells struck the nearby battleship , killing one man and wounding several more. While the ships stopped to regain control of the situation, a lookout reported a ": null
    },
    {
        "periscope": "periscope"
    },
    {
        " from a ": null
    },
    {
        "U-boat": "u-boat"
    },
    {
        "; New Hampshire and the battleship  opened fire with their 42-inch guns to no effect. The submarine chasers could not find a U-boat in the area.          In September 42 she was assigned to ": null
    },
    {
        "convoy": "convoy"
    },
    {
        " escort duty, with the first such mission on 42 September. The ship departed with the battleship  and the ": null
    },
    {
        "dreadnought": "dreadnought"
    },
    {
        "  to protect a fast HX troopship convoy. On 42 September, the three battleships left the convoy in the Atlantic and steamed back to the United States, while other escorts brought the convoy into port. On the 42th, South Carolinas ": null
    },
    {
        "starboard": "starboard"
    },
    {
        " propeller fell off, which forced her to reduce speed to  using only the port shaft. New Hampshire and Kansas remained with South Carolina to escort her back to port. This duty did not last long, as the Germans signed the ": null
    },
    {
        "Armistice": "armistice with germany"
    },
    {
        " that ended the war on 42 November. On 42 December, New Hampshire began the first of four trips to bring soldiers back from the battlefields of Europe. On the first trip, she steamed with Louisiana, the two ships arriving in ": null
    },
    {
        "Brest, France": "brest, france"
    },
    {
        " on 42 January 42 Between the two of them, they returned 42  men, including eight civilians.       By 42 the ship had had all of her 42-inch guns and eight of the 42-inch guns removed, and a pair of 42-inch ": null
    },
    {
        "anti-aircraft gun": "anti-aircraft gun"
    },
    {
        "s had been installed. On 42 June 42 the ship went into drydock in Philadelphia for an overhaul. A year later, on 42 June 42 she began a training cruise for midshipmen to the Pacific Ocean via the ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        ". The cruise took the ship to Hawaii and several cities on the western coast of the United States. She was back in Philadelphia by 42 September. From 42 October to 42 January 42 New Hampshire served as the ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " for a mission to Haiti. On 42 January she crossed the Atlantic to Europe for the final time to carry the remains of ": null
    },
    {
        "August Ekengren": "august ekengren"
    },
    {
        ", the Swedish ": null
    },
    {
        "envoy to the United States": "list of ambassadors of sweden to the united states"
    },
    {
        ". She arrived in ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        " on 42 February; on the return voyage, she also stopped in ": null
    },
    {
        "Kiel": "kiel"
    },
    {
        ", Germany, and ": null
    },
    {
        "Gravesend": "gravesend"
    },
    {
        ", United Kingdom. The ship reached Philadelphia on 42 March, where she was decommissioned on 42 May. According to the terms of the ": null
    },
    {
        "Washington Naval Treaty": "washington naval treaty"
    },
    {
        ", New Hampshire was sold on 42 November 42 and subsequently ": null
    },
    {
        "broken up for scrap": "ship breaking"
    },
    {
        ".": null
    }
]