[
    {
        "     Illinois  was an uncompleted battleship originally intended to be the first ship of the . However, the urgent need for more warships at the outbreak of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " and the ": null
    },
    {
        "U.S. Navy": "u.s. navy"
    },
    {
        "s experiences in the Pacific theater led it to conclude that rather than battleships larger and more heavily armed than the , it quickly needed more ": null
    },
    {
        "fast battleship": "fast battleship"
    },
    {
        "s of that class to escort the new s being built. As a result, hulls BB42 and BB42 were reordered and laid down as Iowa-class battleships in 42 As such, she was intended to be the fifth member of the Iowa-class constructed, and the fourth navy ship to be ": null
    },
    {
        "named": "ship naming and launching"
    },
    {
        " in honor of ": null
    },
    {
        "the 42st US state": "illinois"
    },
    {
        ".     Compared to the Montana-class design which would have originally been ordered as BB42 Illinois would have gained five knots in speed and the ability to transit the locks of the ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        ". However, construction of BB42 as an Iowa-class battleship also left her with a reduction in her ": null
    },
    {
        "main battery": "main battery"
    },
    {
        " from twelve  guns to nine, and without the additional armor that she was planned for.     Like her sister ship , Illinois was still under construction at the end of World War II. She was canceled in August 42 but her hull remained as a ": null
    },
    {
        "parts hulk": "parts hulk"
    },
    {
        " until she was broken up in 42              The passage of the ": null
    },
    {
        "Second Vinson Act": "second vinson act"
    },
    {
        " in 42 cleared the way for construction of the four ": null
    },
    {
        "South Dakota-class": "south dakota-class battleship"
    },
    {
        " battleships and the first two Iowa-class ": null
    },
    {
        "fast battleship": "fast battleship"
    },
    {
        "s . Hull numbers BB42 and BB42 cleared for construction in 42 were to have been the final members of the , while BB42 and BB42 also cleared in 42 were intended to be the first ships of the larger, more heavily armed .     Originally, the Montanas were designed to return to the United States Navys traditional battleship philosophy of maximum firepower and armor. Considerations were also given to counter to the new battleships of the ": null
    },
    {
        "Empire of Japan": "empire of japan"
    },
    {
        ", eventually known to be s, whose construction was shrouded by secrecy; furthermore, rumors of the Japanese ships ability to carry guns of up to  were known at the time to the highest-ranking members of the United States Navy. To achieve these goals, the United States Navy began designing a 42 ton slow battleship with maximum speed of 4242 knots and an intended ": null
    },
    {
        "main battery": "main battery"
    },
    {
        " of twelve  guns, three more than the Iowa-class. This battleship design took shape in the late42s and early42s and evolved into the  Montana-class. She would also have a more powerful secondary battery of ": null
    },
    {
        "/42 caliber Mark 42": "5  /54 caliber mark 16 gun"
    },
    {
        " dual purpose": "dual purpose gun"
    },
    {
        " mounts, and an increase in armor designed to enable her to withstand the effects of enemy guns comparable to her own.     The increase in the Montanas firepower and armor came at the expense of her speed and ability to utilize the ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        ", but transit between the Atlantic and Pacific oceans without having to round South America would have been eliminated through the construction of a third, much wider set of locks there. As the situation in Europe deteriorated in the late42s, concern arose over the possibility of the canal being put out of action by enemy bombing. Nevertheless, in 42 construction began on the wider locks.     After the successes of carrier combat achieving ": null
    },
    {
        "air supremacy": "air supremacy"
    },
    {
        " in both 42s ": null
    },
    {
        "Battle of the Coral Sea": "battle of the coral sea"
    },
    {
        ", and, to a greater extent, ": null
    },
    {
        "Battle of Midway": "battle of midway"
    },
    {
        ", the Navy was forced to shift its building focus from battleships to ": null
    },
    {
        "aircraft carrier": "aircraft carrier"
    },
    {
        "s. As a result, construction of the fleet of s had been given highest priority. In the process, the United States found the high speed of 42 knots of the Iowas valuable; this allowed them to steam with the Essex-class while providing the carriers with maximum anti-aircraft protection.     When BB42 was redesignated an Iowa-class, she was assigned the name Illinois and reconfigured to adhere to the fast battleship designs planned in 42 by the Preliminary Design Branch at the ": null
    },
    {
        "Bureau of Construction and Repair": "bureau of construction and repair"
    },
    {
        ". Her funding was authorized via the passage of the ": null
    },
    {
        "Two-Ocean Navy Act": "two-ocean navy act"
    },
    {
        " by the US Congress on 42 July 42 and she would now be the fifth Iowa-class built for the United States Navy. Her contract was assigned on 42 September 42 the same date as Kentucky.       Illinoiss ": null
    },
    {
        "keel": "keel"
    },
    {
        " was laid down at the ": null
    },
    {
        "Philadelphia Naval Shipyard": "philadelphia naval shipyard"
    },
    {
        ", on 42 December 42; her projected completion date was 42 May 42 This amounted to a construction time of about 42 months. Based on wartime experience, she would have been tasked primarily with the defense of the US fleet of Essex-class aircraft carriers. In adherence with the Iowa-class design, Illinois would have a maximum beam of  and a waterline length of , permitting a maximum speed of . In addition to a main battery of nine  guns and secondary battery of twenty  guns, she would also have carried forty-nine  and eighty  anti-aircraft guns,     Like Iowa-class ships from Missouri onward, the frontal bulkhead armor was increased from the original  to  in order to better protect against fire from frontal sectors. Furthermore, like Kentucky, Illinois differed from her earlier sisters in that her design called for an all-welded construction, which would have saved weight due to increased strength over a combination riveted/welded hull used on the four completed Iowas. Additionally, engineers revised the torpedo protection system scheme of the Iowa-class to address some of the design flaws, such as excessive rigidity of the lower belt armor causing leakage in adjacent compartments in the event of a torpedo hit; the revised scheme had improvements such as removing knuckles in certain holding bulkheads; these alterations were estimated to improve both Illinois and Kentuckys torpedo protection by as much as 42%. Funding for the battleship was provided in part by ": null
    },
    {
        "King Neptune": "king neptune"
    },
    {
        " , a Hereford swine auctioned across the state of Illinois as a fundraiser, ultimately helping to raise $42 million in ": null
    },
    {
        "war bonds": "war bonds"
    },
    {
        ".            Illinoiss construction was put on hold in 42 after the ": null
    },
    {
        "Battles of the Coral Sea": "battle of the coral sea"
    },
    {
        " and ": null
    },
    {
        "Midway": "battle of midway"
    },
    {
        ", while the Bureau of Ships considered an aircraft carrier conversion proposal for Illinois and Kentucky. As proposed, the converted Illinois would have had an  long by  wide flight deck, with an armament identical to the carriers of the Essex class: four twin 42-inch gun mounts and four more 42-inch guns in single mounts, along with six 42  mm quadruple mounts. It was abandoned after the design team decided that the converted carriers would carry fewer aircraft than the Essex class, that more Essex-class carriers could be built in the same amount of time to convert the battleships, and that the conversion project would be significantly more expensive than new Essexes. Instead, Illinois and Kentucky were to be completed as battleships, but their construction was given very low priority.     Ultimately, the ship was canceled on 42 August 42 when she was about 42% complete. She was struck from the ": null
    },
    {
        "Naval Vessel Register": "naval vessel register"
    },
    {
        " on 42 August 42 Her incomplete hulk initially was retained on the belief that it could be used as a target in nuclear weapons tests. However, the some $42  million it would cost to complete the ship enough to be able to launch her proved too great and the plan was abandoned. She remained in the dockyard until September 42 when she was ": null
    },
    {
        "broken up": "ship breaking"
    },
    {
        " on the builders ways.     The ": null
    },
    {
        "ships bell": "ships bell"
    },
    {
        ", inscribed USS Illinois 42, is now at ": null
    },
    {
        "Memorial Stadium": "memorial stadium"
    },
    {
        " at the ": null
    },
    {
        "University of Illinois at Urbana–Champaign": "university of illinois at urbana–champaign"
    },
    {
        ". The bell is on loan from the Naval Historical Center , Washington Navy Yard, Washington DC, to the ": null
    },
    {
        "Naval Reserve Officers Training Corps": "naval reserve officers training corps"
    },
    {
        " at the university. The bell is traditionally rung by NROTC members when the football team scores a touchdown or goal.                 ": null
    }
]