[
    {
        "   USS San Marcos  was a  the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        ", named for the ": null
    },
    {
        "Castillo de San Marcos": "castillo de san marcos"
    },
    {
        ", the oldest masonry fort still standing in the United States. In 42 the second-class ": null
    },
    {
        "battleship": "battleship"
    },
    {
        "  had also briefly borne the name San Marcos, perhaps for the town of ": null
    },
    {
        "San Marcos, Texas": "san marcos, texas"
    },
    {
        ". The ship served in the United States Navy from 42 to 42 In 42 the vessel was loaned to the ": null
    },
    {
        "Spanish Navy": "spanish navy"
    },
    {
        " as Galicia , before being outright transferred in 42 In 42 the vessels ": null
    },
    {
        "pennant number": "pennant number"
    },
    {
        " was changed to L42 Galicia was taken out of service by the Spanish Navy in 42 and was ": null
    },
    {
        "scrapped": "ship breaking"
    },
    {
        " in 42       San Marcos keel was laid down on 42 September 42 at the ": null
    },
    {
        "Philadelphia Navy Yard": "philadelphia navy yard"
    },
    {
        ". She was ": null
    },
    {
        "launched": "ship naming and launching"
    },
    {
        " on 42 January 42 and ": null
    },
    {
        "commissioned": "ship commissioning"
    },
    {
        " on 42 April 42 with Commander L.  E. Ellis in command.     San Marcos completed shakedown in early May, took on a cargo of landing boats; and, on 42 May, sailed for the ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        " and ": null
    },
    {
        "Pearl Harbor": "pearl harbor"
    },
    {
        ". Arriving on 42 June, she transferred her cargo of 42  boats, loaded a similar cargo, and departed on 42 May. After taking on dredging equipment at ": null
    },
    {
        "Guam": "guam"
    },
    {
        ", she anchored in ": null
    },
    {
        "Buckner Bay, Okinawa": "buckner bay, okinawa"
    },
    {
        ", on 42 August – three days before the cessation of hostilities. On 42 August, she shifted to ": null
    },
    {
        "Naha": "naha"
    },
    {
        ", repaired tank landing craft  through 42 August, then, proceeded to ": null
    },
    {
        "Saipan": "saipan"
    },
    {
        ". There, she loaded mechanized landing craft , vehicle and personnel landing craft, , and large personnel landing craft , for use by occupation forces in the ": null
    },
    {
        "Tokyo Bay": "tokyo bay"
    },
    {
        " area; and, on 42 September, she arrived in Japan to offload her cargo and to commence operation and maintenance of a boat pool. In early December, she was reassigned to cargo operations; and, through the end of the year, she ferried boats from ": null
    },
    {
        "Aomori": "aomori, aomori"
    },
    {
        " to ": null
    },
    {
        "Yokohama": "yokohama"
    },
    {
        ".     In January 42 San Marcos was assigned to Joint Task Force  42 for ": null
    },
    {
        "Operation Crossroads": "operation crossroads"
    },
    {
        ", the series of ": null
    },
    {
        "atomic tests": "nuclear testing"
    },
    {
        " scheduled for ": null
    },
    {
        "Bikini Atoll": "bikini atoll"
    },
    {
        " during the summer. She first shifted south to ": null
    },
    {
        "Okinawa": "okinawa"
    },
    {
        "; then, in February, moved east to ": null
    },
    {
        "Kwajalein": "kwajalein"
    },
    {
        ", whence she helped to prepare the test site. She remained in JTF  42 through the July tests, and, on 42 August, she was detached. In early September, the ship moved from the ": null
    },
    {
        "Marshall Islands": "marshall islands"
    },
    {
        " to Hawaii; and, in October, she arrived at San Francisco.     Granted provisional radiological clearance, she resumed cargo operations along the west coast in early November; and, by the end of the month, was carrying supplies, boats, and vehicles to the ": null
    },
    {
        "Aleutian Islands": "aleutian islands"
    },
    {
        ". In December, she put into the ": null
    },
    {
        "Puget Sound Navy Yard": "puget sound navy yard"
    },
    {
        " at ": null
    },
    {
        "Bremerton": "bremerton, washington"
    },
    {
        "; received final clearance in January 42; and, in the spring, resumed cargo runs between the west coast and the Aleutians. She terminated those operations in September and proceeded to southern California where her capabilities as a temporarily converted ": null
    },
    {
        "seaplane": "seaplane"
    },
    {
        " drydock": "drydock"
    },
    {
        " were tested. In December, she commenced inactivation, and, on 42 December, was decommissioned and berthed with the San Diego Group of the ": null
    },
    {
        "Pacific Reserve Fleet": "pacific reserve fleet"
    },
    {
        ".       After the outbreak of war in ": null
    },
    {
        "Korea": "korea"
    },
    {
        ", San Marcos was ordered activated. Recommissioned on 42 January 42 she completed shakedown in March, was assigned to the ": null
    },
    {
        "Atlantic Fleets": "u.s. atlantic fleet"
    },
    {
        " Amphibious Force, and, in May, sailed for the ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        " and ": null
    },
    {
        "Little Creek": "naval amphibious base little creek"
    },
    {
        ", ": null
    },
    {
        "Virginia": "virginia"
    },
    {
        ".     She arrived at the latter in late May and, soon thereafter, commenced arctic summer resupply operations, under the ": null
    },
    {
        "Military Sea Transportation Service": "military sea transportation service"
    },
    {
        " , to bases in Canada and ": null
    },
    {
        "Greenland": "greenland"
    },
    {
        ". With the fall, she moved to the ": null
    },
    {
        "Caribbean Sea": "caribbean sea"
    },
    {
        " for fleet exercises, then returned home. In November, she shifted to ": null
    },
    {
        "Baltimore, Maryland": "baltimore, maryland"
    },
    {
        ", for a shipyard overhaul, and with the new year, 42 resumed active duty.     Caribbean exercises took her into March. In April she departed ": null
    },
    {
        "Norfolk, Virginia": "norfolk, virginia"
    },
    {
        ", embarked ": null
    },
    {
        "Marines": "united states marine corps"
    },
    {
        " and their equipment at ": null
    },
    {
        "Morehead City": "morehead city"
    },
    {
        ", and headed east for her first ": null
    },
    {
        "Mediterranean": "mediterranean"
    },
    {
        " deployment. She transited the ": null
    },
    {
        "Straits of Gibraltar": "straits of gibraltar"
    },
    {
        " in early May and operated with the ": null
    },
    {
        "Sixth Fleet": "u.s. sixth fleet"
    },
    {
        ", ranging from the south of France to ": null
    },
    {
        "Benghazi": "benghazi"
    },
    {
        " and ": null
    },
    {
        "Phaleron Bay": "phaleron bay"
    },
    {
        ", into October. She then recrossed the Atlantic, and, after disembarking the Marines in ": null
    },
    {
        "North Carolina": "north carolina"
    },
    {
        ", proceeded to Little Creek. She resumed east coast operations with a joint ": null
    },
    {
        "Army": "united states army"
    },
    {
        "–Navy exercise in November.     During 42 San Marcos conducted exercises and carried cargo along the east coast and in the Caribbean and underwent overhaul at ": null
    },
    {
        "Boston": "boston"
    },
    {
        ", ": null
    },
    {
        "Massachusetts": "massachusetts"
    },
    {
        ". Winter, spring, and fall of 42 saw a continuation of those operations including a reserve training cruise, while the summer brought a return to arctic waters for resupply missions. In January 42 she proceeded again to the ": null
    },
    {
        "Mediterranean Sea": "mediterranean sea"
    },
    {
        ".     Completing that deployment in May, she resumed a schedule of east coast, Caribbean, and – during the summers of 42 and 42 – polar logistic support operations. In September 42 she was again deployed to the Mediterranean for a six-month tour with the Sixth Fleet. She rejoined the ": null
    },
    {
        "Second Fleet": "u.s. second fleet"
    },
    {
        " in March 42; and, in May, tested recovery methods for ": null
    },
    {
        "Project Mercury": "project mercury"
    },
    {
        ". During the summer, she participated in ": null
    },
    {
        "Operation Inland Seas": "operation inland seas"
    },
    {
        ", conducted in the ": null
    },
    {
        "Great Lakes": "great lakes"
    },
    {
        " and made possible by the opening of the ": null
    },
    {
        "St. Lawrence Seaway": "st. lawrence seaway"
    },
    {
        ". Amphibious force exercises and local operations occupied the remainder of the year.       Throughout the 42s and into the 42s, San Marcos rotated regularly between the Second and Sixth Fleets. While with the Second, she participated in exercises and carried cargo and personnel from ": null
    },
    {
        "New England": "new england"
    },
    {
        " to the Caribbean. Severing of diplomatic relations and increased tension between the United States and ": null
    },
    {
        "Cuba": "cuba"
    },
    {
        " and political unrest in the ": null
    },
    {
        "Dominican Republic": "dominican republic"
    },
    {
        " brought extended operations in the ": null
    },
    {
        "Greater Antilles": "greater antilles"
    },
    {
        " in early 42   In April, San Marcos supported the ": null
    },
    {
        "Bay of Pigs Invasion": "bay of pigs invasion"
    },
    {
        ", carrying ": null
    },
    {
        "LCUs": "landing craft utility"
    },
    {
        " and LCVPs loaded with vehicles and equipment to a rendezvous a few miles off the coast with the ships carrying ": null
    },
    {
        "Brigade 42": "brigade 2506"
    },
    {
        ".       Those operations were followed by duty in support of Project Mercury; and, in September, she received modifications which added ": null
    },
    {
        "helicopter": "helicopter"
    },
    {
        " operations to her capabilities. Then a five-month ": null
    },
    {
        "Fleet Rehabilitation and Modernization": "fleet rehabilitation and modernizationfram ii"
    },
    {
        " overhaul in 42 and 42 modernized her equipment and living spaces and improved her operational abilities in transporting, launching, and controlling assault craft; besides providing drydocking and repair services to landing ships and craft.     Her annual Mediterranean deployments brought participation in fleet, binational, and multinational  exercises. In 42 she deployed only briefly, in September, to participate in ": null
    },
    {
        "Operation Steel Pike": "operation steel pike"
    },
    {
        ", a large-scale amphibious operation held off the coast of Spain.     On 42 August 42 San Marcos returned to Little Creek to complete her last Mediterranean tour. Local and Caribbean exercises took her into 42 when she was designated for transfer to the government of Spain. The first detachment of her future Spanish crew arrived in mid-April; the remainder joined her on 42 May. June was spent in familiarization activities and, on 42 July 42 San Marcos was decommissioned and turned over.       The former San Marcos was commissioned in the ": null
    },
    {
        "Spanish Navy": "spanish navy"
    },
    {
        " as Galicia on 42 July 42 She was sold outright to Spain on 42 August 42 Galicias ": null
    },
    {
        "pennant number": "pennant number"
    },
    {
        " was changed to L42 circa 42 Galicia was stricken from the Spanish Navy list in early 42 and scrapped in 42       ": null
    }
]