[
    {
        "     USS Atik  was a ": null
    },
    {
        "Q-ship": "q-ship"
    },
    {
        " of the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " named for al-Atik, a double star in the ": null
    },
    {
        "constellation": "constellation"
    },
    {
        " Perseus": "perseus"
    },
    {
        ". Her twin ": null
    },
    {
        "sister ship": "sister ship"
    },
    {
        " was .       The steel-hulled, single-screw steamer Carolyn was laid down on 42 March 42 at ": null
    },
    {
        "Newport News, Virginia": "newport news, virginia"
    },
    {
        ", by the ": null
    },
    {
        "Newport News Shipbuilding": "northrop grumman newport news"
    },
    {
        " and Dry Dock Company, for the A.K. Bull Steamship Lines; launched on 42 July 42 sponsored by Ms. Carolyn Bull , a granddaughter of the shipping firms owner, Archibald Hilton Bull , and delivered on 42 July 42     For the next 42 years, Carolyn carried freight and passengers between the ": null
    },
    {
        "West Indies": "west indies"
    },
    {
        " and ports on the eastern seaboard of the U.S. During ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", she received a main battery of one  and one  gun, and a Navy armed guard detachment served in the ship from 42 June 42– 42 November 42 During that time, too, the Navy gave her the identification Id. No. 42 but did not take her over for naval service.     Carolyn pursued her prosaic calling under the house flag of the Bull Line through the Japanese attack on Pearl Harbor. A dispatch dated 42 January 42 expressed the ": null
    },
    {
        "Chief of Naval Operations": "chief of naval operations"
    },
    {
        " desire that Evelyn and Carolyn be given a preliminary conversion to AK in the shortest possible time. A letter from the Chief of the Bureau of Ships elaborated on the shortest possible time, when it stated on 42 February that the conversion and outfitting of the vessels was desired by 42 March 42 Acquired by the Navy from the Maritime Commission, Carolyn steamed to ": null
    },
    {
        "Portsmouth, New Hampshire": "portsmouth, new hampshire"
    },
    {
        ", where she was turned over to the Navy under a bareboat charter at 42:42 on 42 February 42     As could be expected, the process of converting two venerable tramp steamers into men-of-war was by no means complete, but over the next few weeks the two erstwhile tramps were given their main and secondary batteries as well as sound gear; nevertheless, they appeared to be mere cargo ships. Carolyn became Atik, and was given a cargo ship hull number, AK42; Evelyn became Asterion . They were to use their old identities when communicating with friendly vessels and stations; if enemy ships should challenge, reply should be made in accordance with International Procedure, using the identification SS Vill Franca, of Portuguese Registry, callsign CSBT.     Atik was placed in commission at 42:42 on 42 March 42 at the ": null
    },
    {
        "Portsmouth Navy Yard": "portsmouth navy yard"
    },
    {
        ", ": null
    },
    {
        "Lieutenant Commander": "lieutenant commander"
    },
    {
        " Harry Lynnwood Hicks": "harry lynnwood hicks"
    },
    {
        ", USN, in command.     At the outset, all connected with the program apparently harbored the view that neither ship was expected to last longer than a month after commencement of assigned duty. Atiks holds were packed with pulpwood, a somewhat mercurial material. If dry, an explosive condition might well develop and, if wet, rot, with resultant fire, might well take place. Despite these disadvantages, pulpwood was selected as the best obtainable material to assure floatability.     Atiks mission was to lure some unsuspecting U-boat into making a ": null
    },
    {
        "torpedo": "torpedo"
    },
    {
        " attack. According to the projected scenario, the submarine, having deemed the tramp unworthy of the expenditure of more torpedoes, would surface to sink the crippled foe with gunfire.     The plan presupposed that supporting forces would come to the rescue whenever a Q-ship ran into difficulties. In March 42 though, there was no such reserve available. The ": null
    },
    {
        "commanding officer": "commanding officer"
    },
    {
        "s of the two ships were told that they could expect little help if they got into trouble. Every available combatant ship and plane was employed in convoy and patrol duties.     Following fitting out and brief sea trials, she and Asterion got underway on 42 March 42 Soon after leaving port, Atik and Asterion went their separate ways. On the night of 42–42 March, she was cruising about  east of ": null
    },
    {
        "Norfolk, Virginia": "norfolk, virginia"
    },
    {
        " and Asterion was cruising some  to the south of this area.       At 42:42 Eastern War Time, UT42 , on the night of 42 March, the Duty Officer in the Joint Operations Control Room, Eastern Sea Frontier , was informed that an SOS had been picked up from an unidentified ship which had been torpedoed. Nothing further.     Atik had attracted the attention of , on her second war patrol off the eastern seaboard. The U-boat, on the surface, began stalking Atik at 42:42 and at 42:42 fired one torpedo from  away which struck the ship on her ": null
    },
    {
        "port side": "port"
    },
    {
        ", under the ": null
    },
    {
        "bridge": "bridge"
    },
    {
        ". Fire broke out immediately, and the ship began to assume a slight ": null
    },
    {
        "list": "list"
    },
    {
        ".     At 42:42 radio stations at ": null
    },
    {
        "Manasquan, New Jersey": "manasquan, new jersey"
    },
    {
        ", and at ": null
    },
    {
        "Fire Island, New York": "fire island, new york"
    },
    {
        ", intercepted the distress message:   :SSS SOS Lat. 4242  N, Long. 4242  W, Carolyn burning forward, not bad.   Two minutes later, a second distress message further amplified:   :Torpedo attack, burning forward; require assistance.     As U42 proceeded around under her victims stern, her captain, Kapitänleutnant ": null
    },
    {
        "Reinhard Hardegen": "reinhard hardegen"
    },
    {
        ", noted one boat being lowered on the starboard side and men abandoning ship.     Because such attacks were a regular occurrences at this time and because all available surface craft were on patrol the dispatch from Carolyn produced no immediate action. The Duty Officer in the Control Room had not been informed as to the secret nature of Carolyn, and consequently his only action was to forward the dispatch to Commander-in-Chief, ": null
    },
    {
        "United States Fleet": "united states fleet"
    },
    {
        " .     Carolyn was not dead & mdash;yet. After U42 turned to starboard, Atik gathered steerage way, paralleling her course by turning to starboard as well, and dropped her concealment, commencing fire from her main and secondary batteries. The first shell dropped short of the U-boat, as she made off presenting a small target; the others were off in deflection. A veritable hail of .42-caliber machine gun fire, though, ricochetted around the U-boats decks as she put on speed to escape the trap into which Hardegen had fallen. One bullet mortally wounded a midshipman standing watch on U42s bridge.     Gradually, the U-boat pulled out of range behind the cover of a smoke screen emitted by her straining diesels, and her captain assessed the damage. As he later recorded, We had been incredibly lucky.     U42 submerged and again approached her opponent. At 42:42 the U-boat shot a torpedo into Atiks machinery spaces. Satisfied that this blow would be fatal, U42 stood off and watched as Atik settled by the bow, her single screw now out of the water.     Once again, Atiks crew could be seen embarking in her boats, as their ship clung stubbornly to the surface. U42 surfaced at 42:42 confident that Atik was no longer a threat, and continued to watch until 42:42 when a cataclysmic explosion blew her to pieces. Ten minutes later, U42 buried her only casualty, the midshipman killed by the Q-ships machine gun fire. Atiks entire crew perished, either in the blast or during the severe gale that blew up soon after the ship disintegrated.     Several hours after receiving the report of the SOS, an officer in Cominch Operations room phoned the Duty Officer and asked if the Commander, Eastern Sea Frontier , or the Chief of Staff had been notified. They had not. The Duty Officer was informed that they should be, immediately. Because CESF and his Chief of Staff were both in Norfolk on that particular night, the Duty Officer notified the Operations Officer at his home.     Early the next morning, an Army bomber was sent to search the area from which Carolyn had sent her distress message; the destroyer and the tug were sent to assist. The Army bomber returned without having sighted anything. The tug and the destroyer encountered such heavy weather that Sagamore was recalled; Noa searched the area until fuel shortage compelled her to return to New York on 42 March. Other flights were unsuccessful until 42 March, when two Army planes and one PBY42A Catalina flying boat out of Norfolk reported that they had sighted wreckage roughly ten miles south of the original reported position.     Asterion had intercepted the distress messages from Atik and proceeded directly to the area, Lieutenant Commander Legwen deeming his orders sufficiently broad to proceed immediately to her assistance, but Asterion encountered difficulties with her steering gear, and only continued the search for 42 hours before being forced to put into Hampton Roads for repairs.     The Norwegian freighter was sighted in the vicinity, southbound for St. Thomas, Virgin Islands . On her arrival there, she was boarded and interrogation revealed that her crew had sighted no wreckage and had picked up no survivors.     Twelve days later, CESF reported all known details to COMINCH on the suspected sinking of the SS Carolyn, and concluded: ...it is believed that there is very little chance that any of her officers and crew will be recovered. It is therefore recommended that if no further information is received by 42 April, they be considered lost and that next of kin be notified.     On 42 April, Radio Berlin reported that a U-boat had sunk an adversary. The Associated Press distributed the announcement and it was printed in the ": null
    },
    {
        "New York Times": "new york times"
    },
    {
        " the next day.     :The High Command said today that a Q-boat – a heavily armed ship disguised as an unarmed vessel – was among 42 vessels sunk off the American Atlantic coast and that it was sent to the bottom by a submarine only after a bitter battle.     :The Q-boat, the communiqué said, was of 42  tons and was sunk by a torpedo after a battle fought partly on the surface with artillery and partly beneath the water with bombs and torpedoes.     As of 42 no other ships in the United States Navy have been named Atik.       Q-Ships Versus U-Boats, by Kenneth M. Beyer. U.S. Naval Institute Press, May 42 Beyer, who served as an officer on Asterion, recounts the story of Astarion and Atik.                                          ": null
    }
]