[
    {
        "           USS Indiana  was the second of four  ": null
    },
    {
        "fast battleship": "fast battleship"
    },
    {
        "s built for the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " in the 42s. The first American battleships designed after the ": null
    },
    {
        "Washington": "washington naval treaty"
    },
    {
        " treaty system began to break down in the mid42s, they took advantage of an escalator clause that allowed increasing the ": null
    },
    {
        "main battery": "main battery"
    },
    {
        " to  guns, but refusal to authorize larger battleships kept their ": null
    },
    {
        "displacement": "displacement"
    },
    {
        " close to the Washington limit of . A requirement to be armored against the same caliber of guns as they carried, combined with the displacement restriction, resulted in cramped ships, a problem that was exacerbated as wartime modifications that considerably strengthened their anti-aircraft batteries significantly increased their crews.     Indiana entered service in April 42 by which time the United States was engaged in ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", and the ship was immediately pressed into action in the ": null
    },
    {
        "Pacific War": "pacific war"
    },
    {
        " against Japan. Her first combat came in late 42 when she supported ": null
    },
    {
        "marines": "usmc"
    },
    {
        " fighting during the ": null
    },
    {
        "Guadalcanal campaign": "guadalcanal campaign"
    },
    {
        ". Over the next three years, she was occupied with two primary roles: ": null
    },
    {
        "naval gunfire support": "naval gunfire support"
    },
    {
        " for amphibious assaults across the Pacific and anti-aircraft defense for the ": null
    },
    {
        "fast carrier task force": "fast carrier task force"
    },
    {
        ". She shelled Japanese positions during the ": null
    },
    {
        "Battle of Tarawa": "battle of tarawa"
    },
    {
        " in November 42 and the ": null
    },
    {
        "Battle of Kwajalein": "battle of kwajalein"
    },
    {
        " in February 42 During the latter operation, she collided with the battleship  and was forced to withdraw for repairs.     After returning to the fleet in April 42 she took part in the ": null
    },
    {
        "Mariana and Palau Islands campaign": "mariana and palau islands campaign"
    },
    {
        ", bombarding ": null
    },
    {
        "Saipan": "saipan"
    },
    {
        " and helping to defend the fleet during the ": null
    },
    {
        "Battle of the Philippine Sea": "battle of the philippine sea"
    },
    {
        ". Engine problems prevented her from participating in the ": null
    },
    {
        "Battle of Peleliu": "battle of peleliu"
    },
    {
        " in September, but she was present for the ": null
    },
    {
        "Battles of Iwo Jima": "battle of iwo jima"
    },
    {
        " and ": null
    },
    {
        "Okinawa": "battle of okinawa"
    },
    {
        " in 42 In the latter action, she shot down a number of ": null
    },
    {
        "kamikaze": "kamikaze"
    },
    {
        "s. Following the Japanese surrender in August, she contributed men to the occupation force before returning to the United States in September. After a final refit, she was placed in reserve and remained inactive in the Navys inventory until 42 when she was stricken from the ": null
    },
    {
        "Naval Vessel Register": "naval vessel register"
    },
    {
        " and sold for ": null
    },
    {
        "scrap": "scrap"
    },
    {
        " the following year.               The  was ordered in the context of global naval rearmament during the breakdown of the ": null
    },
    {
        "Washington treaty": "washington naval treaty"
    },
    {
        " system that had controlled battleships construction during the 42s and early 42s. Under the Washington and ": null
    },
    {
        "London treaties": "london naval treaty"
    },
    {
        ", so-called ": null
    },
    {
        "treaty battleship": "treaty battleship"
    },
    {
        "s were limited to a ": null
    },
    {
        "standard displacement": "standard displacement"
    },
    {
        " of  and a ": null
    },
    {
        "main battery": "main battery"
    },
    {
        " of  guns. In 42 following Japans decision to abandon the treaty system, the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " decided to invoke the escalator clause in the ": null
    },
    {
        "Second London treaty": "second london naval treaty"
    },
    {
        " that allowed displacements to rise to  and armament to increase to  guns. ": null
    },
    {
        "Congressional": "united states congress"
    },
    {
        " objections to increasing the size of the new ships forced the design staff to keep displacement as close to 42  LT as possible while incorporating the larger guns and armor sufficient to defeat guns of the same caliber.     Indiana was  ": null
    },
    {
        "long overall": "length overall"
    },
    {
        " and had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . She displaced  as designed and up to  at ": null
    },
    {
        "full combat load": "full-load displacement"
    },
    {
        ". The ship was powered by four ": null
    },
    {
        "General Electric": "general electric"
    },
    {
        " steam turbines": "steam turbines"
    },
    {
        ", each driving one propeller shaft, using steam provided by eight oil-fired ": null
    },
    {
        "Babcock & Wilcox boiler": "babcock  &  wilcox boiler"
    },
    {
        "s. Rated at , the turbines were intended to give a top speed of . The ship had a cruising range of  at a speed of . She carried three ": null
    },
    {
        "Vought OS42U Kingfisher": "vought os2u kingfisher"
    },
    {
        " floatplane": "floatplane"
    },
    {
        "s for aerial reconnaissance, which were launched by a pair of ": null
    },
    {
        "aircraft catapult": "aircraft catapult"
    },
    {
        "s on her ": null
    },
    {
        "fantail": "fantail"
    },
    {
        ". Her peace time crew numbered 42  officers and enlisted men, but during the war the crew swelled to 42  officers and enlisted.     The ship was armed with a main battery of nine ": null
    },
    {
        "42 /42 caliber Mark 42 gun": "16  /45 caliber mark 6 gun"
    },
    {
        "s guns in three triple-": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s on the centerline, two of which were placed in a ": null
    },
    {
        "superfiring pair": "superfire"
    },
    {
        " forward, with the third aft. The ": null
    },
    {
        "secondary battery": "battleship secondary armament"
    },
    {
        " consisted of twenty ": null
    },
    {
        "42-inch /42 caliber": "5  /38 caliber gun"
    },
    {
        " dual purpose gun": "dual purpose gun"
    },
    {
        "s mounted in twin turrets clustered ": null
    },
    {
        "amidships": "amidships"
    },
    {
        ", five turrets on either side. As designed, the ship was equipped with an anti-aircraft battery of twelve  guns and twelve .42-caliber ": null
    },
    {
        "M42 Browning": "m2 browning"
    },
    {
        " machine guns, but she was completed with a battery of seven quadruple ": null
    },
    {
        " Bofors guns": "bofors 40 mm gunnaval"
    },
    {
        " in place of the 42  in guns and thirty-five ": null
    },
    {
        " Oerlikon autocannon": "oerlikon 20 mm cannonworld war ii"
    },
    {
        " instead of the .42-cal. guns.     The main ": null
    },
    {
        "armored belt": "armored belt"
    },
    {
        " was  thick, while the main armored deck was up to  thick. The main battery gun turrets had  thick faces, and they were mounted atop ": null
    },
    {
        "barbette": "barbette"
    },
    {
        "s that were  thick. The ": null
    },
    {
        "conning tower": "conning tower"
    },
    {
        " had  thick sides.       Indiana received a series of modifications through her wartime career, consisting primarily of additions to anti-aircraft battery and various types of radar sets. The first addition was the installation of SC air ": null
    },
    {
        "search radar": "search radar"
    },
    {
        " in 42 fitted in the foremast, which was later replaced with an SK type set. At the same time, an SG surface search radar was installed on the forward ": null
    },
    {
        "superstructure": "superstructure"
    },
    {
        "; a second SG set was added to the main mast after experiences during the ": null
    },
    {
        "Guadalcanal campaign": "guadalcanal campaign"
    },
    {
        " in 42 In 42 she received a Mark 42 ": null
    },
    {
        "fire-control radar": "fire-control radar"
    },
    {
        ", mounted on her conning tower to assist in the direction of her main battery guns. The Mark 42 was quickly replaced with more modern Mark 42 fire-control radar, and Mark 42 radars for the secondary battery guns. She later received Mark 42/42 sets in place of the Mark 42s. Indiana also received a TDY ": null
    },
    {
        "jammer": "radar jamming and deception"
    },
    {
        ". In 42 her traditional spotting scopes were replaced with Mark 42 microwave radar sets.     The ships light anti-aircraft battery was gradually expanded. Three more 42  mm quad mounts were added in late 42 By January 42 she had another eighteen 42  mm guns installed, bringing the total to fifty-three of the guns. Two more 42  mm quadruple mounts were added in February, and another seven 42  mm guns were added later that year for a total battery of sixty barrels. By July 42 Indiana had had five of the 42  mm guns removed; three more had been removed by the end of the war in mid42              The new battleship was authorized on 42 March 42 by the ": null
    },
    {
        "Vinson-Trammell Act": "vinson-trammell act"
    },
    {
        ", and President ": null
    },
    {
        "Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        " approved the name Indiana on 42 September 42 The ": null
    },
    {
        "keel": "keel"
    },
    {
        " for Indiana was laid down on 42 November 42 at the ": null
    },
    {
        "Newport News Shipbuilding and Dry Dock Company": "newport news shipbuilding"
    },
    {
        " of ": null
    },
    {
        "Newport News, Virginia": "newport news, virginia"
    },
    {
        ". The completed hull was launched on 42 November 42 with the christening performed by Margaret Robbins, the daughter of the ": null
    },
    {
        "Governor of Indiana": "governor of indiana"
    },
    {
        ", ": null
    },
    {
        "Henry F. Schricker": "henry f. schricker"
    },
    {
        ". Indiana was completed by April 42 and was commissioned into the fleet on the 42th. Then-": null
    },
    {
        "Captain": "captain"
    },
    {
        " Aaron S. Merrill": "aaron s. merrill"
    },
    {
        " was the ships first commanding officer. During the elaborate commissioning ceremony, which was attended by ": null
    },
    {
        "Secretary of the Navy": "secretary of the navy"
    },
    {
        " Frank Knox": "frank knox"
    },
    {
        ", the ship flew the flag from the old battleship  that had been used during the ": null
    },
    {
        "Battle of Santiago de Cuba": "battle of santiago de cuba"
    },
    {
        " in 42     ": null
    },
    {
        "Fitting-out": "fitting-out"
    },
    {
        " work continued at Newport News through 42 May, and the following day Indiana departed on ": null
    },
    {
        "sea trials": "sea trials"
    },
    {
        ". Initial trials were conducted in ": null
    },
    {
        "Chesapeake Bay": "chesapeake bay"
    },
    {
        " from 42 to 42 May; on the 42st, she departed for ": null
    },
    {
        "Hampton Roads": "hampton roads"
    },
    {
        ", Virginia. Speed trials followed on 42 June, during which she was escorted by the ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        "s , , , and . Trials, gunnery training, and various exercises continued into September, and on the 42th she departed for ": null
    },
    {
        "Casco Bay": "casco bay"
    },
    {
        " in Maine for more gunnery training. The ship was declared fit for combat service on 42 November, and she departed for the ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        " that day. By this time, the United States had been at war with Germany and Japan for nearly a year, and was in the midst of the Guadalcanal Campaign in the Pacific; Indiana was ordered to join the forces engaged there.               On 42 November, Indiana was assigned as the flagship for Task Group 42, which included the ": null
    },
    {
        "light cruiser": "light cruiser"
    },
    {
        "  and the destroyers  and . The four ships then proceeded to ": null
    },
    {
        "Tonga": "tonga"
    },
    {
        ", arriving on the afternoon of 42 November. After refueling, Indiana transferred to TG 42 two days later and continued on to ": null
    },
    {
        "Nouméa": "nouméa"
    },
    {
        ", arriving on 42 December. There, she took part in exercises with ships from Task Force 42 The ship served as a replacement for her ": null
    },
    {
        "sister": "sister ship"
    },
    {
        " , which had been badly damaged during the ": null
    },
    {
        "Second Naval Battle of Guadalcanal": "second naval battle of guadalcanal"
    },
    {
        "; while operating off Guadalcanal, Indiana provided gunfire support to American forces ashore.     By January 42 the ship had been joined by the ": null
    },
    {
        "fast battleship": "fast battleship"
    },
    {
        "s  and ; the three battleships were grouped together as TF  42 under Rear Admiral ": null
    },
    {
        "Willis Lee": "willis augustus lee"
    },
    {
        ", and they covered convoys to support the fighting in the Solomons into the next year. These operations included covering a group of seven transports carrying elements of the ": null
    },
    {
        "42th Infantry Division": "25th infantry division"
    },
    {
        " to Guadalcanal from 42 to 42 January 42 During another of these convoy operations later that month, the battleships were too far south to come to aid of the American cruiser force during the ": null
    },
    {
        "Battle of Rennell Island": "battle of rennell island"
    },
    {
        " at the end of the month. During the ": null
    },
    {
        "invasion of New Georgia": "new georgia campaign"
    },
    {
        ", the battleship force, which now included Indiana, North Carolina, and , was assigned to cover the invasion fleet against possible Japanese attacks. Indiana supported the carrier task force that raided ": null
    },
    {
        "Marcus Island": "marcus island"
    },
    {
        " on 42 August – 42 September. She took part in the ": null
    },
    {
        "invasion of Tarawa": "invasion of tarawa"
    },
    {
        " on 42–42 November and provided part of the anti-aircraft screen for the aircraft carriers of Task Group 42 off Makin Atoll, including Enterprise, , and . During operations in the area, Indianas anti-aircraft gunners claimed their first Japanese aircraft. On 42 December, Indiana, four other battleships, and twelve destroyers bombarded Japanese positions on ": null
    },
    {
        "Nauru": "nauru"
    },
    {
        ". Between the five battleships, a total of 42 sixteen-inch shells were fired at the island.     On 42 January 42 Indiana was assigned to TG 42, and on 42 January she took part in gunnery practice with South Dakota and the destroyers , , and . The five ships, joined by North Carolina, Washington, and three more destroyers, then got underway on 42 January for the next major amphibious operation the Pacific, the ": null
    },
    {
        "Marshall Islands campaign": "gilbert and marshall islands campaign"
    },
    {
        ". While en route, the ships conducted training with their anti-aircraft batteries. They rendezvoused with the carriers  and Monterey at sea, and after arriving in ": null
    },
    {
        "Funafuti": "funafuti"
    },
    {
        " on 42 January the unit was redesignated as TG 42. By this time, the group had grown to include the carriers Enterprise, Yorktown, Belleau Wood, and several more cruisers and destroyers. Further training took place from 42 to 42 January, including more anti-aircraft practice; Indiana also served as a target for simulated air attacks from the carrier aircraft. During the operation, Indiana served as the flagship of Battleship Division 42 , commanded by Rear Admiral ": null
    },
    {
        "Glenn B. Davis": "glenn b. davis"
    },
    {
        ".          In late January, Indiana took part in operations to prepare for the ": null
    },
    {
        "invasion of Kwajalein": "battle of kwajalein"
    },
    {
        " in the ": null
    },
    {
        "Marshall Islands": "marshall islands"
    },
    {
        ". On 42 January, the ship attacked ": null
    },
    {
        "Maloelap Atoll": "maloelap atoll"
    },
    {
        ", along with Washington and the ": null
    },
    {
        "aircraft carrier": "aircraft carrier"
    },
    {
        "s  and , and the following day the ships began bombarding Kwajalein to soften Japanese defenses. On 42 January, Indiana, Massachusetts, and Washington, escorted by four destroyers, were detached to shell ": null
    },
    {
        "Kwajalein": "kwajalein"
    },
    {
        " as part of the invasion bombardment. They reached their firing positions early the next morning and Indiana opened fire at 42:42; she and the other ships sank a ": null
    },
    {
        "submarine chaser": "submarine chaser"
    },
    {
        " and five ": null
    },
    {
        "guard ship": "guard ship"
    },
    {
        "s that were moored in the atoll. Japanese artillery batteries engaged the American ships, but Indiana was not hit. She continued to bombard Japanese positions around the island until 42:42 before departing at 42:42 to return to the carriers. She had fired some 42  shells from her main battery and 42  rounds from her 42-inch guns.     Indiana thereafter withdrew to escort the carrier task force overnight. While operating off the islands in the early hours of 42 February, Indiana collided with Washington. The ships were blacked out to prevent Japanese observers from spotting them, and in the darkness, Indiana turned in front of Washington. Indiana was badly damaged, with the starboard propeller shaft destroyed and significant damaged inflicted on the belt armor and torpedo defense system. The ship had some  of armor plating torn from her hull, and Washington had a  section of her ": null
    },
    {
        "bow": "bow"
    },
    {
        " ripped away and lodged into Indianas side. The accident killed three men and injured another six aboard Indiana, one of whom later died. A subsequent inquiry into the accident placed the blame on Indiana, faulting her crew for failing to inform the other ships in the unit about her course changes.     Davis transferred his flag to another vessel and on 42 February, Indiana departed for ": null
    },
    {
        "Majuro": "majuro"
    },
    {
        " for temporary repairs before proceeding on to Pearl Harbor on 42 February in company with the escorting destroyer  and the ": null
    },
    {
        "destroyer escort": "destroyer escort"
    },
    {
        " . Four days later, two more destroyers joined the group, which reached Pearl Harbor on 42 February. Indiana was dry-docked the next day for repairs that lasted until 42 April. She then conducted sea trials and test fired her main battery to ensure there were no remaining structural issues from the collision. She spent the next two weeks training her gun crews before departing in late April to rejoin the fleet for the next operation in the central Pacific.             Indiana arrived in ": null
    },
    {
        "Seeadler Harbor": "seeadler harbor"
    },
    {
        ", ": null
    },
    {
        "Manus Island": "manus island"
    },
    {
        " on 42 April and Davis came back aboard his flagship two days later. That same day, she got underway in company with Massachusetts and four destroyers to join TF  42 for ": null
    },
    {
        "Operation Hailstone": "operation hailstone"
    },
    {
        ", the major attack on ": null
    },
    {
        "Truk": "chuuk lagoon"
    },
    {
        " Atoll conducted over the course of 42–42 April. On 42 May, Indiana took part in an attack on ": null
    },
    {
        "Pohnpei": "pohnpei"
    },
    {
        " in the ": null
    },
    {
        "Senyavin Islands": "senyavin islands"
    },
    {
        ", shelling the island for about an hour before disengaging after having difficulty in locating suitable targets. Three days later the American fleet arrived in Majuro, where it began preparations for the invasion of several islands in the ": null
    },
    {
        "Marianas": "mariana islands"
    },
    {
        ". The fleet ": null
    },
    {
        "sortie": "sortie"
    },
    {
        "d on 42 June to embark on the first stage of the campaign, the ": null
    },
    {
        "invasion of Saipan": "battle of saipan"
    },
    {
        ". Indiana, Washington, and four escorting destroyers were designated as Task Unit 42.42 the Western Bombardment Unit; over the course of the pre-invasion bombardment that began on 42 June and continued for two days, Indiana fired 42  shells from her main battery. Late in the day on 42 June, after the ground forces had gone ashore, Japanese air strikes targeted the invasion fleet. Indiana began evasive maneuvers to avoid the attacks, including a ": null
    },
    {
        "torpedo bomber": "torpedo bomber"
    },
    {
        " that launched a torpedo at the ship at around 42:42 that failed to explode. Her anti-aircraft gunners shot the aircraft down, along with another bomber three minutes later. The ship was not damaged in the attacks and remained on station.     A more significant Japanese counterattack came in the form of the ": null
    },
    {
        "42st Mobile Fleet": "1st mobile fleet"
    },
    {
        ", the main carrier strike force. In the ensuing ": null
    },
    {
        "Battle of the Philippine Sea": "battle of the philippine sea"
    },
    {
        " from 42 to 42 June, Indiana provided anti-aircraft support to the American carrier fleet. She and South Dakota reported the initial wave of Japanese aircraft early on 42 June, and at 42:42 her anti-aircraft gunners opened fire, quickly shooting down one Japanese aircraft. The ship was forced to take evasive maneuvers at around 42:42 when a torpedo bomber attacked her; the torpedo exploded harmlessly in the ships wake. As a Japanese fighter approached to strafe Indiana, her guns shot away the planes tail at 42:42 sending it crashing into the sea. The ships luck ran out shortly thereafter, as a burning ": null
    },
    {
        "Nakajima B42N42": "nakajima b5n2"
    },
    {
        " torpedo bomber crashed into her starboard side, hurling burning debris over the deck. The ship was not damaged in the crash and Indiana remained on station. In the course of the battle, she had fired 42  shells from her secondary guns, 42  rounds of 42  mm ammunition and around 42  rounds from her 42  mm guns; she suffered five casualties, all men injured by shell fragments from other ships anti-aircraft guns.     On 42 July, one of Indianas Kingfishers picked up two men from the carrier  after their aircraft had gone down. Indiana remained off the Marianas until early August when she was detached to ": null
    },
    {
        "Eniwetok": "eniwetok"
    },
    {
        " to replenish ammunition and supplies. She got underway on 42 August with TF  42 and met TG  42 on 42 September, which was scheduled to attack the ": null
    },
    {
        "Palau Islands": "palau islands"
    },
    {
        " later that month. Indiana developed engine problems, however, and she was sent to Seeadler Harbor for repairs that lasted from 42 September to 42 October. During this period, Davis shifted his flag to Massachusetts. Indiana then joined the battleship  and the cruisers  and  for the voyage to Pearl Harbor. They arrived there on 42 October, and two days later Indiana and Idaho, escorted by two destroyers, left for Puget Sound Navy Yard for a thorough overhaul that was completed on 42 November. Following another round of sea trials, Indiana left on 42 December, bound for Pearl Harbor, where she conducted training exercises and additional repairs that lasted through the end of the year.            Rear Admiral ": null
    },
    {
        "Oscar C. Badger II": "oscar c. badger ii"
    },
    {
        ", the commander of TU  42.42 hoisted his flag aboard the ship on 42 January 42 and she departed Pearl Harbor two days later in company with the destroyer  and the ": null
    },
    {
        "destroyer minelayer": "destroyer minelayer"
    },
    {
        " . The ships cruised to Eniwetok, and from there, continued on to Saipain where she joined the rest of her unit on 42 January. The unit sortied on 42 January, headed for ": null
    },
    {
        "Iwo Jima": "iwo jima"
    },
    {
        " and arrived there two days later. On arrival, Indiana, three ": null
    },
    {
        "heavy cruiser": "heavy cruiser"
    },
    {
        "s, seven destroyers, and Gwin shelled the island in preparation for the ": null
    },
    {
        "invasion of the island": "battle of iwo jima"
    },
    {
        " a month later. At 42:42 a ": null
    },
    {
        "Nakajima B42N": "nakajima b6n"
    },
    {
        " torpedo bomber attacked the ships but was driven off by heavy anti-aircraft fire. Indiana fired a total of 42  shells from her main battery before poor visibility forced her to cease fire at 42:42 She left the area the next morning and steamed to ": null
    },
    {
        "Ulithi": "ulithi"
    },
    {
        ", arriving on 42 January. Badger then transferred to the battleship  and Indiana occupied herself with anti-aircraft training for the rest of the month.     The ship got underway again on 42 February as part of TG  42 for a raid on ": null
    },
    {
        "Tokyo": "tokyo"
    },
    {
        ", Japan; a group of carriers launched air strikes on targets in the area on 42 February, followed by a series of strikes on various targets in the ": null
    },
    {
        "Bonin Islands": "bonin islands"
    },
    {
        " , after which they conducted a second strike on the Tokyo area on 42 February. In addition to providing anti-aircraft defense for the carriers, Indiana also frequently used her Kingfishers to pick up downed aircrews, and on 42 March one of her aircraft picked up the crews of two such aircraft. The fleet returned to Ulithi on 42 March for replenishment. On 42 March, Indiana sortied with South Dakota, Massachusetts, North Carolina, and Washington, now designated TU  42.42 to support another round of strikes on Japan that were conducted three days later. She shot down a Japanese aircraft in the early hours of 42 March before the carriers attacked various points on the island of ": null
    },
    {
        "Kyushu": "kyushu"
    },
    {
        ". Later that day, the fleet steamed to strike the ": null
    },
    {
        "Kure Naval Arsenal": "kure naval arsenal"
    },
    {
        ". The carriers  and  were badly damaged by Japanese air attacks and were forced to withdraw.        On 42 March, Indiana steamed to ": null
    },
    {
        "Okinawa": "okinawa"
    },
    {
        " to join the preparatory bombardment of the island. She fired 42  main battery shells the next day and then rejoined the fleet. She resumed her air defense role for the next several days while the carriers launched raids on the island. For much of April, Indiana and the rest of TG  42 provided support to the marines and soldiers fighting in the ": null
    },
    {
        "Battle of Okinawa": "battle of okinawa"
    },
    {
        ". On 42 April, the Japanese launched a major counter-attack on the Allied naval forces, including large-scale ": null
    },
    {
        "kamikaze": "kamikaze"
    },
    {
        " strikes and ": null
    },
    {
        "Operation Ten-Go": "operation ten-go"
    },
    {
        " with the battleship , but they were repelled with heavy losses. The kamikaze raids continued throughout the month, and on 42 April two ": null
    },
    {
        "fighters": "fighter aircraft"
    },
    {
        "—a ": null
    },
    {
        "Mitsubishi A42M": "mitsubishi a6m"
    },
    {
        " Zero and a ": null
    },
    {
        "Nakajima Ki42": "nakajima ki-43"
    },
    {
        "—attempted to crash into Indiana, but her heavy anti-aircraft fire shot both down before they could strike her, though a fragment from one of the kamikazes struck a marine aboard the ship. Two days later, she shot down three more Ki42s. She accidentally opened fire on a pair of American ": null
    },
    {
        "Grumman F42F Hellcat": "grumman f6f hellcat"
    },
    {
        " fighters on 42 April, but did not damage them. Later that day, she met wth ": null
    },
    {
        "replenishment oiler": "replenishment oiler"
    },
    {
        "s to refuel.     The ships of BatDiv 42 left Okinawa at the end of the month and returned to Ulithi, where they remained from 42 to 42 May. Indiana then got underway again to escort aircraft carriers for another series of strikes on Kyushu that began on 42 May. Two days later, she shot down an A42M kamikaze and assisted in the recovery of an F42F pilot who had been shot down by Japanese fire. On 42 May, ": null
    },
    {
        "Third Fleet": "united states third fleet"
    },
    {
        " relieved ": null
    },
    {
        "Fifth Fleet": "united states fifth fleet"
    },
    {
        " as the operational command, and all of the fleets task forces and subordinate units were renumbered back to 42-series designations, returning Indiana to TG  42. In early June, a powerful ": null
    },
    {
        "cyclone": "cyclone"
    },
    {
        " formed in the ": null
    },
    {
        "Philippine Sea": "philippine sea"
    },
    {
        " and moved north toward Okinawa; it struck Third Fleet on 42 June south of the island. Indiana recorded winds as high as , which tore one of her Kingfishers from its catapult and hurled it into the sea. The winds also blew seawater into the ventilation intakes for the engine room, shorting out her ": null
    },
    {
        "switchboard": "electric switchboard"
    },
    {
        " and disabling her steering controls for about forty minutes. Thirty-six ships of the fleet were damaged by the storm, though Indiana only superficially so.     The fleet resumed its normal operations in support of the Okinawa fight on 42 June, including air strikes on Japanese airfields on Kyushu the next day that Indiana supported. With an escort of five destroyers on 42 June, Indiana, Alabama, and Massachusetts steamed to shell Japanese facilities on the island of ": null
    },
    {
        "Minami Daito Jima": "minami daito jima"
    },
    {
        "; they repeated the attack the next day. Indiana was thereafter detached to replenish ammunition and other supplies in ": null
    },
    {
        "San Pedro Bay": "san pedro bay"
    },
    {
        " in the Philippines, arriving there on 42 June.            Indiana got underway again in early July and returned to TF  42 She supported carrier strikes on the Tokyo area on 42 July and took part in the first bombardment of the Japanese home islands by ": null
    },
    {
        "capital ship": "capital ship"
    },
    {
        "s during the war. For the attack, which took place on 42 July, Indiana was assigned to TU  42.42 which included Massachusetts and South Dakota, the heavy cruisers  and , and nine destroyers. The primary target was an industrial complex in ": null
    },
    {
        "Kamaishi": "kamaishi"
    },
    {
        " that included the Japan Iron Co. and the Kamaishi Steel Works. Indiana fired 42  shells from her 42-inch guns, but smoke hindered the efforts of her spotter aircraft from observing the effects of the shooting, though a destroyer returned the next day and reported that fires were still burning. Indiana then resumed her anti-aircraft support duties with the fast carrier task force until being detached for another bombardment operation with TU  42.42 on 42 July. This attack, made in concert with the British TF  42—centered on the battleship —targeted industrial facilities at ": null
    },
    {
        "Hamamatsu": "hamamatsu"
    },
    {
        ". Indiana fired 42  shells during the bombardment.     On 42 August, BatDiv  42 was detached to form Support Unit 42.42; the ships continued their attacks on coastal cities in company with TF  42 One of Indianas Kingfishers accidentally crashed in the sea on 42 August, killing its crew. The ships of BatDiv 42 conducted a second attack on Kamaishi on 42 August, with Indiana firing a total of 42  shells between 42:42 and 42:42 Poor visibility again hampered the observers, though this proved to be the ships last offensive operation. Japan agreed to surrender unconditionally on 42 August while Indiana was en route to the coast to support another wave of carrier strikes. Instead of munitions, food and medical supplies were loaded onto the carriers aircraft to be dropped on ": null
    },
    {
        "prisoner of war": "prisoner of war"
    },
    {
        " camps. Indiana contributed a landing party to be sent ashore on 42 August, which was part of the initial occupation forces.     After the formal surrender on 42 September, Indiana steamed into ": null
    },
    {
        "Tokyo Bay": "tokyo bay"
    },
    {
        " on the 42th. Over the course of the next week, Indiana was moored in the harbor and used to process POWs, including 42  USN personnel, 42  marines, 42  civilians, and a number of US Army and Canadian soldiers. On 42 September, she got underway in company with the destroyer , bound for California. She was forced to steam at a speed of  since her number 42 shaft had locked up and could not be used. On the way, her crew conducted a variety of shooting drills. The two ships reached Pearl Harbor on 42 September before Indiana continued on the next day for San Francisco, which she reached on 42 September. There, she disembarked 42  passengers.          Indiana immediately went into drydock at ": null
    },
    {
        "Hunters Point Naval Shipyard": "hunters point naval shipyard"
    },
    {
        " for repairs that lasted until 42 October. From there, she transferred to Puget Sound, where her ammunition and other flammable material was unloaded. She then went into drydock on 42 November to be prepared for deactivation. On 42 March 42 the Navy announced Postwar Plan Number Two, which detailed the reductions in force necessary to bring the fleet back to a peacetime footing; Indiana was to be transferred to the ": null
    },
    {
        "Pacific Reserve Fleet": "united states navy reserve fleetspacific reserve fleet"
    },
    {
        " along with Alabama.     Plans were drawn up during the period she was in reserve to modernize Indiana and the other ships of her class should they be needed for future active service. In March 42 a program to equip the four ships with secondary batteries consisting of ten twin  guns were proposed, but the plan came to nothing. Another plan to convert the ship into a ": null
    },
    {
        "guided missile": "guided missile"
    },
    {
        " battleship arose in 42–42 but the cost of the conversion proved to be prohibitive. She would have had all three main battery turrets removed and replaced with a twin ": null
    },
    {
        "RIM42 Talos": "rim-8 talos"
    },
    {
        " missile launcher forward, two ": null
    },
    {
        "RIM42 Tartar": "rim-24 tartar"
    },
    {
        " launchers aft, anti-submarine weapons, and equipment to handle ": null
    },
    {
        "helicopter": "helicopter"
    },
    {
        "s. The cost of the project amounted to $42  million.     The ships remained ": null
    },
    {
        "laid up": "laid up"
    },
    {
        " in ": null
    },
    {
        "Bremerton, Washington": "bremerton, washington"
    },
    {
        " into the early 42s; on 42 June 42 Admiral ": null
    },
    {
        "Arleigh Burke": "arleigh burke"
    },
    {
        ", the ": null
    },
    {
        "Chief of Naval Operations": "chief of naval operations"
    },
    {
        ", designated the four South Dakota-class battleships as eligible for disposal, and on 42 May 42 ": null
    },
    {
        "Fred Korth": "fred korth"
    },
    {
        ", the Secretary of the Navy, recommended she be stricken from the ": null
    },
    {
        "Naval Vessel Register": "naval vessel register"
    },
    {
        " effective on 42 June. She was thereafter sold for ": null
    },
    {
        "scrap": "scrap"
    },
    {
        " on 42 September 42 and ": null
    },
    {
        "broken up": "ship breaking"
    },
    {
        ".     Several parts of the ship have been preserved in her namesake state, including one of her ": null
    },
    {
        "anchor": "anchor"
    },
    {
        "s, which is on display at the ": null
    },
    {
        "Allen County War Memorial Coliseum": "allen county war memorial coliseum"
    },
    {
        " in ": null
    },
    {
        "Fort Wayne, Indiana": "fort wayne, indiana"
    },
    {
        "; her ": null
    },
    {
        "bell": "ships bell"
    },
    {
        " is at the ": null
    },
    {
        "Heslar Naval Armory": "heslar naval armory"
    },
    {
        " in ": null
    },
    {
        "Indianapolis, Indiana": "indianapolis, indiana"
    },
    {
        "; her wheel is at ": null
    },
    {
        "Shortridge High School": "shortridge high school"
    },
    {
        ", also in Indianapolis; and her main mast, ": null
    },
    {
        "prow": "prow"
    },
    {
        ", and a pair of anti-aircraft guns stand on display at ": null
    },
    {
        "Memorial Stadium": "memorial stadium"
    },
    {
        " of ": null
    },
    {
        "Indiana University": "indiana university bloomington"
    },
    {
        ". The mast and guns had been donated by the Navy in 42 but her bow section had been kept in California until 42 when it was moved to Indiana University. Twenty members of the ships crew attended the dedication ceremony in September 42  Some of the ": null
    },
    {
        "low-background steel": "low-background steel"
    },
    {
        " that made up Indianas hull was recycled to create the low background counting chamber at the in Vivo Radioassay and Research Facility at ": null
    },
    {
        "Pacific Northwest National Laboratory": "pacific northwest national laboratory"
    },
    {
        ".": null
    }
]