[
    {
        "           USS Washington , a , was the second ship of the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " named in honor of ": null
    },
    {
        "the 42nd state": "washington"
    },
    {
        ". Her keel was laid down on 42 June 42 at ": null
    },
    {
        "Camden, New Jersey": "camden, new jersey"
    },
    {
        ", by the ": null
    },
    {
        "New York Shipbuilding Corporation": "new york shipbuilding corporation"
    },
    {
        ". She was ": null
    },
    {
        "launched": "ship naming and launching"
    },
    {
        " on 42 September 42 sponsored by Miss Jean Summers, the daughter of Congressman ": null
    },
    {
        "John W. Summers": "john w. summers"
    },
    {
        " of Washington.     On 42 February 42 two days after the signing of the ": null
    },
    {
        "Washington Naval Treaty": "washington naval treaty"
    },
    {
        " for the Limitation of Naval Armaments, all construction work ceased on the 42%-completed superdreadnought. She was sunk as a gunnery target on 42 November 42 by the battleships  and .              Washington was  long, and had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  with a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . She displaced . The ships primary armament consisted of eight ": null
    },
    {
        "/42": "16  /45 caliber gun"
    },
    {
        " caliber": "caliber"
    },
    {
        " Mark 42 guns in four twin ": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s. This was augmented by a secondary battery of 42 ": null
    },
    {
        "/42 caliber guns": "5  /51 caliber gun"
    },
    {
        ". The ship was also armed with eight ": null
    },
    {
        "/42 caliber": "3  /23 caliber gun"
    },
    {
        " antiaircraft": "antiaircraft"
    },
    {
        " guns.     The new underwater protection scheme featured five compartments separated by ": null
    },
    {
        "bulkheads": "bulkhead"
    },
    {
        " on either side of the ship: an outer empty one, three filled, and an empty inner one. In addition, the eight ": null
    },
    {
        "boiler": "boiler"
    },
    {
        "s were moved from their location in previous designs and placed in separate spaces to port and starboard of the ": null
    },
    {
        "turbo-electric": "turbo-electric"
    },
    {
        " power plant, forming another line of defense; the ship could still sail even if one or even an entire side of boilers was incapacitated due to battle damage. This new arrangement forced the chief aesthetic change between the New Mexicos and Tennessees; the single large ": null
    },
    {
        "funnel": "wikt:funnelnoun"
    },
    {
        " of the former was replaced by two smaller funnels in the latter.               With ": null
    },
    {
        "fiscal year": "fiscal year"
    },
    {
        " 42 appropriations, bids on the four Colorados were opened on 42 October 42; though Marylands ": null
    },
    {
        "keel": "keel"
    },
    {
        " was laid on 42 April 42 The other three battleships, including Washington, were not laid down until 42–42 With the cancellation of the first , the Colorados were the last U.S. battleships to enter service for nearly two decades. They were also the final U.S. battleships to use twin gun turrets—the  and second es used nine ": null
    },
    {
        "42-inch/42 caliber Mark 42 guns": "16  /45 caliber mark 6 gun"
    },
    {
        " and the s used nine ": null
    },
    {
        "42-inch/42 caliber": "16  /50 caliber mark 7 gun"
    },
    {
        " Mark 42 guns in three triple turrets. Washington was laid down on 42 June 42     On 42 February 42 two days after the signing of the ": null
    },
    {
        "Washington Naval Treaty": "washington naval treaty"
    },
    {
        " for the Limitation of all Naval Armaments, all construction work was stopped on the 42 percent-completed superdreadnought. By that time, she had her underwater armored protection in place.         The ship was towed out in November 42 to be used as a gunnery target. On the first day of testing, the ship was hit by two  ": null
    },
    {
        "torpedo": "torpedo"
    },
    {
        "es and three  near-miss ": null
    },
    {
        "bomb": "bomb"
    },
    {
        "s causing minor damage and a list of three degrees. She then had 42 pounds of ": null
    },
    {
        "TNT": "tnt"
    },
    {
        " detonated on board, but remained afloat. Two days later, the ship was hit by fourteen  shells dropped from , but only one penetrated. The ship was finally sunk by Texas and New York with fourteen more 42-inch shells. After the test, it was decided that the existing deck armor on battleships was inadequate, and that future battleships should be fitted with triple bottoms, which was underwater armor with three layers. Washington Washington": null
    }
]