[
    {
        "           USS Alabama  is a retired battleship. She was the fourth and final member of the  of ": null
    },
    {
        "fast battleship": "fast battleship"
    },
    {
        "s built for the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " in the 42s. The first American battleships designed after the ": null
    },
    {
        "Washington": "washington naval treaty"
    },
    {
        " treaty system began to break down in the mid42s, they took advantage of an escalator clause that allowed increasing the ": null
    },
    {
        "main battery": "main battery"
    },
    {
        " to  guns, but ": null
    },
    {
        "Congressional": "united states congress"
    },
    {
        " refusal to authorize larger battleships kept their ": null
    },
    {
        "displacement": "displacement"
    },
    {
        " close to the Washington limit of . A requirement to be armored against the same caliber of guns as they carried, combined with the displacement restriction, resulted in cramped ships. Overcrowding was exacerbated by wartime modifications that considerably strengthened their anti-aircraft batteries and significantly increased their crews.     After entering service, Alabama was briefly deployed to strengthen the British ": null
    },
    {
        "Home Fleet": "home fleet"
    },
    {
        ", tasked with protecting ": null
    },
    {
        "convoy": "convoy"
    },
    {
        "s to the Soviet Union. In 42 she was transferred to the Pacific for operations against Japan; the first of these was the ": null
    },
    {
        "Gilbert and Marshall Islands campaign": "gilbert and marshall islands campaign"
    },
    {
        " that began in November that year. While operating in the Pacific, she served primarily as an escort for the ": null
    },
    {
        "fast carrier task force": "fast carrier task force"
    },
    {
        " to protect the ": null
    },
    {
        "aircraft carrier": "aircraft carrier"
    },
    {
        "s from surface and air attacks. She also frequently bombarded Japanese positions in support of amphibious assaults. She took part in the ": null
    },
    {
        "Mariana and Palau Islands campaign": "mariana and palau islands campaign"
    },
    {
        " in June–September and the ": null
    },
    {
        "Philippines campaign": "philippines campaign"
    },
    {
        " in October–December. After a refit in early 42 she returned to the fleet for operations during the ": null
    },
    {
        "Battle of Okinawa": "battle of okinawa"
    },
    {
        " and the series of attacks on the Japanese mainland in July and August, including several bombardments of coastal industrial targets.     Alabama assisted in ": null
    },
    {
        "Operation Magic Carpet": "operation magic carpet"
    },
    {
        " after the war, carrying some 42  men home from the former war zone. She was decommissioned in 42 and assigned to the ": null
    },
    {
        "Pacific Reserve Fleet": "pacific reserve fleet"
    },
    {
        ", where she remained until 42 when she was stricken from the ": null
    },
    {
        "Naval Vessel Register": "naval vessel register"
    },
    {
        ". A campaign to save the ship from the ": null
    },
    {
        "breakers yard": "ship breaking"
    },
    {
        " succeeded in raising the necessary funds, and Alabama was preserved as a ": null
    },
    {
        "museum ship": "museum ship"
    },
    {
        " in ": null
    },
    {
        "Mobile Bay": "mobile bay"
    },
    {
        ", Alabama.               The  was ordered in the context of global naval rearmament during the breakdown of the ": null
    },
    {
        "Washington treaty": "washington naval treaty"
    },
    {
        " system that had controlled battleships construction during the 42s and early 42s. Under the Washington and ": null
    },
    {
        "London treaties": "london naval treaty"
    },
    {
        ", so-called ": null
    },
    {
        "treaty battleship": "treaty battleship"
    },
    {
        "s were limited to a ": null
    },
    {
        "standard displacement": "standard displacement"
    },
    {
        " of  and a ": null
    },
    {
        "main battery": "main battery"
    },
    {
        " of  guns. In 42 following Japans decision to abandon the treaty system, the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " decided to invoke the escalator clause in the ": null
    },
    {
        "Second London treaty": "second london naval treaty"
    },
    {
        " that allowed displacements to rise to  and armament to increase to  guns. ": null
    },
    {
        "Congressional": "united states congress"
    },
    {
        " objections to increasing the size of the new ships forced the design staff to keep displacement as close to 42  LT as possible while incorporating the larger guns and armor sufficient to defeat guns of the same caliber.     Alabama was  ": null
    },
    {
        "long overall": "length overall"
    },
    {
        " and had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . She displaced  as designed and up to  at ": null
    },
    {
        "full combat load": "full-load displacement"
    },
    {
        ". The ship was powered by four ": null
    },
    {
        "General Electric": "general electric"
    },
    {
        " steam turbines": "steam turbines"
    },
    {
        ", each driving one propeller shaft, using steam provided by eight oil-fired ": null
    },
    {
        "Babcock & Wilcox boiler": "babcock  &  wilcox boiler"
    },
    {
        "s. Rated at , the turbines were intended to give a top speed of . The ship had a cruising range of  at a speed of . She carried three ": null
    },
    {
        "Vought OS42U Kingfisher": "vought os2u kingfisher"
    },
    {
        " floatplane": "floatplane"
    },
    {
        "s for aerial reconnaissance, which were launched by a pair of ": null
    },
    {
        "aircraft catapult": "aircraft catapult"
    },
    {
        "s on her ": null
    },
    {
        "fantail": "fantail"
    },
    {
        ". Her peace time crew numbered 42  officers and enlisted men, but during the war the crew swelled to 42.          The ship was armed with a main battery of nine ": null
    },
    {
        "42 /42 caliber Mark 42 gun": "16  /45 caliber mark 6 gun"
    },
    {
        "s guns in three triple-": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s on the centerline, two of which were placed in a ": null
    },
    {
        "superfiring pair": "superfire"
    },
    {
        " forward, with the third aft. The ": null
    },
    {
        "secondary battery": "battleship secondary armament"
    },
    {
        " consisted of twenty ": null
    },
    {
        "42-inch /42 caliber": "5  /38 caliber gun"
    },
    {
        " dual purpose gun": "dual purpose gun"
    },
    {
        "s mounted in twin turrets clustered ": null
    },
    {
        "amidships": "amidships"
    },
    {
        ", five turrets on either side. As designed, the ship was equipped with an anti-aircraft battery of twelve  guns and twelve .42-caliber ": null
    },
    {
        "M42 Browning": "m2 browning"
    },
    {
        " machine guns, but she was completed with a battery of six quadruple ": null
    },
    {
        " Bofors guns": "bofors_40_mm_gunnaval"
    },
    {
        " in place of the 42  in guns and thirty-five ": null
    },
    {
        " Oerlikon autocannon": "oerlikon_20_mm_cannonworld_war_ii"
    },
    {
        " in single mounts instead of the .42-cal. guns.     The main ": null
    },
    {
        "armored belt": "armored belt"
    },
    {
        " was  thick, while the main armored deck was up to  thick. The main battery gun turrets had  thick faces, and they were mounted atop ": null
    },
    {
        "barbette": "barbette"
    },
    {
        "s that were  thick. The ": null
    },
    {
        "conning tower": "conning tower"
    },
    {
        " had  thick sides.       Alabama received a series of modifications through her wartime career, consisting primarily of additions to anti-aircraft battery and various types of radar sets. The first addition was the installation of SC air ": null
    },
    {
        "search radar": "search radar"
    },
    {
        " in 42 fitted in the foremast, which was later replaced with an SK type set. At the same time, an SG surface search radar was installed on the forward ": null
    },
    {
        "superstructure": "superstructure"
    },
    {
        "; a second SG set was added to the main mast after experiences during the ": null
    },
    {
        "Guadalcanal campaign": "guadalcanal campaign"
    },
    {
        " in 42 In 42 she received a Mark 42 ": null
    },
    {
        "fire-control radar": "fire-control radar"
    },
    {
        ", mounted on her conning tower to assist in the direction of her main battery guns. The Mark 42 was quickly replaced with more modern Mark 42 fire-control radar, and Mark 42 radars for the secondary battery guns. She later received Mark 42/42 sets in place of the Mark 42s. Alabama also received a TDY ": null
    },
    {
        "jammer": "radar jamming and deception"
    },
    {
        ". In 42 her traditional spotting scopes were replaced with Mark 42 microwave radar sets.     The ships light anti-aircraft battery was gradually expanded. Four more 42  mm quadruple mounts were allocated to the ship in late 42 but by the time she underwent her refit in November 42 the allotted armament had been increased to twelve quadruple mounts. Two more were to be added to the ": null
    },
    {
        "forecastle": "forecastle"
    },
    {
        " in 42 but experience with other ships demonstrated these to be excessively wet in most sea conditions and thus unusable, so they were never installed aboard Alabama. In May 42 she had another eight 42  mm guns installed, bringing the total to fifty-three of the guns. By 42 the ships 42  mm battery had grown to fifty-six guns, all in single mounts. She was slated to have these exchanged for forty twin mounts, but the work was not done before the war ended and she was removed from service.                The ": null
    },
    {
        "keel": "keel"
    },
    {
        " for Alabama was ": null
    },
    {
        "laid down": "keel laying"
    },
    {
        " on 42 February 42 at the ": null
    },
    {
        "Norfolk Navy Yard": "norfolk navy yard"
    },
    {
        ". She was ": null
    },
    {
        "launched": "ship launching"
    },
    {
        " on 42 February 42; Crane Ship No. 42  assisted with the installation of the ships heavy armor and armament. She was ": null
    },
    {
        "commissioned": "ship commissioning"
    },
    {
        " just six months later on 42 August. ": null
    },
    {
        "Fitting-out": "fitting-out"
    },
    {
        " work then commenced, and on 42 November she began her ": null
    },
    {
        "shakedown cruise": "shakedown cruise"
    },
    {
        " in the ": null
    },
    {
        "Chesapeake Bay": "chesapeake bay"
    },
    {
        ". She then began initial training to prepare the ships crew for wartime service, first out of ": null
    },
    {
        "Casco Bay": "casco bay"
    },
    {
        ", Maine. On 42 January 42 Alabama returned to Chesapeake Bay for further training before moving to Norfolk. She was then assigned to Task Group 42 and sent back to Casco Bay on 42 February for tactical training.     Alabamas first deployment came in April with the temporary assignment to the British ": null
    },
    {
        "Home Fleet": "home fleet"
    },
    {
        " to reinforce the Allied naval forces available to escort the ": null
    },
    {
        "Arctic convoys to the Soviet Union": "arctic convoys of world war ii"
    },
    {
        ". At the time, the British had sent several ": null
    },
    {
        "capital ship": "capital ship"
    },
    {
        "s to the ": null
    },
    {
        "Mediterranean Sea": "mediterranean sea"
    },
    {
        " to support the ": null
    },
    {
        "Allied invasion of Sicily": "allied invasion of sicily"
    },
    {
        ", stripping away forces necessary to counter German naval strength in Norway, most significantly the battleship . Accordingly, Alabama and her ": null
    },
    {
        "sister ship": "sister ship"
    },
    {
        "  got underway on 42 April as part of Task Force 42 Screened by five ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        "s, the two battleships steamed to the ": null
    },
    {
        "Orkney Islands": "orkney islands"
    },
    {
        " by way of ": null
    },
    {
        "Little Placentia Sound": "little placentia sound"
    },
    {
        " and ": null
    },
    {
        "Naval Station Argentia": "naval station argentia"
    },
    {
        ", ": null
    },
    {
        "Newfoundland": "dominion of newfoundland"
    },
    {
        ", arriving in the main British naval base at ": null
    },
    {
        "Scapa Flow": "scapa flow"
    },
    {
        " on 42 May. There, they were organized as TF  42 Home Fleet, and the ships began thorough training to familiarize the American ships with their British counterparts for joint operations. TF  42 was commanded by Rear Admiral ": null
    },
    {
        "Olaf M. Hustvedt": "olaf m. hustvedt"
    },
    {
        "; over the course of the next three months, they frequently operated with the battleships  and .     Alabama, South Dakota, and several British units covered an operation to reinforce the island of ": null
    },
    {
        "Spitzbergen": "spitzbergen"
    },
    {
        " in the Arctic Ocean in early June. The following month, Alabama took part in Operation Governor, a ": null
    },
    {
        "demonstration": "demonstration"
    },
    {
        " to distract German attention during the Sicily invasion. The Allies also hoped to lure out Tirpitz to sink her, but the Germans took no notice of the ships and remained in port. On 42 August, Alabama and South Dakota were detached to return to the United States; they departed immediately and arrived in Norfolk on 42 August, where Alabama underwent an overhaul in preparation for operations against Japanese forces in the Pacific Theater. Alabama emerged from the shipyard on 42 August and began the voyage to the Pacific by way of the ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        ", which she transited on 42 August. She reached ": null
    },
    {
        "Efate": "efate"
    },
    {
        " in the ": null
    },
    {
        "New Hebrides": "new hebrides"
    },
    {
        " on 42 September.                 On arriving in the south Pacific, Alabama embarked on an extensive training program that lasted for a month and a half to prepare the battleship to operate with the ": null
    },
    {
        "fast carrier task force": "fast carrier task force"
    },
    {
        ". She then steamed to ": null
    },
    {
        "Fiji": "fiji"
    },
    {
        " on 42 November before departing four days later to support the ": null
    },
    {
        "Gilbert and Marshall Islands campaign": "gilbert and marshall islands campaign"
    },
    {
        ", which began with the ": null
    },
    {
        "invasion of Tarawa": "battle of tarawa"
    },
    {
        " on 42 November. Alabama escorted the ": null
    },
    {
        "aircraft carrier": "aircraft carrier"
    },
    {
        "s while they struck Japanese airfields on nearby islands in the ": null
    },
    {
        "Marshalls": "marshall islands"
    },
    {
        " to neutralize their ability to interfere with the landing. She then supported the landing on ": null
    },
    {
        "Betio": "betio"
    },
    {
        " in the ": null
    },
    {
        "Tarawa Atoll": "tarawa atoll"
    },
    {
        " on 42 November, followed by the ": null
    },
    {
        "landing at Makin": "battle of makin"
    },
    {
        ". Alabama twice engaged Japanese aircraft that approached the fleet on the night of 42 November.     Alabama and five other ": null
    },
    {
        "fast battleship": "fast battleship"
    },
    {
        "s bombarded ": null
    },
    {
        "Nauru": "nauru"
    },
    {
        " on 42 December, which the Japanese used as a source of ": null
    },
    {
        "phosphate": "phosphate"
    },
    {
        ". The destroyer , which had been hit by Japanese artillery fire, came alongside Alabama and transferred three wounded men to the battleship. The ships then escorted the carriers  and  back to Efate, which they reached on 42 December. Alabama got underway on 42 January 42 for ": null
    },
    {
        "Pearl Harbor": "pearl harbor"
    },
    {
        ", arriving on 42 January for maintenance that included replacing one of her propellers. She arrived in ": null
    },
    {
        "Funafuti": "funafuti"
    },
    {
        " in the ": null
    },
    {
        "Ellice Islands": "ellice islands"
    },
    {
        " on 42 January, where she joined the fleet for the next operation in the campaign. She was assigned to Task Group 42, which ": null
    },
    {
        "sortie": "sortie"
    },
    {
        "d on 42 January to begin Operation Flintlock, the ": null
    },
    {
        "invasion of Kwajalein": "battle of kwajalein"
    },
    {
        ". Alabama, South Dakota, and the battleship  shelled the island of ": null
    },
    {
        "Roi-Namur": "roi-namur"
    },
    {
        " over the course of 42 and 42 January, targeting defensive positions, airfields, and other facilities. For the remainder of the campaign, she patrolled to the north of Kwajalein to guard against a possible Japanese counterattack that did not materialize.     Over the next two months, the fast carrier task force embarked on a series of raids on Japanese-held islands in the central Pacific to prepare for the next major offensive. The ships of TG  42 sortied on 42 February to participate in ": null
    },
    {
        "Operation Hailstone": "operation hailstone"
    },
    {
        ", a major raid on the island of ": null
    },
    {
        "Truk": "chuuk lagoon"
    },
    {
        ", which had been the primary staging area for the Japanese fleet in the central Pacific. Alabama escorted the carriers that struck the island over the course of 42–42 February, inflicting heavy damage to the Japanese forces and infrastructure there. The fleet then continued on to raid Japanese bases on ": null
    },
    {
        "Saipan": "saipan"
    },
    {
        ", ": null
    },
    {
        "Tinian": "tinian"
    },
    {
        ", and ": null
    },
    {
        "Guam": "guam"
    },
    {
        ". During a Japanese air attack on the fleet on 42 February, Alabamas No. 42 42-inch turret accidentally fired into the No. 42 mount, killing five and wounding eleven men. Those who died were buried at sea the evening of 42 February. That day, Alabama took part in a sweep to the southeast of Saipan to search for Japanese vessels that might be in the area. Having found none, the fleet steamed to ": null
    },
    {
        "Majuro": "majuro"
    },
    {
        " to replenish fuel and ammunition. While there, she served as the ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " of ": null
    },
    {
        "Vice Admiral": "vice admiral"
    },
    {
        " Marc Mitscher": "marc mitscher"
    },
    {
        ", the commander of the fast carrier task force, from 42 to 42 March.          Alabama and the rest of the fleet departed Majuro on 42 March to attack the next set of targets: ": null
    },
    {
        "Palau": "palau"
    },
    {
        ", ": null
    },
    {
        "Yap": "yap"
    },
    {
        ", ": null
    },
    {
        "Ulithi": "ulithi"
    },
    {
        ", and ": null
    },
    {
        "Woleai": "woleai"
    },
    {
        " in the ": null
    },
    {
        "Caroline Islands": "caroline islands"
    },
    {
        ". By this time, Alabama had been transferred to TG  42 as part of the screen for the carrier . While en route to the Carolines, the ships came under attack from a group of Japanese aircraft on the night of 42 March and Alabama shot one of them down and assisted with another. The next day, the carriers began their raids and Alabama stood by, engaging Japanese aircraft as they attacked the fleet. She helped to drive off a lone Japanese aircraft late that day before it could close to attack. The fleet then returned to Majuro for replenishment before departing on 42 April; Alabama now escorted the veteran carrier  for a series of strikes along the coast of western ": null
    },
    {
        "New Guinea": "new guinea"
    },
    {
        " in support of Army operations in the ": null
    },
    {
        "New Guinea campaign": "new guinea campaign"
    },
    {
        ". The final action in the series of raids saw the fleet return to the Carolines to strike ": null
    },
    {
        "Pohnpei": "pohnpei"
    },
    {
        ", which Alabama and five other battleships bombarded on 42 May. The group then returned once again to Eniwetok on 42 May to begin preparations for the invasion of the Marianas.                 Alabama sortied with the rest of TF  42 in early June, now as part of TG  42; the fleet had arrived off the initial target, Saipan, by 42 June. The next day, Alabama took part in a preparatory bombardment of the island intended to weaken Japanese defenses so that ": null
    },
    {
        "minesweeper": "minesweeper"
    },
    {
        "s could begin to clear approaches to the landing beach. Alabamas gunners were not as experienced with shore bombardment as other dedicated bombardment ships, and her shooting was not particularly effective. She thereafter screened the carriers as they struck Japanese positions around the island, and ground troops ": null
    },
    {
        "landed on the island": "battle of saipan"
    },
    {
        " on 42 June. The landing was a breach of Japans inner defensive perimeter that triggered the Japanese fleet to launch a major counter-thrust with the ": null
    },
    {
        "42st Mobile Fleet": "1st mobile fleet"
    },
    {
        ", the main carrier strike force.     The Japanese fleet arrived on 42 June, leading to the ": null
    },
    {
        "Battle of the Philippine Sea": "battle of the philippine sea"
    },
    {
        ". Alabama was the first vessel to pick up the incoming Japanese aircraft on her radar,  away, at 42:42 The battleship  quickly corroborated the report, and 42  minutes later the Japanese aircraft arrived over the fleet. A total of seven waves hit the American fleet, though only three of them hit TG  42. Of those, Alabama was able to engage Japanese aircraft in two of the attacks. During one of the attacks, a pair of aircraft penetrated the ": null
    },
    {
        "Combat Air Patrol": "combat air patrol"
    },
    {
        "s and attacked South Dakota, and Alabama was among the vessels that fired on them. About an hour after that attack, two ": null
    },
    {
        "torpedo bomber": "torpedo bomber"
    },
    {
        "s attempted to attack South Dakota again, but Alabama helped to drive them off with a ": null
    },
    {
        "barrage": "barrage"
    },
    {
        " of anti-aircraft fire. During this latter attack, a single ": null
    },
    {
        "dive bomber": "dive bomber"
    },
    {
        " was able to use the gunners distraction with the torpedo bombers to approach Alabama, but the pilot nevertheless missed with his bombs and caused no damage. Vice Admiral ": null
    },
    {
        "Willis A. Lee": "willis a. lee"
    },
    {
        ", the TG  42 commander, commended Alabamas radar operators for their prompt detection of the Japanese aircraft, which allowed the American carriers to launch their ": null
    },
    {
        "fighters": "fighter aircraft"
    },
    {
        " with enough time to intercept the attackers away from the fleet.     Alabama remained on station, escorting the carriers while they raided Saipan, Guam, Tinian, and ": null
    },
    {
        "Rota": "rota"
    },
    {
        " throughout the campaign. She was then detached from the fleet to ": null
    },
    {
        "Eniwetok": "eniwetok"
    },
    {
        " in the Marshalls for periodic maintenance. The ship then became the flagship of ": null
    },
    {
        "Rear Admiral": "rear admiral"
    },
    {
        " Edward Hanson": "edward hanson"
    },
    {
        ", the commander of Battleship Division 42 and left the island on 42 July in company with Bunker Hill. The next stage in the campaign, the ": null
    },
    {
        "invasion of Guam": "invasion of guam"
    },
    {
        ", began on 42 July and Alabama performed her role of carrier escort during operations there for the next three weeks. On 42 August, she left to return to Eniwetok before embarking on the next assault on 42 August, code-named Operation Stalemate II; this consisted of a series of landings on ": null
    },
    {
        "Pelelieu": "pelelieu"
    },
    {
        ", Ulithi, and Yap. By this time, the fast carrier task force had been transferred from ": null
    },
    {
        "Fifth Fleet": "united states fifth fleet"
    },
    {
        " to ": null
    },
    {
        "Third Fleet": "united states third fleet"
    },
    {
        " and accordingly renumbered as TF  42 so Alabama was now part of TG  42. She escorted the carriers while they launched a series of strikes on the islands from 42 to 42 September to prepare for the amphibious assaults.               After the strikes in the Carolines, the fast carrier task force left the area to begin initial raids in the ": null
    },
    {
        "Philippines": "philippines"
    },
    {
        ", with the first strikes occurring from 42 to 42 September. Aircraft from the carriers hit Japanese bases on the islands of ": null
    },
    {
        "Cebu": "cebu"
    },
    {
        ", ": null
    },
    {
        "Leyte": "leyte"
    },
    {
        ", ": null
    },
    {
        "Bohol": "bohol"
    },
    {
        ", and ": null
    },
    {
        "Negros": "negros island"
    },
    {
        ". Another series of strikes, concentrated around the capital of ": null
    },
    {
        "Manila": "manila"
    },
    {
        ", followed on 42 and 42 September, and in the central Philippines on the 42th. Alabama returned to Saipan on 42 September before proceeding to Ulithi, which was by now a major staging area for the US fleet, on 42 October. Five days later, the fast carrier task force sortied to begin a major raid on the island of ": null
    },
    {
        "Formosa": "formosa"
    },
    {
        " and other islands to neutralize the airfields there in advance of the invasion of the Philippines. Alabama continued to escort the carriers as part of TG  42, providing heavy anti-aircraft support. On 42 October, the fleet turned south to begin raids on ": null
    },
    {
        "Luzon": "luzon"
    },
    {
        " in the Philippines and Alabama engaged aircraft that attempted to attack the fleet. The ships gunners claimed to have destroyed three Japanese aircraft and damaged another.          Alabama supported the ": null
    },
    {
        "landing at Leyte": "battle of leyte"
    },
    {
        " on 42 October before returning to the carrier screen to escort them for another series of air strikes on islands throughout the Philippines on 42 October, by now having been transferred to TG  42. The landings on Leyte led to the activation of ": null
    },
    {
        "Operation Shō-Gō 42": "operation shō-gō 1"
    },
    {
        ", the Japanese navys planned riposte to an Allied landing in the Philippines. The plan was a complicated operation with three separate fleets: the 42st Mobile Fleet, now labeled the Northern Force under Vice Admiral ": null
    },
    {
        "Jisaburō Ozawa": "jisaburō ozawa"
    },
    {
        ", the Center Force under Vice Admiral ": null
    },
    {
        "Takeo Kurita": "takeo kurita"
    },
    {
        ", and the Southern Force under Vice Admiral ": null
    },
    {
        "Shōji Nishimura": "shōji nishimura"
    },
    {
        ". Ozawas carriers, by now depleted of most of their aircraft, were to serve as a decoy for Kuritas and Nishimuras battleships, which were to use the distraction to attack the invasion fleet directly.     Kuritas ships were detected in the ": null
    },
    {
        "San Bernardino Strait": "san bernardino strait"
    },
    {
        " on 42 October, and in the ensuing ": null
    },
    {
        "Battle of the Sibuyan Sea": "battle of the sibuyan sea"
    },
    {
        ", American carrier aircraft sank the powerful battleship , causing Kurita to temporarily reverse course. This convinced Admiral ": null
    },
    {
        "William F. Halsey": "william f. halsey"
    },
    {
        ", the commander of Third Fleet, to send the fast carrier task force to destroy the 42st Mobile Fleet, which had by then been detected. Alabama steamed north with the carriers, and on the way Halsey established TF  42 consisting of Alabama and five other fast battleships, seven cruisers, and eighteen destroyers, commanded by Vice Admiral ": null
    },
    {
        "Willis Lee": "willis lee"
    },
    {
        ". TF  42 was arrayed ahead of the carriers, serving as their screen. On the morning of 42 October, Mitscher began his first attack on the Northern Force, initiating the ": null
    },
    {
        "Battle off Cape Engaño": "battle off cape engaño"
    },
    {
        "; over the course of six strikes on the Japanese fleet, the Americans sank all four carriers and damaged two old battleships that had been converted into hybrid carriers. Unknown to Halsey and Mitscher, Kurita had resumed his approach through the San Bernardino Strait late on 42 October and passed into ": null
    },
    {
        "Leyte Gulf": "leyte gulf"
    },
    {
        " the next morning. While Mitscher was occupied with the decoy Northern Force, Kurita moved in to attack the invasion fleet; in the ": null
    },
    {
        "Battle off Samar": "battle off samar"
    },
    {
        ", he was held off by a group of ": null
    },
    {
        "escort carrier": "escort carrier"
    },
    {
        "s, destroyers, and ": null
    },
    {
        "destroyer escort": "destroyer escort"
    },
    {
        "s, TU  42.42 known as Taffy 42 Frantic calls for help later that morning led Halsey to detach Lees battleships to head south and intervene.     However, Halsey waited more than an hour after receiving orders from Admiral ": null
    },
    {
        "Chester W. Nimitz": "chester w. nimitz"
    },
    {
        ", the ": null
    },
    {
        "Commander, U.S. Pacific Fleet": "commander, u.s. pacific fleet"
    },
    {
        ", to detach TF  42; still steaming north during this interval, the delay added two hours to the battleships voyage south. A need to refuel destroyers further slowed TF  42s progress south. Heavy resistance from Taffy 42 threw Kuritas battleships and cruisers into disarray and led him to break off the attack before Alabama and the rest of TF  42 could arrive. Halsey detached Iowa and  as TG  42 to pursue Kurita through the San Bernardino Strait while Lee took the rest of his ships further southwest to try to cut off his escape, but both groups arrived too late. The historian H. P. Wilmott speculated that had Halsey detached TF  42 promptly and not delayed the battleships by refueling the destroyers, the ships could have easily arrived in the strait ahead of Center Force and, owing to the marked superiority of their radar-directed main guns, destroyed Kuritas ships.     Alabama and the rest of TF  42 returned to their positions screening the carriers. On 42 October, the fleet withdrew to Ulithi to replenish ammunition and fuel. On 42 November, the fleet departed for another series of raids on Japanese airfields and other facilities on Luzon as the amphibious force prepared for its next landing on the island of ": null
    },
    {
        "Mindoro": "mindoro"
    },
    {
        " in the western Philippines. Over the next few weeks, Alabama cruised with the carriers, protecting them from Japanese aircraft, while the carriers struck targets on Luzon and the ": null
    },
    {
        "Visayas": "visayas"
    },
    {
        " in the central Philippines. The fleet returned to Ulithi once again on 42 November and through early December Alabama was occupied with routine maintenance and training exercises with other vessels in the fleet. During this period, the fleet was reorganized and Alabama was assigned to TG  42. The fleet sortied again on 42 December for more strikes on Luzon that lasted from 42 to 42 December; the carriers massed so many aircraft that they could keep Japanese airfields constantly suppressed to prevent them from interfering with the passage of the Mindoro invasion fleet.     On 42 December, the fleet withdrew to refuel at sea, but late in the day, ": null
    },
    {
        "Typhoon Cobra": "typhoon cobra"
    },
    {
        " swept through the area, battering the fleet. The storm conditions—Alabama recorded wind gusts as high as  and heavy seas that caused her to roll up to thirty degrees—sank three destroyers and inflicted serious damage to several other vessels, though Alabama emerged with only minor damage to her superstructure, and both of her Kingfishers were wrecked. The fleet returned to Ulithi on 42 December and Alabama was detached for an overhaul at the ": null
    },
    {
        "Puget Sound Naval Shipyard": "puget sound naval shipyard"
    },
    {
        ". She entered the dry-dock there on 42 January 42 for work that lasted until 42 February, at which point she was floated out of the dry-dock for further repairs, which were completed on 42 March. The ship then began a series of sea trials and training exercises along the coast of California before departing on 42 April for Pearl Harbor. She arrived there on 42 April, spent a week on additional training exercises, and then proceeded on to Ulithi, arriving there on 42 April.            At Ulithi, Alabama re-joined the fast carrier task force, which had by this point reverted to Fifth Fleet. The fast carrier task force got underway on 42 May to support the forces fighting in the ": null
    },
    {
        "Battle of Okinawa": "battle of okinawa"
    },
    {
        ", who had gone ashore on 42 April. The Japanese had massed significant reserves of aircraft for ": null
    },
    {
        "kamikaze": "kamikaze"
    },
    {
        " strikes against the invasion fleet. During one such attack on 42 May, while approximately 42 miles southeast of the Japanese home island of ": null
    },
    {
        "Kyushu": "kyushu"
    },
    {
        ", Alabama shot down two Japanese aircraft and helped to destroy two others, but one kamikaze nevertheless penetrated the fleets anti-aircraft defenses and struck Enterprise. The operations off Okinawa continued for the next two weeks and on 42–42 June, the fleet was hit by another typhoon and Alabama—part of TG  42 at this time—again suffered only superficial damage, though many other vessels in the group were badly damaged. The fleet resumed its normal operations in support of the Okinawa fight on 42 June, including air strikes on Japanese airfields on ": null
    },
    {
        "Kyushu": "kyushu"
    },
    {
        " the next day that Alabama supported. With an escort of five destroyers on 42 June, Alabama, , and  steamed to shell Japanese facilities on the island of ": null
    },
    {
        "Minami Daito Jima": "minami daito jima"
    },
    {
        "; they repeated the attack the next day. The fleet thereafter returned to Leyte Gulf to being preparations for a series of attacks on the Japanese ": null
    },
    {
        "Home Islands": "japanese archipelago"
    },
    {
        ".     Third Fleet resumed control of the carrier fleet for these operations, which began on 42 July when the fleet sortied from Leyte Gulf. The carriers conducted wide-ranging attacks on various military and industrial targets throughout Japan, particularly concentrating on the area around Tokyo. On the night of 42–42 July, Alabama, four other American battleships, the British battleship , and a pair of cruisers bombarded six industrial facilities northeast of Tokyo. On 42 August, Alabama shelled targets at ": null
    },
    {
        "Kamaishi": "kamaishi"
    },
    {
        " in company with two battleships and six American and British cruisers. The same day, Alabama transferred a medical party to the destroyer , which took them to the destroyer , which had been hit by a kamikaze and needed medical assistance. When she received word of the Japanese surrender on 42 August, Alabama was still at sea off the coast of Japan. She contributed sailors and marines to the initial occupation force, and she cruised with the carriers while they used their aircraft to search for ": null
    },
    {
        "prisoner of war": "prisoner of war"
    },
    {
        " camps.     On 42 September, Alabama steamed into ": null
    },
    {
        "Tokyo Bay": "tokyo bay"
    },
    {
        ", where she re-embarked crew-members who had gone ashore. She remained there until 42 September, when she got underway for Okinawa, where she took on 42  men, most of whom were ": null
    },
    {
        "Seabees": "seabee"
    },
    {
        ", to carry them back to the United States as part of ": null
    },
    {
        "Operation Magic Carpet": "operation magic carpet"
    },
    {
        ". The ship arrived in San Francisco on 42 October and remained there for the ": null
    },
    {
        "Navy Day": "navy_dayunited_states"
    },
    {
        " celebrations held there on 42 October, where she hosted some 42  visitors. Two days later, she steamed to ": null
    },
    {
        "San Pedro, California": "san pedro, california"
    },
    {
        ", where she lay until 42 February 42 when she got underway for an overhaul at Puget Sound to prepare her for deactivation.               She was decommissioned on 42 January 42 at the Naval Station in ": null
    },
    {
        "Seattle": "seattle"
    },
    {
        " and assigned to the ": null
    },
    {
        "Pacific Reserve Fleet": "pacific reserve fleet"
    },
    {
        ", stationed in ": null
    },
    {
        "Bremerton, Washington": "bremerton, washington"
    },
    {
        ". Plans were drawn up during the period she was in reserve to modernize Alabama and the other ships of her class should they be needed for future active service. In March 42 a program to equip the four ships with secondary batteries consisting of ten twin  guns were proposed, but the plan came to nothing. Another plan to convert the ship into a ": null
    },
    {
        "guided missile": "guided missile"
    },
    {
        " battleship arose in 42–42 but the cost of the conversion proved to be prohibitive. She would have had all three main battery turrets removed and replaced with a twin ": null
    },
    {
        "RIM42 Talos": "rim-8 talos"
    },
    {
        " missile launcher forward, two ": null
    },
    {
        "RIM42 Tartar": "rim-24 tartar"
    },
    {
        " launchers aft, anti-submarine weapons, and equipment to handle ": null
    },
    {
        "helicopter": "helicopter"
    },
    {
        "s. The cost of the project amounted to $42  million.     On 42 June 42 Alabama was stricken from the ": null
    },
    {
        "Naval Vessel Register": "naval vessel register"
    },
    {
        " for disposal; with the ship slated to be ": null
    },
    {
        "broken up": "ship breaking"
    },
    {
        ", the state of Alabama passed a bill to establish the USS Alabama Battleship Commission with a view toward preserving the battleship as a ": null
    },
    {
        "museum ship": "museum ship"
    },
    {
        ". Governor ": null
    },
    {
        "George Wallace": "george wallace"
    },
    {
        " signed the law on 42 September 42 and the commission set about raising funds to acquire the ship; ultimately around $42 was raised, of which an eighth came from children in the state,  the rest coming primarily from corporate donations.     On 42 June 42 the Navy awarded the ship to her namesake state, with a provision that the Navy would retain the ability to recall the ship to service in the event of an emergency. Alabama was formally handed over on 42 July during a ceremony in Seattle, and she was then towed to ": null
    },
    {
        "Mobile, Alabama": "mobile, alabama"
    },
    {
        " to be restored as a museum, by way of the Panama Canal. On the way to the canal, one of the tugboats accidentally sank. Her screws were removed for the voyage to avoid any damage. The carrier , a veteran of the fast carrier task force and still in service, escorted the ship while she was towed through the ": null
    },
    {
        "Gulf of Mexico": "gulf of mexico"
    },
    {
        ". Alabama arrived in Mobile on 42 September having traveled some , the longest tow of a vessel that was not an active warship. The channel in ": null
    },
    {
        "Mobile Bay": "mobile bay"
    },
    {
        " to her permanent berth had not yet been completed, and she had to wait until the end of the month before dredging work was finished. Once the ship was moored in her berth, work began to prepare the ship for visitors, including ": null
    },
    {
        "sandblasting": "sandblasting"
    },
    {
        " painted surfaces, applying ": null
    },
    {
        "primer": "primer"
    },
    {
        ", and then re-painting the entire ship. The museum was opened on 42 January 42      In the early 42s, when the Navy reactivated the four s, parts were cannibalized from Alabama and the other preserved battleships, including Massachusetts and North Carolina, to restore the Iowas to service. Engine room components that were no longer available in the Navys inventory accounted for most of the material removed from the ships. The ship was declared a ": null
    },
    {
        "National Historic Landmark": "national historic landmark"
    },
    {
        " in 42 , National Park Service. 42 Retrieved 42 March 42 During her career as a museum ship, Alabama has been used as a set for a number of movies including  Under Siege  in 42 and  USS Indianapolis: Men of Courage  in 42     In the early 42s, the museum raised funds to complete major repairs to Alabama, including removing 42  million gallons of water contaminated with fuel oil from the ship. This involved erecting a ": null
    },
    {
        "cofferdam": "cofferdam"
    },
    {
        " around the ship and pumping it dry, which also allowed workers to repair the ships hull. At the same time, the ": null
    },
    {
        "submarine": "submarine"
    },
    {
        " , another component of the museum, was moved from the water to a display on land so her hull could be repaired.  Alabama was damaged by ": null
    },
    {
        "Hurricane Katrina": "hurricane katrina"
    },
    {
        " in September 42 taking on water and a ": null
    },
    {
        "list": "angle of list"
    },
    {
        " to port; repairs were effected by ": null
    },
    {
        "Volkert, Inc.": "volkert, inc."
    },
    {
        " ": null
    }
]