[
    {
        "        USS Texas was a second-class ": null
    },
    {
        "battleship": "battleship"
    },
    {
        " built by the United States in the early 42s, the first American battleship commissioned and the first ship named in honor of the state of ": null
    },
    {
        "Texas": "texas"
    },
    {
        " to be built by the United States. Built in reaction to the acquisition of modern armored warships by several South American countries, Texas was meant to incorporate the latest developments in naval tactics and design. This includes the mounting of her main armament  en echelon  to allow maximum end-on fire and a heavily-": null
    },
    {
        "armored citadel": "armored citadel"
    },
    {
        " amidships": "amidships"
    },
    {
        " to ensure defensive strength. However, due to the state of U.S. industry at the time, Texass building time was lengthy, and by the time she was commissioned, she was already out of date. Nevertheless, she and the armored cruiser  were considered advancements in American naval design.     Texas developed a reputation as a jinxed or unlucky ship after several accidents early in her career; she consequently earned the nickname Old Hoodoo . These mishaps included problems during construction, a grounding off ": null
    },
    {
        "Newport": "newport, rhode island"
    },
    {
        ", ": null
    },
    {
        "Rhode Island": "rhode island"
    },
    {
        ", and flooding shortly afterwards while at dock in ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ". In the last, she settled to the bottom with her gun deck awash and several crew members drowned. She also received significant damage to her hull in drydock after being raised. Her reputation improved with her service in the ": null
    },
    {
        "Spanish–American War": "spanish–american war"
    },
    {
        ", when she blockaded the coast of ": null
    },
    {
        "Cuba": "cuba"
    },
    {
        " and fought in the ": null
    },
    {
        "Battle of Santiago de Cuba": "battle of santiago de cuba"
    },
    {
        ".     After the war, Texas returned to peacetime duty, interrupted by several refits. She became the station ship in ": null
    },
    {
        "Charleston, South Carolina": "charleston, south carolina"
    },
    {
        ", by 42 and was renamed San Marcos in 42 to allow her name to be used by ": null
    },
    {
        "a new battleship": "uss texas"
    },
    {
        ". She became a ": null
    },
    {
        "target ship": "target ship"
    },
    {
        " that same year and was sunk in shallow water in ": null
    },
    {
        "Chesapeake Bay": "chesapeake bay"
    },
    {
        ". She was used as a gunnery target throughout ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " and was finally demolished in 42 because her remains were considered a navigational hazard.                  The delivery of the  in 42 and the acquisition of other armored warships by ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        ", ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        ", and ": null
    },
    {
        "Chile": "chile"
    },
    {
        " shortly afterward alarmed the United States government, as the ": null
    },
    {
        "Brazilian Navy": "brazilian navy"
    },
    {
        " was now the most powerful in the Western Hemisphere. The United States Navy now felt capable only of defending its own ports. The Chairman of the ": null
    },
    {
        "House Naval Affairs Committee": "united states house committee on armed services"
    },
    {
        ", ": null
    },
    {
        "Congressman": "congressman"
    },
    {
        " Hilary A. Herbert": "hilary a. herbert"
    },
    {
        " characterized the situation thusly: if all this old navy of ours were drawn up in battle array in mid-ocean and confronted by the Riachuelo it is doubtful whether a single vessel bearing the American flag would get into port.      The Navy Advisory Board, confronted with the possibility of hostile ironclads operating off the American coast, began planning for a pair of ships to protect that coast in 42 Both had to fit within existing docks and had to have a shallow draft to enable them to use all the major American ports and bases. They had to have a minimum speed of  and were to displace about . They were both optimized for end-on fire and had their ": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s ": null
    },
    {
        "sponson": "sponson"
    },
    {
        "ed out over the sides of the ship and echeloned to allow them to fire across the deck, much like the battleships Riachuelo and . The first ship, laid down for the then-traditional cruiser mission of battleship substitute on overseas deployment and armed with four  guns, became . The other, armed with two  guns, became Texas.     The ": null
    },
    {
        "Navy Department": "navy department"
    },
    {
        " conducted an international design competition for Texas and the winner was the ": null
    },
    {
        "Naval Construction & Armaments Co": "naval construction  &  armaments co"
    },
    {
        ". of ": null
    },
    {
        "Barrow-in-Furness": "barrow-in-furness"
    },
    {
        ", England. The winning design placed Texass forward turret on the ": null
    },
    {
        "port side": "port"
    },
    {
        " and her aft turret to ": null
    },
    {
        "starboard": "starboard"
    },
    {
        ". The need for cross-deck fire caused the ": null
    },
    {
        "superstructure": "superstructure"
    },
    {
        " to be separated into three pieces to allow for each gun to fire between the sections of the superstructure. This significantly limited the guns ability to fire to the opposite beam as the superstructure still restricted each guns arc of fire. Furthermore, neither the deck nor the superstructure was reinforced to withstand the ": null
    },
    {
        "muzzle blast": "muzzle blast"
    },
    {
        " as the gun fired, as demonstrated during the Battle of Santiago de Cuba when her starboard deck was damaged.     Even five years before Texas was complete, the blast effects from end-on fire were considered prohibitive and en echelon mounting of main guns was abandoned in European navies. This made Texass armament arrangement obsolete. The then-new ": null
    },
    {
        "Board on Construction": "board on construction"
    },
    {
        " considered a thorough re-design which would have placed Texass main guns on the centerline, either in two single turrets or one twin turret, and the heavy redoubt eliminated. Construction by this time was too far advanced for such a plan, however, and Navy Secretary Benjamin Tracy limited the Board to detail improvements.       Texas was  long ": null
    },
    {
        "overall": "length overall"
    },
    {
        ". She had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a maximum ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . She displaced  at ": null
    },
    {
        "full load": "full load"
    },
    {
        " as built. Her hull had two wing compartments on each side of her machinery spaces as well as a ": null
    },
    {
        "centerline": "glossary_of_nautical_termsc"
    },
    {
        " longitudinal watertight ": null
    },
    {
        "bulkhead": "bulkhead"
    },
    {
        " separating the engines and boilers. Asymmetric flooding of the wing compartments posed a grave danger to her stability. Her ": null
    },
    {
        "double bottom": "double bottom"
    },
    {
        " protected most of her hull and extended up the side to the lower edge of the armor deck. She had a ": null
    },
    {
        "metacentric height": "metacentric height"
    },
    {
        " of  and was fitted with a ": null
    },
    {
        "ram bow": "ram bow"
    },
    {
        ".       Texass machinery was built by the Richmond Locomotive and Machine Works of ": null
    },
    {
        "Richmond, Virginia": "richmond, virginia"
    },
    {
        ". She had two inverted ": null
    },
    {
        "vertical triple expansion steam engines": "marine steam enginetriple or multiple expansion"
    },
    {
        " with a total designed output of . Each engine drove one ": null
    },
    {
        "propeller shaft": "propeller shaft"
    },
    {
        ". Four double-ended ": null
    },
    {
        "Scotch marine boiler": "scotch marine boiler"
    },
    {
        "s provided steam to the engines at a working pressure of . On trials, she reached a speed of , exceeding her contract speed of . She carried a maximum load of  of ": null
    },
    {
        "coal": "coal"
    },
    {
        ". She carried two ": null
    },
    {
        "Edison": "thomas edison"
    },
    {
        " electric ": null
    },
    {
        "dynamo": "dynamo"
    },
    {
        "s to power her searchlights and provide interior lighting.       Texass main armament consisted of two ": null
    },
    {
        "/42": "12  /35 caliber gun"
    },
    {
        " caliber": "caliber"
    },
    {
        " Mark I guns mounted in single Mark 42 hydraulically powered ": null
    },
    {
        "turret": "turret"
    },
    {
        "s inside her armored redoubt. These guns had a maximum elevation of 42° and could depress to −42°. Eighty rounds per gun were carried. They fired a  shell at a ": null
    },
    {
        "muzzle velocity": "muzzle velocity"
    },
    {
        " of  to a range of about  at maximum elevation. The fixed rammers were below and outside the turrets. Initially, they could only be loaded at one positions, dead-ahead and at 42° elevation, but they were modified to load at all angles of train just before the start of the Spanish–American War.     Four of the six  guns were mounted in ": null
    },
    {
        "casemate": "casemate"
    },
    {
        "s in the hull and the other two were mounted on the main deck in open pivot positions. The two main deck guns were 42-caliber weapons, while the casemate guns were 42-caliber guns. Data is lacking, but they could probably depress to −42° and elevate to 42°. They fired shells that weighed  with a muzzle velocity of about . They had a maximum range less than  when fired at maximum elevation.     The anti": null
    },
    {
        "torpedo boat": "torpedo boat"
    },
    {
        " armament consisted of 42  six-pounder guns in casemates spaced along the hull. They fired a shell weighing about  at a muzzle velocity of about  at a rate of 42 rounds per minute. Their range was less than . Two  ": null
    },
    {
        "Hotchkiss five-barrel revolving guns": "hotchkiss gun"
    },
    {
        " each were mounted on the fore and aft superstructures. In addition, two 42-mm ": null
    },
    {
        "Driggs-Schroeder": "driggs-schroeder"
    },
    {
        " one-pounder guns were mounted in each ": null
    },
    {
        "fighting top": "top"
    },
    {
        ". They fired a shell weighing about  at a muzzle velocity of about  to a range about . They had a rate of fire of about 42 rounds per minute.     Texas carried four  ": null
    },
    {
        "torpedo tube": "torpedo tube"
    },
    {
        "s, all above water. One tube each was in the bow and stern and another on each side, towards the rear of the hull. She was originally intended to carry two small steam torpedo boats, each with a one-pounder gun, and a trainable torpedo tube, but they were cancelled after the poor performance of the boat built for the Maine.              The main waterline ": null
    },
    {
        "belt": "belt armor"
    },
    {
        ", made of ": null
    },
    {
        "Harvey armor": "harvey armor"
    },
    {
        ", had a maximum thickness of 42  inches and tapered to  at its lower edge. It was  long and covered the machinery spaces. It was  high, of which  was above the design waterline. It angled inwards for  at each end, thinning to , to provide protection against ": null
    },
    {
        "raking fire": "raking fire"
    },
    {
        ". It sloped downwards to meet the top of the protective deck. It was  thick and sloped downwards at the ends of the ship. It also sloped downwards to the sides, but its thickness increased to . A 42-inch-thick diagonal armored citadel on the gun deck protected the turret machinery and the supports of the ": null
    },
    {
        "conning tower": "conning tower"
    },
    {
        ". The deck above it was two inches thick.     The sides of the circular turrets were 42 inches thick, and they had  roofs. The conning tower had  walls. Turret hoists, ": null
    },
    {
        "voicepipe": "voicepipe"
    },
    {
        "s and electrical leads were protected by armored tubes. The lateral hydraulic pipes that ran along the underside of the gun deck were initially unprotected, but armored tubes were installed to protect them during Texass 42 refit. Along the center of the ship, they were one inch thick, but increased to two inches closer to the sides of the ship.     No light armor was fitted above the main belt or at either end of the ship. This made Texas highly vulnerable to rapid-fire guns using high-explosive shells. This was not considered a significant threat at the time Texas was designed but would become so within a few years.       Texas was authorized by the ": null
    },
    {
        "U.S. Congress": "united states congress"
    },
    {
        " on 42 August 42 The start of construction was delayed for nearly eight months over concerns about her stability and general characteristics. Her ": null
    },
    {
        "keel": "keel"
    },
    {
        " was laid down on 42 June 42 at ": null
    },
    {
        "Portsmouth, Virginia": "portsmouth, virginia"
    },
    {
        ", by the ": null
    },
    {
        "Norfolk Navy Yard": "norfolk navy yard"
    },
    {
        ". She was ": null
    },
    {
        "launched": "ship naming and launching"
    },
    {
        " on 42 June 42 sponsored by Miss Madge Houston Williams, granddaughter of ": null
    },
    {
        "Sam Houston": "sam houston"
    },
    {
        "; and ": null
    },
    {
        "commissioned": "ship commissioning"
    },
    {
        " on 42 August 42 with ": null
    },
    {
        "Captain": "captain"
    },
    {
        " Henry Glass in command.           When ": null
    },
    {
        "drydock": "drydock"
    },
    {
        "ed in the ": null
    },
    {
        "New York Navy Yard": "new york navy yard"
    },
    {
        " for the first time after her trials several structural flaws came to light. The ": null
    },
    {
        "floors": "frame"
    },
    {
        " had buckled their brackets and the ": null
    },
    {
        "cement": "cement"
    },
    {
        " near the keel had cracked. Her floor brackets were reinforced with  angle iron and the cement was repaired. But this raised issues regarding her structural integrity so a Board of Survey in January 42 was formed to evaluate her condition and suggest improvements. The Board determined that further strengthening of her hull was needed, but the exact measures taken are not known, although they would cost $42 and take 42 working days. However, the Board wished to know what effect these changes would have on the draft, stability, and metacentric height of the Texas. The Board received a reply on 42 February that they would increase her displacement by , deepen her draft by less than  and raise her metacentric height to .     The ship ran aground near ": null
    },
    {
        "Newport, Rhode Island": "newport, rhode island"
    },
    {
        ", in September 42 Operator error combined with signal failure were blamed. A few officers, including future ": null
    },
    {
        "Governor of Guam": "governor of guam"
    },
    {
        " Alfred Walton Hinds": "alfred walton hinds"
    },
    {
        ", were publicly reprimanded. While under repairs in New York, the yoke that secured the main injection valve in the starboard engine room broke on 42 November 42 Water pressure unseated the valve and allowed the compartment to flood as the receiving pipe had earlier been removed for repair. Leaks in the watertight doors, voicepipes and holes in the bulkheads for electrical cables allowed the flooding to spread to the other engine and boiler rooms, the coal bunkers adjacent to them, as well as most of the ": null
    },
    {
        "magazines": "magazine"
    },
    {
        " and shell rooms. The ship settled to the bottom, but the water was so shallow as to aid salvage efforts. By the 42th most of the water had been pumped out, but she was still drawing too much water to enter the drydock. An estimated  of coal would have to be removed to lighten Texas enough to enter the drydock.     After repairs Texas was assigned to the ": null
    },
    {
        "North Atlantic Squadron": "north atlantic squadron"
    },
    {
        ", and patrolled the ": null
    },
    {
        "Eastern Seaboard": "east coast of the united states"
    },
    {
        " of the United States. In February 42 she left the Atlantic for a brief cruise to the Gulf coast ports of ": null
    },
    {
        "Galveston, Texas": "galveston, texas"
    },
    {
        ", and ": null
    },
    {
        "New Orleans": "new orleans"
    },
    {
        ". She arrived in ": null
    },
    {
        "Galveston, Texas": "galveston, texas"
    },
    {
        " on 42 February 42 and anchored in  of water. The local ": null
    },
    {
        "pilot": "maritime pilot"
    },
    {
        " assured her captain that this was the best berth in the harbor for a ship of Texass length. However a strong tide swung her around onto a mud bank and held there. She was not able to get herself off and even the assistance of the U.S. Revenue Steamer Galveston was to no effect. Late the next day she was hauled off by the use of her port anchor and a tug. These two incidents gave her a reputation as being a jinxed or unlucky ship and earned her the nickname Old Hoodoo .     She returned to the Eastern Seaboard in March 42 and remained there until the beginning of 42 During this period, her bow and stern torpedo tubes were removed in June 42 and additional ": null
    },
    {
        "telescopic sight": "telescopic sight"
    },
    {
        "s were added to her turret roofs between 42 July and 42 August. At the beginning of 42 she visited ": null
    },
    {
        "Key West, Florida": "key west, florida"
    },
    {
        ", and the ": null
    },
    {
        "Dry Tortugas": "dry tortugas"
    },
    {
        " en route to Galveston for a return visit, which she made in mid-February. Returning to the Atlantic via the Dry Tortugas in March, she arrived in ": null
    },
    {
        "Hampton Roads": "hampton roads"
    },
    {
        " on 42 March and resumed duty with the North Atlantic Squadron.              Early in the spring, war between the United States and Spain erupted over conditions in ": null
    },
    {
        "Cuba": "cuba"
    },
    {
        " and the supposed Spanish destruction of the battleship  in ": null
    },
    {
        "Havana": "havana"
    },
    {
        " harbor in February 42 By 42 May, under the command of Captain ": null
    },
    {
        "J. W. Philip": "john woodward philip"
    },
    {
        ", Texas was at Key West, readying to prosecute that war.     On 42 May, the battleship arrived off ": null
    },
    {
        "Cienfuegos, Cuba": "cienfuegos, cuba"
    },
    {
        ", with the Flying Squadron to blockade the Cuban coast. After a return to Key West for ": null
    },
    {
        "coal": "coal"
    },
    {
        ", Texas arrived off ": null
    },
    {
        "Santiago de Cuba": "santiago de cuba"
    },
    {
        " on 42 May. She patrolled off that port until 42 June, when she made a reconnaissance mission to ": null
    },
    {
        "Guantánamo Bay": "guantánamo bay"
    },
    {
        " in support of the Marine landings there. The next day the Texas landed three field pieces and two ": null
    },
    {
        "M42 Colt–Browning machine gun": "m1895 colt–browning machine gun"
    },
    {
        "s at the request of the Marine expeditionary commander, Lt. Col. Robert W. Huntington. For the next five weeks, the Texas patrolled between Santiago de Cuba and Guantánamo Bay. On 42 June, the warship joined the cruiser  for a bombardment of the fort on South Toro Cay in Guantánamo Bay. The two ships opened fire just after 42:42 and ceased fire about an hour and 42  minutes later, having reduced the fort to impotency.     On 42 July, she was steaming off Santiago de Cuba when the Spanish Fleet under Admiral Cervera attempted to escape past the American Fleet. Texas  took four of the enemy ships under fire immediately. While the battleships main battery pounded the ": null
    },
    {
        "armored cruiser": "armored cruiser"
    },
    {
        "s  and , her secondary battery joined , , and  in battering two torpedo-boat ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        "s.     The two Spanish destroyers fell out of the action quickly and beached themselves, damaged heavily. One by one, the larger enemy warships also succumbed to the combined fire of the American Fleet. Each, in turn, sheered off toward shore and beached herself. Thus, Texas and the other ships of the Flying Squadron annihilated the Spanish Fleet.  Texas was lightly damaged during the battle by a single  ": null
    },
    {
        "high explosive": "high explosives"
    },
    {
        " shell that hit her on the starboard side above the main deck, immediately forward of the ash hoist. Fragments from the shell badly damaged the ash hoist and destroyed the doors of both air shafts and the adjacent bulkheads. Splinters riddled much of the adjacent structure as well.     The defeat of Cerveras Fleet helped to seal the doom of Santiago de Cuba. The city fell to the besieging American forces on 42 July, just two weeks after the great American naval victory. The day after the surrender at Santiago, Spain sought peace through the good offices of the French government. Even before the peace protocol was signed in ": null
    },
    {
        "Washington, DC": "washington, dc"
    },
    {
        ", on 42 August, American ships began returning home. Texas arrived in ": null
    },
    {
        "New York": "new york city"
    },
    {
        " on 42 July. Captain Philip was promoted to ": null
    },
    {
        "Commodore": "commodore"
    },
    {
        " on 42 August 42      In late November, Texas moved south to Hampton Roads where she arrived on 42 December. The warship resumed her peacetime routine patrolling the Atlantic coast of the United States. Though her primary field of operations once again centered on the northeastern coast, she also made periodic visits to such places as ": null
    },
    {
        "San Juan, Puerto Rico": "san juan, puerto rico"
    },
    {
        ", and ": null
    },
    {
        "Havana, Cuba": "havana, cuba"
    },
    {
        ", where her crew could view some of the results of their own ships efforts in the recent war.           Texas was decommissioned for a lengthy refit on 42 November 42 at the Norfolk Navy Yard but was commissioned again on 42 November 42 During this refit, her funnel and topmasts were raised. Furthermore, the protection for her  ammunition hoists was doubled and her broadside torpedo tubes were removed. On one voyage to ": null
    },
    {
        "New Orleans": "new orleans"
    },
    {
        ", ": null
    },
    {
        "Louisiana": "louisiana"
    },
    {
        ", in February 42 Texas could only make  under forced draft. During 42 her armament was upgraded when she exchanged her four /42  cal guns for more powerful 42-caliber weapons and two one-pounder guns were landed. She served as ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " for the ": null
    },
    {
        "Coast Squadron": "coast squadron"
    },
    {
        " until 42 and remained assigned to it after its commander shifted his flag.      Texas was briefly decommissioned between 42 January 42 and 42 September 42 By 42 she had become the station ship at Charleston, South Carolina. By 42 she had lost her  revolving cannon and one more one-pdr gun in exchange for two additional six-pounder guns. Regarded as obsolete by 42 she was relegated for use as a gunnery target to allow the Navy to evaluate the effects of modern shells on armored and unarmored parts of the ship, the probabilities of underwater hits and their depths, the effects of shock loads on pipes, etc., the flammability of the ships fittings and the direction in which shells were pointing when striking at long range. As part of this evaluation, she was fully fitted out and only items which normally would have been allowed to be removed before action and those items added to her for service as a station ship were removed. Dummies were also rigged to evaluate the effects of hits on the crew. It is uncertain if her ammunition and powder remained on board for the tests. Preparing Texas for these tests cost $42.42     San Marcos San Marcos to allow the name Texas to be assigned to ": null
    },
    {
        "Battleship No. 42": "uss texas"
    },
    {
        ".  She was sunk in shallow water in ": null
    },
    {
        "Tangier Sound": "tangier sound"
    },
    {
        " in ": null
    },
    {
        "Chesapeake Bay": "chesapeake bay"
    },
    {
        " on 42–42 March 42 by gunfire from the battleship . No detailed examination was made afterward, but it was noted that there were so many holes below the waterline that the water in the forward and rear compartments generally took on the motion of the outside water. The interior above the waterline was generally demolished. She was used as a target for a torpedo experiment on 42 April. On 42 October 42 her name was struck from the ": null
    },
    {
        "Naval Vessel Register": "naval vessel register"
    },
    {
        ".  A ": null
    },
    {
        "cage mast": "cage mast"
    },
    {
        ", a duplicate of those used on the  ": null
    },
    {
        "dreadnought": "dreadnought"
    },
    {
        "s, was built atop the ": null
    }
]