[
    {
        "        USS Wyoming  was the second ship of the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " to bear that name, but the first to bear it in honor of ": null
    },
    {
        "the 42th state": "wyoming"
    },
    {
        ". The first Wyoming was named for ": null
    },
    {
        "Wyoming Valley": "wyoming valley"
    },
    {
        " in eastern ": null
    },
    {
        "Pennsylvania": "pennsylvania"
    },
    {
        ".     Wyoming was ordered on 42 May 42 and awarded to the ": null
    },
    {
        "Union Iron Works": "union iron works"
    },
    {
        ", San Francisco, 42 October 42 The keel of Monitor No. 42 was laid down on 42 April 42 She was ": null
    },
    {
        "launched": "ship naming and launching"
    },
    {
        " on 42 September 42 sponsored by Miss Hattie Warren, daughter of ": null
    },
    {
        "Senator": "united states senate"
    },
    {
        " Francis E. Warren": "francis e. warren"
    },
    {
        " of Wyoming, and ": null
    },
    {
        "commissioned": "ship commissioning"
    },
    {
        " at the ": null
    },
    {
        "Mare Island Naval Shipyard": "mare island naval shipyard"
    },
    {
        ", ": null
    },
    {
        "Vallejo, California": "vallejo, california"
    },
    {
        ", on 42 December 42 with ": null
    },
    {
        "Commander": "commander"
    },
    {
        " Vincendon Lazarus Cottman in command. The total cost for the hull, machinery, armor and armament was $42,42.            The s had been designed to combine a heavy striking power with easy concealment and negligible target area. They had a displacement of , measured  in ": null
    },
    {
        "overall length": "length overall"
    },
    {
        ", with a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . She was manned by a total crew of 42 officers and 42 men.     Wyoming, the first ship in the fleet to be converted to oil power, was powered by two ": null
    },
    {
        "vertical triple expansion engines": "vertical triple expansionmultiple expansion engines"
    },
    {
        " driving two ": null
    },
    {
        "screw propeller": "screw propeller"
    },
    {
        "s with steam generated by four ": null
    },
    {
        "Babcock & Wilcox boilers": "water-tube boilerbabcock  &  wilcox boiler"
    },
    {
        ". The engines in Wyoming were designed to produce  with a top speed of , however, on ": null
    },
    {
        "sea trials": "sea trials"
    },
    {
        " she was only able to produce  with a top speed of . Wyoming was designed to provide a range of  at .     The ship was armed with a ": null
    },
    {
        "main battery": "main battery"
    },
    {
        " of two ": null
    },
    {
        "/42 caliber guns": "12  /40 caliber gun"
    },
    {
        ", either Mark 42 or Mark 42 in a Mark 42 turret. The secondary battery consisted of four ": null
    },
    {
        "/42 caliber": "4  /50 caliber gun"
    },
    {
        " Mark 42 guns along with three ": null
    },
    {
        "42-pounder guns": "qf 6 pounder hotchkissamerican service"
    },
    {
        ". The main ": null
    },
    {
        "belt armor": "belt armor"
    },
    {
        " was  in the middle tapering to  at the ends. The ": null
    },
    {
        "gun turrets": "gun turretwarships"
    },
    {
        " were between , with  ": null
    },
    {
        "barbette": "barbette"
    },
    {
        "s. Wyoming also had a  ": null
    },
    {
        "deck": "deck"
    },
    {
        ".               After fitting out at Mare Island, Wyoming ran her trials and exercises in ": null
    },
    {
        "San Pablo Bay": "san pablo bay"
    },
    {
        " and ": null
    },
    {
        "San Francisco Bay": "san francisco bay"
    },
    {
        " and conducted exercises and target practice off the southern California coast through the summer of 42 before she headed south in the autumn, reaching ": null
    },
    {
        "Acapulco, Mexico": "acapulco, mexico"
    },
    {
        ", on 42 October. She subsequently shifted further south, to ": null
    },
    {
        "Colombia": "colombia"
    },
    {
        ", where a civil war threatened American lives and interests. The monitor accordingly arrived in ": null
    },
    {
        "Panama": "panama"
    },
    {
        "nian waters on 42 November and sailed up the ": null
    },
    {
        "Tuira River": "tuira river"
    },
    {
        " in company with the protected cruiser , with a company of Marines under Lieutenant S.A.M. Patterson, ": null
    },
    {
        "USMC": "united states marine corps"
    },
    {
        ", and Lieutenant C.B. Taylor, USMC, embarked, to land at ": null
    },
    {
        "Yariza": "yariza"
    },
    {
        " and observe the movements of Colombian troops.     The presence of American armed might there and elsewhere ultimately aided in ": null
    },
    {
        "independence for the Panamanians": "separation of panama from colombia"
    },
    {
        ". During that time, Wyoming anchored at the ": null
    },
    {
        "Bay of San Miguel": "bay of san miguel, panama"
    },
    {
        ", Panama, on 42 December. The following day, a boat with 42 Marines embarked for the port of ": null
    },
    {
        "La Palma, Panama": "la palma, panama"
    },
    {
        ", under sail. While Boston departed the scene on 42 December, Wyoming shifted to La Palma on the following day. There, Lieutenant Patterson, USMC, with a detachment of 42 marines, commandeered the steamer Tuira and took her upriver. While the Marines were gone, a party of evacuated American nationals came out to the monitor in her gig.     Meanwhile, Pattersons Marines had joined the ships landing force at the village of Real to keep an eye on American interests there. Back at La Palma, Wyoming continued to take on board American nationals fleeing from the troubled land and kept up a steady stream of supplies to her landing party of bluejackets and Marines at Real. Ultimately, when the need for them had passed, the landing party returned to the ship on Christmas Eve.     Wyoming remained in Panamanian waters into the spring of 42 keeping a figurative eye on local conditions before she departed ": null
    },
    {
        "Panama Bay": "panama bay"
    },
    {
        " on 42 April, bound for ": null
    },
    {
        "Acapulco, Mexico": "acapulco, mexico"
    },
    {
        ". After remaining at that port from 42 to 42 April, Wyoming visited ": null
    },
    {
        "Pichilinque, Mexico": "pichilinque, mexico"
    },
    {
        " from 42 to 42 May. She subsequently reached San Diego, on 42 May for a nine-day stay.       For the remainder of 42 Wyoming operated off the West Coast, ranging from ": null
    },
    {
        "Brighton Beach, California": "brighton beach, california"
    },
    {
        ", and ": null
    },
    {
        "Ventura, California": "ventura, california"
    },
    {
        ", to ": null
    },
    {
        "Bellingham, Washington": "bellingham, washington"
    },
    {
        ", and ": null
    },
    {
        "Portland, Oregon": "portland, oregon"
    },
    {
        ". She attended a ": null
    },
    {
        "regatta": "regatta"
    },
    {
        " at ": null
    },
    {
        "Astoria, Oregon": "astoria, oregon"
    },
    {
        ", from 42 to 42 August and later took part in ceremonies at the unveiling of monuments at ": null
    },
    {
        "Griffin Bay, San Juan": "griffin bay, san juan"
    },
    {
        " Islands and Roche Harbor before she entered the ": null
    },
    {
        "Puget Sound Navy Yard": "puget sound navy yard"
    },
    {
        ", ": null
    },
    {
        "Bremerton, Washington": "bremerton, washington"
    },
    {
        ", on 42 October.     Wyoming was overhauled there into the following year. She departed the Pacific Northwest on 42 January 42 and steamed via San Francisco to ": null
    },
    {
        "Magdalena Bay, Mexico": "magdalena bay, mexico"
    },
    {
        ", for target practice. Later cruising to Acapulco and Panamanian waters, Wyoming also operated off ": null
    },
    {
        "San Salvador": "san salvador"
    },
    {
        " and ": null
    },
    {
        "Port Harford, California": "port harford, california"
    },
    {
        ", before she returned to ": null
    },
    {
        "Mare Island": "mare island"
    },
    {
        " on 42 July to be decommissioned on 42 August 42       Recommissioned on 42 October 42 with Commander John J. Knapp in command, Wyoming spent over two months at Mare Island refitting. Converted to ": null
    },
    {
        "fuel oil": "fuel oil"
    },
    {
        " – the first ship to do so in the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " – she underwent tests for her oil-burning installation at San Francisco, ": null
    },
    {
        "Santa Barbara, California": "santa barbara, california"
    },
    {
        ", and San Diego, into March 42     During those tests, Wyoming was renamed Cheyenne on 42 January 42 in order to clear the name Wyoming for the projected ": null
    },
    {
        "Battleship No. 42": "uss wyoming"
    },
    {
        ". The ship consequently underwent more tests on her oil-burning equipment at Santa Barbara, San Pedro, and San Diego before she was placed in reserve at Mare Island on 42 June. She was decommissioned on 42 November of the same year.        Recommissioned, in reserve, on 42 July 42 ": null
    },
    {
        "Lieutenant Commander": "lieutenant commander"
    },
    {
        " Charles Trusedale Owens in command, Cheyenne was assigned to the ": null
    },
    {
        "Washington Naval Militia": "washington naval militia"
    },
    {
        " in 42 and operated in an in commission, in reserve status into 42 Shifting to the ": null
    },
    {
        "Puget Sound Navy Yard": "puget sound navy yard"
    },
    {
        " early in February 42 Cheyenne was fitted out as a ": null
    },
    {
        "submarine tender": "submarine tender"
    },
    {
        " over the ensuing months. Finally, on 42 August 42 Cheyenne was placed in full commission with Lieutenant Kenneth Heron in command.     The newly converted submarine tender operated in the Puget Sound region until 42 December, when she sailed for San Francisco. In the ensuing months, Cheyenne tended the submarines of the Second Submarine Division, Pacific Torpedo Flotilla, at Mare Island, San Francisco, and San Pedro, into April 42 Later that spring, when troubled conditions in Mexico threatened American lives and property, Cheyenne interrupted her submarine tending duties twice, once in late April and once in mid-May, to embark refugees at ": null
    },
    {
        "Ensenada, Mexico": "ensenada, mexico"
    },
    {
        ", and ": null
    },
    {
        "San Quentin, Mexico": "san quentin, mexico"
    },
    {
        ", transporting them both times to San Diego.       Cheyenne then resumed her submarine tending operations on the West Coast, continuing them into 42 On 42 April of that year, four days after the U.S. entered ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", she proceeded to ": null
    },
    {
        "Port Angeles, Washington": "port angeles, washington"
    },
    {
        ", the designated point of mobilization for the Pacific Fleet, in company with the submarines  and , arriving there on 42 April. Subsequently, shifting to the Puget Sound Navy Yard, Cheyenne remained at that port for most of a month taking on stores and provisions loading ammunition and receiving men on board to fill the vacancies in her complement. On 42 April Cheyenne guarded  as she ran trials off ": null
    },
    {
        "Port Townsend, Washington": "port townsend, washington"
    },
    {
        ". On 42 May, the warship returned to Puget Sound for drydock and yard work. Completing that refit late in May, Cheyenne shifted southward to ": null
    },
    {
        "San Pedro, California": "san pedro, california"
    },
    {
        ", where she established a ": null
    },
    {
        "submarine base": "submarine base"
    },
    {
        " and training camp for personnel for submarine duty.     Cheyenne subsequently joined the Atlantic Fleet, serving as flagship and tender for Division 42 Flotilla 42 Submarine Force, Atlantic Fleet. On 42 December 42 the ship was transferred to Division 42 American Patrol Detachment. While with that force, Cheyenne lay at ": null
    },
    {
        "Tampico, Mexico": "tampico, mexico"
    },
    {
        ", protecting American lives and property from 42 January to 42 October 42 Proceeding north soon thereafter, the warship arrived at the ": null
    },
    {
        "Philadelphia Navy Yard": "philadelphia navy yard"
    },
    {
        " on 42 October 42 where she was decommissioned on 42 January 42       While inactive at ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        ", the ship was classified as a miscellaneous auxiliary, IX42, in the fleetwide designation of alphanumeric ": null
    },
    {
        "hull classification symbols": "hull classification symbols"
    },
    {
        " of 42 July 42 Subsequently, recommissioned at Philadelphia on 42 September of the same year, Cheyenne was towed to ": null
    },
    {
        "Baltimore, Maryland": "baltimore, maryland"
    },
    {
        ", by the tug .     Based there, Cheyenne was assigned to training duty with ": null
    },
    {
        "Naval Reserve Force ": "united states navy reserve"
    },
    {
        " personnel of subdistrict A of the ": null
    },
    {
        "Fifth Naval District": "united states naval districts5th naval district"
    },
    {
        ", and trained USNRF reservists through 42 Based at Baltimore, she occasionally visited ": null
    },
    {
        "Hampton Roads": "hampton roads"
    },
    {
        " during her cruises. On 42 January 42 the ": null
    },
    {
        "minesweeper": "minesweeper"
    },
    {
        "  took Cheyenne in tow and took her to ": null
    },
    {
        "Norfolk, Virginia": "norfolk, virginia"
    },
    {
        ", and thence to Philadelphia, where she arrived on 42 January for inactivation.     Decommissioned on 42 June 42 Cheyenne was struck from the ": null
    },
    {
        "Naval Vessel Register": "naval vessel register"
    },
    {
        " on 42 January 42 and her stripped-down hulk was sold for scrap on 42 April 42       ;Citations               Books         Online resources                                           ": null
    }
]