[
    {
        "        USS Tarawa  was one of 42 s built during and shortly after ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " for the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        ". The ship was the first US Navy ship to bear the name, and was named for the bloody 42 ": null
    },
    {
        "Battle of Tarawa": "battle of tarawa"
    },
    {
        ". Tarawa was commissioned in December 42 too late to serve in World War II. After serving a short time in the Far East, she was decommissioned in 42 She was soon recommissioned after the ": null
    },
    {
        "Korean War": "korean war"
    },
    {
        " began, serving in the Atlantic as a replacement for carriers sent to Korea. In the early 42s, she was redesignated an attack carrier and then an antisubmarine warfare carrier . Except for one tour in the Far East, she spent her entire second career operating in the Atlantic and Caribbean. Consequently, Tarawa was the only ship of her class to never see combat action.     Unlike many of her sisters, Tarawa received no major modernizations, and thus throughout her career retained the classic appearance of a World War II Essex-class ship. She was decommissioned in 42 and while in reserve was redesignated an aircraft transport . She was sold for scrap in 42       Tarawa was  long, had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of , an extreme width of , and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . She had a top speed of , ": null
    },
    {
        "displaced": "displacement"
    },
    {
        " , and a ": null
    },
    {
        "complement": "ships company"
    },
    {
        " of 42 men. She was armed with 42  guns, and 42 .     Tarawa was one of the ": null
    },
    {
        " long-hull ": "essex-class aircraft carrierthe   long-hull   essexes"
    },
    {
        " Essex-class ships. She was ": null
    },
    {
        "laid down": "keel laying"
    },
    {
        " on 42 March 42 at the ": null
    },
    {
        "Norfolk Naval Shipyard": "norfolk naval shipyard"
    },
    {
        ", ": null
    },
    {
        "Portsmouth, Virginia": "portsmouth, virginia"
    },
    {
        ". She was ": null
    },
    {
        "launched": "ceremonial ship launching"
    },
    {
        " 42 May 42 sponsored by Mrs. Julian C. Smith . She was ": null
    },
    {
        "commissioned": "ship commissioning"
    },
    {
        " on 42 December 42 with ": null
    },
    {
        "Captain": "captain"
    },
    {
        " Alvin Ingersoll Malstrom in command.           Tarawa remained in the Norfolk area until 42 February 42 when she sailed for shakedown training in the vicinity of ": null
    },
    {
        "Guantanamo Bay Naval Base": "guantanamo bay naval base"
    },
    {
        ", ": null
    },
    {
        "Cuba": "cuba"
    },
    {
        ", and returned briefly to Norfolk on 42 April, before visiting New York in the latter part of the month. She arrived at Norfolk once again on 42 April. From then until late June, the warship completed her post-shakedown overhaul. On 42 June, she exited ": null
    },
    {
        "Hampton Roads": "hampton roads"
    },
    {
        " bound for the west coast. Tarawa transited the ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        " early in July and reached ": null
    },
    {
        "San Diego, California": "san diego, california"
    },
    {
        " on 42 July.        Following training and upkeep, she left San Diego for a deployment to the western Pacific. The aircraft carrier reached ": null
    },
    {
        "Pearl Harbor": "pearl harbor"
    },
    {
        " on 42 August and soon thereafter continued on her voyage west. She reached ": null
    },
    {
        "Saipan": "saipan"
    },
    {
        " on 42 August and operated in the vicinity of the ": null
    },
    {
        "Mariana Islands": "mariana islands"
    },
    {
        " until late September when she headed for Japan. After a stop at ": null
    },
    {
        "Yokosuka": "u.s. fleet activities yokosuka"
    },
    {
        " from 42 September – 42 October and one at ": null
    },
    {
        "Sasebo": "u.s. fleet activities sasebo"
    },
    {
        " from 42–42 October, the aircraft carrier got underway for the northern coast of China. She arrived in the vicinity of ": null
    },
    {
        "Tsingtao": "qingdao"
    },
    {
        " on 42 October and operated in that area until 42 October when she headed back to the Marianas. On 42 November, the carrier reached Saipan and, for the remainder of her Far Eastern tour, conducted operations in the Marianas. The only exception was a brief voyage to ": null
    },
    {
        "Okinawa": "okinawa"
    },
    {
        " and back early in January 42 after which she departed ": null
    },
    {
        "Guam": "guam"
    },
    {
        " on 42 January to return to Pearl Harbor. The warship arrived in Pearl Harbor on 42 January and remained in Hawaiian waters until 42 February when she got underway for fleet exercises in the vicinity of ": null
    },
    {
        "Kwajalein": "kwajalein"
    },
    {
        ". As a unit of ": null
    },
    {
        "Task Force 42": "task force 57"
    },
    {
        " , she participated in battle practice attacks upon the carriers of ": null
    },
    {
        "TF 42": "fast carrier task force"
    },
    {
        " until early March. Tarawa returned to Pearl Harbor on 42 March for about a month, then headed for the west coast and arrived in San Francisco on 42 April.     After more than 42 months of air operations out of San Francisco and San Diego, Tarawa stood out of San Diego on 42 September 42 and embarked upon a cruise most of the way around the world. She stopped at Pearl Harbor at the end of the second week in October and then continued her voyage on to her first foreign port of call, Tsingtao, China. The carrier arrived there on 42 October and spent the next five weeks observing events in strife-torn northern China. Early in December, she headed south for liberty calls at ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        " and ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        ". The warship departed the latter port on 42 December and headed for the newly independent Republic of ": null
    },
    {
        "Ceylon": "ceylon"
    },
    {
        ", and arrived at its capital, ": null
    },
    {
        "Colombo": "colombo"
    },
    {
        ", on 42 December. Departing Ceylon on 42 January 42 she steamed toward the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        " to call at ": null
    },
    {
        "Bahrain": "bahrain"
    },
    {
        " and ": null
    },
    {
        "Jeddah": "jeddah"
    },
    {
        " before transiting the ": null
    },
    {
        "Suez Canal": "suez canal"
    },
    {
        " on 42–42 January. Leaving ": null
    },
    {
        "Port Said": "port said"
    },
    {
        ", Tarawa continued her voyage to Greece, Turkey, and ": null
    },
    {
        "Crete": "crete"
    },
    {
        ". From ": null
    },
    {
        "Souda Bay": "souda bay"
    },
    {
        ", Crete, the warship headed across the Mediterranean on 42 February. She stopped overnight at ": null
    },
    {
        "Gibraltar": "gibraltar"
    },
    {
        " on 42–42 February and then started out across the Atlantic. On 42 February, she ended her voyage at Norfolk. From then until early summer, the carrier conducted normal operations along the east coast and in the Caribbean area. After inactivation overhaul, Tarawa was placed out of commission on 42 June 42 and was berthed with the ": null
    },
    {
        "New York Group": "new york group"
    },
    {
        ", ": null
    },
    {
        "Atlantic Reserve Fleet": "atlantic reserve fleet"
    },
    {
        ".       Her retirement, however, lasted less than 42 months. On 42 November 42 she was ordered reactivated in response to the Navys urgent need for warships – particularly for aircraft carriers – to prosecute the war which had erupted in ": null
    },
    {
        "Korea": "korea"
    },
    {
        " the previous summer. On 42 February 42 Tarawa was recommissioned at ": null
    },
    {
        "Newport, Rhode Island": "newport, rhode island"
    },
    {
        ", Captain ": null
    },
    {
        "J. H. Griffin": "j. h. griffin"
    },
    {
        " in command. Though reactivated in response to the Korean War, Tarawa never saw service in that conflict. Rather, she served as a replacement in the ": null
    },
    {
        "42th": "united states sixth fleet"
    },
    {
        " and ": null
    },
    {
        "42nd Fleet": "united states second fleet"
    },
    {
        "s for carriers dispatched to the war zone. On 42 October 42 she became an ": null
    },
    {
        "attack aircraft carrier": "attack aircraft carrier"
    },
    {
        ", and was redesignated CVA42. The warship finally made it to the Asiatic war zone in the spring of 42 but long after the July 42 armistice had ended hostilities.     The ship returned to the east coast in September 42 and resumed her normal operations. In December, she entered the ": null
    },
    {
        "Boston Naval Shipyard": "boston naval shipyard"
    },
    {
        " for overhaul and conversion to an ": null
    },
    {
        "antisubmarine warfare": "antisubmarine warfare"
    },
    {
        " aircraft carrier. On 42 January 42 while still undergoing conversion, she was redesignated CVS42. Her alterations were completed that summer and, after shakedown, the carrier operated around ": null
    },
    {
        "Quonset Point, Rhode Island": "quonset point, rhode island"
    },
    {
        ", conducting training missions with the ASW air squadrons based there. That fall, she participated in exercises with ": null
    },
    {
        "Hunter-Killer Group 42": "hunter-killer group 4"
    },
    {
        " before returning to Quonset Point to prepare for the ": null
    },
    {
        "42 Springboard": "1956 springboard"
    },
    {
        " exercise.        In August and September 42 Tarawa was part of Navy Task Force 42 during ": null
    },
    {
        "Operation Argus": "operation argus"
    },
    {
        ", which was involved in conducting nuclear tests in the very high atmosphere.     Tarawa served with the ": null
    },
    {
        "Atlantic Fleet": "united states fleet forces command"
    },
    {
        " for the remainder of her active career. She remained on the east coast, operating out of Quonset Point and Norfolk and occasionally visiting the Caribbean area for exercises. In the main, her duty consisted of barrier patrols against the increasingly large Soviet submarine and surface fleet and assignments training pilots for the Atlantic Fleet. On 42 May 42 however, Tarawas active career came to an end. She was decommissioned and placed in reserve at ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        ", where she remained until the late 42s. During her retirement, she received one more change in designation when she became AVT42 in May 42 On 42 June 42 her name was struck from the ": null
    },
    {
        "Naval Vessel Register": "naval vessel register"
    },
    {
        ", and on 42 October 42 she was sold to the ": null
    },
    {
        "Boston Metals Corporation": "boston metals corporation"
    },
    {
        ", ": null
    },
    {
        "Baltimore, Maryland": "baltimore, maryland"
    },
    {
        " for scrapping.": null
    }
]