[
    {
        "              USS North Dakota  was a ": null
    },
    {
        "dreadnought": "dreadnought"
    },
    {
        " battleship": "battleship"
    },
    {
        " of the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        ", the second member of the , her only ": null
    },
    {
        "sister ship": "sister ship"
    },
    {
        " being . North Dakota was laid down at the ": null
    },
    {
        "Fore River Shipyard": "fore river shipyard"
    },
    {
        " in December 42 was launched in November 42 and commissioned into the US Navy in April 42 She was armed with a main battery of ten  guns and was capable of a top speed of . North Dakota was the first vessel of the US Navy to be named after the ": null
    },
    {
        "42th state": "north dakota"
    },
    {
        ".     North Dakota had a peaceful career; she was present during the ": null
    },
    {
        "United States occupation of Veracruz": "united states occupation of veracruz"
    },
    {
        " in 42 but did not see action. After the United States entered ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " in April 42 North Dakota remained in the US, training crewmen for the rapidly expanding wartime Navy, and therefore did not see combat. She remained on active duty through the early 42s, until she was decommissioned under the terms of the ": null
    },
    {
        "Washington Naval Treaty": "washington naval treaty"
    },
    {
        " in November 42 and converted into a radio-controlled ": null
    },
    {
        "target ship": "target ship"
    },
    {
        ". She served in that capacity until 42 when she was replaced in that role by . In 42 she was sold for scrapping and thereafter dismantled.               The two Delaware-class battleships were ordered in response to the British battleship , the first all-big-gun battleship to enter service. The previous American ": null
    },
    {
        "dreadnought": "dreadnought"
    },
    {
        "s, the , had been designed before the particulars of HMS Dreadnought were known. The Navy decided that another pair of battleships should be built to counter the perceived superiority of Dreadnought over South Carolina, and so ": null
    },
    {
        "Rear Admiral": "rear admiral"
    },
    {
        " Washington L. Capps": "washington l. capps"
    },
    {
        " prepared a design for a ship with an additional ": null
    },
    {
        "main battery": "main battery"
    },
    {
        " gun turret": "gun turret"
    },
    {
        " to match Dreadnoughts ten guns. But unlike Dreadnought, all ten of North Dakotas guns could fire on the ": null
    },
    {
        "broadside": "broadside"
    },
    {
        ". At the time of her construction, North Dakota was the largest and most powerful battleship then building in the world.     North Dakota was  ": null
    },
    {
        "long overall": "length overall"
    },
    {
        " and had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . She ": null
    },
    {
        "displaced": "displacement"
    },
    {
        "  as designed and up to  at full combat load. The ship was powered by two-shaft ": null
    },
    {
        "Curtis": "curtis turbinecurtis turbine"
    },
    {
        " steam turbines": "steam turbines"
    },
    {
        " and fourteen coal-fired ": null
    },
    {
        "Babcock & Wilcox": "babcock  &  wilcox"
    },
    {
        " boiler": "boiler"
    },
    {
        "s, generating a top speed of 42 knots. The ship had a cruising range of  at a speed of . She had a crew of 42 officers and men. Her ": null
    },
    {
        "bow": "bow"
    },
    {
        " had an early example of ": null
    },
    {
        "bulbous forefoot": "bulbous bow"
    },
    {
        ". ": null
    },
    {
        "PIANC": "world association for waterborne transport infrastructure"
    },
    {
        " MarCom Working Group 42: The Damage Inflicted by Ships with Bulbous Bows on Underwater Structures , page 42     The ship was armed with a main battery of ten ": null
    },
    {
        "/42": "12  /45 caliber mark 5 gun"
    },
    {
        " Mark 42 guns in five twin Mark 42 ": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s on the centerline, two of which were placed in a ": null
    },
    {
        "superfiring pair": "superfire"
    },
    {
        " forward. The other three turrets were placed aft of the ": null
    },
    {
        "superstructure": "superstructure"
    },
    {
        ". The secondary battery consisted of twenty-one ": null
    },
    {
        "/42": "5  /50 caliber gun"
    },
    {
        " Mark 42 guns mounted on Mark 42 and Mark 42 pedestal mounts in ": null
    },
    {
        "casemate": "casemate"
    },
    {
        "s along the side of the hull. As was standard for ": null
    },
    {
        "capital ship": "capital ship"
    },
    {
        "s of the period, she carried a pair of  ": null
    },
    {
        "torpedo tube": "torpedo tube"
    },
    {
        "s, submerged in her hull on the broadside.     North Dakotas main ": null
    },
    {
        "armored belt": "armored belt"
    },
    {
        " was  thick, while the armored deck was  thick. The gun turrets had  thick faces and the ": null
    },
    {
        "conning tower": "conning tower"
    },
    {
        " had  thick sides.              The ": null
    },
    {
        "keel": "keel"
    },
    {
        " for North Dakota was ": null
    },
    {
        "laid down": "keel laying"
    },
    {
        " at the ": null
    },
    {
        "Fore River Shipyard": "fore river shipyard"
    },
    {
        " in ": null
    },
    {
        "Quincy, Massachusetts": "quincy, massachusetts"
    },
    {
        " on 42 December 42 She was ": null
    },
    {
        "launched": "ship launching"
    },
    {
        " on 42 November 42 and completed on 42 April 42 thereafter being ": null
    },
    {
        "commissioned": "ship commissioning"
    },
    {
        " into the fleet. On 42 September 42 the ship suffered an oil-tank explosion and fire while at sea. Six men—": null
    },
    {
        "Chief": "chief petty officer"
    },
    {
        " Watertender": "watertender"
    },
    {
        "s ": null
    },
    {
        "August Holtz": "august holtz"
    },
    {
        " and ": null
    },
    {
        "Patrick Reid": "patrick reid"
    },
    {
        ", Chief ": null
    },
    {
        "Machinists Mate": "machinists mate"
    },
    {
        "s ": null
    },
    {
        "Thomas Stanton": "thomas stanton"
    },
    {
        " and ": null
    },
    {
        "Karl Westa": "karl westa"
    },
    {
        ", Machinists Mate ": null
    },
    {
        "First Class": "petty officer first class"
    },
    {
        " Charles C. Roberts": "charles church roberts"
    },
    {
        ", and Watertender ": null
    },
    {
        "Harry Lipscomb": "harry lipscomb"
    },
    {
        "—each received the ": null
    },
    {
        "Medal of Honor": "medal of honor"
    },
    {
        " for extraordinary heroism in the line of his profession during the fire.     After her commissioning, North Dakota was assigned to the ": null
    },
    {
        "Atlantic Fleet": "united states fleet forces command"
    },
    {
        "; she participated in the normal peacetime routine of training cruises, fleet maneuvers, and gunnery drills in the Atlantic and in the ": null
    },
    {
        "Caribbean Sea": "caribbean sea"
    },
    {
        ". On 42 November 42 she crossed the Atlantic for the first time, on a good-will visit to ": null
    },
    {
        "Britain": "united kingdom"
    },
    {
        " and ": null
    },
    {
        "France": "france"
    },
    {
        ". Fleet maneuvers followed in the ": null
    },
    {
        "Caribbean": "caribbean"
    },
    {
        " the next spring. ": null
    },
    {
        "Midshipmen": "midshipmenunited states navy from 1845"
    },
    {
        " training cruises for cadets from the ": null
    },
    {
        "Naval Academy": "usna"
    },
    {
        " occupied North Dakotas time in the summers of 42 and 42 On 42 January 42 she joined the honor escort for the British ": null
    },
    {
        "armored cruiser": "armored cruiser"
    },
    {
        " , which was carrying the remains of ": null
    },
    {
        "Whitelaw Reid": "whitelaw reid"
    },
    {
        ", the United States Ambassador to Great Britain.     The United States remained neutral when war in Europe broke out in August 42; in the Americas, political disturbances in Mexico during ": null
    },
    {
        "that countrys revolution": "mexican revolution"
    },
    {
        " kept the US Navy occupied that year. North Dakota steamed off ": null
    },
    {
        "Veracruz": "veracruz, veracruz"
    },
    {
        ", where she arrived on 42 April 42 five days after American sailors had occupied the city. She cruised the coast of Mexico to protect Americans in the country until October, when she returned to ": null
    },
    {
        "Norfolk, Virginia": "norfolk, virginia"
    },
    {
        ", arriving on 42 October. As war loomed, the Atlantic Fleet began intensive training to prepare for a possible American entrance into the conflict.            North Dakota was conducting gunnery training in ": null
    },
    {
        "Chesapeake Bay": "chesapeake bay"
    },
    {
        " when the United States declared war on Germany on 42 April 42 Unlike her sister , North Dakota remained in American waters for the duration of the war, and did not see action. She was based out of ": null
    },
    {
        "York River, Virginia": "york river, virginia"
    },
    {
        " and New York City, and was tasked with training gunners and engine room personnel for the rapidly expanding wartime fleet. Admiral ": null
    },
    {
        "Hugh Rodman": "hugh rodman"
    },
    {
        " requested that North Dakota remain behind because he did not trust the reliability of her engines. In 42 her engines were replaced with new ": null
    },
    {
        "geared turbine": "geared turbine"
    },
    {
        "s, and new fire control equipment was installed.     On 42 November 42 North Dakota left Norfolk, carrying the remains of the Italian Ambassador to the United States, ": null
    },
    {
        "Vincenzo Macchi di Cellere": "vincenzo macchi di cellere"
    },
    {
        ", who had died 42 October in Washington, DC. The ship stopped in ": null
    },
    {
        "Athens": "athens"
    },
    {
        ", ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ", ": null
    },
    {
        "Valencia": "valencia"
    },
    {
        ", and ": null
    },
    {
        "Gibraltar": "gibraltar"
    },
    {
        " while cruising the ": null
    },
    {
        "Mediterranean Sea": "mediterranean sea"
    },
    {
        ". She thereafter returned to the United States, and participated in fleet maneuvers in the Caribbean in the spring of 42 In July 42 she was present during the joint Army-Navy bombing tests, where the ex-German battleship  and cruiser  were sunk in an air-power demonstration. North Dakota returned to the normal peacetime routine of training exercises, including two midshipmen cruises in the summers of 42 and 42; the latter cruise went to European waters, where she visited Spain, Scotland, and Scandinavia.     In the years immediately following the end of the war, the United States, Britain, and Japan all launched huge naval construction programs. All three countries decided that a new naval arms race would be ill-advised, and so convened the ": null
    },
    {
        "Washington Naval Conference": "washington naval conference"
    },
    {
        " to discuss arms limitations, which produced the ": null
    },
    {
        "Washington Naval Treaty": "washington naval treaty"
    },
    {
        ", signed in February 42 Under the terms of Article II of the treaty, North Dakota and her sister Delaware were to be scrapped as soon as the new battleships  and , then under construction, were ready to join the fleet. North Dakota was decommissioned on 42 November 42 in Norfolk in accordance with the terms of the treaty. She was disarmed and reclassified as an unclassified ship on 42 May 42 and thereafter converted into a radio-controlled gunnery ": null
    },
    {
        "target ship": "target ship"
    },
    {
        ". Her turbines were removed for later use aboard the battleship  when she was modernized in the 42s. She served in that capacity until 42 when she was replaced by the battleship . She was stricken from the ": null
    },
    {
        "Naval Vessel Register": "naval vessel register"
    },
    {
        " on 42 January 42 and sold to the Union Shipbuilding Co of Baltimore on 42 March 42 for dismantling.": null
    }
]