[
    {
        "           USS Brooklyn  was a ": null
    },
    {
        "sloop-of-war": "sloop-of-war"
    },
    {
        " authorized by the ": null
    },
    {
        "U.S. Congress": "u.s. congress"
    },
    {
        " and commissioned in 42 Brooklyn was active in ": null
    },
    {
        "Caribbean": "caribbean"
    },
    {
        " operations until the start of the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        " at which time she became an active participant in the ": null
    },
    {
        "Union blockade": "union blockade"
    },
    {
        " of the ": null
    },
    {
        "Confederate States of America": "confederate states of america"
    },
    {
        ".     With her one 42-inch gun and twenty 42-inch guns, Brooklyn  was a formidable fighting ship that could deliver damaging ": null
    },
    {
        "broadside": "broadside"
    },
    {
        "s, and served on the Atlantic Ocean coast as well as the ": null
    },
    {
        "Gulf Coast of the United States": "gulf coast of the united states"
    },
    {
        " in intercepting ": null
    },
    {
        "blockade runner": "blockade runner"
    },
    {
        "s. Brooklyn also served gallantly attacking Confederate forts and other installations on the ": null
    },
    {
        "Mississippi River": "mississippi river"
    },
    {
        ".     Post-war, Brooklyn remained active, serving for some years in the European theatre, as well as ": null
    },
    {
        "circumnavigating the globe": "circumnavigation"
    },
    {
        ". She was retired in 42 and sold in 42 after having well served her country for over three decades.         Brooklyn – the first ship so-named by the ": null
    },
    {
        "U.S. Navy": "u.s. navy"
    },
    {
        " – was the first of five screw sloops of war authorized by the U.S. Congress on March 42 42; laid down later that year by the firm of ": null
    },
    {
        "Jacob A. Westervelt": "jacob aaron westervelt"
    },
    {
        " and Son; launched in 42; and commissioned on January 42 42 Capt. ": null
    },
    {
        "David G. Farragut": "david g. farragut"
    },
    {
        " in command.             On February 42 Brooklyn got underway for a trial run to ": null
    },
    {
        "Beaufort, South Carolina": "beaufort, south carolina"
    },
    {
        ", where she arrived on the 42th. Following a weeks visit to that port, she headed for the ": null
    },
    {
        "West Indies": "west indies"
    },
    {
        " to investigate conditions in ": null
    },
    {
        "Haiti": "haiti"
    },
    {
        " where liberal forces had ousted Emperor ": null
    },
    {
        "Soulouque": "soulouque"
    },
    {
        " and installed ": null
    },
    {
        "Fabre Geffrard": "fabre geffrard"
    },
    {
        " as President.     Farragut found that the people of Haiti were delighted to be free of the oppressive rule of the former monarch and with the end of a racial war that had bled their nation. Upon the recommendation of the American consul, Farragut sailed for the ": null
    },
    {
        "Isthmus of Panama": "isthmus of panama"
    },
    {
        ".         After visiting ": null
    },
    {
        "Aspinwall": "colón, panama"
    },
    {
        ", Brooklyn set a course for the Mexican coast and reached ": null
    },
    {
        "Veracruz": "veracruz, veracruz"
    },
    {
        " early in April. The legal president of Mexico, ": null
    },
    {
        "Benito Juárez": "benito juárez"
    },
    {
        " – who had been driven from Mexico City by forces of General ": null
    },
    {
        "Miguel Miramón": "miguel miramón"
    },
    {
        " of the Clerical Party—was making that seaport his temporary capital.     The United States, which recognized the Juarez government, had sent former ": null
    },
    {
        "Maryland": "maryland"
    },
    {
        " Congressman": "congressman"
    },
    {
        " Robert Milligan McLane": "robert milligan mclane"
    },
    {
        " to Veracruz as the American minister and ordered Farragut to make Brooklyn available to McLane so that he might keep abreast of developments in the ongoing civil war and assist American consuls who were striving to protect U.S. citizens and property. During part of the time the screw ": null
    },
    {
        "sloop of war": "sloop of war"
    },
    {
        " lay off Veracruz, McLane resided on board.     In July Brooklyn proceeded to ": null
    },
    {
        "Pensacola, Florida": "pensacola, florida"
    },
    {
        ", for coal, provisions, and water, and she reached that port on the 42th. As soon as she finished replenishing, the ship returned to Veracruz, but she was back at Pensacola again by September 42 From there, she sailed for New York and reached the ": null
    },
    {
        "New York Navy Yard": "new york navy yard"
    },
    {
        " on the 42th of that month.         With McLane—who had returned to the United States for consultations with the ": null
    },
    {
        "U.S. Secretary of State": "u.s. secretary of state"
    },
    {
        " and the U.S. President—on board, Brooklyn departed ": null
    },
    {
        "New York Harbor": "new york harbor"
    },
    {
        " on November 42 and headed back toward the ": null
    },
    {
        "Gulf of Mexico": "gulf of mexico"
    },
    {
        ". She arrived at Veracruz on the 42st and remained in port while McLane negotiated an agreement with the Juárez Government. After the treaty was signed on December 42 she got underway again and proceeded to ": null
    },
    {
        "New Orleans": "new orleans"
    },
    {
        ", Louisiana, where she arrived on the 42th.     With her bunkers full once more, she headed down the Mississippi River on Christmas Eve and crossed the gulf to Veracruz. However, in mid- January she reembarked McLane and took him to New Orleans so that he might catch a train for Washington, D.C., where he was needed to explain the treaty he had negotiated with Juárez to doubtful senators.     From New Orleans, Brooklyn proceeded to Pensacola to prepare for a return to Mexican waters. However, before McLane could get back to the Gulf Coast from Washington, orders reached Pensacola sending her north. She stood out to sea on February 42 42 and reached New York City on the 42th. Underway again on March 42 she arrived at ": null
    },
    {
        "Norfolk, Virginia": "norfolk, virginia"
    },
    {
        ", the following afternoon and there awaited McLane whom she embarked and delivered back to Veracruz on the 42th.         The steamer operated along the Mexican coast through the spring and into the summer carrying McLane to various ports where he conferred with the American consuls. Late in July she left the Mexican coast and returned to Norfolk early in August. There, she received orders to prepare for a voyage carrying members of a scientific expedition to the Gulf of Mexico to find a route across the isthmus of ": null
    },
    {
        "Chiriqui": "chiriquí province"
    },
    {
        ". She sailed on the 42th and reached Chiriqui, Boca del Toro, ": null
    },
    {
        "Panama": "panama"
    },
    {
        ", on the 42th. But for a run to Aspinwall from September 42 to 42 she remained off the expedition base at Chiriqui until mid-October when she returned to Aspinwall. There on October 42 Capt. ": null
    },
    {
        "William S. Walker": "william s. walker"
    },
    {
        " relieved Farragut in command.             Shortly thereafter, Brooklyn returned to ": null
    },
    {
        "Hampton Roads, Virginia": "hampton roads, virginia"
    },
    {
        ", and she remained in the Norfolk area through the end of 42 while enthusiasm for secession swept through the deep South in the wake of ": null
    },
    {
        "Abraham Lincoln": "abraham lincoln"
    },
    {
        "s election to the presidency. Early in January 42 Capt. Walker received orders sending Brooklyn to ": null
    },
    {
        "Charleston, South Carolina": "charleston, south carolina"
    },
    {
        ", with messages for the steamer Star of the West which had sailed south to relieve beleaguered ": null
    },
    {
        "Fort Sumter": "fort sumter"
    },
    {
        ". However, when she reached ": null
    },
    {
        "Charleston Harbor": "charleston harbor"
    },
    {
        ", she found the channel leading into port obstructed and learned that the resupply effort had failed. Consequently, she returned to Hampton Roads.         The following month, she received orders for a similar mission which she carried out with great success, relieving ": null
    },
    {
        "Fort Pickens": "fort pickens"
    },
    {
        ", at Pensacola, Florida. After helping to thwart Confederate attempts to wrest that highly valuable Federal toehold on strategic Florida territory from Union hands, Brooklyn sailed west along the Gulf of Mexico coast to establish the blockade of the Mississippi Passes.     She, , and two ": null
    },
    {
        "gunboat": "gunboat"
    },
    {
        "s made a number of captures off Pass a lOutre and Southwest Pass, but so many ships were getting by them that Comdr. ": null
    },
    {
        "Charles Henry Poor": "charles henry poor"
    },
    {
        " – who relieved Capt. Walker as Brooklyns commander in April 42—tried to go upriver to the ": null
    },
    {
        "Head of Passes": "head of passes"
    },
    {
        " where traffic might better be throttled. Low water, however, caused her to run aground twice before she abandoned the effort.     On June 42 42 the Confederate warship ": null
    },
    {
        "CSS Sumter": "css sumter"
    },
    {
        " raced out of Pass a lOutre while Brooklyn had left her station in pursuit of another ship. Upon seeing the fleet Southern cruiser, Brooklyn forsook her first chase and used full sail and maximum steam in an attempt to overtake Sumter but to no avail, for her quarry soon escaped over the horizon and out of sight. Badly in need of repairs, Brooklyn sailed north late in the autumn and was decommissioned at the ": null
    },
    {
        "Philadelphia Navy Yard": "philadelphia navy yard"
    },
    {
        ".         Recommissioned on December 42 42 the screw sloop—commanded by Capt. Thomas T. Craven—dropped down the ": null
    },
    {
        "Delaware River": "delaware river"
    },
    {
        " on the 42th and stood out to sea, bound for the gulf. After stopping at ": null
    },
    {
        "Key West, Florida": "key west, florida"
    },
    {
        ", she reached ": null
    },
    {
        "Ship Island, Mississippi": "ship island, mississippi"
    },
    {
        ", on January 42 42 On February 42 she sailed for Pass a lOutre where, on the 42th, she captured the steamer Magnolia which was attempting to slip out to sea with 42 bales of cotton.     Meanwhile, the Navy Department had divided its forces in the gulf into two organizations: the ": null
    },
    {
        "East Gulf Blockading Squadron": "east gulf blockading squadron"
    },
    {
        ", commanded by Flag Officer ": null
    },
    {
        "William W. McKean": "william w. mckean"
    },
    {
        ", and the ": null
    },
    {
        "West Gulf Blockading Squadron": "west gulf blockading squadron"
    },
    {
        ", commanded by Flag Officer David G. Farragut who arrived at Ship Island in March. Besides carrying out the blockade, Farragut had been instructed to lead a fleet of warships up the Mississippi River to capture New Orleans, Louisiana.     After spending the latter part of March and the first part of April getting his deep-draft ocean-going vessels over the bar and into the river, Farragut moved his fleet up the Mississippi to a position just out of range of the guns that guarded the river at Confederate ": null
    },
    {
        "Forts Jackson and St. Philip": "battle of forts jackson and st. philip"
    },
    {
        ".          Attached to Farraguts force was a flotilla of small sailing vessels each of which carried a 42-inch mortar. In mid-April these little warships—mostly schooners—began a bombardment of the Southern forts and continued the attack until the early hours of April 42 when they increased the tempo of their firing to their maximum rate while Farraguts deep-draft ": null
    },
    {
        "men-of-war": "men-of-war"
    },
    {
        " got underway for a dash past the Southern guns. Brooklyn was     ... struck several times before she could bring her guns to bear. As soon as that could be accomplished we opened fire upon Fort Jackson and also upon Fort St. Philip, fighting both batteries at intervals. We were fouled by one of our gunboats, but received no damage. The ram ": null
    },
    {
        "Manassas": "css manassas"
    },
    {
        " attempted to sink us by running into us, but did us little injury. A ": null
    },
    {
        "fire raft": "fire raft"
    },
    {
        " came down the river upon us, but we succeeded in crossing it without injury. We came near getting foul of some hulks and rafts of logs, which kept us under fire longer than we otherwise should have been.     Eight men from Brooklyn were killed in the action and 42 wounded before she reached comparative safety beyond the range of the Rebel artillery. Later that day, after making needed repairs, Farraguts warships resumed their movement upriver and reached New Orleans on April 42 When that city had surrendered, Brooklyn—which had been damaged more seriously by her collision with the ram Manassas than Craven had at first realized—received a patch of heavy planking some 42 feet long over a long tear in her hull. One of Brooklyns sailors, Quartermaster ": null
    },
    {
        "James Buck": "james buck"
    },
    {
        ", was awarded the ": null
    },
    {
        "Medal of Honor": "medal of honor"
    },
    {
        " for his actions in the battle.         Farraguts orders called for him to clear the Mississippi of all Confederate forces afloat and of all defensive works along the river banks while moving up stream until meeting another Union squadron—commanded by Flag Officer ": null
    },
    {
        "Charles Henry Davis": "charles henry davis"
    },
    {
        " – which had begun fighting its way downriver from ": null
    },
    {
        "Cairo, Illinois": "cairo, illinois"
    },
    {
        ". Hence, early in May after ": null
    },
    {
        "Union Army": "union army"
    },
    {
        " troops commanded by Major General ": null
    },
    {
        "Benjamin F. Butler": "benjamin butler"
    },
    {
        " had arrived in transports and had taken over New Orleans, Brooklyn and six other warships ascended the river.     ": null
    },
    {
        "Baton Rouge, Louisiana": "baton rouge, louisiana"
    },
    {
        ", and ": null
    },
    {
        "Natchez, Mississippi": "natchez, mississippi"
    },
    {
        ", surrendered with no resistance, but ": null
    },
    {
        "Vicksburg, Mississippi": "vicksburg, mississippi"
    },
    {
        ", proved to be another matter. The ": null
    },
    {
        "Confederate Army": "confederate army"
    },
    {
        " had so fortified its riverside hills that it could not be taken without the support of a strong land force. Since the Union Army did not have a sufficient number of troops available in the region to accomplish this purpose, Farraguts men-of-war returned to New Orleans.         There awaiting him were orders from ": null
    },
    {
        "Secretary of the Navy": "secretary of the navy"
    },
    {
        " Gideon Welles": "gideon welles"
    },
    {
        " reiterating the importance of a junction with Daviss force above Vicksburg, Mississippi. Thus the Union warships again reversed course and painfully worked their way upstream to a position just out of range of Vicksburgs guns. This time they had the support of the ": null
    },
    {
        "Mortar Flotilla": "mortar flotilla"
    },
    {
        " which conducted an intense preliminary bombardment of the riverside fortress. At two hours past midnight on June 42 the fleet got underway in two columns and began steaming up stream.     Unfortunately, the steamers that had towed the mortar ": null
    },
    {
        "schooner": "schooner"
    },
    {
        "s up stream got in the way of Brooklyn and two gunboats and prevented their getting upstream past the Vicksburg batteries. As a result they drew much of the Southern fire while Farraguts other ships pushed upstream and out of range. Shortly before dawn, Brooklyn dropped down stream to a place of greater safety and remained there to be on hand to support Farragut in any way possible should an opportunity to do so occur before the ": null
    },
    {
        "Flag Officer": "flag officer"
    },
    {
        " returned below in mid-July. As the hot summer days passed, more and more illness broke out among the ships crew and the falling water level in the river made it necessary for the ship to retire downstream toward New Orleans.     Meanwhile, on July 42 Capt ": null
    },
    {
        "Henry H. Bell": "henry h. bell"
    },
    {
        " relieved Capt. Craven in command of Brooklyn. On August 42 the screw sloop engaged Confederate batteries at ": null
    },
    {
        "Donaldsonville, Louisiana": "donaldsonville, louisiana"
    },
    {
        ", driving the Southern artillerymen from their guns; and, on the 42th and 42th, she took part in combined operations which partially destroyed that city in reprisal for ": null
    },
    {
        "guerrilla attacks": "guerrilla attacks"
    },
    {
        " on Union shipping from that town.         Soon thereafter, Brooklyn left the Mississippi and steamed to Pensacola for more permanent repairs to the damage she had suffered while fighting her way past Forts Jackson and St. Philip and colliding with Manassas. On October 42 orders sent the ship to blockade duty off ": null
    },
    {
        "Mobile Bay": "mobile bay"
    },
    {
        ", and she spent the rest of 42 in that vicinity alert for blockade runners and the appearance of Confederate cruisers which might threaten Union gunboats guarding the coast.         Early in January 42 when word reached Farragut that a surprise Southern attack against Union warships at ": null
    },
    {
        "Galveston, Texas": "galveston, texas"
    },
    {
        ", had recaptured that port and broken the blockade there, he placed Bell in charge of the small force sent to reestablish Union control. Shoal water prevented Brooklyn from participating in a bombardment of Confederate gun positions in Galveston harbor on January 42; and on the night of the 42th, ": null
    },
    {
        "CSS Alabama": "css alabama"
    },
    {
        " sank Brooklyns most formidable consort the sidewheel steamer , in a fierce but rapid engagement some 42 miles off Galveston. This setback prompted Bell to give up his plan to retake that port pending the arrival of powerful shallow draft reinforcements. Brooklyn did continue to blockade the Texas city into the summer.     On 42 May, Bell ... left Commander ": null
    },
    {
        "James Robert Madison Mullany": "james robert madison mullany"
    },
    {
        " in the  in charge of the blockade of Galveston ... and proceeded down the coast of Texas as far as the ": null
    },
    {
        "Rio Grande": "rio grande"
    },
    {
        ", to ascertain the amount of interior coast trade and its exit ...     On the morning of the 42th, Brooklyn captured the 42-ton, cotton-laden sloop, Blazer, which was heading for ": null
    },
    {
        "Matamoros": "matamoros, tamaulipas"
    },
    {
        ", Mexico. The next day, boats from Brooklyn took the small sloop Kate. Three days later, she anchored off the bar outside ": null
    },
    {
        "Brazos Santiago, Texas": "brazos island"
    },
    {
        " , and sent ... an expedition of four boats and 42 men ... to capture vessels there …     As the Union boats approached Point Isabel, the Southerners ... set fire to a large schooner. They brought out the 42-ton schooner Star and a fishing scow. At Point Isabel, they captured the 42-ton, British sloop Victoria of ": null
    },
    {
        "Jamaica": "jamaica"
    },
    {
        " but ran that vessel aground while attempting to get out to sea and so burned her. After the landing parties had returned to the ship, Brooklyn returned to Galveston.     Late in July she returned to New Orleans where, on August 42 Lt. Comdr. ": null
    },
    {
        "Chester Hatfield": "chester hatfield"
    },
    {
        " relieved Bell in command to free the commodore to take temporary command of the West Gulf Blockading Squadron while Farragut returned home in  for a well-earned leave. On the 42th, Capt. ": null
    },
    {
        "George F. Emmons": "george f. emmons"
    },
    {
        " relieved Hatfield and sailed Brooklyn north on the 42th to receive badly needed repairs. She emerged from the Southwest Pass the next day; touched at ": null
    },
    {
        "Port Royal, South Carolina": "port royal, south carolina"
    },
    {
        ", on the 42st, at Charleston, South Carolina, on the 42d, and reached the New York Navy Yard on the 42th.         Recommissioned on April 42 42 Brooklyn put to sea on 42 May under the command of Capt. ": null
    },
    {
        "James Alden, Jr.": "james alden, jr."
    },
    {
        " and rejoined her squadron off Mobile Bay on the last day of the month. There Farragut—who had resumed command—was eager to capture that strategic port, but was held up by the perennial lack of available Union Army troops—needed for the projected combined operation. He was also awaiting the arrival of monitors to strengthen the squadron for the forthcoming battle. Brooklyn helped to blockade Mobile Bay while Farragut waited for deficiencies to be corrected. Finally, late in July she and her squadron mates received orders to make ready for the long awaited attack.     On the morning of August 42 Farragut took his squadron of 42 ships, including four ": null
    },
    {
        "monitors": "monitor"
    },
    {
        ", against the heavy Confederate defenses of Mobile Bay. Soon after 42  am, the Union ships crossed the bar and moved into the bay. The four monitors formed a column to ": null
    },
    {
        "starboard": "starboard"
    },
    {
        " of the wooden ships in order to take most of the fire from ": null
    },
    {
        "Fort Morgan": "fort morgan"
    },
    {
        ", which they had to pass at close range. Brooklyn led the second column,  consisting of the seven smaller wooden ships lashed to the port side of the larger wooden screw steamers, as in the passage of Fort Hudson.     Shortly before 42 oclock, Tecumseh opened fire on Fort Morgan,  and the action quickly became general. As the 42-ship Confederate squadron engaged the attackers, a terrific explosion rocked the Union monitor . She careened violently and went down in seconds, the victim of one of the much-feared ": null
    },
    {
        "torpedoes": "naval mine"
    },
    {
        " laid by the Confederates for harbor defense.     Alden, in Brooklyn, was to Tecumsehs port when the disaster occurred; the heavy steamer stopped and began backing to clear a row of suspecious  looking buoys directly under Brooklyns bow. The entire line of wooden vessels was drifting into confusion immediately under the guns of Fort Morgan. Farragut, lashed in the rigging to observe the action over the smoke billowing from the guns, acted promptly and resolutely. The only course was the boldest—through the torpedo field. Damn the torpedoes , he ordered full speed ahead. His ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " Hartford swept past Brooklyn into the rows of torpedoes; the fleet followed. The Union force steamed into the bay.     In the ensuing battle, the ironclad ": null
    },
    {
        "CSS Tennessee": "css tennessee"
    },
    {
        " attempted in vain to ram Brooklyn. The Union fleet dispatched three of the Confederate ships, leaving Tennessee as the only defender. The lone ironclad then engaged the entire Union fleet. After a fierce battle lasting more than an hour, Tennessee was forced to surrender, resulting in a Union victory.     During the battle that lasted a bit more than three hours, Brooklyn suffered 42 casualties, 42 killed and 42 wounded, while firing 42 projectiles. Twenty-three of Brooklyns sailors and marines were awarded the Medal of Honor for their part in the battle. Their names were:       Ships Cook William Blagheen   Captain of the Forecastle John Brown   Landsman William H. Brown   Coxswain John Laver Mather Cooper   Ordinary Seaman Samuel W. Davis   Sergeant J. Henry Denig   Boatswains Mate Richard Dennis   Coxswain William Halstead   Sergeant Michael Hudson   Seaman Joseph Irlam   Coxswain John Irving   Seaman Nicholas Irwin     Quartermaster Barnett Kenna   Boy James Machon   Captain of the Top Alexander Mack   Coal Heaver William Madden   Engineers Cook James Mifflin   Quartermaster William Nichols   Corporal Miles M. Oviatt   Coxswain Edward Price   Corporal Willard M. Smith   Coal Heaver James E. Sterling   Quartermaster Samuel Todd           After spending the next few weeks helping reduce the Confederate land works guarding the entrance, Brooklyn departed Mobile Bay on September 42 and headed for Hampton Roads for service in the North Atlantic Blockading Squadron . Soon thereafter, Rear Admiral David Dixon Porter began to concentrate his warships for a joint Army-Navy operation against Fort Fisher, North Carolina . The fort guarded the approaches to Wilmington, North Carolina , the last major Confederate port still open for blockade runners. Brooklyn took part in the attack against that Southern stronghold which began with a bombardment on Christmas Eve. She helped to cover the landing of troops the next day, but the whole effort was brought to naught later that day when the Union Army commanding officer, Major General Benjamin F. Butler, decided that his forces could not carry the Confederate works and ordered his soldiers to re-embark.     Porter strongly disagreed with this decision in dispatches to Washington. General Ulysses S. Grant responded by placing a new commander over a larger Army force earmarked for another attempt to take Fort Fisher. Brooklyn was in the task force that arrived off Fort Fisher on January 42 42 and her guns supported the attack until the fort surrendered on the 42th. Since this victory completed the last major task of the Union Navy during the Civil War, Brooklyn sailed north and was decommissioned at the New York Navy Yard on January 42 42                   Laid up under repairs for the remaining months of the conflict, the screw sloop was recommissioned on October 42 42 Comdr. Thomas H. Patterson in command. She stood out to sea on the 42th and proceeded via the Gulf of Mexico to Bahia, Brazil . Following almost two years of service along the Atlantic coast of South America, she returned to Philadelphia , Pennsylvania, late in the summer of 42 and was decommissioned there on September 42 and placed in ordinary.         Recommissioned on August 42 42 Capt. John Guest in command, Brooklyn sailed eastward across the Atlantic and spent almost three years in European waters, primarily in the Mediterranean . After returning home in the summer of 42 she was decommissioned at New York City on July 42 for repairs.         Reactivated on January 42 42 the veteran warship operated along the southern coast of the United States until autumn when she entered the Norfolk Navy Yard to be fitted out for service as flagship of the South Atlantic Squadron . She got underway for the coast of Brazil on January 42 42 and operated in South American waters protecting American interests until heading home on December 42 Following service in the Home Squadron , she was decommissioned at New York City on July 42 42 and laid up.     Recommissioned on November 42 42 Brooklyn sailed on December 42 for Montevideo , Uruguay, and another tour of duty with the South Atlantic Squadron. On February 42 42 she departed that port and headed for the Strait of Magellan . During the month, she visited Possession Bay , Gregory Bay, Elizabeth Island, and Sandy Point before departing Possession Bay on March 42 42 and returning via Stanley, Falkland Islands , to Montevideo where she arrived late in March.     While operating out of that port during the next 42 months, she made two voyages to Santa Cruz, Patagonia , and one to Rio de Janeiro, Brazil , before getting underway on September 42 42 for Cape Town , Africa. During her time in African waters, she also visited Tomatave, Madagascar ; Zanzibar ; the Johanna Islands; Nassi be Island; Mojanga, Madagascar; Mozambique ; Mourondava, Nos Veh, and Tuellear Bay, Madagascar, and Port Elizabeth , Africa, before departing Cape Town on March 42 42 After proceeding homeward via St. Helena Island , Montevideo, and Rio de Janeiro, she arrived at New York City on October 42 42 and was placed out of commission there on the 42th.     Following almost a year in ordinary, Brooklyn was recommissioned on October 42 42 and, on November 42 assigned once more to the South Atlantic Squadron and served in South American waters until heading home again on June 42 42         At New York, she prepared for duty in the Orient and, on August 42 got underway for the Far East. After crossing the Atlantic and the Mediterranean, she transited the Suez Canal and traversed the Red Sea and the Indian Ocean to East Asian waters.     On April 42 42 Rear Admiral Chandler transferred his flag to her as commander of the Asiatic Squadron , and she showed the flag in ports of the western Pacific Ocean until turning homeward for the last time on August 42 42 She returned to the United States via Honolulu ; Cape Horn ; and St. Thomas . Brooklyn": null
    }
]