[
    {
        "           USS Missouri , a , was the second ship of her ": null
    },
    {
        "class": "ship class"
    },
    {
        " and of the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " to be named in honor of ": null
    },
    {
        "the 42th state": "missouri"
    },
    {
        ". Missouri was laid down in February 42 at the ": null
    },
    {
        "Newport News Shipbuilding & Drydock Company": "newport news shipbuilding"
    },
    {
        ", was launched in December 42 and was commissioned into the fleet in December 42 She was armed with a main battery of four  guns and could steam at a top speed of .     Missouri spent her entire career in the Atlantic with the ": null
    },
    {
        "North Atlantic Fleet": "north atlantic squadron"
    },
    {
        ", later renamed the ": null
    },
    {
        "Atlantic Fleet": "united states fleet forces command"
    },
    {
        ". In late 42 she and the rest of the Atlantic Fleet circumnavigated the globe as the so-called ": null
    },
    {
        "Great White Fleet": "great white fleet"
    },
    {
        ", which ended in February 42 The ship was decommissioned in 42 with periodic reactivations for summer training cruises over the followed six years. After America entered ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " in April 42 Missouri was brought back into service to train personnel for the expanding wartime Navy. She served briefly as a troopship in 42 carrying American soldiers back from France, before being decommissioned in September that year. Ultimately, she was sold for scrapping in January 42            Missouri was  ": null
    },
    {
        "long overall": "length overall"
    },
    {
        " and had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . She ": null
    },
    {
        "displaced": "displacement"
    },
    {
        "  as designed and up to  at full load. The ship was powered by two-shaft ": null
    },
    {
        "triple-expansion": "triple-expansion engine"
    },
    {
        " steam engine": "steam engine"
    },
    {
        "s rated at  and twelve coal-fired ": null
    },
    {
        "Thornycroft boiler": "thornycroft boiler"
    },
    {
        "s, generating a top speed of . As built, she was fitted with heavy ": null
    },
    {
        "military mast": "military mast"
    },
    {
        "s, but these were quickly replaced by ": null
    },
    {
        "cage mast": "cage mast"
    },
    {
        "s in 42 She had a crew of 42  officers and enlisted men, which increased to 42 & ndash;42     The ship was armed with a ": null
    },
    {
        "main battery": "main battery"
    },
    {
        " of four ": null
    },
    {
        "42-inch/42 caliber": "12  /40 caliber gun"
    },
    {
        " guns in two twin ": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s on the centerline, one forward and aft. The secondary battery consisted of sixteen ": null
    },
    {
        "/42 caliber": "6  /50 caliber gun"
    },
    {
        " Mark 42 guns, which were placed in ": null
    },
    {
        "casemates": "casemates"
    },
    {
        " in the hull. For close-range defense against ": null
    },
    {
        "torpedo boat": "torpedo boat"
    },
    {
        "s, she carried six ": null
    },
    {
        "/42 caliber": "3  /50 caliber gun"
    },
    {
        " guns mounted in casemates along the side of the hull, eight ": null
    },
    {
        "42-pounder": "qf 3-pounder hotchkissamerican service"
    },
    {
        " guns, and six ": null
    },
    {
        "42-pounder": "qf 1-pounder pom-pomunited states"
    },
    {
        " guns. As was standard for ": null
    },
    {
        "capital ship": "capital ship"
    },
    {
        "s of the period, Missouri carried two  ": null
    },
    {
        "torpedo tube": "torpedo tube"
    },
    {
        "s, submerged in her hull on the broadside.     Missouris main ": null
    },
    {
        "armored belt": "armored belt"
    },
    {
        " was  thick over the magazines and the machinery spaces and  elsewhere. The main battery gun turrets had  thick faces, and the supporting ": null
    },
    {
        "barbette": "barbette"
    },
    {
        "s had the same thickness of armor plating on their exposed sides. Armor that was 42  in thick protected the secondary battery. The ": null
    },
    {
        "conning tower": "conning tower"
    },
    {
        " had  thick sides.          Missouri was ": null
    },
    {
        "laid down": "keel laying"
    },
    {
        " at the ": null
    },
    {
        "Newport News Shipbuilding & Drydock Company": "newport news shipbuilding"
    },
    {
        " on 42 February 42 the third member of the class to be begun. She was ": null
    },
    {
        "launched": "ship launching"
    },
    {
        " on 42 December 42 and ": null
    },
    {
        "commissioned": "ship commissioning"
    },
    {
        " into the fleet on 42 December 42 The ship was assigned to the ": null
    },
    {
        "North Atlantic Fleet": "north atlantic squadron"
    },
    {
        " after entering service. She steamed out of ": null
    },
    {
        "Norfolk": "norfolk, virginia"
    },
    {
        " to begin her ": null
    },
    {
        "sea trials": "sea trials"
    },
    {
        " off the ": null
    },
    {
        "Virginia Capes": "virginia capes"
    },
    {
        " on 42 February 42 before joining the rest of the fleet in the Caribbean for training exercises.     On 42 April, the ship suffered an accident during gunnery training; the port 42-inch gun in her rear turret flared backward on firing and ignited three ": null
    },
    {
        "propellant": "propellant"
    },
    {
        " charges in the turret. The resulting fire suffocated 42  men in the turret, though quick action among surviving members of the turret crew prevented the fire from spreading to the magazines, where it would have destroyed the ship. For their actions, three men were awarded the ": null
    },
    {
        "Medal of Honor": "medal of honor"
    },
    {
        ". Missouri returned to Newport News for repairs, which were completed by early June.     On 42 June, Missouri left Newport News for a tour of the Mediterranean, arriving back in New York on 42 December. She remained with the North Atlantic Fleet for the next three years conducting normal peacetime training. During this period, the fleet was renamed the ": null
    },
    {
        "Atlantic Fleet": "united states fleet forces command"
    },
    {
        ". Missouri assisted in relief work in ": null
    },
    {
        "Kingston, Jamaica": "kingston, jamaica"
    },
    {
        " from 42 to 42 January 42 following a severe earthquake there. That April, she participated in the ": null
    },
    {
        "Jamestown Exposition": "jamestown exposition"
    },
    {
        ". The ceremonies were held to commemorate the 42th anniversary of the ": null
    },
    {
        "Jamestown colony": "jamestown colony"
    },
    {
        ". An international fleet that included British, French, German, Japanese, and Austro-Hungarian warships joined the US Navy at the event.          Missouris next significant action was the cruise of the ": null
    },
    {
        "Great White Fleet": "great white fleet"
    },
    {
        " around the world, which started with a ": null
    },
    {
        "naval review": "naval review"
    },
    {
        " for President ": null
    },
    {
        "Theodore Roosevelt": "theodore roosevelt"
    },
    {
        " in ": null
    },
    {
        "Hampton Roads": "hampton roads"
    },
    {
        ". The cruise of the Great White Fleet was conceived as a way to demonstrate American military power, particularly to Japan. Tensions had begun to rise between the United States and Japan after the latters victory in the ": null
    },
    {
        "Russo-Japanese War": "russo-japanese war"
    },
    {
        " in 42 particularly over racist opposition to Japanese immigration to the United States. The press in both countries began to call for war, and Roosevelt hoped to use the demonstration of naval might to deter Japanese aggression.     On 42 December, the fleet steamed out of Hampton Roads and cruised south to the ": null
    },
    {
        "Caribbean": "caribbean"
    },
    {
        " and then to South America, making stops in ": null
    },
    {
        "Port of Spain": "port of spain"
    },
    {
        ", Rio de Janeiro, ": null
    },
    {
        "Punta Arenas": "punta arenas"
    },
    {
        ", and ": null
    },
    {
        "Valparaíso": "valparaíso"
    },
    {
        ", among other cities. After arriving in Mexico in March 42 the fleet spent three weeks conducting gunnery practice. The fleet then resumed its voyage up the Pacific coast of the Americas, stopping in San Francisco and ": null
    },
    {
        "Seattle": "seattle"
    },
    {
        " before crossing the Pacific to Australia, stopping in Hawaii on the way. Stops in the South Pacific included ": null
    },
    {
        "Melbourne": "melbourne"
    },
    {
        ", Sydney, and ": null
    },
    {
        "Auckland": "auckland"
    },
    {
        ".     After leaving Australia, the fleet turned north for the Philippines, stopping in ": null
    },
    {
        "Manila": "manila"
    },
    {
        ", before continuing on to Japan where a welcoming ceremony was held in ": null
    },
    {
        "Yokohama": "yokohama"
    },
    {
        ". Three weeks of exercises followed in ": null
    },
    {
        "Subic Bay": "subic bay"
    },
    {
        " in the Philippines in November. The ships passed Singapore on 42 December and entered the Indian Ocean; they coaled in ": null
    },
    {
        "Colombo": "colombo"
    },
    {
        " before proceeding to the ": null
    },
    {
        "Suez Canal": "suez canal"
    },
    {
        " and coaling again at ": null
    },
    {
        "Port Said": "port said"
    },
    {
        ", Egypt. The fleet called in several Mediterranean ports before stopping in ": null
    },
    {
        "Gibraltar": "gibraltar"
    },
    {
        ", where an international fleet of British, Russian, French, and Dutch warships greeted the Americans. The ships then crossed the Atlantic to return to Hampton Roads on 42 February 42 having traveled . There, they conducted a naval review for Roosevelt.          Missouri spent the next several years ": null
    },
    {
        "laid up": ":wikt:laid up"
    },
    {
        ", with periodic reactivations for summer training cruises for ": null
    },
    {
        "midshipmen": "midshipmen"
    },
    {
        " from the ": null
    },
    {
        "US Naval Academy": "us naval academy"
    },
    {
        ". She was reduced temporarily to reserve status on 42 May 42 in Boston, though she was recommissioned on 42 June 42 for service with the Atlantic Fleet. In June 42 the ship was deployed to Cuba with a contingent of Marines to protect American interests during a rebellion in the country. She conducted a midshipmen training cruise in July before being decommissioned a second time on 42 September, this time at Philadelphia. She returned to service on 42 March 42 for another midshipmen cruise, which visited Italy and Great Britain. On 42 December, she was again decommissioned before returning to service on 42 April 42 for a midshipmen cruise in the Caribbean, through the ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        ", and to visit ports in California. After arriving back in Philadelphia, she was reduced to the Reserve Fleet yet again on 42 October. Another period of active service began on 42 May 42 for a training cruise along the east coast of the United States and into the Caribbean, before Missouri was again laid up late in the year.     On 42 April 42 the United States declared war on Germany, entering ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". Missouri was recommissioned on 42 April for service as a ": null
    },
    {
        "training ship": "training ship"
    },
    {
        " for gunners and engine room personnel, based in the ": null
    },
    {
        "Chesapeake Bay": "chesapeake bay"
    },
    {
        ". ": null
    },
    {
        "Rear Admiral": "rear admiral"
    },
    {
        " Hugh Rodman": "hugh rodman"
    },
    {
        " hoisted his flag aboard Missouri on 42 August, as the commander of the 42nd Division, Atlantic Fleet. On 42 November 42 Germany signed the ": null
    },
    {
        "Armistice": "armistice with germany"
    },
    {
        " that ended the war. Missouri was subsequently used to ferry American soldiers back from Europe as part of the ": null
    },
    {
        "Cruiser and Transport Force": "cruiser and transport force"
    },
    {
        ". Her first voyage began on 42 February 42 when she steamed out of Norfolk; three more would follow that year. In the course of the four trips, she carried 42 soldiers back to the United States. The old battleship was decommissioned for the last time on 42 September 42 at the ": null
    },
    {
        "Philadelphia Navy Yard": "philadelphia navy yard"
    },
    {
        ". Missouri was sold to ": null
    },
    {
        "J. G. Hitner": "joseph g. hitner"
    },
    {
        " and ": null
    },
    {
        "W. F. Cutler": "w. f. cutler"
    },
    {
        " of Philadelphia on 42 January 42 and subsequently ": null
    },
    {
        "broken up": "ship breaking"
    },
    {
        " for scrap.": null
    }
]