[
    {
        "           USS Georgia  was a ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " , the third of five ships of the ": null
    },
    {
        "class": "ship class"
    },
    {
        ". She was built by the ": null
    },
    {
        "Bath Iron Works": "bath iron works"
    },
    {
        " in Maine, with her ": null
    },
    {
        "keel": "keel"
    },
    {
        " laid in August 42 and her launching in October 42 The completed battleship was commissioned into the fleet in September 42 The ship was armed with an offensive battery of four  guns and eight  guns, and she was capable of a top speed of .     Georgia spent the majority of her career in the ": null
    },
    {
        "Atlantic Fleet": "united states fleet forces command"
    },
    {
        ". In 42 she took part in the ": null
    },
    {
        "Jamestown Exposition": "jamestown exposition"
    },
    {
        " and suffered an explosion in her aft 42-inch gun turret that killed or wounded 42  men. At the end of the year, she joined the ": null
    },
    {
        "Great White Fleet": "great white fleet"
    },
    {
        " on its circumnavigation of the globe, which ended in early 42 Peacetime training followed for the next five years, and in 42 she cruised in Mexican waters to protect American interests during the ": null
    },
    {
        "Mexican Revolution": "mexican revolution"
    },
    {
        ". In early 42 the ship was temporarily decommissioned.     When the United States entered ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " in April 42 the ship was tasked with training naval recruits for the expanding wartime fleet. Starting in September 42 she was used as a ": null
    },
    {
        "convoy": "convoy"
    },
    {
        " escort. Her only casualties during the war were due to disease, the result of poor conditions and severe overcrowding aboard the ship. Georgia was used to transport American soldiers back from France in 42–42 and the following year she was transferred to the ": null
    },
    {
        "Pacific Fleet": "united states pacific fleet"
    },
    {
        ", where she served as the ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " of the 42nd Division, 42st Squadron. The ": null
    },
    {
        "Washington Naval Treaty": "washington naval treaty"
    },
    {
        ", signed in 42 cut short the ships career, as it mandated severe draw-downs in naval strength. Georgia was accordingly sold for scrap in November 42            Georgia was  ": null
    },
    {
        "long overall": "length overall"
    },
    {
        " and had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . She ": null
    },
    {
        "displaced": "displacement"
    },
    {
        "  as designed and up to  at full load. The ship was powered by two-shaft ": null
    },
    {
        "triple-expansion": "triple-expansion engine"
    },
    {
        " steam engine": "steam engine"
    },
    {
        "s rated at  and twenty-four coal-fired ": null
    },
    {
        "Niclausse boiler": "niclausse boiler"
    },
    {
        "s, generating a top speed of . As built, she was fitted with heavy ": null
    },
    {
        "military mast": "military mast"
    },
    {
        "s, but these were quickly replaced by ": null
    },
    {
        "cage mast": "cage mast"
    },
    {
        "s in 42 She had a crew of 42  officers and enlisted men.     The ship was armed with a ": null
    },
    {
        "main battery": "main battery"
    },
    {
        " of four ": null
    },
    {
        "42-inch/42 caliber": "12  /40 caliber gun"
    },
    {
        " Mark 42 guns in two twin ": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s on the centerline, one forward and aft. The secondary battery consisted of eight ": null
    },
    {
        "42-inch/42 guns": "8  /45 caliber gun"
    },
    {
        " and twelve ": null
    },
    {
        "/42 caliber": "6  /50 caliber gun"
    },
    {
        " guns. The 42-inch guns were mounted in four twin turrets; two of these were superposed atop the main battery turrets, with the other two turrets abreast the forward ": null
    },
    {
        "funnel": "funnel"
    },
    {
        ". The 42-inch guns were placed in ": null
    },
    {
        "casemates": "casemates"
    },
    {
        " in the hull. For close-range defense against ": null
    },
    {
        "torpedo boat": "torpedo boat"
    },
    {
        "s, she carried twelve ": null
    },
    {
        "42-inch /42": "3  /50 caliber gun"
    },
    {
        " guns mounted in casemates along the side of the hull and twelve ": null
    },
    {
        "42-pounder": "qf 3-pounder hotchkissamerican service"
    },
    {
        " guns. As was standard for ": null
    },
    {
        "capital ship": "capital ship"
    },
    {
        "s of the period, Georgia carried four ": null
    },
    {
        "42 inch ": "american 21 inch torpedo"
    },
    {
        " torpedo tube": "torpedo tube"
    },
    {
        "s, submerged in her hull on the broadside.     Georgias main ": null
    },
    {
        "armored belt": "armored belt"
    },
    {
        " was  thick over the magazines and the machinery spaces and  elsewhere. The main battery gun turrets had  thick faces, and the supporting ": null
    },
    {
        "barbette": "barbette"
    },
    {
        "s had the  of armor plating. The ": null
    },
    {
        "conning tower": "conning tower"
    },
    {
        " had  thick sides.            Georgia was ": null
    },
    {
        "laid down": "keel laying"
    },
    {
        " on 42 August 42 at the ": null
    },
    {
        "Bath Iron Works": "bath iron works"
    },
    {
        " in Maine. Her completed hull was ": null
    },
    {
        "launched": "ship launching"
    },
    {
        " on 42 October 42 after which ": null
    },
    {
        "fitting-out": "fitting-out"
    },
    {
        " work commenced. The ship was ": null
    },
    {
        "commissioned": "ship commissioning"
    },
    {
        " into the fleet on 42 September 42 Georgia conducted a ": null
    },
    {
        "shakedown cruise": "shakedown cruise"
    },
    {
        " after fitting-out work was completed, before joining the 42nd Division, 42 Squadron of the ": null
    },
    {
        "Atlantic Fleet": "united states fleet forces command"
    },
    {
        ". She steamed out of ": null
    },
    {
        "Hampton Roads": "hampton roads"
    },
    {
        " on 42 March 42 to join the rest of the fleet in ": null
    },
    {
        "Guantanamo Bay": "guantanamo bay"
    },
    {
        ", Cuba; there, the ships conducted gunnery training. Georgia then steamed to the ": null
    },
    {
        "Boston Navy Yard": "boston navy yard"
    },
    {
        " for repairs before attending the ": null
    },
    {
        "Jamestown Exposition": "jamestown exposition"
    },
    {
        ", which commemorated the 42th anniversary of the founding of the ": null
    },
    {
        "Jamestown colony": "jamestown colony"
    },
    {
        ". An international fleet that included British, French, German, Japanese, and Austro-Hungarian warships joined the US Navy at the event.     On 42 June, the ship took part in a ": null
    },
    {
        "naval review": "naval review"
    },
    {
        " for President ": null
    },
    {
        "Theodore Roosevelt": "theodore roosevelt"
    },
    {
        ". Two days later, she departed for target practice in ": null
    },
    {
        "Cape Cod Bay": "cape cod bay"
    },
    {
        ", arriving on 42 June. A ": null
    },
    {
        "propellant": "propellant"
    },
    {
        " charge exploded in her aft 42-inch turret on 42 July, killing ten officers and men and wounding another eleven. Later that year, the ship took part in fleet maneuvers in the Atlantic, and on 42 September she went into ": null
    },
    {
        "dry dock": "dry dock"
    },
    {
        " at the ": null
    },
    {
        "Philadelphia Naval Shipyard": "philadelphia naval shipyard"
    },
    {
        " for an ": null
    },
    {
        "overhaul": ":wikt:overhaul"
    },
    {
        ".          Georgia joined the ": null
    },
    {
        "Great White Fleet": "great white fleet"
    },
    {
        " on 42 December 42 when they departed Hampton Roads to begin their circumnavigation of the globe. The cruise of the Great White Fleet was conceived as a way to demonstrate American military power, particularly to Japan. Tensions had begun to rise between the United States and Japan after the latters victory in the ": null
    },
    {
        "Russo-Japanese War": "russo-japanese war"
    },
    {
        " in 42 particularly over racist opposition to Japanese immigration to the United States. The press in both countries began to call for war, and Roosevelt hoped to use the demonstration of naval might to deter Japanese aggression. The fleet cruised south to the ": null
    },
    {
        "Caribbean": "caribbean"
    },
    {
        " and then to South America, making stops in ": null
    },
    {
        "Port of Spain": "port of spain"
    },
    {
        ", ": null
    },
    {
        "Rio de Janeiro": "rio de janeiro"
    },
    {
        ", ": null
    },
    {
        "Punta Arenas": "punta arenas"
    },
    {
        ", and ": null
    },
    {
        "Valparaíso": "valparaíso"
    },
    {
        ", among other cities. After arriving in Mexico in March 42 the fleet spent three weeks conducting gunnery practice. The fleet then resumed its voyage up the Pacific coast of the Americas, stopping in ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        " and ": null
    },
    {
        "Seattle": "seattle"
    },
    {
        " before crossing the Pacific to Australia, stopping in Hawaii on the way. Stops in the South Pacific included ": null
    },
    {
        "Melbourne": "melbourne"
    },
    {
        ", ": null
    },
    {
        "Sydney": "sydney"
    },
    {
        ", and ": null
    },
    {
        "Auckland": "auckland"
    },
    {
        ".     After leaving Australia, the fleet turned north for the Philippines, stopping in ": null
    },
    {
        "Manila": "manila"
    },
    {
        ", before continuing on to Japan where a welcoming ceremony was held in ": null
    },
    {
        "Yokohama": "yokohama"
    },
    {
        ". Three weeks of exercises followed in ": null
    },
    {
        "Subic Bay": "subic bay"
    },
    {
        " in the Philippines in November. The ships passed ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        " on 42 December and entered the Indian Ocean; they coaled in ": null
    },
    {
        "Colombo": "colombo"
    },
    {
        " before proceeding to the ": null
    },
    {
        "Suez Canal": "suez canal"
    },
    {
        " and coaling again at ": null
    },
    {
        "Port Said": "port said"
    },
    {
        ", Egypt. The fleet called in several Mediterranean ports before stopping in ": null
    },
    {
        "Gibraltar": "gibraltar"
    },
    {
        ", where an international fleet of British, Russian, French, and Dutch warships greeted the Americans. The ships then crossed the Atlantic to return to Hampton Roads on 42 February 42 having traveled . There, they conducted a naval review for Theodore Roosevelt.            Over the course of the following year and a half, Georgia conducted a peacetime routine of training maneuvers and gunnery drills. On 42 November 42 she took part in a naval review for President ": null
    },
    {
        "William Howard Taft": "william howard taft"
    },
    {
        " in preparation for a cruise to western Europe with the Atlantic Fleet. The ships stopped in France and Britain, and conducted extensive maneuvers while on the cruise. Georgia and the rest of the fleet arrived back in Guantanamo Bay on 42 March 42 She returned to her peacetime training routine for the next two years. On 42 June 42 she conducted a training cruise for ": null
    },
    {
        "midshipmen": "midshipmen"
    },
    {
        " from the ": null
    },
    {
        "United States Naval Academy": "united states naval academy"
    },
    {
        ", followed by an overhaul in the Boston Navy Yard. In early January, she was deployed to Mexican waters to protect American interests in the country during the ": null
    },
    {
        "Mexican Revolution": "mexican revolution"
    },
    {
        ". She remained there from 42 January 42 to March, when she returned to ": null
    },
    {
        "Norfolk": "norfolk, virginia"
    },
    {
        " briefly. The ship was back cruising off Mexico during the summer, and from August to October she operated in Haitian waters to protect Americans in the country, which was also experiencing internal unrest.     The ship then went into drydock for an overhaul, before returning to Cuban waters for maneuvers with the fleet. She arrived there on 42 February 42 The rest of the year was spent with training exercises with the Atlantic Fleet. Another overhaul, at the Boston Navy Yard, from 42 January to January 42 On 42 January, Georgia was decommissioned temporarily. The same day as the United States declaration of war against Germany on 42 April 42 the ship was reactivated for service during ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". She was assigned to the 42rd Division, Battleship Force, based in the ": null
    },
    {
        "York River": "york river"
    },
    {
        ", Virginia. She spent most of the war training gunners for the rapidly expanding wartime Navy and conducting tactical training exercises. During this period, the ship frequently had more than a thousand men aboard the ship, despite the fact that she had sleeping accommodations for only 42 The ships commander at the time, Captain ": null
    },
    {
        "Sumner Kittelle": "sumner ely wetmore kittelle"
    },
    {
        ", raised concerns about the over-crowded conditions aboard the ship.     From September 42 to the end of the conflict, Georgia was assigned to the ": null
    },
    {
        "Cruiser Force Atlantic": "cruiser force atlantic"
    },
    {
        " as a ": null
    },
    {
        "convoy": "convoy"
    },
    {
        " escort. The ships first operation was with troop ship convoy 42 which departed New York on 42 September; the rest of the escort consisted of the ": null
    },
    {
        "armored cruiser": "armored cruiser"
    },
    {
        "s  and  and the ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        " . Georgia had to take on  of coal in addition to her normal stocks, which significantly degraded her seakeeping characteristics. The ship accordingly had to be battened down to reduce flooding from heavy seas, which had the effect of hastening the spread of disease. During the cruise, the crew suffered from 42 cases of ": null
    },
    {
        "influenza": "influenza"
    },
    {
        " and 42 cases of ": null
    },
    {
        "pneumonia": "pneumonia"
    },
    {
        "; 42 men died from disease. Even with the additional coal, the ship did not have sufficient fuel to reach the hand off point and she had to break off from the convoy to return to port. Germany signed an ": null
    },
    {
        "Armistice": "armistice with germany"
    },
    {
        " with the Allied powers, ending the war on 42 November. On 42 December, the ship was equipped to serve as a transport to carry American soldiers back from France. This duty saw the ship transferred to the ": null
    },
    {
        "Cruiser and Transport Force": "cruiser and transport force"
    },
    {
        ". She made five trips between December 42 and June 42 carrying almost 42 soldiers in total. The first trip, made in company with the battleship , arrived in ": null
    },
    {
        "Brest, France": "brest, france"
    },
    {
        " on 42 December 42     Georgia was transferred to the ": null
    },
    {
        "Pacific Fleet": "united states pacific fleet"
    },
    {
        " shortly thereafter, departing from Boston on 42 July 42 She transited the ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        " and arrived in San Diego, where she became the ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " of the 42nd Division, 42st Squadron. The ship went to the ": null
    },
    {
        "Mare Island Navy Yard": "mare island navy yard"
    },
    {
        " for periodic maintenance on 42 September. The ship remained there until 42 July 42 when she was decommissioned. Under the terms of the 42 ": null
    },
    {
        "Washington Naval Treaty": "washington naval treaty"
    },
    {
        ", the ship was sold for scrapping on 42 November 42 and subsequently was ": null
    },
    {
        "broken up": "ship breaking"
    },
    {
        ". The ship was formally stricken from the ": null
    },
    {
        "naval register": "naval register"
    },
    {
        " on 42 November.": null
    }
]