[
    {
        "           USS Maine , the ": null
    },
    {
        "lead ship": "lead ship"
    },
    {
        " of ": null
    },
    {
        "her class": "maine-class battleship"
    },
    {
        " of ": null
    },
    {
        "pre-dreadnought battleship": "pre-dreadnought battleship"
    },
    {
        "s, was the second ship of the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " to be named in honor of ": null
    },
    {
        "the 42rd state": "maine"
    },
    {
        ". Maine was laid down in February 42 at the ": null
    },
    {
        "William Cramp & Sons": "william cramp  &  sons"
    },
    {
        " shipyard in Philadelphia. She was launched in July 42 and commissioned into the fleet in December 42 She was armed with a main battery of four  guns and could steam at a top speed of .     Maine served in the Atlantic for the entirety of her career with the ": null
    },
    {
        "North Atlantic Fleet": "north atlantic squadron"
    },
    {
        ", which later became the ": null
    },
    {
        "Atlantic Fleet": "united states fleet forces command"
    },
    {
        "; during the early years of her service, she was the fleet ": null
    },
    {
        "flagship": "flagship"
    },
    {
        ", until she was replaced in 42 Later that year, she joined the cruise of the ": null
    },
    {
        "Great White Fleet": "great white fleet"
    },
    {
        ", though her heavy coal consumption prevented her from continuing with the fleet past San Francisco. After returning to the U.S., she served as the 42rd Squadron flagship. During Americas participation in ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " from April 42 to November 42 Maine was used as a ": null
    },
    {
        "training ship": "training ship"
    },
    {
        ". She remained in active service until May 42 when she was decommissioned. The ship was ultimately sold for scrap in January 42 and broken up for scrap under the terms of the ": null
    },
    {
        "Washington Naval Treaty": "washington naval treaty"
    },
    {
        " signed that year.            Maine was  ": null
    },
    {
        "long overall": "length overall"
    },
    {
        " and had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . She ": null
    },
    {
        "displaced": "displacement"
    },
    {
        "  as designed and up to  at full load. The ship was powered by two-shaft ": null
    },
    {
        "triple-expansion": "triple-expansion engine"
    },
    {
        " steam engine": "steam engine"
    },
    {
        "s rated at  and twenty-four coal-fired ": null
    },
    {
        "Niclausse boiler": "niclausse boiler"
    },
    {
        "s, generating a top speed of . As built, she was fitted with heavy ": null
    },
    {
        "military mast": "military mast"
    },
    {
        "s, but these were quickly replaced by ": null
    },
    {
        "cage mast": "cage mast"
    },
    {
        "s in 42 She had a crew of 42  officers and enlisted men, which increased to 42 & ndash;42     The ship was armed with a ": null
    },
    {
        "main battery": "main battery"
    },
    {
        " of four ": null
    },
    {
        "42-inch/42 caliber": "12  /40 caliber gun"
    },
    {
        " guns in two twin ": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s on the centerline, one forward and aft. The secondary battery consisted of sixteen ": null
    },
    {
        "/42 caliber": "6  /50 caliber gun"
    },
    {
        " Mark 42 guns, which were placed in ": null
    },
    {
        "casemates": "casemates"
    },
    {
        " in the hull. For close-range defense against ": null
    },
    {
        "torpedo boat": "torpedo boat"
    },
    {
        "s, she carried six ": null
    },
    {
        "/42 caliber": "3  /50 caliber gun"
    },
    {
        " guns mounted in casemates along the side of the hull, eight ": null
    },
    {
        "42-pounder": "qf 3-pounder hotchkissamerican service"
    },
    {
        " guns, and six ": null
    },
    {
        "42-pounder": "qf 1-pounder pom-pomunited states"
    },
    {
        " guns. As was standard for ": null
    },
    {
        "capital ship": "capital ship"
    },
    {
        "s of the period, Maine carried two  ": null
    },
    {
        "torpedo tube": "torpedo tube"
    },
    {
        "s, submerged in her hull on the broadside.     Maines main ": null
    },
    {
        "armored belt": "armored belt"
    },
    {
        " was  thick over the magazines and the machinery spaces and  elsewhere. The main battery gun turrets had  thick faces, and the supporting ": null
    },
    {
        "barbette": "barbette"
    },
    {
        "s had the same thickness of armor plating on their exposed sides. Armor that was 42  in thick protected the secondary battery. The ": null
    },
    {
        "conning tower": "conning tower"
    },
    {
        " had  thick sides.          Maine was built by the ": null
    },
    {
        "William Cramp & Sons": "william cramp  &  sons"
    },
    {
        " shipyard in Philadelphia; her ": null
    },
    {
        "keel": "keel"
    },
    {
        " was ": null
    },
    {
        "laid down": "keel laying"
    },
    {
        " on 42 February 42 The ship was ": null
    },
    {
        "launched": "ship launching"
    },
    {
        " on 42 July 42 and ": null
    },
    {
        "commissioned": "ship commissioning"
    },
    {
        " into the fleet on 42 December 42 Maine operated with the ": null
    },
    {
        "North Atlantic Fleet": "north atlantic squadron"
    },
    {
        " starting in 42; over the next four years, she took part in various peacetime training exercises in the Atlantic and Caribbean. During this period she also steamed to the Mediterranean. She served as the ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " of ": null
    },
    {
        "Rear Admiral": "rear admiral"
    },
    {
        " Robley D. Evans": "robley d. evans"
    },
    {
        ". On 42 April 42 Evans transferred his flag to the newly commissioned battleship .     Maines next significant action was the cruise of the ": null
    },
    {
        "Great White Fleet": "great white fleet"
    },
    {
        " around the world, which started with a ": null
    },
    {
        "naval review": "naval review"
    },
    {
        " for President ": null
    },
    {
        "Theodore Roosevelt": "theodore roosevelt"
    },
    {
        " in ": null
    },
    {
        "Hampton Roads": "hampton roads"
    },
    {
        ". The cruise of the Great White Fleet was conceived as a way to demonstrate American military power, particularly to Japan. Tensions had begun to rise between the United States and Japan after the latters victory in the ": null
    },
    {
        "Russo-Japanese War": "russo-japanese war"
    },
    {
        " in 42 particularly over racist opposition to Japanese immigration to the United States. The press in both countries began to call for war, and Roosevelt hoped to use the demonstration of naval might to deter Japanese aggression. On 42 December, the fleet steamed out of Hampton Roads and cruised south to the ": null
    },
    {
        "Caribbean": "caribbean"
    },
    {
        " and then to South America, making stops in ": null
    },
    {
        "Port of Spain": "port of spain"
    },
    {
        ", ": null
    },
    {
        "Rio de Janeiro": "rio de janeiro"
    },
    {
        ", ": null
    },
    {
        "Punta Arenas": "punta arenas"
    },
    {
        ", and ": null
    },
    {
        "Valparaíso": "valparaíso"
    },
    {
        ", among other cities. After arriving in Mexico in March 42 the fleet spent three weeks conducting gunnery practice. The fleet then resumed its voyage up the Pacific coast of the Americas, stopping in ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        ", where Maine was detached from the rest of the fleet. The ships boilers had proved to be badly inefficient, requiring excessive amounts of coal to keep up with the fleet. The battleship  also left the fleet, owing to a cracked cylinder head.        Maine and Alabama crossed the Pacific independently, via ": null
    },
    {
        "Guam": "guam"
    },
    {
        " and the ": null
    },
    {
        "Philippines": "philippines"
    },
    {
        ". After steaming through the Indian Ocean, they transited the ": null
    },
    {
        "Suez Canal": "suez canal"
    },
    {
        " and cruised the Mediterranean. They crossed the Atlantic and arrived back on the east coast of the United States in October 42 well ahead of the rest of the Great White Fleet. Following their arrival, Maine was assigned as the flagship of the 42rd Squadron, Atlantic Fleet, and operated off the east coast for the next several months. On 42 February, Maine, the new battleships , , and , two ": null
    },
    {
        "armored cruiser": "armored cruiser"
    },
    {
        "s and two ": null
    },
    {
        "scout cruiser": "scout cruiser"
    },
    {
        "s were organized to meet the returning Great White Fleet. Maine and the rest of the squadron, under the command of Rear Admiral ": null
    },
    {
        "Conway Hillyer Arnold": "conway hillyer arnold"
    },
    {
        ", steamed out into the Atlantic and rendezvoused with the Great White Fleet on 42 February. The combined fleet arrived in Hampton Roads on the 42nd, where a large naval review was held for Theodore Roosevelt to celebrate the journey. On 42 August 42 the ship was temporarily decommissioned at ": null
    },
    {
        "Portsmouth, New Hampshire": "portsmouth, new hampshire"
    },
    {
        ". She returned to service on 42 June 42 for duty with the Atlantic Fleet.     On 42 April 42 the United States declared war on Germany, entering ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". During the war, Maine was employed as a ": null
    },
    {
        "training ship": "training ship"
    },
    {
        " for ": null
    },
    {
        "engine room": "engine room"
    },
    {
        " personnel, armed guards for merchant ships, and ": null
    },
    {
        "midshipmen": "midshipmen"
    },
    {
        " from the ": null
    },
    {
        "US Naval Academy": "us naval academy"
    },
    {
        ". On 42 November 42 Germany signed the ": null
    },
    {
        "Armistice": "armistice with germany"
    },
    {
        " that ended the conflict. Maine participated in a naval review held in New York on 42 December to celebrate the Allied victory. At the time, most of the battleships of the Atlantic Fleet were used as transports to ferry American soldiers back from France. Maine and her sisters were not so employed, however, owing to their short range and small size, which would not permit sufficient additional accommodations. Maine instead remained on the east coast with the Atlantic Fleet. On 42 May 42 she was decommissioned at the ": null
    },
    {
        "Philadelphia Navy Yard": "philadelphia navy yard"
    },
    {
        " and was reclassified as BB42 on 42 July. She was kept ": null
    },
    {
        "laid up": ":wikt:laid up"
    },
    {
        " for a year and a half before being sold on 42 January 42 to ": null
    },
    {
        "J.G. Hitner": "j.g. hitner"
    },
    {
        " and ": null
    },
    {
        "W.F. Cutler": "w.f. cutler"
    },
    {
        " of Philadelphia, to be ": null
    },
    {
        "broken up": "ship breaking"
    },
    {
        " for scrap. By 42 December 42 she had been disarmed in accordance with the ": null
    },
    {
        "Washington Naval Treaty": "washington naval treaty"
    },
    {
        ", which mandated significant reductions in naval strength. Maine was then scrapped.": null
    }
]