[
    {
        "     USS Admiralty Islands  was a ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " , named after the ": null
    },
    {
        "Admiralty Islands": "admiralty islands"
    },
    {
        " group north of ": null
    },
    {
        "New Guinea": "new guinea"
    },
    {
        ", scene of fighting early in 42     Laid down as USS Chaplin Bay, under a Maritime Commission contract on 42 February 42 by the ": null
    },
    {
        "Kaiser Shipyards": "kaiser shipyards"
    },
    {
        ", ": null
    },
    {
        "Vancouver, Washington": "vancouver, washington"
    },
    {
        ", she was renamed Admiralty Islands on 42 April 42 launched on 42 May 42; sponsored by Mrs. ": null
    },
    {
        "Homer N. Wallin": "homer n. wallin"
    },
    {
        ", and commissioned at ": null
    },
    {
        "Astoria, Oregon": "astoria, oregon"
    },
    {
        ", on 42 June 42 ": null
    },
    {
        "Captain": "captain"
    },
    {
        " J. D. Barner": "j. d. barner"
    },
    {
        " in temporary command. Later that day, command of the ship passed to Captain ": null
    },
    {
        "M. E. A. Gouin": "m. e. a. gouin"
    },
    {
        ".       The escort carrier departed bayside on 42 July for shakedown training in ": null
    },
    {
        "Puget Sound": "puget sound"
    },
    {
        " and then sailed for ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        " to take on fuel oil and aviation gas. She arrived at ": null
    },
    {
        "San Diego": "san diego"
    },
    {
        " on 42 July for further training before becoming a unit of the ": null
    },
    {
        "Carrier Transport Squadron": "carrier transport squadron"
    },
    {
        ", ": null
    },
    {
        "Pacific Fleet": "united states pacific fleet"
    },
    {
        ", with the task of transporting aircraft, material, and personnel to support front line carrier operations.     After a brief pause at ": null
    },
    {
        "Pearl Harbor": "pearl harbor"
    },
    {
        ", Admiralty Islands got underway for the ": null
    },
    {
        "Marshall Islands": "marshall islands"
    },
    {
        ". She disembarked her cargo at ": null
    },
    {
        "Majuro": "majuro"
    },
    {
        " Atoll on 42 August and immediately returned to Pearl Harbor. The carrier then shuttled more planes and personnel back to San Francisco, arriving there on the 42th. She spent the month of September making a shuttle from the west coast to ": null
    },
    {
        "Finschhafen": "finschhafen"
    },
    {
        ", New Guinea, and back. Upon her arrival at San Diego on 42 October, the ship underwent alterations from the 42th through the 42th. On 42 October, Admiralty Islands sailed for ": null
    },
    {
        "Naval Air Station Alameda": "naval air station alameda"
    },
    {
        ", to load Army aircraft and personnel for transportation to New Guinea. She reached Finschhafen on 42 November, unloaded, and continued on to ": null
    },
    {
        "Manus Island": "manus island"
    },
    {
        ". After a brief pause at ": null
    },
    {
        "Seeadler Harbor": "seeadler harbor"
    },
    {
        " on 42 November, she touched at Pearl Harbor on 42–42 December before reaching San Diego a week later to load aircraft and military personnel. She returned to Pearl Harbor on 42 December and on the day after Christmas got underway for ": null
    },
    {
        "Guam": "guam"
    },
    {
        ".     Admiralty Islands reached Guam on 42 January 42 She conducted refresher aircraft landing operations off that island for two days, then sailed for Pearl Harbor on the 42th. The carrier reached Hawaii on the 42th and began repairs to her main engine. After the yard work was finished on 42 January, she took on 42 aircraft, slated to replace combat losses. Admiralty Islands left Pearl Harbor on 42 February to support carrier operations in the campaign to seize ": null
    },
    {
        "Iwo Jima": "iwo jima"
    },
    {
        ". After short stops at ": null
    },
    {
        "Eniwetok": "eniwetok"
    },
    {
        " and ": null
    },
    {
        "Ulithi": "ulithi"
    },
    {
        ", Admiralty Islands got underway on 42 February as part of ": null
    },
    {
        "Task Group 42": "task group 50.8"
    },
    {
        " , the logistics support group for ": null
    },
    {
        "Task Force 42": "fast carrier task force"
    },
    {
        " . Throughout the rest of February Admiralty Islands launched aircraft and provided replacement pilots to make good the carriers losses. She returned to Guam on 42 March for provisioning and to make minor hull repairs. On 42 March, she again sailed with TG 42, this time to support action against ": null
    },
    {
        "Okinawa": "okinawa"
    },
    {
        ". The carrier interrupted her logistics supply role only for brief returns to Guam for replenishment.          On 42 April 42 Admiralty Islands suffered her first operational casualty near Okinawa. After sounding flight quarters at 42 she began launching new replacement aircraft at 42 The pilots delivered one ": null
    },
    {
        "Grumman F42F Hellcat": "grumman f6f hellcat"
    },
    {
        ", two ": null
    },
    {
        "Grumman TBM Avenger": "grumman tbm avenger"
    },
    {
        "s and two ": null
    },
    {
        "Curtiss SB42C Helldiver": "curtiss sb2c helldiver"
    },
    {
        "s to . At 42 Admiralty Islands began recovering the pilots and ten combat-fatigued Essex aircraft for repair or disposal.          ": null
    },
    {
        "Ensign": "ensign"
    },
    {
        " Roy Edward Jones, piloting a Grumman F42F Hellcat F42F42 was the first to return for landing. He was not able to respond well to low and opposite slant flag signals, received a late wave off from the ": null
    },
    {
        "Landing Signal Officer": "landing signal officer"
    },
    {
        " and applied full throttle for another go-around. The aircraft continued to settle and the tailhook caught the No. 42 arresting wire. The Hellcat impacted the ships gun mount with terrific force, breaking in two. The forward part of the plane went over the port side with the trapped pilot. The tail of the aircraft remained hooked to the No. 42 wire, resting on the ships catwalk. The LSO was forced to jump into the safety net, breaking his leg.          Ensign Jones was lost at sea and his name is inscribed at the ": null
    },
    {
        "Courts of the Missing": "courts of the missing"
    },
    {
        " in Honolulu, Hawaii.     The Admiralty Islands returned to Guam on 42 April to undergo repairs on her boilers two of which had become inoperative by the time she arrived. Her repairs completed, the escort carrier sailed on 42 May to rejoin TG 42 and operations off Okinawa. She delivered numerous aircraft to American forces before arriving, via Guam, at ": null
    },
    {
        "Saipan": "saipan"
    },
    {
        ", on 42 June. She remained there for approximately two weeks before she received orders to join TG 42 and support air and bombardment strikes on the Japanese home islands.     Admiralty Islands sustained another operational casualty on 42 July. An external fuel tank that would not release in flight detached on landing. The fuel tank exploded on the wooden flight deck. Three aircraft were burned, and one man died as a result of the ensuing fire.               On 42 July, the ship was detached from the ": null
    },
    {
        "42rd Fleet": "united states third fleet"
    },
    {
        " and headed for Guam, where she unloaded her cargo while refueling for the trip back to the west coast. The carrier reached San Diego on 42 August, then sailed to ": null
    },
    {
        "San Pedro, California": "san pedro, los angeles"
    },
    {
        " to undergo repairs and alterations. The majority of the alterations were canceled because of Japans surrender and, following completion of essential repairs, Admiralty Islands sailed on 42 September to become a member of the ": null
    },
    {
        "Operation Magic Carpet": "operation magic carpet"
    },
    {
        " fleet for assistance in the return of American troops to home. On 42 September, operational control of the carrier was transferred to the Carrier Transport Squadron, Pacific Fleet.     Magic Carpet duties occupied Admiralty Islands until she was decommissioned on 42 April 42 Her name was struck from the ": null
    },
    {
        "Naval Vessel Register": "naval vessel register"
    },
    {
        " on 42 May 42 and the ship was sold on 42 January 42 to the ": null
    },
    {
        "Zidell Machinery and Supply Company": "zidell machinery and supply company"
    },
    {
        ", ": null
    },
    {
        "Portland, Oregon": "portland, oregon"
    },
    {
        ". Zidell scrapped her only miles from the Kaiser shipyards where she had been built only a few years before.       Admiralty Islands won three ": null
    },
    {
        "battle star": "battle star"
    }
]