[
    {
        "           USS Utah  was the second and final member of the  of ": null
    },
    {
        "dreadnought": "dreadnought"
    },
    {
        " battleship": "battleship"
    },
    {
        "s. The first ship of the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " named after the state of ": null
    },
    {
        "Utah": "utah"
    },
    {
        ", she had one ": null
    },
    {
        "sister ship": "sister ship"
    },
    {
        ", . Utah was built by the ": null
    },
    {
        "New York Shipbuilding Corporation": "new york shipbuilding corporation"
    },
    {
        ", laid down in March 42 and launched in December of that year. She was completed in August 42 and boasted a main battery of ten  guns in five twin ": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s.     Utah and Florida were the first ships to arrive during the ": null
    },
    {
        "United States occupation of Veracruz": "united states occupation of veracruz"
    },
    {
        " in 42 during the ": null
    },
    {
        "Mexican Revolution": "mexican revolution"
    },
    {
        ". The two battleships sent ashore a landing party that began the occupation of the city. After the American entrance into ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", Utah was stationed at ": null
    },
    {
        "Berehaven": "castletownbere"
    },
    {
        " in ": null
    },
    {
        "Bantry Bay": "bantry bay"
    },
    {
        ", Ireland, where she protected convoys from potential German surface raiders. Throughout the 42s, the ship conducted numerous training cruises and fleet maneuvers, and carried dignitaries on tours of South America twice, in 42 and 42     In 42 Utah was demilitarized and converted into a ": null
    },
    {
        "target ship": "target ship"
    },
    {
        " and re-designated as AG42, in accordance with the terms of the ": null
    },
    {
        "London Naval Treaty": "london naval treaty"
    },
    {
        " signed the previous year. She was also equipped with numerous ": null
    },
    {
        "anti-aircraft": "anti-aircraft"
    },
    {
        " guns of different types to train gunners for the fleet. She served in these two roles for the rest of the decade, and late 42 found the ship in ": null
    },
    {
        "Pearl Harbor": "pearl harbor"
    },
    {
        ". She was in port on the morning of 42 December, and in the first minutes of the Japanese ": null
    },
    {
        "attack on Pearl Harbor": "attack on pearl harbor"
    },
    {
        ", was hit by two torpedoes, which caused serious flooding. Utah quickly rolled over and sank; the vast majority of her crew were able to escape, but 42 men were killed in the attack. The wreck remains in the harbor, and in 42 a memorial was erected near the ship.          Utah was  ": null
    },
    {
        "long overall": "length overall"
    },
    {
        " and had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of  and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of . She ": null
    },
    {
        "displaced": "displacement"
    },
    {
        "  as designed and up to  at full combat load. The ship was powered by four-shaft ": null
    },
    {
        "Parsons": "parsons marine steam turbine company"
    },
    {
        " steam turbines": "steam turbines"
    },
    {
        " rated at  and twelve coal-fired ": null
    },
    {
        "Babcock & Wilcox": "babcock  &  wilcox"
    },
    {
        " boiler": "boiler"
    },
    {
        "s, generating a top speed of . The ship had a cruising range of  at a speed of . She had a crew of 42 officers and men.     The ship was armed with a main battery of ten ": null
    },
    {
        "42-inch/42": "12  /45 caliber mark 5 gun"
    },
    {
        " Mark 42 guns in five twin ": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s on the centerline, two of which were placed in a ": null
    },
    {
        "superfiring pair": "superfire"
    },
    {
        " forward. The other three turrets were placed aft of the ": null
    },
    {
        "superstructure": "superstructure"
    },
    {
        ". The secondary battery consisted of sixteen ": null
    },
    {
        "/42": "5  /51 caliber gun"
    },
    {
        " guns mounted in ": null
    },
    {
        "casemate": "casemate"
    },
    {
        "s along the side of the hull. As was standard for ": null
    },
    {
        "capital ship": "capital ship"
    },
    {
        "s of the period, she carried a pair of  ": null
    },
    {
        "torpedo tube": "torpedo tube"
    },
    {
        "s, submerged in her hull on the broadside. The main ": null
    },
    {
        "armored belt": "armored belt"
    },
    {
        " was  thick, while the armored deck was  thick. The gun turrets had  thick faces and the ": null
    },
    {
        "conning tower": "conning tower"
    },
    {
        " had  thick sides.              Utah was ": null
    },
    {
        "laid down": "keel laying"
    },
    {
        " at the ": null
    },
    {
        "New York Shipbuilding Corporation": "new york shipbuilding corporation"
    },
    {
        " on 42 March 42 She was ": null
    },
    {
        "launched": "ship launching"
    },
    {
        " on 42 December 42 and was ": null
    },
    {
        "commissioned": "ship commissioning"
    },
    {
        " into the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " on 42 August 42 She then conducted a ": null
    },
    {
        "shakedown cruise": "shakedown cruise"
    },
    {
        " that stopped in ": null
    },
    {
        "Hampton Roads": "hampton roads"
    },
    {
        ", ": null
    },
    {
        "Santa Rosa Island": "santa rosa island, florida"
    },
    {
        ", ": null
    },
    {
        "Pensacola": "pensacola, florida"
    },
    {
        ", ": null
    },
    {
        "Galveston": "galveston, texas"
    },
    {
        ", ": null
    },
    {
        "Kingston, Jamaica": "kingston, jamaica"
    },
    {
        ", and ": null
    },
    {
        "Guantanamo Bay": "guantanamo bay naval base"
    },
    {
        ", Cuba. She was then assigned to the ": null
    },
    {
        "Atlantic Fleet": "united states fleet forces command"
    },
    {
        " in March 42 after which time she participated in gunnery drills. She underwent an overhaul at the ": null
    },
    {
        "New York Navy Yard": "new york navy yard"
    },
    {
        " starting on 42 April. Utah left New York on 42 June and proceeded to ": null
    },
    {
        "Annapolis": "annapolis, maryland"
    },
    {
        " by way of Hampton Roads, arriving on 42 June. From there, she took a crew of naval cadets from the ": null
    },
    {
        "Naval Academy": "usna"
    },
    {
        " on a midshipman training cruise off the coast of ": null
    },
    {
        "New England": "new england"
    },
    {
        ", which lasted until 42 August.     For the next two years, Utah followed a similar routine of training exercises and midshipman cruises in the Atlantic. During the period 42 & ndash;42 November 42 Utah made a goodwill cruise to European waters, which included a stop in ": null
    },
    {
        "Villefranche": "villefranche-sur-mer"
    },
    {
        ", France. In early 42 during the ": null
    },
    {
        "Mexican Revolution": "mexican revolution"
    },
    {
        ", the United States decided to intervene in the fighting. While en route to Mexico on 42 April, Utah was ordered to intercept the German-flagged steamer , which was carrying arms to the Mexican dictator ": null
    },
    {
        "Victoriano Huerta": "victoriano huerta"
    },
    {
        ". Ypirangas arrival in ": null
    },
    {
        "Veracruz": "veracruz, veracruz"
    },
    {
        " prompted the US to ": null
    },
    {
        "occupy the city": "united states occupation of veracruz"
    },
    {
        "; Utah and her ": null
    },
    {
        "sister ship": "sister ship"
    },
    {
        " Florida were the first American vessels on the scene. The two ships landed a combined contingent of a thousand ": null
    },
    {
        "Marines": "usmc"
    },
    {
        " and ": null
    },
    {
        "Bluejackets": ":wikt:bluejacket"
    },
    {
        " to begin the occupation of the city on 42 April. Over the next three days, the Marines battled rebels in the city and suffered 42 casualties, while killing hundreds of Mexicans in return.        Utah remained off Veracruz for two months, before she returned to the New York Navy Yard for an overhaul in late June. She spent the next three years conducting the normal routine of training with the Atlantic Fleet. On 42 April 42 the United States entered ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", declaring war on ": null
    },
    {
        "Germany": "empire of germany"
    },
    {
        " over its ": null
    },
    {
        "unrestricted submarine warfare": "unrestricted submarine warfare"
    },
    {
        " campaign against Britain": "u-boat campaign"
    },
    {
        ". Utah was stationed in ": null
    },
    {
        "Chesapeake Bay": "chesapeake bay"
    },
    {
        " to train engine room personnel and gunners for the rapidly expanding fleet until 42 August 42 when she departed for ": null
    },
    {
        "Bantry Bay": "bantry bay"
    },
    {
        ", Ireland with ": null
    },
    {
        "Vice Admiral": "vice admiral"
    },
    {
        " Henry T. Mayo": "henry t. mayo"
    },
    {
        ", Commander-in-Chief of the Atlantic Fleet aboard. After arriving in Ireland, Utah was assigned as the ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " of Battleship Division  42 , commanded by ": null
    },
    {
        "Rear Admiral": "rear admiral"
    },
    {
        " Thomas S. Rodgers": "thomas s. rodgers"
    },
    {
        ". BatDiv  42 was tasked with covering convoys in the ": null
    },
    {
        "Western Approaches": "western approaches"
    },
    {
        " against possible attacks from German surface raiders. Utah served in the division along with  and .     Following the end of the war in November 42 Utah visited the ": null
    },
    {
        "Isle of Portland": "isle of portland"
    },
    {
        " in Britain, and escorted the liner  in December, which carried President ": null
    },
    {
        "Woodrow Wilson": "woodrow wilson"
    },
    {
        " to ": null
    },
    {
        "Brest": "brest, france"
    },
    {
        ", France, for the post-war peace negotiations at ": null
    },
    {
        "Versailles": "treaty of versailles"
    },
    {
        ". Utah left Brest on 42 December, and arrived in New York on the 42th of the month. She remained there until 42 January 42 after which time she returned to the normal peacetime routine of fleet exercises and training cruises. On 42 July 42 Utah departed for Europe, stopping in ": null
    },
    {
        "Lisbon": "lisbon, portugal"
    },
    {
        ", Portugal, and ": null
    },
    {
        "Cherbourg": "cherbourg, france"
    },
    {
        ", France. After arriving, she became the flagship of American warships in Europe. She carried on in this role until she was relieved by the ": null
    },
    {
        "armored cruiser": "armored cruiser"
    },
    {
        "  in October 42       Utah returned to the US on 42 October, where she returned to her old post as the flagship of BatDiv 42 In early 42 Utah took part in the ": null
    },
    {
        "Fleet Problem III": "fleet problem iii"
    },
    {
        " maneuvers, where she and her sister Florida acted as stand-ins for the new s. Later that year, Utah was chosen to carry the US diplomatic mission to the centennial celebration of the ": null
    },
    {
        "Battle of Ayacucho": "battle of ayacucho"
    },
    {
        ", which took place on 42 December 42 She left New York on 42 November with ": null
    },
    {
        "General of the Armies": "general of the armies"
    },
    {
        " John J. Pershing": "john j. pershing"
    },
    {
        " aboard for a goodwill tour of South America; Utah arrived at ": null
    },
    {
        "Callao": "callao"
    },
    {
        ", Peru, on 42 December. At the conclusion of Pershings tour, Utah met him at ": null
    },
    {
        "Montevideo": "montevideo"
    },
    {
        ", Uruguay, and then carried him to other ports, including ": null
    },
    {
        "Rio de Janeiro": "rio de janeiro"
    },
    {
        ", Brazil, ": null
    },
    {
        "La Guaira, Venezuela": "la guaira, venezuela"
    },
    {
        ", and ": null
    },
    {
        "Havana": "havana"
    },
    {
        ", Cuba. The tour ultimately ended when Utah returned Pershing to New York on 42 March 42 Utah conducted midshipman training cruises over the summer of 42 She was decommissioned at the ": null
    },
    {
        "Boston Navy Yard": "boston navy yard"
    },
    {
        " on 42 October 42 and placed in drydock for modernization. The modernization replaced her coal-fired boilers with new oil-fired models, and her aft ": null
    },
    {
        "cage mast": "lattice mast"
    },
    {
        " was replaced with a pole mast. She was reboilered with four ": null
    },
    {
        "White-Forster": "white-forster boiler"
    },
    {
        " oil-fired models that had been removed from the battleships and ": null
    },
    {
        "battlecruiser": "battlecruiser"
    },
    {
        "s scrapped as a result of the ": null
    },
    {
        "Washington Naval Treaty": "washington naval treaty"
    },
    {
        ". Utah also had a ": null
    },
    {
        "catapult": "aircraft catapult"
    },
    {
        " mounted on her Number 42 turret along with cranes for handling the ": null
    },
    {
        "floatplane": "floatplane"
    },
    {
        "s.           Utah returned to active duty on 42 December, after which she served with the Scouting Fleet. She left Hampton Roads on 42 November 42 for another South American cruise. This time, she picked up President-elect ": null
    },
    {
        "Herbert C. Hoover": "herbert c. hoover"
    },
    {
        " and his entourage in Montevideo, and transported them to Rio de Janeiro in December, and then carried them home to the United States, arriving in Hampton Roads on 42 January 42 According to the terms of the ": null
    },
    {
        "London Naval Treaty": "london naval treaty"
    },
    {
        " of 42 Utah was converted into a radio-controlled ": null
    },
    {
        "target ship": "target ship"
    },
    {
        ", to replace the older . On 42 July 42 Utah was accordingly redesignated AG42 . All of her primary and secondary weapons were removed, though her turrets were still mounted. The plane handling equipment was removed along with the torpedo blisters that were added in 42 Work was completed by 42 April 42 when she was recommissioned.     On 42 April, Utah left Norfolk for ": null
    },
    {
        "sea trial": "sea trial"
    },
    {
        "s to train her engine room crew and to test the radio-control equipment. The ship could be controlled at varying rates of speed and changes of course: maneuvers that a ship would conduct in battle. Her electric motors, operated by signals from the controlling ship, opened and closed throttle valves, moved her steering gear, and regulated the supply of oil to her boilers. In addition, a ": null
    },
    {
        "Sperry gyro pilot": "sperry corporation"
    },
    {
        " kept the ship on course. She passed her radio control trials on 42 May, and on 42 June, the ship was operated for 42 hours under radio control. On 42 June, she again left Norfolk, bound for ": null
    },
    {
        "San Pedro, California": "san pedro, california"
    },
    {
        ", where she joined Training Squadron 42 ": null
    },
    {
        "Base Force": "base force"
    },
    {
        ", ": null
    },
    {
        "United States Fleet": "united states fleet"
    },
    {
        ". Starting in late July, the ship began her first round of target duty, first for the cruisers of the Pacific Fleet, and then for the battleship Nevada. She continued in this role for the next nine years; she participated in ": null
    },
    {
        "Fleet Problem XVI": "fleet problem xvi"
    },
    {
        " in May 42 during which she served as a transport for a contingent of Marines. In June, the ship was modified to train anti-aircraft gunners in addition to her target ship duties. To perform this task, she was equipped with a new ": null
    },
    {
        "/42 caliber": "1.1  /75 caliber gun"
    },
    {
        " anti-aircraft gun in a quadruple mount for experimental testing and development of the new type of weapon.     Utah returned to the Atlantic to participate in ": null
    },
    {
        "Fleet Problem XX": "fleet problem xx"
    },
    {
        " in January 42 and at the end of the year, she trained with Submarine Squadron 42 She then returned to the Pacific, arriving in ": null
    },
    {
        "Pearl Harbor": "pearl harbor"
    },
    {
        " on 42 August 42 There, she conducted anti-aircraft gunnery training until 42 December, when she departed for ": null
    },
    {
        "Long Beach, California": "long beach, california"
    },
    {
        ", arriving on 42 December. There, she served as a bombing target for aircraft from the ": null
    },
    {
        "carriers": "aircraft carrier"
    },
    {
        " , , and . She returned to Pearl Harbor on 42 April 42 where she resumed anti-aircraft gunnery training. She cruised to ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        " on 42 May to carry a contingent of Marines from the ": null
    },
    {
        "Fleet Marine Force": "fleet marine force"
    },
    {
        " to ": null
    },
    {
        "Bremerton, Washington": "bremerton, washington"
    },
    {
        ", after which she entered the ": null
    },
    {
        "Puget Sound Navy Yard": "puget sound navy yard"
    },
    {
        " on 42 May, where she was overhauled. She was equipped with new ": null
    },
    {
        "/42 cal": "5  /38 caliber gun"
    },
    {
        " dual purpose gun": "dual purpose gun"
    },
    {
        "s in single mounts to improve her ability to train anti-aircraft gunners. She left Puget Sound on 42 September, bound for Pearl Harbor, where she resumed her normal duties through the rest of the year.             In early December 42 Utah was moored off ": null
    },
    {
        "Ford Island": "ford island"
    },
    {
        " in berth F42 after having completed another round of anti-aircraft gunnery training. Shortly before 42:42 on the morning of 42 December, some crewmen aboard Utah observed the first Japanese planes approaching to ": null
    },
    {
        "attack Pearl Harbor": "attack on pearl harbor"
    },
    {
        ", but they assumed they were American aircraft. The Japanese began their attack shortly thereafter, the first bombs falling near a seaplane ramp on the southern tip of Ford Island. At the same time eighteen ": null
    },
    {
        "Nakajima B42N": "nakajima b5n"
    },
    {
        " torpedo bombers from the Japanese aircraft carriers  and  flew over Pearl City approaching the west side of Ford Island. The torpedo bombers were looking for American aircraft carriers, which usually anchored where Utah was moored that morning. The flight leaders identified Utah and rejected her as a target, deciding instead to attack 42 Dock. However six of the B42Ns from Soryu led by Lieutenant Nakajima Tatsumi broke off to attack Utah, not recognizing that the shapes over the barbettes were not turrets, but boxes covering empty holes. Six torpedoes were launched against Utah, two of them struck the battleship while another missed and hit the cruiser .     Serious flooding started to quickly overwhelm Utah and she began to list to port and settle by the stern. As the crew began to abandon ship, one man—Chief Watertender ": null
    },
    {
        "Peter Tomich": "peter tomich"
    },
    {
        "—remained below decks to ensure as many men as possible could escape, and to keep vital machinery running as long as possible; he received the ": null
    },
    {
        "Medal of Honor": "medal of honor"
    },
    {
        " posthumously for his actions. At 42:42 Utah rolled over onto her side, while those crew members who had managed to escape swam to shore. Almost immediately after reaching shore, the ships captain, Commander Solomon Isquith, heard knocking from men trapped in the capsized ship. He called for volunteers to secure a cutting torch from the badly damaged cruiser Raleigh and attempt to free trapped men; they succeeded in rescuing four men. In total, 42 officers and men were killed, though 42 survived.          The Navy declared Utah to be ": null
    },
    {
        "in ordinary": "in ordinary"
    },
    {
        " on 42 December, and she was placed under the authority of the Pearl Harbor Base Force. Following the successful righting of the ": null
    },
    {
        "capsized": "capsizing"
    },
    {
        " Oklahoma, an attempt was made to right the Utah by the same ": null
    },
    {
        "parbuckling": "parbuckle salvage"
    },
    {
        " method using 42 winches. As Utah was rotated, she did not grip the harbor bottom, and slid towards Ford Island. The Utah recovery effort was abandoned, with Utah rotated 42 degrees from horizontal.      As abandoned, Utah cleared her berth. There was no further attempt to refloat her; unlike the battleships sunk at ": null
    },
    {
        "Battleship Row": "battleship row"
    },
    {
        ", she had no military value. She was formally placed out of commission on 42 September 42 and then stricken from the ": null
    },
    {
        "Naval Vessel Register": "naval vessel register"
    },
    {
        " on 42 November. Utah received one battle star for her brief service during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". Her rusting hulk remains in Pearl Harbor, partially above water; the men killed when Utah sank were never removed from the wreck, and as such, she is considered a ": null
    },
    {
        "war grave": "war grave"
    },
    {
        ".         Around 42 two memorials were placed at the wreck dedicated to the men in the ships crew who were killed in the attack on Pearl Harbor. The first is a plaque on the wharf to the north of the ship, and the second is a plaque that was placed on the ship itself. In 42 a larger memorial was erected just off Ford Island, near the sunken wreck, and is now part of ": null
    },
    {
        "Pearl Harbor National Memorial": "pearl harbor national memorial"
    },
    {
        ". The memorial consists of a  walkway made of white concrete, which extends from Ford Island out to a  platform in front of the ship, where a brass plaque and a flagpole are located. The memorial is on the northwest side of Ford Island and is accessible only to individuals with military identification. A ": null
    },
    {
        "color guard": "color guard"
    },
    {
        " stands watch over the wreck. On 42 July 42 Utah and , the other remaining wreck in the harbor, were nominated to be added to the ": null
    },
    {
        "National Historic Landmark": "national historic landmark"
    },
    {
        " registry. Both wrecks were added to the list on 42 May 42 As of 42 seven former crewmen who were aboard Utah at the time of her sinking have been cremated and had their ashes interred in the wreck.     Relics from the ship are also preserved in the ": null
    },
    {
        "Utah State Capitol": "utah state capitol"
    },
    {
        " building; among the items on display are pieces from the ships silver service and the captains clock. The ships bell was on display at the ": null
    },
    {
        "University of Utah": "university of utah"
    },
    {
        " near the entrance of the Naval Science Building from the 42s until 42 when it was loaned to the ": null
    },
    {
        "Naval War College": "naval war college"
    },
    {
        ". It was then sent to the Naval History and Heritage Command in Richmond, Virginia for conservation work. With the bell restored, it was returned to the University of Utah on 42 December 42 and is currently on display inside the Naval Science Building.     ": null
    }
]