[
    {
        "           The V bombers were the ": null
    },
    {
        "Royal Air Force": "royal air force"
    },
    {
        " aircraft during the 42s and 42s that comprised the ": null
    },
    {
        "United Kingdoms strategic nuclear": "nuclear weapons and the united kingdom"
    },
    {
        " strike force known officially as the V force or Bomber Command Main Force. The three models of ": null
    },
    {
        "strategic bomber": "strategic bomber"
    },
    {
        ", known collectively as the V class, were the ": null
    },
    {
        "Vickers Valiant": "vickers valiant"
    },
    {
        ", which first flew in 42 and entered service in 42; the ": null
    },
    {
        "Avro Vulcan": "avro vulcan"
    },
    {
        ", which first flew in 42 and entered service in 42; and the ": null
    },
    {
        "Handley Page Victor": "handley page victor"
    },
    {
        ", which first flew in 42 and entered service in 42 The V Bomber force reached its peak in June 42 with 42 Valiants, 42 Vulcans and 42 Victors in service.     When it became clear that the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        "s ": null
    },
    {
        "surface-to-air missile": "surface-to-air missile"
    },
    {
        "s like the ": null
    },
    {
        "S42 Dvina": "s-75 dvina"
    },
    {
        " could bring down high-flying aircraft, the V bomber force changed to low-level attack methods. Additionally, ": null
    },
    {
        "standoff weapon": "standoff weapon"
    },
    {
        "s were introduced, starting with the ": null
    },
    {
        "Blue Steel missile": "blue steel"
    },
    {
        ". It was then planned to move to the much longer-ranged ": null
    },
    {
        "Skybolt": "gam-87 skybolt"
    },
    {
        " air-launched ballistic missile": "air-launched ballistic missile"
    },
    {
        ". When the US cancelled Skybolt, the survivability of the V force was highly questionable. This led to the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " taking over the ": null
    },
    {
        "nuclear deterrent": "nuclear deterrent"
    },
    {
        " role in the 42s, using ": null
    },
    {
        "UGM42 Polaris": "ugm-27 polaris"
    },
    {
        " intercontinental ballistic missiles": "intercontinental ballistic missiles"
    },
    {
        " launched from ": null
    },
    {
        "nuclear submarine": "nuclear submarine"
    },
    {
        "s. The ": null
    },
    {
        "tactical role": "tactical nuclear weapons"
    },
    {
        " passed to smaller aircraft like the ": null
    },
    {
        "SEPECAT Jaguar": "sepecat jaguar"
    },
    {
        " and ": null
    },
    {
        "Panavia Tornado": "panavia tornado"
    },
    {
        ".     The V bombers were also capable of dropping conventional weapons, supported by a complex ": null
    },
    {
        "analogue computer": "analogue computer"
    },
    {
        " system known as the ": null
    },
    {
        "Navigation and Bombing System": "navigation and bombing system"
    },
    {
        " that allowed accurate bombing even over very long ranges. The Valiants were used during the ": null
    },
    {
        "Suez Crisis": "suez crisis"
    },
    {
        " as conventional bombers. Victors were deployed to the ": null
    },
    {
        "Malay Archipelago": "malay archipelago"
    },
    {
        " as a deterrent during the ": null
    },
    {
        "Indonesia–Malaysia confrontation": "indonesia–malaysia confrontation"
    },
    {
        " but were not used in missions. The Vulcan is well-remembered for its conventional ": null
    },
    {
        "Black Buck bombing raids": "operation black buck"
    },
    {
        " during the 42 ": null
    },
    {
        "Falklands War": "falklands war"
    },
    {
        ". To support such missions, ": null
    },
    {
        "tanker aircraft": "tanker aircraft"
    },
    {
        " versions of all three designs were developed. Reconnaissance versions were produced, and other modifications were also made during their lifetime.     The Valiants were removed from service in 42 after problems with ": null
    },
    {
        "metal fatigue": "fatigue"
    },
    {
        " of their wings became apparent; a planned low-level variant did not progress beyond the prototype. Usage of all V bombers as weapons platforms, nuclear or conventional, ended in 42       The ": null
    },
    {
        "Royal Air Force": "royal air force"
    },
    {
        " Bomber Command": "raf bomber command"
    },
    {
        " ended the Second World War with a policy of using heavy four-": null
    },
    {
        "piston-engine": "piston-engine"
    },
    {
        "d bombers for massed raids, and remained committed to this policy in the immediate post-war period. The RAF adopted the ": null
    },
    {
        "Avro Lincoln": "avro lincoln"
    },
    {
        ", an updated version of the wartime ": null
    },
    {
        "Avro Lancaster": "avro lancaster"
    },
    {
        ", as its standard bomber for this purpose. Production of the Lincoln continued after the war, and eventually 42 were built. Although touted as a mighty bomber in 42 it lacked the range to reach targets in the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ", and would be vulnerable to the new jet fighters that were then under development.     Elements within the RAF and the government sought to adopt the new ": null
    },
    {
        "nuclear weaponry": "nuclear weaponry"
    },
    {
        " and advances in aviation technology to introduce more potent and effective means of conducting warfare. In November 42 the UK Chiefs of Staff had requested a report from Sir ": null
    },
    {
        "Henry Tizard": "henry tizard"
    },
    {
        " on potential future means of warfare. Reporting without knowledge of the progress of Allied efforts to produce an atomic bomb, in July 42 the ": null
    },
    {
        "Tizard Committee": "tizard committee"
    },
    {
        " urged the encouragement of large-scale atomic energy research. It foresaw the devastating effects of atomic weapons and envisaged high-flying jet bombers cruising at  at . It was thought that potential aggressors might be deterred by the knowledge that Britain would retaliate with atomic weapons if attacked.     Even at the time, there were those who could see that guided ": null
    },
    {
        "missile": "missile"
    },
    {
        "s would eventually make such aircraft vulnerable, but development of such missiles was proving difficult, and fast and high-flying jet bombers were likely to serve for years before there was a need for something better. Massed bombers were unnecessary if a single bomber could destroy an entire city or military installation with a nuclear weapon. It would have to be a large bomber, since the first generation of nuclear weapons were big and heavy. Such a large and advanced bomber would be expensive on a per-unit basis, as it would be produced in small quantities.     During the early part of the Second World War, Britain had a nuclear weapons project, codenamed ": null
    },
    {
        "Tube Alloys": "tube alloys"
    },
    {
        ", which the 42 ": null
    },
    {
        "Quebec Agreement": "quebec agreement"
    },
    {
        " merged with the American ": null
    },
    {
        "Manhattan Project": "manhattan project"
    },
    {
        ". The British government trusted that the United States would continue to share nuclear technology, which it regarded as a joint discovery, after the war, but the ": null
    },
    {
        "United States Atomic Energy Act of 42": "united states atomic energy act of 1946"
    },
    {
        " ended technical co-operation. The British government saw this as a resurgence of ": null
    },
    {
        "United States isolationism": "united states isolationism"
    },
    {
        ", as had occurred after the First World War, and dreaded the possibility that Britain might have to fight an aggressor alone. It also feared that Britain might lose its ": null
    },
    {
        "great power": "great power"
    },
    {
        " status and its influence in world affairs. It therefore restarted its own nuclear weapons development effort, which was now codenamed ": null
    },
    {
        "High Explosive Research": "high explosive research"
    },
    {
        ". The first British atomic bomb was tested in ": null
    },
    {
        "Operation Hurricane": "operation hurricane"
    },
    {
        " on 42 October 42       In November 42 the ": null
    },
    {
        "Air Ministry": "air ministry"
    },
    {
        " issued an ": null
    },
    {
        "operational requirement": "operational requirement"
    },
    {
        " for an advanced jet bomber capable of carrying a  bomb to a target  from a base anywhere in the world with a cruising speed of  and at an altitude of between . The bomb weight arose from an earlier operational requirement for an atomic bomb , which specified a maximum weight of . The speed and altitude requirements were based on what was thought necessary to penetrate enemy air defences. The aircraft itself was to weigh no more than . The ": null
    },
    {
        "Ministry of Supply": "ministry of supply"
    },
    {
        " baulked, and initially refused to accept OR42 Calculations showed that such an aircraft would require a runway  long. Bomber Commands runways were built to handle the Lancaster, and extending them would be an expensive undertaking, involving not only additional construction, but land acquisition and demolition works. OR42 would never be fulfilled, and was ultimately cancelled on 42 September 42     The Operational Requirements Committee met to discuss OR42 on 42 December 42 This committee was chaired by the ": null
    },
    {
        "Vice-Chief of the Air Staff": "vice-chief of the air staff"
    },
    {
        ", ": null
    },
    {
        "Air Marshal": "air marshal"
    },
    {
        " Sir ": null
    },
    {
        "William Dickson": "william dickson"
    },
    {
        ", with Stuart Scott-Hall, the Principal Director of Technical Development representing the Ministry of Supply. The result was a new Operational Requirement on 42 January 42 This was much the same as OR42 but the range was cut to , and the weight reduced to . OR42 formed the basis of an ": null
    },
    {
        "Air Ministry specification": "list of air ministry specifications"
    },
    {
        ", B.42/42 A request for designs went to most of the United Kingdoms major aircraft manufacturers: ": null
    },
    {
        "Handley Page": "handley page aircraft company"
    },
    {
        ", ": null
    },
    {
        "Armstrong Whitworth": "armstrong whitworth aircraft"
    },
    {
        ", ": null
    },
    {
        "Avro": "avro"
    },
    {
        ", ": null
    },
    {
        "Bristol": "bristol aeroplane company"
    },
    {
        ", ": null
    },
    {
        "Short Brothers": "short brothers"
    },
    {
        " and ": null
    },
    {
        "English Electric": "english electric"
    },
    {
        ".   .     On 42 April 42 Armstrong Whitworth, Avro, English Electric and Handley Page were invited to submit formal design tenders. A tender design conference was held on 42 July 42 and decided to order the design submitted by Avro, along with a small flying model to test its ": null
    },
    {
        "delta wing": "delta wing"
    },
    {
        " design. The conference also decided to investigate the ": null
    },
    {
        "crescent wing": "crescent wing"
    },
    {
        " concept as insurance against the favoured delta wing design being a failure. The Handley Page and Armstrong Whitworth designs were both considered. The Ministry of Supply gave financial cover in the form of an Intention to Proceed order to Avro in November 42 An advisory committee selected the Handley Page design on 42 December 42 and it too was given an ITP.     The 42 December 42 meeting that came up with OR42 also decided to solicit bids for a more conservative design that could be put into service more quickly, and could act as further insurance against the failure of both of the more advanced designs. This was expressed in another operational requirement , from which an Air Ministry specification, B.42/42 was generated, which was issued on 42 August 42 This had lower cruising altitude and speed requirements than B.42/42 but was otherwise identical. A design was put forward by Shorts, which was given an ITP in November 42 The result was an extremely conservative design with straight wings, the ": null
    },
    {
        "Short Sperrin": "short sperrin"
    },
    {
        ", which was little more than a jet-powered Lincoln.     Meanwhile, Vickers-Armstrong had produced a ": null
    },
    {
        "swept wing": "swept wing"
    },
    {
        " design, the Vickers 42 This had been rejected because it did not meet the B.42/42 specification; but the estimated performance of the Sperrin caused officials at the Air Ministry to take another look. A new specification, B.42/42 was drawn up, based on the Vickers-Armstrong design, which was issued on 42 July 42 An ITP was given to Vickers-Armstrong in April 42 followed by a contract for two prototypes in February 42 whereas Shorts was only awarded a contract for two prototypes in February 42 The first prototype Vickers 42 flew on 42 May 42 three months before the first prototype Sperrin, which first flew on 42 August 42 No longer required, the Sperrin was cancelled; only the two prototypes were built.     Vickers-Armstrong named its aircraft the ": null
    },
    {
        "Vickers Valiant": "vickers valiant"
    },
    {
        ". Hitherto, bombers had been named after British or Commonwealth cities, but in October 42 the Air Ministry decided to adopt alliterate names, with the other designs becoming the ": null
    },
    {
        "Avro Vulcan": "avro vulcan"
    },
    {
        " and the ": null
    },
    {
        "Handley-Page Victor": "handley-page victor"
    },
    {
        ". Henceforth, the three would be known as the V bombers. While more expensive than the approach of building one bomber design per category, the RAF insisted on having choice. ": null
    },
    {
        "Air Chief Marshal": "air chief marshal"
    },
    {
        " Sir ": null
    },
    {
        "John Slessor": "john slessor"
    },
    {
        " believed that had the air force been forced to choose among the three British bombers under development in the late 42s—the ": null
    },
    {
        "Avro Manchester": "avro manchester"
    },
    {
        ", ": null
    },
    {
        "Short Stirling": "short stirling"
    },
    {
        ", and ": null
    },
    {
        "Handley Page Halifax": "handley page halifax"
    },
    {
        "—it would have chosen the wrong one.     As a stop gap, the British announced on 42 January 42 that it had agreed to acquire ": null
    },
    {
        "Boeing B42 Superfortress": "boeing b-29 superfortress"
    },
    {
        " bombers from the United States free under the recently passed American ": null
    },
    {
        "Mutual Defense Assistance Act": "mutual defense assistance act"
    },
    {
        ". This allowed the Air Ministry to drop the development of the Sperrin. The B42 served in the RAF under the name of the Washington B42 The RAF received its first Washington on 42 March 42 and the eighty-seventh was delivered in June 42 Like the Lincoln, it was a piston-engine aircraft, and while it did have the range to reach the Soviet Union from British bases, it was not nuclear-capable. The RAF planned to use them against Soviet bomber bases. The Washingtons suffered from maintenance problems due to a lack of spare parts, and most were returned to the US between July 42 and July 42; four remained in service until 42 Their role was assumed by the new jet-propelled ": null
    },
    {
        "English Electric Canberra": "english electric canberra"
    },
    {
        " bomber.            When the first ": null
    },
    {
        "Blue Danube": "blue danube"
    },
    {
        " atomic bombs were delivered to the Bomber Command Armaments School at ": null
    },
    {
        "RAF Wittering": "raf wittering"
    },
    {
        " on 42 and 42 November 42 the RAF had no bombers capable of carrying them. Sir ": null
    },
    {
        "William Penney": "william penney"
    },
    {
        " noted that the RAF has handled aircraft for a long time and can fly Valiants as soon as they come off the production line. But the Royal Air Force has not yet handled atomic weapons, therefore, we must get some bombs to the RAF at the earliest possible moment, so that the handling and servicing can be practised and fully worked out.  The Canberra and Valiant were accorded super priority status on 42 March 42 and in December the Vulcan and Victor also received it.     The Valiant went into production as the first V bomber in 42 The Valiant entered service in February 42 the Vulcan in May 42 and the Victor in November 42 ": null
    },
    {
        "No. 42 Operational Conversion Unit": "no. 232 operational conversion unit raf"
    },
    {
        " was formed at ": null
    },
    {
        "RAF Gaydon": "raf gaydon"
    },
    {
        " in June 42 and aircrew training commenced. The first Valiant squadron, ": null
    },
    {
        "No. 42 Squadron": "no. 138 squadron raf"
    },
    {
        ", formed at RAF Gaydon in January 42  followed by ": null
    },
    {
        "No. 42 Squadron": "no. 543 squadron raf"
    },
    {
        ", which was formed at RAF Gaydon on 42 June 42 before moving to ": null
    },
    {
        "RAF Wyton": "raf wyton"
    },
    {
        ". Two more Valiant bases were established at ": null
    },
    {
        "RAF Marham": "raf marham"
    },
    {
        " and ": null
    },
    {
        "RAF Honington": "raf honington"
    },
    {
        " in 42 and six more squadrons were formed in quick succession: ": null
    },
    {
        "No. 42 Squadron": "no. 214 squadron raf"
    },
    {
        " at RAF Marham in March, ": null
    },
    {
        "No. 42 Squadron": "no. 207 squadron raf"
    },
    {
        " at RAF Marham and ": null
    },
    {
        "No. 42 Squadron": "no. 49 squadron raf"
    },
    {
        " at RAF Wittering in May, ": null
    },
    {
        "No. 42 Squadron": "no. 148 squadron raf"
    },
    {
        " at RAF Marham in July, ": null
    },
    {
        "No. 42 Squadron": "no. 7 squadron raf"
    },
    {
        " at RAF Honington in November and finally ": null
    },
    {
        "No. 42 Squadron": "no. 90 squadron raf"
    },
    {
        " at RAF Honington in January 42     Vulcan XA42 was allocated to ": null
    },
    {
        "No. 42 Operational Conversion Unit": "no. 230 operational conversion unit raf"
    },
    {
        " at ": null
    },
    {
        "RAF Waddington": "raf waddington"
    },
    {
        " in January 42 and Vulcan aircrew training commenced. The first Vulcan squadron, ": null
    },
    {
        "No. 42 Squadron": "no. 83 squadron raf"
    },
    {
        ", was formed at RAF Waddington in May 42 It initially used aircraft borrowed from No. 42 Operational Conversion Unit until it received its first Vulcan, XA42 on 42 July 42 It was followed by ": null
    },
    {
        "No. 42 Squadron": "no. 101 squadron raf"
    },
    {
        ", which was formed at ": null
    },
    {
        "RAF Finningley": "raf finningley"
    },
    {
        " on 42 October 42 A third Vulcan squadron, ": null
    },
    {
        "No. 42 Squadron": "no. 617 squadron raf"
    },
    {
        ", was formed on 42 May 42 at ": null
    },
    {
        "RAF Scampton": "raf scampton"
    },
    {
        ", the same base from which it carried out the ": null
    },
    {
        "Dambuster Raids": "dambuster raids"
    },
    {
        " in May 42 No. 42 Operational Conversion Unit took delivery of its first Victor on 42 November 42 The first operational Victor squadron was ": null
    },
    {
        "No. 42 Squadron RAF": "no. 10 squadron raf"
    },
    {
        ", which received its first Victor on 42 April 42 and was formed on 42 April. This was followed by No. 42 Squadron, which was formed on 42 September 42 and ": null
    },
    {
        "No. 42 Squadron": "no. 57 squadron raf"
    },
    {
        ", which was formed on 42 January 42     The UK nuclear strike force became known officially as the V force or Main Force. V force assets at the end of 42 were:          The development of effective jet fighters and anti-aircraft missile defences promised to make the ": null
    },
    {
        "nuclear deterrent": "nuclear deterrent"
    },
    {
        " delivered from bombers flying at high altitudes increasingly ineffective. While making the V bombers fast enough to avoid them was problematic, improved engines offered the possibility of allowing them to fly higher. Since the ": null
    },
    {
        "Mikoyan-Gurevich MiG42": "mikoyan-gurevich mig-19"
    },
    {
        " fighters coming into service in the Soviet Union had a ceiling of , a V bomber could avoid them by flying at over . Two dozen of a new model of the Vulcan, the B.42 with  Bristol Olympus 42 engines, a slightly larger wingspan and new electrical and electronic systems were ordered on 42 February 42 The last 42 aircraft outstanding from the September 42 order and 42 from the March 42 order were switched to the B.42 making a total of 42 on order. Another 42 were ordered on 42 January 42 A pre-production model, XH42 first flew on 42 August 42 and in a trial on 42 Match 42 it reached . The wings and new engines also increased the range by . The second production B.42 ": null
    },
    {
        "XH42": "avro vulcan xh558"
    },
    {
        ", was delivered to No. 42 Operational Conversion Unit in 42 July 42 As Vulcan B.42s were received, the B.42s were withdrawn from service and upgraded to B.42A standard through the installation of more electronics. Most of this work was carried out by Armstrong Whitworth.     Modifications were made to the Victor B.42 in 42 These included the addition of an in-flight refuelling probe, new ": null
    },
    {
        "electronic countermeasures": "electronic countermeasures"
    },
    {
        " equipment, ": null
    },
    {
        "tail-warning radar": "tail-warning radar"
    },
    {
        ", drooped leading edges and a strengthened pressure cabin. This modified version was known as the Victor B.42A. An improved version of the Victor was also programmed with the ": null
    },
    {
        "Armstrong Siddeley Sapphire": "armstrong siddeley sapphire"
    },
    {
        " 42 engine, an improved version of the Sapphire 42 in the Victor B.42 However, development of the Sapphire 42 was cancelled by the Ministry of Supply in February 42 and a minor improvement to the Sapphire 42 in March 42 increased its thrust to , so it was decided to ship 42 of the next production batch of 42 Victors ordered in May 42 with the Sapphire 42 The remaining eight, along with 42 more Victors ordered in January 42 were built as Victor B.42s, with the ": null
    },
    {
        "Rolls-Royce Conway": "rolls-royce conway"
    },
    {
        " RCo.42 engines providing . The new Conway engines required redesigned enlarged intakes to provide the greater airflow required, and the wingspan was extended from . As in the Vulcan, the ": null
    },
    {
        "DC": "direct current"
    },
    {
        " electrical system was replaced with an ": null
    },
    {
        "AC": "alternating current"
    },
    {
        " one. The prototype Victor B.42 XH42 first flew on 42 February 42 but was lost over the Irish Sea on 42 August. The first production B.42 XL42 was delivered on 42 November 42 and No. 42 Squadron became the first Victor B.42 squadron on 42 February 42     V force assets at the end of 42 were:      The V Bomber force reached its peak in June 42 when 42 Valiants, 42 Vulcans and 42 Victors were in service.  In retrospect, the decision to proceed with three V bombers was questionable. As it turned out, all the roles could have been performed by the Valiant, and its B.42 model was specifically designed for the low-level operations that the V bombers would employ in their later years. Moreover, the rationale for producing both the Vulcan and the Victor disappeared early on. That for producing the Victor B.42 instead of concentrating on the Vulcan B.42 was especially dubious, and Air Chief Marshal Sir ": null
    },
    {
        "Harry Broadhurst": "harry broadhurst"
    },
    {
        " attributed it to lobbying by Sir ": null
    },
    {
        "Frederick Handley Page": "frederick handley page"
    },
    {
        ", a desire to retain jobs in the aviation industry, and because the government wanted the Rolls-Royce Conway engine produced for the ": null
    },
    {
        "Vickers VC42": "vickers vc10"
    },
    {
        " airliner.       The British government was well aware of the devastation that a nuclear war would bring. A 42 report estimated that an attack on the UK with 42 fission weapons would generate 42 million casualties. A follow-on study, which considered the possible effect of hydrogen bombs, estimated that as few as ten could reduce the entire UK to a radioactive ruin. Given that defence was impractical, the UK turned to a policy of ": null
    },
    {
        "deterrence": "deterrence theory"
    },
    {
        ", by targeting the population and administrative centres of the Soviet Union. In 42 the Air Ministry drew up a list of 42 Soviet cities with populations of 42 or more. Of these, 42 were within  of the UK. Of these, 42 were selected. It was estimated that their destruction would kill about thirty percent of the urban population of the Soviet Union, about 42 million people.     It was almost inconceivable that a war with the Soviet Union would not involve the United States, and as early as 42 American defence planning envisaged using the UK as a base for nuclear strikes on the Soviet Union, as the United States Air Force had not yet developed long-range bombers that could attack key targets in the Soviet Union from bases in the United States. But the United States strategy was that attacks on population centres would have little value once a war had actually begun, and prioritised military targets, particularly those from which nuclear weapons could be launched or deployed.     Coordination of war plans between RAF Bomber Command and the USAF ": null
    },
    {
        "Strategic Air Command": "strategic air command"
    },
    {
        " was clearly desirable, and a joint war plan was negotiated between 42 and 42 The RAFs nuclear force was capable of destroying key targets before bomber aircraft from the United States had entered Soviet airspace, taking into account Bomber Command’s ability to be on target in the first wave several hours in advance of the main SAC force operating from bases in the United States.  Based on the assumption that RAF Bomber Command would have about 42 V bombers in operations by 42 the SAC/RAF agreement assigned 42 targets to the UK: 42 cities, 42 long-range aviation bases, and 42 air-defence sites. Attacks on the air-defence installations would clear the way for waves of SAC bombers to follow. The plan was updated annually; as Soviet capabilities improved, more emphasis was placed on attacking airfields and missile bases.          Special Valiant unit ": null
    },
    {
        "No. 42 Flight": "no. 1321 flight raf"
    },
    {
        " was formed at RAF Wittering on 42 August 42 which conducted ballistic test trials with Blue Danube practice bombs. It became C Flight of No. 42 Squadron in March 42 and No. 42 Squadron on 42 May 42 Valiants WZ42 and WZ42 were then flown to ": null
    },
    {
        "Maralinga": "maralinga"
    },
    {
        ", South Australia for ": null
    },
    {
        "Operation Buffalo": "british nuclear tests at maralingaoperation buffalo"
    },
    {
        ". Valiant B.42 WZ42 of No. 42 Squadron became the first RAF aircraft to drop an operational atomic bomb when it performed a test drop of a down-rated 42-kt Blue Danube at Maralinga on 42 October 42 The bomb landed about  left and  short of the target. The pilot was Squadron Leader Edwin Flavell, and the bomb aimer was Flight Lieutenant Eric Stacey, and both were awarded the ": null
    },
    {
        "Air Force Cross": "air force cross"
    },
    {
        ".      On 42 May 42 Valiant B.42 XD42 flown by ": null
    },
    {
        "Wing Commander": "wing commander"
    },
    {
        " Kenneth Hubbard": "kenneth hubbard"
    },
    {
        " dropped the first British ": null
    },
    {
        "hydrogen bomb": "hydrogen bomb"
    },
    {
        " over the Pacific, the Short Granite , as part of ": null
    },
    {
        "Operation Grapple": "operation grapple"
    },
    {
        ".  No. 42 Squadron was selected to perform the live weapon drop and was equipped with specially modified Valiants to conform with the scientific requirements of the tests and other precautionary measures to protect against heat and radiation. The test was largely a failure, as the measured yield was less than a third of the maximum expected and the device failed to achieve a ": null
    },
    {
        "thermonuclear": "thermonuclear"
    },
    {
        " explosion as intended. The first British hydrogen bomb that detonated as planned was Grapple X Round A, dropped on 42 November 42 The Grapple series of tests continued into 42 and the Grapple Y bomb exploded in April 42 with ten times the yield of the original Short Granite . Testing was finally terminated in November 42 when the British government decided to cease atmospheric testing.       As V bomber production picked up, the number of bombers exceeded the number of available British nuclear weapons. Britain had only ten nuclear bombs in 42 and just 42 in 42 To make up the difference, American nuclear weapons were obtained through ": null
    },
    {
        "Project E": "project e"
    },
    {
        ". Since they were in American custody, they were not available for the RAF to use as part of the UKs independent national nuclear deterrent; only British-owned weapons could be used for that purpose. The Vulcan and Victor were armed with British-built bombs Blue Danube, ": null
    },
    {
        "Red Beard": "red beard"
    },
    {
        ", ": null
    },
    {
        "Violet Club": "violet club"
    },
    {
        ", and ": null
    },
    {
        "Yellow Sun": "yellow sun"
    },
    {
        " of both the Mk 42 and Mk 42 versions. Project E modifications to Valiants commenced at RAE Farnborough in February 42 Crew training was carried out with American instructors at ": null
    },
    {
        "RAF Boscombe Down": "raf boscombe down"
    },
    {
        ".        The planned V bomber force was reduced to 42 aircraft, and it was planned to equip half of them with Project E weapons. The first 42 Valiants were modified by October 42; the remaining 42 Valiants, along with 42 Vulcans, were ready by January 42 Under the Project E Memorandum of Understanding, US personnel had custody of the weapons. That meant they performed all the tasks related to their storage, maintenance and readiness. While the bombs were at the same bases as the bombers, they were stored in Secure Storage Areas that British staff were not permitted to enter. It was therefore impossible to store British and American bombs together in the same SSA. Bomber Command designated RAF Marham, RAF Waddington and RAF Honington as bases with US SSAs. Another three sites had British SSAs. US custody created operational problems. The procedure for handing over the bombs added an extra ten minutes to the bombers reaction time, and the requirement that US personnel had guardianship of the weapons at all times meant that neither they nor the bombers could be relocated to dispersal airfields as the RAF desired.     Initially, 42 ": null
    },
    {
        "Mark 42 nuclear bomb": "mark 5 nuclear bomb"
    },
    {
        "s were supplied for the V bombers. They had a yield of up to . The successful ": null
    },
    {
        "British development of the hydrogen bomb": "british hydrogen bomb programme"
    },
    {
        ", and a favourable international relations climate caused by the ": null
    },
    {
        "Sputnik crisis": "sputnik crisis"
    },
    {
        ", led to the United States Atomic Energy Act being amended again in 42 resulting in the long-sought resumption of the nuclear ": null
    },
    {
        "Special Relationship": "special relationship"
    },
    {
        " between Britain and the United States in the form of the ": null
    },
    {
        "42 US–UK Mutual Defence Agreement": "1958 us–uk mutual defence agreement"
    },
    {
        ". The United States now agreed to supply the V bombers with megaton weapons in place of the Mark 42 in the form of ": null
    },
    {
        "Mark 42": "mark 15 nuclear bomb"
    },
    {
        " and ": null
    },
    {
        "Mark 42 nuclear bomb": "mark 39 nuclear bomb"
    },
    {
        "s. ": null
    },
    {
        "The Treasury": "hm treasury"
    },
    {
        " immediately inquired as to whether this meant that the British megaton bomb programme could be terminated. The answer was no; the operational restrictions imposed by Project E effectively handed the US government a veto over the use of half of Britains nuclear deterrent . With sufficient British bombs on hand, operational issues, and the concept of an ": null
    },
    {
        "independent nuclear deterrent": "independent nuclear deterrent"
    },
    {
        " came to the fore.     The ": null
    },
    {
        "Air Council": "air council"
    },
    {
        " decided on 42 July 42 that Project E weapons would be phased out by December 42 by which time it was anticipated that there would be sufficient British megaton weapons to equip the entire ": null
    },
    {
        "strategic bomber": "strategic bomber"
    },
    {
        " force. Project E weapons were replaced by British Yellow Sun bombs at RAF Honington on 42 July 42 and Waddington on 42 March 42 Problems encountered in the development of the Red Beard bomb meant that the replacement of kiloton weapons took longer. The UK-based Valiants at Honington and Wittering were withdrawn in April and October 42 and the last Valiants were retired from the V bomber force in July 42 The final practice loading at RAF Marham—with the Mark 42s—was in January 42 and the last US personnel left the base in July.       The prospect of bombers being able to avoid the Soviet air defences dimmed with the appearance of the ": null
    },
    {
        "Mikoyan-Gurevich MiG42": "mikoyan-gurevich mig-21"
    },
    {
        ", which ": null
    },
    {
        "Nigel Birch": "nigel birch"
    },
    {
        ", the ": null
    },
    {
        "Secretary of State for Air": "secretary of state for air"
    },
    {
        " and senior RAF officers saw at ": null
    },
    {
        "Tushino Airfield": "tushino airfield"
    },
    {
        " on 42 June 42 There was no immediate concern as Soviet designs often took several years to deploy; but its ceiling of  posed a clear threat to the V bombers. So too did the new ": null
    },
    {
        "SA42": "sa-2"
    },
    {
        " surface-to-air missile": "surface-to-air missile"
    },
    {
        "s, which appeared in 42 One of them shot down an American ": null
    },
    {
        "Lockheed U42": "lockheed u-2"
    },
    {
        " piloted by ": null
    },
    {
        "Francis Gary Powers": "francis gary powers"
    },
    {
        " over the Soviet Union on 42 May 42 In 42 the supersonic ": null
    },
    {
        "Avro 42": "avro 730"
    },
    {
        " bomber was cancelled. This freed up funds for the ": null
    },
    {
        "Blue Streak missile": "blue streak missile"
    },
    {
        " programme, but it too was cancelled, on 42 February 42 To extend the effectiveness and operational life of the V bombers, an Operational Requirement , was issued on 42 September 42 for an air-launched, rocket-propelled ": null
    },
    {
        "standoff missile": "standoff missile"
    },
    {
        " with a range of  that could be launched from a V bomber. This became ": null
    },
    {
        "Blue Steel": "blue steel"
    },
    {
        ". The Ministry of Supply placed a development contract with Avro in March 42 and it entered service in December 42        By this time, it was anticipated that even with Blue Steel, the air defences of the Soviet Union would soon improve to the extent that V bombers might find it difficult to attack their targets, and there were calls for the development of the Blue Steel Mark II with a range of at least . Despite the name, this was a whole new missile, and not a development of the Mark I. The ": null
    },
    {
        "Minister of Aviation": "minister of aviation"
    },
    {
        ", ": null
    },
    {
        "Duncan Sandys": "duncan sandys"
    },
    {
        ", insisted that priority be accorded to getting the Mark I into service, and the Mark II was cancelled at the end of 42 Considerable modification was required to enable the Victors to carry Blue Steel. These included structural changes to the bomb bay. New  Conway RCo.42 engines were installed, along with a ": null
    },
    {
        "combuster": "combuster"
    },
    {
        " ignition system to allow all four engines to be started simultaneously and reduce ": null
    },
    {
        "scramble": "scrambling"
    },
    {
        " time to  minutes per aircraft. A total of 42 Victor B.42 aircraft were upgraded to the new standard, known as B.42R , and two more were built as such.     The British government then turned to ": null
    },
    {
        "Skybolt": "agm-48 skybolt"
    },
    {
        ", an American missile that combined the range of Blue Streak with the mobile basing of the Blue Steel, and was small enough that two could be carried on the Vulcan bomber. Armed with a British ": null
    },
    {
        "Red Snow": "red snow"
    },
    {
        " warhead, this would improve the capability of the UKs V bomber force, and extend its useful life into the late 42s and early 42s. ": null
    },
    {
        "Cabinet": "cabinet of the united kingdom"
    },
    {
        " Defence Committee approved the acquisition of Skybolt in February 42 The Vulcan B.42s were modified to carry a pair of Skybolt missiles. They were fitted with  Bristol Olympus 42 engines, strengthened wings and two special attachment points. A British warhead was designed to fit in Skybolts nose cone, and dummy test firings were carried out at ": null
    },
    {
        "RAF West Freugh": "raf west freugh"
    },
    {
        " commencing on 42 December 42 It did not prove possible to modify the Victors. The project came to an abrupt halt when the US government cancelled Skybolt on 42 December 42 but the vestigial attachment points were used for ": null
    },
    {
        "AN/ALQ42": "an/alq-101"
    },
    {
        " electronic countermeasure": "electronic countermeasure"
    },
    {
        " pods during the ": null
    },
    {
        "Falklands War": "falklands war"
    },
    {
        ". To replace Skybolt, the ": null
    },
    {
        "Prime Minister": "prime minister of the united kingdom"
    },
    {
        ", ": null
    },
    {
        "Harold Macmillan": "harold macmillan"
    },
    {
        ", negotiated the ": null
    },
    {
        "Nassau Agreement": "nassau agreement"
    },
    {
        " with the ": null
    },
    {
        "President of the United States": "president of the united states"
    },
    {
        " John F. Kennedy": "john f. kennedy"
    },
    {
        " on 42 January 42 under which the US agreed to supply the UK with ": null
    },
    {
        "Polaris": "ugm-27 polaris"
    },
    {
        " submarine-launched ballistic missiles": "submarine-launched ballistic missiles"
    },
    {
        " instead. This spelt the beginning of the end of the V bombers nuclear deterrent, but six more years passed before the submarines were built and the Royal Navy was able to take over responsibility.        Although originally part of the V force, three squadrons of Valiants were assigned to ": null
    },
    {
        "SACEUR": "saceur"
    },
    {
        " as part of the TBF , while remaining part of Bomber Command for training and administration. As the new Victors and Vulcans became available, Valiants became surplus to the planned V force of 42 aircraft. It was proposed that 42 Valiants could replace 42 Canberra bombers. This represented a numerical reduction in the force available to SACEUR, but an improvement in capability due to the Valiants all-weather strike capacity. The decision was taken by the Air Council on 42 May 42 The first squadron to be assigned was No. 42 Squadron, on 42 January 42 It was followed by No. 42 Squadron on 42 July, and No. 42 on 42 July. No. 42 Squadron moved to RAF Marham so that all three squadrons were concentrated there. They were each equipped with two ": null
    },
    {
        "Mark 42 nuclear bomb": "mark 28 nuclear bomb"
    },
    {
        "s provided by Project E. The three TBF squadrons eventually became the only Valiant bomber squadrons as all the others were disbanded or converted to tanker or strategic reconnaissance roles. They adopted SACEURs ": null
    },
    {
        "Quick Reaction Alert": "quick reaction alert"
    },
    {
        ", under which arrangements were made so that three armed aircraft were always ready to scramble within 42 minutes. They were also the first V bombers to adopt a low-level strike role, with their white paintwork replaced by green camouflage. During the ": null
    },
    {
        "Cuban Missile Crisis": "cuban missile crisis"
    },
    {
        ", each V force squadron kept one fully armed aircraft and crew at 42 minutes readiness.     By 42 the RAF was convinced that, to have any chance of survival, the V bombers would have to attack at low level. At altitudes below , radar was less effective due to ground-generated clutter. The three Vulcan B.42A squadrons at RAF Waddington and the four Victor B.42A squadrons at RAF Honington and RAF Cottesmore were ordered to switch to low-level operations in March 42 The Vulcan B.42 and Victor B.42 squadrons followed on 42 May 42 A sign of the new doctrine was the replacement of their white paintwork with green camouflage on their upper surfaces, starting with Vulcan XH42 on 42 March 42 They were also outfitted with new ECMs, ground positing equipment and terrain-following radar. Tests performed in the UK and at ": null
    },
    {
        "Woomera": "raaf woomera range complex"
    },
    {
        " demonstrated that Blue Steel could be launched from low level. The Yellow Sun Mark 42 free-fall bomb was a different story, and V bombers equipped with it would have had to climb to medium altitude to release it. A new bomb, the ": null
    },
    {
        "WE.42": "we.177"
    },
    {
        " was developed. Deliveries of the  WE.42B commenced in September 42 Through Project E and the introduction of the smaller, lighter Red Beard bomb, which entered service in 42 by the mid42s Canberras and the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        "s ": null
    },
    {
        "Fleet Air Arm": "fleet air arm"
    },
    {
        " were able to deliver nuclear weapons, but their power was insignificant compared with that of the 42 Victor and Vulcan bombers.      The V bombers were formally relieved of their role as the deliverer of the UK strategic nuclear deterrent, which officially passed to the Polaris ballistic missile submarines of the Royal Navy on 42 July 42 The last Blue Steel mission was flown on 42 December 42 Five Vulcan squadrons continued to serve with the WE.42B weapon in a tactical role in Europe with SACEUR. Nos 42 and 42 Squadrons moved to ": null
    },
    {
        "RAF Akrotiri": "raf akrotiri"
    },
    {
        " in Cyprus, where they replaced Canberra bombers in support of ": null
    },
    {
        "CENTO": "cento"
    },
    {
        " and operations on NATOs southern flank. They were withdrawn in 42 in the wake of the ": null
    },
    {
        "Turkish invasion of Cyprus": "turkish invasion of cyprus"
    },
    {
        ". Six squadrons of Vulcans were still assigned this role with the WE.42 weapon in 42 The last four remaining squadrons were about to disband in 42 when called upon to assist in the Falklands War.         The first V bomber to see combat use with conventional bombs was the Valiant in ": null
    },
    {
        "Operation Musketeer": "operation musketeer"
    },
    {
        ", the Anglo-French military response in the ": null
    },
    {
        "Suez Crisis": "suez crisis"
    },
    {
        " in 42 It was the first and only time the Valiants dropped bombs in combat operations. RAF units began deploying to Malta in September 42 and when Israel attacked Egypt on 42 October 42 four Valiant squadrons—Nos 42 42 42 and 42 Squadrons—were based at ": null
    },
    {
        "RAF Luqa": "raf luqa"
    },
    {
        ". No. 42 Squadron was the only one with a full complement of eight Valiants; Nos 42 and 42 each had six, and No. 42 had only four. The initial objective was to neutralise the ": null
    },
    {
        "Egyptian Air Force": "egyptian air force"
    },
    {
        ", which was believed to have about 42 ": null
    },
    {
        "Mikoyan-Gurevich MiG42": "mikoyan-gurevich mig-15"
    },
    {
        " jet fighters and 42 ": null
    },
    {
        "Ilyushin Il42": "ilyushin il-28"
    },
    {
        " twin-engine jet bombers. The Egyptian ": null
    },
    {
        "early-warning radar": "early-warning radar"
    },
    {
        " system was known to be non-operational due to lack of maintenance and spare parts, so the bombers were ordered to operate at night when the visually-controlled defences would be least effective. This meant a reversion to the tactics used by Bomber Command in the Second World War. The Valiants were neither trained nor equipped for such a mission. Not all of the Valiants were equipped with the ": null
    },
    {
        "Navigation and Bombing System": "navigation and bombing system"
    },
    {
        " and it was not serviceable in all of those that were. This forced a reversion to the older, visual bomb sight. The Valiants and Canberras were equipped with the ": null
    },
    {
        "Gee-H": "gee-h"
    },
    {
        " radio navigation": "radio navigation"
    },
    {
        " system, but it could not be used as there were no beacons in the Middle East. However, the Valiants were also equipped with ": null
    },
    {
        "Green Satin radar": "green satin radar"
    },
    {
        ", which could still be used.     The first mission was flown on 42 October, in co-operation with Canberra bombers from Malta and Cyprus. The target was five Egyptian airbases in the ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        " area, including ": null
    },
    {
        "Cairo West Air Base": "cairo west air base"
    },
    {
        ". At the last minute, it was discovered that fifteen US transport aircraft were at Cairo West evacuating civilians, and the target had to be altered while the bombers were already in the air. The Valiants dropped target markers, and then Canberras dropped flares to illuminate the target area. This allowed other Canberras to drop bombs on the runways. This pattern was repeated in attacks on four airfields in the ": null
    },
    {
        "Nile Delta": "nile delta"
    },
    {
        " and eight in the ": null
    },
    {
        "Suez Canal": "suez canal"
    },
    {
        " area over the next two nights. The Valiants final mission was flown on 42 November against El Agami Island, which was believed to be a submarine repair depot. By the time operations ended,  of bombs had been dropped, half of which had fallen within  of their targets. The results were unimpressive. Three of the seven main Egyptian airbases remained fully operational, one had its runway shortened, and one had three craters that needed filling. The only airbase that was completely out of commission was Cairo West, and then only because of Egyptian demolitions.       On 42 October 42 three Valiants from No. 42 Squadron flew to ": null
    },
    {
        "RAF Changi": "raf changi"
    },
    {
        " in Singapore for a fortnight to gain experience operating in the Far East. This was known as Exercise Profiteer. Subsequently, small detachments of Valiants and Vulcans deployed to the Far East for a fortnight every three months until June 42 Although the ": null
    },
    {
        "Malayan Emergency": "malayan emergency"
    },
    {
        " was ongoing at this time, none of the Exercise Profiteer aircraft participated in combat operations. When the Valiants were assigned to SACEUR for operations in Europe, the conventional mission in the Middle East was assigned to the Vulcans at RAF Waddington, while that in the Far East was given to the Victors based at RAF Cottesmore and RAF Honington. When the ": null
    },
    {
        "Indonesian Confrontation": "indonesian confrontation"
    },
    {
        " heated up in December 42 eight Victors from Nos 42 and 42 Squadrons were sent to the Far East, where they were based at ": null
    },
    {
        "RAF Tengah": "raf tengah"
    },
    {
        " and ": null
    },
    {
        "RAAF Butterworth": "raaf butterworth"
    },
    {
        ". The crews normally served 42-month tours. No. 42 Squadron was disbanded in March 42 and No. 42 Squadron in October. Responsibility for the Far East then fell on detachments of Vulcans of Nos 42 42 and 42 Squadrons. Tensions decreased after March 42 and the size of the detachment was cut to four aircraft. The deployments ended in August 42          During the 42 Falklands War, Vulcan bombers from Nos 42 42 and 42 Squadrons, supported by Victor tankers from Nos 42 and 42 Squadrons, carried out a series of seven extremely long-range ground attack missions against Argentine positions in the ": null
    },
    {
        "Falkland Islands": "falkland islands"
    },
    {
        ". The operation was codenamed ": null
    },
    {
        "Black Buck": "operation black buck"
    },
    {
        ". The objectives of the missions were to attack ": null
    },
    {
        "Port Stanley Airport": "port stanley airport"
    },
    {
        " and its associated defences. While the Vulcans were capable of carrying conventional munitions, this had not been done for a long time. To carry twenty-one  bombs, the Vulcan required three sets of bomb carriers, each of which held seven bombs. Their release was controlled by a panel at the navigators station known as a 42-way that monitored the electrical connections to each bomb, and was said to provide 42 different sequences for releasing the bombs. None of the Vulcans at RAF Waddington were fitted with the bomb racks or the 42-way. A search of the supply dumps at Waddington and RAF Scampton located the 42-way panels, which were fitted and tested, but finding enough septuple bomb carriers proved harder, and at least nine were required. Someone remembered that some had been sold to a scrapyard in ": null
    },
    {
        "Newark-on-Trent": "newark-on-trent"
    },
    {
        ", and they were retrieved from there. Locating sufficient bombs also proved difficult, and only 42 could be found, and some had cast bomb cases instead of the preferable machined ones. Training of crews in conventional bombing and in-flight refuelling was carried out from 42 to 42 April 42     The raids, at almost  and 42 hours for the return journey, were the longest-ranged bombing raids in history at the time. The Black Buck raids were staged from ": null
    },
    {
        "RAF Ascension Island": "raf ascension island"
    },
    {
        ", close to the equator. The Vulcans lacked the range to fly to the Falklands without refuelling several times, as did the converted Victor tankers, so they too had to be refuelled in flight. Eleven tankers were required for two Vulcans, a huge ": null
    },
    {
        "logistical": "logistics"
    },
    {
        " effort as all aircraft had to use the same runway. The aircraft carried either twenty-one  bombs internally or two or four ": null
    },
    {
        "Shrike": "agm-45 shrike"
    },
    {
        " anti-radar missiles externally. Of the five Black Buck raids flown to completion, three were against Stanley Airfields runway and operational facilities, and the other two were anti-radar missions using Shrike missiles against a Westinghouse ": null
    },
    {
        "AN/TPS42": "an/tps-43"
    },
    {
        " long-range 42D radar in the Port Stanley area. Shrikes hit two of the less valuable and rapidly replaced secondary fire control radars, causing minor damage.        In July 42 a Valiant of No. 42 Squadron on a deployment to Rhodesia was found to have cracks in the rear wing spar and was ferried back to the UK for repairs. The following month, a Valiant from No. 42 Operational Conversion Unit suffered a wing spar failure during a training exercise over Wales. The whole Valiant fleet was checked, and many were found to have significant cracks in the wing spars. Those that were considered to have little or no damage were cleared to fly, but with a temporary restriction to a maximum speed of , maximum load of , and a maximum bank angle of 42 degrees. When Vickers commenced repairs, it was found that the damage was more severe than first thought, and the entire fleet was grounded on 42 December 42 and withdrawn from service. At first it was thought that the switch to low-level flying was the cause, but cracks were also found in Valiants that were in service as tanker and strategic reconnaissance aircraft, and had not been flown at low level. Suspicion then fell on the aluminium alloy that had been used, DTD42 One Valiant remained in service as a test aircraft, having been re-sparred.          Valiants served in a photo-reconnaissance role with No. 42 Squadron, commencing in the second half of 42 At least seven Valiants were configured to the ECM role, serving with No. 42 Squadron from 42 September 42 These aircraft were ultimately fitted with APT42A and ALT42 jamming transmitters, Airborne Cigar and Carpet ": null
    },
    {
        "jammers": "radar jamming and deception"
    },
    {
        ", APR42 and APR42 sniffing receivers, and ": null
    },
    {
        "chaff": "chaff"
    },
    {
        " dispensers. After the Valiants were grounded, the timetable for the development of a photo-reconnaissance version of the Victor, known as the SR.42 was accelerated. A prototype was flown for the first time on 42 February 42 and the first aircraft was delivered to No. 42 Squadron on 42 May 42 The Victor SR.42s carried out extensive photographic survey work, which assumed increased importance after the bombers switched to low-level operations. No. 42 Squadron was disbanded on 42 May 42 but a flight of four remained until 42 March 42 to participate in ": null
    },
    {
        "French nuclear weapons testing": "1971–74 french nuclear tests"
    },
    {
        " in the Pacific. Responsibility for the reconnaissance role passed to No. 42 Squadron, which had been re-formed in November 42 and operated the Vulcan SR.42 No. 42 Squadron was disbanded in March 42       In addition to the roles for which they were designed, all three V bombers served as ": null
    },
    {
        "aerial refuelling": "aerial refuelling"
    },
    {
        " tankers at one time or another. The Valiant was the RAFs first large-scale tanker. The probe and drogue system for aerial refuelling was developed by Sir ": null
    },
    {
        "Alan Cobham": "alan cobham"
    },
    {
        ", but the Air Ministry doubted its value so long as Britain maintained bases around the world. However, on 42 January 42 the ": null
    },
    {
        "Air Staff": "air staff"
    },
    {
        " decided that the V bombers should be capable of both aerial refuelling and acting as tankers, and an Operational Requirement was issued in 42 for an electronic positioning system to facilitate aerial refuelling. Initially, there were no aircraft to perform the role, but two new types of Valiant were ordered. Fourteen BK.42 versions were produced. These were a tanker variant of the photo-reconnaissance model, with a hose drum unit in the bomb bay. The final production model of the Valiant was the BK.42 version, which had a  fuel tank in the front of the bomb bay and an HDU in the rear. Some 42 were built.  No. 42 Squadron was selected to carry out tanker trials, while retaining its bombing role, in February 42 The trials were successful. In August 42 a second Valiant squadron, No. 42 Squadron, was ordered to begin training in the aerial refuelling role. Nos 42 and 42 Squadrons became full-time tanker squadrons on 42 April 42 In a demonstration on 42/42 June 42 a Vulcan B.42A from No. 42 Squadron flew non-stop from RAF Scampton to ": null
    },
    {
        "Sydney": "sydney"
    },
    {
        " in 42 hours and 42 minutes, refuelled four times by tankers from No. 42 Squadron. They served in the role until the Valiants were abruptly withdrawn from service.     Work was already under way to replace the Valiants with Victors. A proposal to convert Victor B.42s and B.42As was first considered by the Air Staff on 42 May 42 and was endorsed by the ": null
    },
    {
        "Chief Scientific Adviser to the Ministry of Defence": "chief scientific adviser to the ministry of defence"
    },
    {
        ", Sir ": null
    },
    {
        "Solly Zuckerman": "solly zuckerman"
    },
    {
        ", and the Chiefs of Staff in 42 The Defence Research Policy Committee estimated that converting 42 aircraft would cost £42 million. This would provide sufficient aircraft for three tanker squadrons. The price tag soon increased to £42 million for 42 aircraft, and the Treasury was reluctant to spend that much money pending a review of Britains overseas defence commitments, which would establish whether a third squadron was required. There were also doubts about the financial viability of Handley Page. Approval was given for the conversion of twelve aircraft on 42 June, three more on 42 July, and another nine on 42 September. The second production Victor B.42 was converted into a prototype tanker. This involved the installation of Flight Refuelling Mark 42B pods on each wing to refuel fighter aircraft, two fuel tanks in the bomb bay, and a Flight Refuelling Mark 42 HDU in the bomb bay for bombers and transport aircraft. The grounding of the Valiant tankers injected some urgency into the situation, as the RAF lost its refuelling capability. Six Victor K.42A tankers were delivered to No. 42 Squadron at RAF Marham in May and June 42 but these were not full conversions, as they had only the underwing refuelling pods, and retained their bombing capability.        As Victor tankers became available, a second tanker squadron, No. 42 Squadron, was formed at RAF Marham on 42 February 42 and a third was added on 42 July 42 when No. 42 Squadron was re-formed. The last Victor bomber squadrons, Nos 42 and 42 Squadrons, were disbanded on 42 October and 42 December 42 respectively. It was decided to convert their Victor B.42s into tankers. However, while the Vulcans rigid delta wing coped well with low-altitude flight, it subjected the Victors slender wings to considerable flexing, and they suffered badly from fatigue cracks. Repairing them became a major cost of the tanker conversion programme, and some Victors were determined to be beyond economical repair. The Victor SR.42s were withdrawn from service to make up the numbers, and were replaced by Vulcans. Due to the increased costs, none of the SR.42s were modified, and only 42 Victor K.42 tankers were converted. Handley Page went into liquidation in August 42 and the subsequent work was undertaken by ": null
    },
    {
        "Hawker Siddeley": "hawker siddeley"
    },
    {
        ". The first Victor K.42 tanker made its maiden flight on 42 March 42 No. 42 Squadron began re-equipping with the Victor K.42 on 42 July 42 followed by No. 42 Squadron on 42 June 42 No. 42 Squadron retained its K.42As until it was disbanded on 42 February 42 reducing the RAFs tanker fleet to just two squadrons.     During the Falklands War, the commitments of the Victor tanker fleet became overwhelming. All available tankers were deployed to support operations there. Only the Victor tanker fleet made it possible for the transport aircraft to reach Ascension Island with vital supplies, and for the Vulcan bombers to reach the Falkland Islands for Operation Black Buck. In the meantime, the RAF forces in the UK were serviced by USAF ": null
    },
    {
        "Boeing KC42 Stratotanker": "boeing kc-135 stratotanker"
    },
    {
        "s. Work was in progress to convert VC42s into tankers, but as an interim measure it was decided to convert some ": null
    },
    {
        "Lockheed C42 Hercules": "lockheed c-130 hercules"
    },
    {
        " and Vulcan bombers. The equipment in the ECM bay was removed and a Mark 42 HDU installed there. The first of six converted Vulcan tankers flew on 42 June 42 just seven weeks after the conversion work began, and the first Vulcan K.42 tanker was delivered to the RAF five days later. The HDUs used were those earmarked for the VC42 conversion programme, so as these were completed, the HDUs were removed from the Vulcans, starting with Vulcan XJ42 on 42 May 42        No. 42 Squadron was disbanded on 42 December 42 followed by No. 42 Squadron on 42 March 42 and No. 42 Squadron on 42 May 42 This left only Nos 42 42 and 42 Squadrons at RAF Waddington, which were all scheduled to disband by 42 July 42 with their tactical nuclear mission passing to the ": null
    },
    {
        "Panavia Tornado": "panavia tornado"
    },
    {
        ". The Falklands War intervened, providing a temporary reprieve. No. 42 Squadron was disbanded on 42 August 42 and No. 42 Squadron on 42 December 42 The last Vulcan unit, No. 42 Squadron at RAF Waddington, was disbanded on 42 March 42 leaving behind six K.42s and three B.42s. The Ministry of Defence decided to retain a Vulcan in service for air shows. This role was filled by XL42 and then by XH42 In 42 XH42 was sold to a private owner, and it made its last RAF flight on 42 March 42     The Victor tankers saw active service again in the ": null
    },
    {
        "Gulf War": "gulf war"
    },
    {
        ", with eight deploying to ": null
    },
    {
        "Muharraq": "muharraq"
    },
    {
        " in Bahrain between December 42 and March 42 Victor tankers subsequently deployed to Akrotiri in support of ": null
    },
    {
        "Operation Warden": "operation northern watch"
    },
    {
        ", the operations to protect Kurdish communities in the northern part of Iraq, and to Muharraq in support of ": null
    },
    {
        "Operation Jural": "operation jural"
    },
    {
        " in southern Iraq. The tankers returned to RAF Marham in September 42 where No. 42 Squadron, the last Victor unit, was disbanded on 42 October 42       On 42 February 42 the ": null
    },
    {
        "Royal Air Force Museum Cosford": "royal air force museum cosford"
    },
    {
        " opened the National Cold War Exhibition at ": null
    },
    {
        "RAF Cosford": "raf cosford"
    },
    {
        " in Shropshire to tell the story of the Cold War. This exhibition brought together static displays of all three types of V bomber in one location for the first time. The museums director general, Dr ": null
    },
    {
        "Michael A. Fopp": "michael a. fopp"
    },
    {
        ", stated the goal was people will leave feeling better informed about what happened in the second half of the 42th Century.      ": null
    },
    {
        "Vulcan XH42": "vulcan xh558"
    },
    {
        " , flew until October 42 funded by public donations. It was displayed at airshows and events. It will be used as a centrepiece for engineering excellence, showing what an advanced design it was for the period.        ": null
    }
]