[
    {
        "             Vere Gordon Childe was an Australian ": null
    },
    {
        "archaeologist": "archaeologist"
    },
    {
        " who specialised in the study of ": null
    },
    {
        "European prehistory": "european prehistory"
    },
    {
        ". He spent most of his life in the United Kingdom, working as an academic for the ": null
    },
    {
        "University of Edinburgh": "university of edinburgh"
    },
    {
        " and then the ": null
    },
    {
        "Institute of Archaeology": "ucl institute of archaeology"
    },
    {
        ", ": null
    },
    {
        "London": "london"
    },
    {
        ", and wrote twenty-six books during his career. Initially an early proponent of ": null
    },
    {
        "culture-historical archaeology": "culture-historical archaeology"
    },
    {
        ", he later became the first exponent of ": null
    },
    {
        "Marxist archaeology": "marxist archaeology"
    },
    {
        " in the Western world.     Born in ": null
    },
    {
        "Sydney": "sydney"
    },
    {
        " to a middle-class English migrant family, Childe studied ": null
    },
    {
        "classics": "classics"
    },
    {
        " at the ": null
    },
    {
        "University of Sydney": "university of sydney"
    },
    {
        " before moving to England to study ": null
    },
    {
        "classical archaeology": "classical archaeology"
    },
    {
        " at the ": null
    },
    {
        "University of Oxford": "university of oxford"
    },
    {
        ". There, he embraced the ": null
    },
    {
        "socialist": "socialist"
    },
    {
        " movement and campaigned against the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ", viewing it as a conflict waged by competing ": null
    },
    {
        "imperialist": "imperialist"
    },
    {
        "s to the detriment of Europes working class. Returning to Australia in 42 he was prevented from working in academia because of his socialist activism, instead working for the ": null
    },
    {
        "Labor Party": "australian labor party"
    },
    {
        " as the private secretary of the politician ": null
    },
    {
        "John Storey": "john storey"
    },
    {
        ". Growing critical of Labor, he wrote an analysis of their policies and joined the far-left ": null
    },
    {
        "Industrial Workers of the World": "industrial workers of the world"
    },
    {
        ". Emigrating to London in 42 he became librarian of the ": null
    },
    {
        "Royal Anthropological Institute": "royal anthropological institute"
    },
    {
        " and journeyed across Europe to pursue his research into the continents prehistory, publishing his findings in academic papers and books. In doing so he introduced the continental European concept of an ": null
    },
    {
        "archaeological culture": "archaeological culture"
    },
    {
        "—the idea that a recurring ": null
    },
    {
        "assemblage of artefacts": "assemblage"
    },
    {
        " demarcates a distinct cultural group—to the British archaeological community.     From 42 to 42 he worked as the Abercromby Professor of Archaeology at the University of Edinburgh, and then from 42 to 42 as the director of the Institute of Archaeology, London. During this period he oversaw the ": null
    },
    {
        "excavation": "excavation"
    },
    {
        " of archaeological sites in Scotland and Northern Ireland, focusing on the society of ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " Orkney": "orkney"
    },
    {
        " by excavating the settlement of ": null
    },
    {
        "Skara Brae": "skara brae"
    },
    {
        " and the ": null
    },
    {
        "chambered tomb": "chambered tomb"
    },
    {
        "s of ": null
    },
    {
        "Maeshowe": "maeshowe"
    },
    {
        " and ": null
    },
    {
        "Quoyness": "quoyness chambered cairn"
    },
    {
        ". In these decades he published prolifically, producing excavation reports, journal articles, and books. With ": null
    },
    {
        "Stuart Piggott": "stuart piggott"
    },
    {
        " and ": null
    },
    {
        "Grahame Clark": "grahame clark"
    },
    {
        " he co-founded ": null
    },
    {
        "The Prehistoric Society": "the prehistoric society"
    },
    {
        " in 42 becoming its first president. Remaining a committed socialist, he embraced ": null
    },
    {
        "Marxism": "marxism"
    },
    {
        ", and—rejecting culture-historical approaches—used ": null
    },
    {
        "Marxist ideas": "historical materialism"
    },
    {
        " as an interpretative framework for archaeological data. He became a sympathiser with the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " and visited the country on several occasions, although he grew sceptical of Soviet foreign policy following the ": null
    },
    {
        "Hungarian Revolution of 42": "hungarian revolution of 1956"
    },
    {
        ". His beliefs resulted in him being legally barred from entering the United States, despite receiving repeated invitations to lecture there. Upon retirement, he returned to Australias ": null
    },
    {
        "Blue Mountains": "blue mountains"
    },
    {
        ", where he committed suicide.     One of the best-known and most widely cited archaeologists of the twentieth century, Childe became known as the great synthesizer for his work integrating regional research with a broader picture of Near Eastern and European prehistory. He was also renowned for his emphasis on the role of revolutionary technological and economic developments in human society, such as the ": null
    },
    {
        "Neolithic Revolution": "neolithic revolution"
    },
    {
        " and the ": null
    },
    {
        "Urban Revolution": "urban revolution"
    },
    {
        ", reflecting the influence of Marxist ideas concerning societal development. Although many of his interpretations have since been discredited, he remains widely respected among archaeologists.           Childe was born on 42 April 42 in Sydney. He was the only surviving child of the Reverend Stephen Henry Childe and Harriet Eliza , a middle-class couple of ": null
    },
    {
        "English descent": "english australians"
    },
    {
        ". The son of an ": null
    },
    {
        "Anglican": "anglican"
    },
    {
        " priest, Stephen Childe was ordained into the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        " in 42 after gaining a BA from the ": null
    },
    {
        "University of Cambridge": "university of cambridge"
    },
    {
        ". Becoming a teacher, in 42 he married Mary Ellen Latchford, with whom he had five children. They moved to Australia in 42 where Mary died. In 42 Stephen married Harriet, an Englishwoman from a wealthy background who had moved to Australia as a child. Gordon Childe was raised alongside five half-siblings at his fathers palatial country house, the Chalet Fontenelle, in the township of ": null
    },
    {
        "Wentworth Falls": "wentworth falls, new south wales"
    },
    {
        " in the ": null
    },
    {
        "Blue Mountains": "blue mountains"
    },
    {
        ", west of Sydney. Reverend Stephen Childe worked as the minister for St. Thomas Parish, but proved unpopular, arguing with his congregation and taking unscheduled holidays.     A sickly child, Gordon Childe was educated at home for several years, before receiving a private-school education in ": null
    },
    {
        "North Sydney": "north sydney, new south wales"
    },
    {
        ". In 42 he began attending ": null
    },
    {
        "Sydney Church of England Grammar School": "sydney church of england grammar school"
    },
    {
        ", gaining his Junior Matriculation in 42 and Senior Matriculation in 42 At school he studied ancient history, French, Greek, Latin, geometry, algebra, and trigonometry, achieving good marks in all subjects, but he was bullied because of his physical appearance and unathletic physique. In July 42 his mother died; his father soon remarried. Childes relationship with his father was strained, particularly following his mothers death, and they disagreed on religion and politics: the Reverend was a devout Christian and ": null
    },
    {
        "conservative": "social conservatism"
    },
    {
        " while his son was an ": null
    },
    {
        "atheist": "atheist"
    },
    {
        " and ": null
    },
    {
        "socialist": "socialist"
    },
    {
        ".       Childe studied for a degree in ": null
    },
    {
        "classics": "classics"
    },
    {
        " at the University of Sydney in 42; although focusing on written sources, he first came across ": null
    },
    {
        "classical archaeology": "classical archaeology"
    },
    {
        " through the work of the archaeologists ": null
    },
    {
        "Heinrich Schliemann": "heinrich schliemann"
    },
    {
        " and ": null
    },
    {
        "Arthur Evans": "arthur evans"
    },
    {
        ". At university, he became an active member of the ": null
    },
    {
        "debating society": "debating society"
    },
    {
        ", at one point arguing in favour of the proposition that socialism is desirable . Increasingly interested in socialism, he read the works of ": null
    },
    {
        "Karl Marx": "karl marx"
    },
    {
        " and ": null
    },
    {
        "Friedrich Engels": "friedrich engels"
    },
    {
        ", as well as those of the philosopher ": null
    },
    {
        "G. W. F. Hegel": "georg wilhelm friedrich hegel"
    },
    {
        ", whose ": null
    },
    {
        "dialectics": "dialectics"
    },
    {
        " heavily influenced ": null
    },
    {
        "Marxist theory": "marxist theory"
    },
    {
        ". At university, he became a great friend of fellow undergraduate and future judge and politician ": null
    },
    {
        "Herbert Vere Evatt": "herbert vere evatt"
    },
    {
        ", with whom he remained in lifelong contact. Ending his studies in 42 Childe graduated the following year with various honours and prizes, including Professor ": null
    },
    {
        "Francis Anderson": "francis anderson"
    },
    {
        "s prize for philosophy.          Wishing to continue his education, he gained a £42 Cooper Graduate Scholarship in Classics, allowing him to pay the tuition fees at ": null
    },
    {
        "Queens College": "the queens college, oxford"
    },
    {
        ", part of the ": null
    },
    {
        "University of Oxford": "university of oxford"
    },
    {
        ", England. He set sail for Britain aboard the ": null
    },
    {
        "SS Orsova": "ss orsova"
    },
    {
        " in August 42 shortly after the outbreak of ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". At Queens, Childe was entered for a diploma in classical archaeology followed by a ": null
    },
    {
        "Literae Humaniores": "literae humaniores"
    },
    {
        " degree, although he never completed the former. Whilst there, he studied under ": null
    },
    {
        "John Beazley": "john beazley"
    },
    {
        " and Arthur Evans, the latter being Childes supervisor. In 42 he published his first ": null
    },
    {
        "academic paper": "academic paper"
    },
    {
        ", On the Date and Origin of ": null
    },
    {
        "Minyan Ware": "minyan ware"
    },
    {
        " , in the  Journal of Hellenic Studies , and the following year produced his B.Litt. thesis, The Influence of Indo-Europeans in Prehistoric Greece , displaying his interest in combining philological and archaeological evidence.     At Oxford he became actively involved with the socialist movement, antagonising the conservative university authorities. Becoming a noted member of the left-wing ": null
    },
    {
        "reformist": "reformism"
    },
    {
        " Oxford University Fabian Society, he was there in 42 when it changed its name to the Oxford University Socialist Society, following a split from the ": null
    },
    {
        "Fabian Society": "fabian society"
    },
    {
        ". His best friend and flatmate was ": null
    },
    {
        "Rajani Palme Dutt": "rajani palme dutt"
    },
    {
        ", a fervent socialist and Marxist. The pair often got drunk and tested each others knowledge about classical history late at night. With Britain in the midst of World War I, many socialists refused to fight for the British Army despite the ": null
    },
    {
        "government-imposed conscription": "recruitment to the british army during the first world warconscription"
    },
    {
        ". They believed that the ruling classes of Europes ": null
    },
    {
        "imperialist": "imperialism"
    },
    {
        " nations were waging the war for their own interests at the expense of the working classes; these socialists thought that ": null
    },
    {
        "class war": "class conflict"
    },
    {
        " was the only conflict they should be concerned with. Dutt was imprisoned for refusing to fight, and Childe campaigned for the release of both him and other socialists and pacifist ": null
    },
    {
        "conscientious objectors": "conscientious objectors"
    },
    {
        ". Childe was never required to enlist in the army, most likely because of his poor health and eyesight. His anti-war sentiments concerned the authorities; the intelligence agency ": null
    },
    {
        "MI42": "mi5"
    },
    {
        " opening a file on him, his mail was intercepted, and he was kept under observation.              Childe returned to Australia in August 42 As a known socialist agitator, he was placed under surveillance by the security services, who intercepted his mail. In 42 he became senior resident tutor at ": null
    },
    {
        "St Andrews College, Sydney University": "st andrews college, sydney"
    },
    {
        ", joining Sydneys socialist and anti-conscription movement. In Easter 42 he spoke at the Third Inter-State Peace Conference, an event organised by the Australian Union of Democratic Control for the Avoidance of War, a group opposed to Prime Minister ": null
    },
    {
        "Billy Hughes": "billy hughes"
    },
    {
        "s plans to introduce conscription. The conference had a prominent socialist emphasis; its report argued that the best hope to end international war was the abolition of the Capitalist System . News of Childes participation reached the Principal of St Andrews College, who forced Childe to resign despite much opposition from staff.     Staff members secured him work as a tutor in ancient history in the Department of Tutorial Classes, but the university chancellor ": null
    },
    {
        "William Cullen": "william portus cullen"
    },
    {
        " feared that he would promote socialism to students and fired him. The leftist community condemned this as an infringement of Childes ": null
    },
    {
        "civil rights": "civil rights"
    },
    {
        ", and the centre-left politicians ": null
    },
    {
        "William McKell": "william mckell"
    },
    {
        " and T.J. Smith raised the issue in the ": null
    },
    {
        "Parliament of Australia": "parliament of australia"
    },
    {
        ". Moving to ": null
    },
    {
        "Maryborough": "maryborough, queensland"
    },
    {
        ", Queensland, in October 42 Childe took up employment teaching Latin at the ": null
    },
    {
        "Maryborough Grammar School": "maryborough state high school"
    },
    {
        ". Here, too, his political affiliations became known, and he was subject to an opposition campaign from local conservative groups and the Maryborough Chronicle, resulting in abuse from some pupils. He soon resigned.     Realising he would be barred from an academic career by the university authorities, Childe sought employment within the leftist movement. In August 42 he became private secretary and speech writer to the politician ": null
    },
    {
        "John Storey": "john storey"
    },
    {
        ", a prominent member of the centre-left ": null
    },
    {
        "Labor Party": "australian labor party"
    },
    {
        " then in opposition to New South Wales ": null
    },
    {
        "Nationalist Party": "nationalist party"
    },
    {
        " government. Representing the Sydney suburb of ": null
    },
    {
        "Balmain": "electoral district of balmain"
    },
    {
        " on the ": null
    },
    {
        "New South Wales Legislative Assembly": "new south wales legislative assembly"
    },
    {
        ", Storey became ": null
    },
    {
        "state premier": "premiers of the australian states"
    },
    {
        " in 42 when Labor achieved electoral victory. Working within the Labor Party allowed Childe greater insight into its workings; the deeper his involvement, the more he became critical of Labor, believing that once in political office they betrayed their socialist ideals and moved to a centrist, pro-capitalist stance. He joined the radical leftist ": null
    },
    {
        "Industrial Workers of the World": "industrial workers of the world"
    },
    {
        ", which at the time was banned in Australia. In 42 Storey sent Childe to London to keep the British press updated about developments in New South Wales, but Storey died in December and an ensuing New South Wales election restored a Nationalist government under ": null
    },
    {
        "George Fuller": "george fuller"
    },
    {
        "s premiership. Fuller thought Childes job unnecessary, and in early 42 terminated his employment.       Unable to find an academic job in Australia, Childe remained in Britain, renting a room in ": null
    },
    {
        "Bloomsbury": "bloomsbury"
    },
    {
        ", ": null
    },
    {
        "Central London": "central london"
    },
    {
        ", and spending much time studying at the ": null
    },
    {
        "British Museum": "british museum"
    },
    {
        " and the ": null
    },
    {
        "Royal Anthropological Institute": "royal anthropological institute"
    },
    {
        " library. An active member of Londons socialist movement, he associated with leftists at the ": null
    },
    {
        "42 Club": "1917 club"
    },
    {
        " in ": null
    },
    {
        "Gerrard Street": "gerrard street, london"
    },
    {
        ", ": null
    },
    {
        "Soho": "soho"
    },
    {
        ". He befriended members of the Marxist ": null
    },
    {
        "Communist Party of Great Britain": "communist party of great britain"
    },
    {
        " and contributed to their publication,  Labour Monthly , but had not yet openly embraced Marxism. Having earned a good reputation as a prehistorian, he was invited to other parts of Europe to study prehistoric artefacts. In 42 he travelled to ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ", Austria to examine unpublished material about the ": null
    },
    {
        "painted Neolithic pottery": "cucuteni–trypillia culture"
    },
    {
        " from ": null
    },
    {
        "Schipenitz": "schipenitz"
    },
    {
        ", ": null
    },
    {
        "Bukovina": "bukovina"
    },
    {
        " held in the Prehistoric Department of the ": null
    },
    {
        "Natural History Museum": "naturhistorisches museum"
    },
    {
        "; he published his findings in the 42 volume of the  Journal of the Royal Anthropological Institute . Childe used this excursion to visit museums in Czechoslovakia and Hungary, bringing them to the attention of British archaeologists in a 42 article in  Man . After returning to London, in 42 Childe became a private secretary for three ": null
    },
    {
        "Members of Parliament": "member of parliament"
    },
    {
        ", including ": null
    },
    {
        "John Hope Simpson": "john hope simpson"
    },
    {
        " and ": null
    },
    {
        "Frank Gray": "frank gray"
    },
    {
        ", both members of the centre-left ": null
    },
    {
        "Liberal Party": "liberal party"
    },
    {
        ". Supplementing this income, Childe worked as a translator for the publishers ": null
    },
    {
        "Kegan Paul, Trench, Trübner & Co.": "kegan paul, trench, trübner  &  co."
    },
    {
        " and occasionally lectured in prehistory at the ": null
    },
    {
        "London School of Economics": "london school of economics"
    },
    {
        ".          In 42 the London Labour Company published his first book, How Labour Governs. Examining the Australian Labor Party and its connections to the ": null
    },
    {
        "Australian labour movement": "australian labour movement"
    },
    {
        ", it reflects Childes disillusionment with the party, arguing that once elected, its politicians abandoned their socialist ideals in favour of personal comfort. Childes biographer Sally Green noted that How Labour Governs was of particular significance at the time because it was published just as the British ": null
    },
    {
        "Labour Party": "labour party"
    },
    {
        " was emerging as a major player in British politics, threatening the two-party dominance of the ": null
    },
    {
        "Conservatives": "conservative party"
    },
    {
        " and Liberals; ": null
    },
    {
        "in 42": "1923 united kingdom general election"
    },
    {
        " Labour formed ": null
    },
    {
        "their first government": "first macdonald ministry"
    },
    {
        ". Childe planned a sequel expanding on his ideas, but it was never published.     In May 42 he visited the museums in ": null
    },
    {
        "Lausanne": "lausanne"
    },
    {
        ", ": null
    },
    {
        "Bern": "bern"
    },
    {
        ", and ": null
    },
    {
        "Zürich": "zürich"
    },
    {
        " to study their prehistoric artefact collections; that year he became a member of the Royal Anthropological Institute. In 42 he became the Institutes librarian, one of the only archaeological jobs available in Britain, through which he cementing connections with scholars across Europe. His job made him well known in Britains small archaeological community; he developed a great friendship with ": null
    },
    {
        "O. G. S. Crawford": "o. g. s. crawford"
    },
    {
        ", the archaeological officer to the ": null
    },
    {
        "Ordnance Survey": "ordnance survey"
    },
    {
        ", influencing Crawfords move toward socialism and Marxism.     In 42 Kegan Paul, Trench, Trübner & Co published Childes second book, The Dawn of European Civilisation, in which he synthesised the data about European prehistory that he had been exploring for several years. An important work, it was released when there were few professional archaeologists across Europe and most museums focused on their locality; The Dawn was a rare example that looked at the larger picture across the continent. Its importance was also due to the fact that it introduced the concept of the ": null
    },
    {
        "archaeological culture": "archaeological culture"
    },
    {
        " into Britain from continental scholarship, thereby aiding in the development of ": null
    },
    {
        "culture-historical archaeology": "culture-historical archaeology"
    },
    {
        ". Childe later stated that the book aimed at distilling from archaeological remains a preliterate substitute for the conventional politico-military history with cultures, instead of statesmen, as actors, and migrations in place of battles.  In 42 he published a successor, The Aryans: A Study of Indo-European Origins, exploring the theory that ": null
    },
    {
        "civilisation diffused northward and westward into Europe": "indo-european migrations"
    },
    {
        " from the Near East via an ": null
    },
    {
        "Indo-European linguistic group": "indo-european linguistic group"
    },
    {
        " known as the ": null
    },
    {
        "Aryans": "indo-iranian peoples"
    },
    {
        "; with the ensuing racial use of the term Aryan by the German ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        ", Childe avoided mention of the book. In these works, Childe accepted a moderate version of ": null
    },
    {
        "diffusionism": "diffusionism"
    },
    {
        ", the idea that cultural developments diffuse from one place to others, rather than being independently developed in many places. In contrast to the hyper-diffusionism of ": null
    },
    {
        "Grafton Elliot Smith": "grafton elliot smith"
    },
    {
        ", Childe suggested that although most cultural traits spread from one society to another, it was possible for the same traits to develop independently in different places.                  In 42 Scotlands ": null
    },
    {
        "University of Edinburgh": "university of edinburgh"
    },
    {
        " offered Childe the post of Abercromby Professor of Archaeology, a new position established in the bequest of the prehistorian ": null
    },
    {
        "Lord Abercromby": "john abercromby, 5th baron abercromby"
    },
    {
        ". Although sad to leave London, Childe took the job, moving to ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        " in September 42 Aged 42 Childe became the only academic prehistorian in a teaching post in Scotland . Many Scottish archaeologists disliked Childe, regarding him as an outsider with no specialism in Scottish prehistory; he wrote to a friend that I live here in an atmosphere of hatred and envy.  He nevertheless made friends in Edinburgh, including archaeologists like ": null
    },
    {
        "W. Lindsay Scott": "w. lindsay scott"
    },
    {
        ", ": null
    },
    {
        "Alexander Curle": "alexander curle"
    },
    {
        ", ": null
    },
    {
        "J. G. Callender": "j. g. callender"
    },
    {
        ", and ": null
    },
    {
        "Walter Grant": "walter grant"
    },
    {
        ", as well as non-archaeologists like the physicist ": null
    },
    {
        "Charles Galton Darwin": "charles galton darwin"
    },
    {
        ", becoming godfather to Darwins youngest son. Initially lodging at ": null
    },
    {
        "Liberton": "liberton, scotland"
    },
    {
        ", he moved into the semi-residential Hotel de Vere on Eglington Crescent.     At Edinburgh University, Childe focused on research rather than teaching. He was reportedly kind to his students but had difficulty talking to large audiences; many students were confused that his ": null
    },
    {
        "BSc": "bsc"
    },
    {
        " degree course in archaeology was structured counter-chronologically, dealing with the more recent ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        " first before progressing backward to the ": null
    },
    {
        "Palaeolithic": "palaeolithic"
    },
    {
        ". Founding the Edinburgh League of Prehistorians, he took his more enthusiastic students on excavations and invited guest lecturers to visit. An early proponent of ": null
    },
    {
        "experimental archaeology": "experimental archaeology"
    },
    {
        ", he involved his students in his experiments; in 42 he used this method to investigate the ": null
    },
    {
        "vitrification process evident at several Iron Age forts": "vitrified fort"
    },
    {
        " in northern Britain.     Childe regularly travelled to London to visit friends, among whom was ": null
    },
    {
        "Stuart Piggott": "stuart piggott"
    },
    {
        ", another influential British archaeologist who succeeded Childe as Edinburghs Abercromby Professor. Another friend was ": null
    },
    {
        "Grahame Clark": "grahame clark"
    },
    {
        ", whom Childe befriended and encouraged in his research. The trio were elected onto the committee of the Prehistoric Society of East Anglia. At Clarks suggestion, in 42 they used their influence to convert it into a nationwide organisation, the ": null
    },
    {
        "Prehistoric Society": "prehistoric society"
    },
    {
        ", of which Childe was elected president. Membership of the group grew rapidly; in 42 it had 42 members and by 42 it had 42     Childe spent much time in continental Europe and attended many conferences there, having learned several European languages. In 42 he first visited the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ", spending 42 days in ": null
    },
    {
        "Leningrad": "leningrad"
    },
    {
        " and ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        "; impressed with the ": null
    },
    {
        "socialist state": "socialist state"
    },
    {
        ", he was particularly interested in the social role of Soviet archaeology. Returning to Britain, he became a vocal Soviet sympathiser and avidly read the CPGBs  Daily Worker , although was heavily critical of certain Soviet policies, particularly the ": null
    },
    {
        "Molotov–Ribbentrop Pact": "molotov–ribbentrop pact"
    },
    {
        " with ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ". His socialist convictions led to an early denunciation of European ": null
    },
    {
        "fascism": "fascism"
    },
    {
        ", and he was outraged by the ": null
    },
    {
        "Nazi co-option of prehistoric archaeology": "ahnenerbe"
    },
    {
        " to glorify their own conceptions of an Aryan racial heritage. Supportive of the British governments decision to fight the fascist powers in the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ", he thought it probable that he was ": null
    },
    {
        "on a Nazi blacklist": "the black book"
    },
    {
        " and made the decision to drown himself in a canal should the Nazis conquer Britain. Though opposing fascist Germany and Italy, he also criticised the imperialist, capitalist governments of the United Kingdom and United States: he repeatedly described the latter as being full of loathsome fascist hyenas . This did not prevent him from visiting the U.S. In 42 he addressed a Conference of Arts and Sciences marking the tercentenary of ": null
    },
    {
        "Harvard University": "harvard university"
    },
    {
        "; there, the university awarded him an ": null
    },
    {
        "honorary": "honorary degree"
    },
    {
        " Doctor of Letters": "doctor of letters"
    },
    {
        " degree. He returned in 42 lecturing at Harvard, the ": null
    },
    {
        "University of California, Berkeley": "university of california, berkeley"
    },
    {
        ", and the ": null
    },
    {
        "University of Pennsylvania": "university of pennsylvania"
    },
    {
        ".            Childes university position meant that he was obliged to undertake archaeological excavations, something he loathed and believed he did poorly. Students agreed, but recognised his genius for interpreting evidence . Unlike many contemporaries, he was scrupulous with writing up and publishing his findings, producing almost annual reports for the  Proceedings of the Society of Antiquaries of Scotland  and, unusually, ensuring that he acknowledged the help of every digger.     His best known excavation was undertaken from 42 to 42 at ": null
    },
    {
        "Skara Brae": "skara brae"
    },
    {
        " in the ": null
    },
    {
        "Orkney Islands": "orkney islands"
    },
    {
        ". Having uncovered a well-preserved Neolithic village, in 42 he published the excavation results in a book titled Skara Brae. He made an error of interpretation, erroneously attributing the site to the Iron Age. During the excavation, Childe got on particularly well with the locals; for them, he was every inch the professor because of his eccentric appearance and habits. In 42 Childe, collaborating with the ": null
    },
    {
        "anthropologist": "anthropologist"
    },
    {
        " C. Daryll Forde": "c. daryll forde"
    },
    {
        ", excavated two Iron Age ": null
    },
    {
        "hillfort": "hillfort"
    },
    {
        "s at ": null
    },
    {
        "Earns Hugh": "earns hugh"
    },
    {
        " on the ": null
    },
    {
        "Berwickshire": "berwickshire"
    },
    {
        " coast, while in June 42 he excavated a ": null
    },
    {
        "promontory fort": "promontory fort"
    },
    {
        " at ": null
    },
    {
        "Larriban": "larriban"
    },
    {
        " near to ": null
    },
    {
        "Knocksoghey": "knocksoghey"
    },
    {
        " in Northern Ireland. Together with Wallace Thorneycroft, another Fellow of the Society of Antiquaries of Scotland, Childe excavated two vitrified Iron Age forts in Scotland, at ": null
    },
    {
        "Finavon": "finavon"
    },
    {
        ", ": null
    },
    {
        "Angus": "angus, scotland"
    },
    {
        " and at ": null
    },
    {
        "Rahoy": "rahoy"
    },
    {
        ", ": null
    },
    {
        "Argyllshire": "argyllshire"
    },
    {
        " . In 42 he and Walter Grant oversaw excavations at the Neolithic settlement of ": null
    },
    {
        "Rinyo": "rinyo"
    },
    {
        "; their investigation ceased during the Second World War, but resumed in 42       Childe continued writing and publishing books on archaeology, beginning with a series of works following on from The Dawn of European Civilisation and The Aryans by compiling and synthesising data from across Europe. First was The Most Ancient Near East , which assembled information from across Mesopotamia and India, setting a background from which the spread of farming and other technologies into Europe could be understood. This was followed by The Danube in Prehistory which examined the archaeology along the ": null
    },
    {
        "Danube": "danube"
    },
    {
        " river, recognising it as the natural boundary dividing the Near East from Europe; Childe believed it was via the Danube that new technologies travelled westward. Although Childe had used culture-historical approaches in earlier publications, The Danube in Prehistory was his first publication to provide a specific definition of the concept of an ": null
    },
    {
        "archaeological culture": "archaeological culture"
    },
    {
        ", revolutionising the theoretical approach of British archaeology.          Childes next book, The Bronze Age , dealt with the ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " in Europe, and displayed his increasing adoption of Marxist theory as a means of understanding how society functioned and changed. He believed that metal was the first indispensable article of commerce, and that metal-smiths were therefore full-time professionals who lived off the ": null
    },
    {
        "social surplus": "social surplus"
    },
    {
        ". In 42 Childe travelled to Asia, visiting Iraq—a place he thought great fun —and India, which he felt was detestable due to the hot weather and extreme poverty. Touring archaeological sites in the two countries, he opined that much of what he had written in The Most Ancient Near East was outdated, going on to produce New Light on the Most Ancient Near East , in which he applied his Marxist-influenced ideas about the economy to his conclusions.     After publishing Prehistory of Scotland , Childe produced one of the defining books of his career, Man Makes Himself . Influenced by Marxist views of history, Childe argued that the usual distinction between prehistory and history was a false dichotomy and that human society has progressed through a series of technological, economic, and social revolutions. These included the ": null
    },
    {
        "Neolithic Revolution": "neolithic revolution"
    },
    {
        ", when hunter-gatherers began settling in permanent farming communities, through to the ": null
    },
    {
        "Urban Revolution": "urban revolution"
    },
    {
        ", when society moved from small towns to the first cities, and up to more recent times, when the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        " changed the nature of production.     After the outbreak of the Second World War, Childe was unable to travel across Europe, instead focusing on writing Prehistoric Communities of the British Isles . Childes pessimism regarding the wars outcome led him to believe that European Civilization—Capitalist and ": null
    },
    {
        "Stalinist": "stalinist"
    },
    {
        " alike—was irrevocably headed for a Dark Age.  In this state of mind he produced a sequel to Man Makes Himself titled What Happened in History , an account of human history from the Palaeolithic through to the fall of the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ". Although ": null
    },
    {
        "Oxford University Press": "oxford university press"
    },
    {
        " offered to publish the work, he released it through ": null
    },
    {
        "Penguin Books": "penguin books"
    },
    {
        " because they could sell it at a cheaper price, something he believed pivotal in providing knowledge for those he called the masses . This was followed by two short works, Progress and Archaeology and The Story of Tools , the latter an explicitly Marxist text written for the ": null
    },
    {
        "Young Communist League": "young communist league"
    },
    {
        ".            In 42 Childe left Edinburgh to take up the position as director and professor of European prehistory at the ": null
    },
    {
        "Institute of Archaeology": "ucl institute of archaeology"
    },
    {
        " in London. Anxious to return to the capital, he had kept silent over his disapproval of government policies so that he would not be prevented from getting the job. He took up residence in the ": null
    },
    {
        "Isokon building": "isokon building"
    },
    {
        " near to ": null
    },
    {
        "Hampstead": "hampstead"
    },
    {
        ".     Located in ": null
    },
    {
        "St Johns Lodge": "st johns lodge, london"
    },
    {
        " in the Inner Circle of ": null
    },
    {
        "Regents Park": "regents park"
    },
    {
        ", the IOA was founded in 42 largely by the archaeologist ": null
    },
    {
        "Mortimer Wheeler": "mortimer wheeler"
    },
    {
        ", but until 42 relied primarily on volunteer lecturers. Childes relationship with the conservative Wheeler was strained, for their personalities were very different; Wheeler was an extrovert who pursued the limelight, was an efficient administrator, and was intolerant of others shortcomings, while Childe lacked administrative skill, and was tolerant of others. Childe was popular among the Institutes students, who saw him as a kindly eccentric; they commissioned a bust of Childe from ": null
    },
    {
        "Marjorie Maitland Howard": "marjorie maitland howard"
    },
    {
        ". His lecturing was nevertheless considered poor, as he often mumbled and walked into an adjacent room to find something while continuing to talk. He further confused his students by referring to the socialist states of eastern Europe by their full official titles, and by referring to towns by their Slavonic names rather than the names with which they were better known in English. He was deemed better at giving tutorials and seminars, where he devoted more time to interacting with his students. As Director, Childe was not obliged to excavate, though he did undertake projects at the Orkney Neolithic burial tombs of ": null
    },
    {
        "Quoyness": "quoyness"
    },
    {
        " and ": null
    },
    {
        "Maes Howe": "maes howe"
    },
    {
        " .     In 42 he and Crawford resigned as fellows of the ": null
    },
    {
        "Society of Antiquaries": "society of antiquaries of london"
    },
    {
        ". They did so to protest the selection of ": null
    },
    {
        "James Mann": "james mann"
    },
    {
        "—keeper of the ": null
    },
    {
        "Tower of London": "tower of london"
    },
    {
        "s armouries—as the societys president, believing that Wheeler, a professional archaeologist, was a better choice. Childe joined the editorial board of the periodical  Past & Present , founded by Marxist historians in 42 During the early 42s, he also became a board member for  The Modern Quarterly —later The Marxist Quarterly—working alongside the boards chairman Rajani Palme Dutt, his best friend and flatmate from his Oxford days. He authored occasional articles for Palme Dutts socialist journal, the  Labour Monthly , but disagreed with him over the ": null
    },
    {
        "Hungarian Revolution of 42": "hungarian revolution of 1956"
    },
    {
        "; Palme Dutt defended the Soviet Unions decision to quash the revolution using military force, but Childe, like many Western socialists, strongly opposed it. The event made Childe abandon faith in the Soviet leadership, but not in socialism or Marxism. He retained a love of the Soviet Union, having visiting on multiple occasions; he was also involved with a CPBG satellite body, the Society for Cultural Relations with the USSR, and served as president of its National History and Archaeology Section from the early 42s until his death.     In April 42 Childe was awarded the Gold Medal of the Society of Antiquaries for his services to archaeology. He was invited to lecture in the United States on multiple occasions, by ": null
    },
    {
        "Robert Braidwood": "robert braidwood"
    },
    {
        ", ": null
    },
    {
        "William Duncan Strong": "william duncan strong"
    },
    {
        ", and ": null
    },
    {
        "Leslie White": "leslie white"
    },
    {
        ", but the ": null
    },
    {
        "U.S. State Department": "u.s. state department"
    },
    {
        " barred him from entering the country due to his Marxist beliefs. Whilst working at the institute, Childe continued writing and publishing books dealing with archaeology. History promoted a Marxist view of the past and reaffirmed Childes belief that prehistory and literate history must be viewed together, whilst Prehistoric Migrations displayed his views on moderate diffusionism. In 42 he also published a paper in the  Southwestern Journal of Anthropology . This was Archaeology and Anthropology , which argued that the disciplines of archaeology and anthropology should be used in tandem, an approach that would be widely accepted in the decades following his death.       In the summer of 42 Childe retired as IOA director a year prematurely. European archaeology had rapidly expanded during the 42s, leading to increasing specialisation and making the synthesising that Childe was known for increasingly difficult. That year, the Institute was moving to ": null
    },
    {
        "Gordon Square": "gordon square"
    },
    {
        ", Bloomsbury, and Childe wanted to give his successor, ": null
    },
    {
        "W.F. Grimes": "w.f. grimes"
    },
    {
        ", a fresh start in the new surroundings. To commemorate his achievements, the  Proceedings of the Prehistoric Society  published a  Festschrift  edition on the last day of his directorship containing contributions from friends and colleagues from all over the world, something that touched Childe deeply. Upon his retirement, he told many friends that he planned to return to Australia, visit his relatives, and commit suicide; he was terrified of becoming old, senile, and a burden on society, and suspected he had ": null
    },
    {
        "cancer": "cancer"
    },
    {
        ". Subsequent commentators suggested that a core reason for his suicidal desires was a loss of faith in Marxism following the Hungarian Revolution and ": null
    },
    {
        "Nikita Khrushchev": "nikita khrushchev"
    },
    {
        "s ": null
    },
    {
        "denouncement of Joseph Stalin": "on the personality cult and its consequences"
    },
    {
        ", although ": null
    },
    {
        "Bruce Trigger": "bruce trigger"
    },
    {
        " dismissed this explanation, noting that while Childe was critical of Soviet foreign policy, he never saw the state and Marxism as synonymous.          Sorting out his affairs, Childe donated most of his library and all of his estate to the Institute. After a February 42 holiday visiting archaeological sites in Gibraltar and Spain, he sailed to Australia, reaching Sydney on his 42th birthday. Here, the University of Sydney, which had once barred him from working there, awarded him an honorary degree. He travelled around the country for six months, visiting family members and old friends, but was unimpressed by Australian society, believing it reactionary, increasingly suburban, and poorly educated. Looking into Australian prehistory, he found it a profitable field for research, and lectured to archaeological and leftist groups on this and other topics, taking to Australian radio to criticise academic racism towards ": null
    },
    {
        "Indigenous Australians": "indigenous australians"
    },
    {
        ".     Writing personal letters to many friends, he sent one to Grimes, requesting that it not be opened until 42 In it, he described how he feared old age, and stated his intention to take his own life, remarking that Life ends best when one is happy and strong.  On 42 October 42 Childe went to the area of Govetts Leap in ": null
    },
    {
        "Blackheath": "blackheath, new south wales"
    },
    {
        ", an area of the Blue Mountains where he had grown up. Leaving his hat, spectacles, compass, pipe, and Mackintosh atop the cliffs, he fell 42 feet to his death. A coroner ruled his death as accidental, but his death was recognised as suicide when his letter to Grimes was published in the 42s. His remains were cremated at the ": null
    },
    {
        "Northern Suburbs Crematorium": "northern suburbs crematorium"
    },
    {
        ", and his name added to a small family plaque in the Crematorium Gardens. Following his death, an unprecedented level of tributes and memorials were issued by the archaeological community, all, according to Ruth Tringham, testifying to his status as Europes greatest prehistorian and a wonderful human being .              The biographer Sally Green noted that Childes beliefs were never dogmatic, always idiosyncratic and continually changing throughout his life .   His ": null
    },
    {
        "theoretical approach": "archaeological theory"
    },
    {
        " blended together ": null
    },
    {
        "Marxism": "marxism"
    },
    {
        ", ": null
    },
    {
        "diffusionism": "diffusionism"
    },
    {
        ", and ": null
    },
    {
        "functionalism": "structural functionalism"
    },
    {
        ". Childe was critical of the ": null
    },
    {
        "evolutionary archaeology": "evolutionary archaeology"
    },
    {
        " dominant during the nineteenth century. He believed that archaeologists who adhered to it placed a greater emphasis on artefacts than on the humans who had made them. Like most archaeologists in Western Europe and the United States at the time, Childe did not regard humans as naturally inventive or inclined to change; thus, he tended to perceive social change in terms of diffusion and migration rather than internal development or cultural evolution.     During the decades in which Childe was working, most archaeologists adhered to the ": null
    },
    {
        "three-age system": "three-age system"
    },
    {
        " first developed by the Danish antiquarian ": null
    },
    {
        "Christian Jürgensen Thomsen": "christian jürgensen thomsen"
    },
    {
        ". This system rested upon an evolutionary chronology that divided prehistory into the ": null
    },
    {
        "Stone Age": "stone age"
    },
    {
        ", ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        ", and ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        ", but Childe highlighted that many of the worlds societies were still effectively Stone Age in their technology. He nevertheless saw it as a useful model for analysing socio-economic development when combined with a Marxist framework. He therefore used technological criteria for dividing up prehistory into three ages, but instead used economic criteria for sub-dividing the Stone Age into the ": null
    },
    {
        "Palaeolithic": "palaeolithic"
    },
    {
        " and ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        ", rejecting the concept of the ": null
    },
    {
        "Mesolithic": "mesolithic"
    },
    {
        " as useless. Informally, he adopted the division of past societies into the framework of savagery , barbarism , and civilisation that Engels had employed.         In the early part of his career, Childe was a proponent of the ": null
    },
    {
        "culture-historical approach to archaeology": "culture-historical archaeology"
    },
    {
        ", coming to be seen as one of its founders and chief exponents . Culture-historical archaeology revolved around the concept of ": null
    },
    {
        "culture": "archaeological culture"
    },
    {
        " , which it had adopted from anthropology. This was a major turning point in the history of the discipline , allowing archaeologists to look at the past through a spatial dynamic rather than a temporal one. Childe adopted the concept of culture from the German philologist and archaeologist ": null
    },
    {
        "Gustaf Kossinna": "gustaf kossinna"
    },
    {
        ", although this influence might have been mediated through ": null
    },
    {
        "Leon Kozłowski": "leon kozłowski"
    },
    {
        ", a Polish archaeologist who had adopted Kossinas ideas and who had a close association with Childe. Trigger expressed the view that while adopting Kossinas basic concept, Childe displayed no awareness of the racist connotations that Kossina had given it.     Childes adherence to the culture-historical model is apparent in three of his books—The Dawn of European Civilisation , The Aryans and The Most Ancient East —but in none of these does he define what he means by culture . Only later, in The Danube in Prehistory , did Childe give culture a specifically archaeological definition. In this book, he defined a culture as a set of regularly associated traits in the ": null
    },
    {
        "material culture": "material culture"
    },
    {
        "—i.e. pots, implements, ornaments, burial rites, house forms —that recur across a given area. He stated that in this respect a culture was the archaeological equivalent of a people . Childes use of the term was non-racial; he considered a people to be a social grouping, not a biological race. He opposed the equation of archaeological cultures with biological races—as various nationalists across Europe were doing at the time—and vociferously criticised Nazi uses of archaeology, arguing that the Jewish people were not a distinct biological race but a socio-cultural grouping. In 42 he suggested that culture worked as a living functioning organism and emphasised the adaptive potential of material culture; in this he was influenced by anthropological ": null
    },
    {
        "functionalism": "structural functionalism"
    },
    {
        ". Childe accepted that archaeologists defined cultures based on a subjective selection of material criteria; this view was later widely adopted by archaeologists like ": null
    },
    {
        "Colin Renfrew": "colin renfrew"
    },
    {
        ".     Later in his career, Childe tired of culture-historical archaeology. By the late 42s he was questioning the utility of culture as an archaeological concept and thus the basic validity of the culture-historical approach. McNairn suggested that this was because the term culture had become popular across the ": null
    },
    {
        "social sciences": "social sciences"
    },
    {
        " in reference to all learned modes of behaviour, and not just material culture as Childe had done. By the 42s, Childe was doubtful as to whether a certain archaeological assemblage or culture really reflected a social group who had other unifying traits, such as a shared language. In the 42s, Childe was comparing the role culture-historical archaeology had among prehistorians to the place of the traditional politico-military approach among historians.              Childe has typically been seen as a ": null
    },
    {
        "Marxist archaeologist": "marxist archaeologist"
    },
    {
        ", being the first archaeologist in the West to use Marxist theory in his work. Marxist archaeology emerged in the Soviet Union in 42 when the archaeologist ": null
    },
    {
        "Vladislav I. Ravdonikas": "vladislav i. ravdonikas"
    },
    {
        " published a report titled For a Soviet history of material culture . Criticising the archaeological discipline as inherently ": null
    },
    {
        "bourgeois": "bourgeois"
    },
    {
        " and therefore anti-socialist, Ravdonikass report called for a pro-socialist, Marxist approach to archaeology as part of the academic reforms instituted under ": null
    },
    {
        "Joseph Stalin": "joseph stalin"
    },
    {
        "s rule. It was during the mid42s, around the time of his first visit to the Soviet Union, that Childe began to make explicit reference to Marxism in his work.     Many archaeologists have been profoundly influenced by Marxisms socio-political ideas. As a ": null
    },
    {
        "materialist": "historical materialism"
    },
    {
        " philosophy, Marxism emphasises the idea that material things are more important than ideas, and that the social conditions of a given period are the result of the existing material conditions, or ": null
    },
    {
        "mode of production": "mode of production"
    },
    {
        ". Thus, a Marxist interpretation foregrounds the social context of any technological development or change. Marxist ideas also emphasise the biased nature of scholarship, each scholar having their own entrenched beliefs and class loyalties; Marxism thus argues that intellectuals cannot divorce their scholarly thinking from political action. Green stated that Childe accepted Marxist views on a model of the past because they offer a structural analysis of culture in terms of economy, sociology and ideology, and a principle for cultural change through economy . McNairn noted that Marxism was a major intellectual force in Childes thought , while Trigger stated that Childe identified with Marxs theories both emotionally and intellectually .     Childe stated that he used Marxist ideas when interpreting the past because and in so far as it works ; he criticised many fellow Marxists for treating the socio-political theory as a set of dogmas. Childes Marxism often differed from the Marxism of his contemporaries, both because he made reference to the original texts of Hegel, Marx, and Engels rather than later interpretations and because he was selective in using their writings. McNairn considered Childes Marxism an individual interpretation that differed from popular or orthodox Marxism; Trigger called him a a creative Marxist thinker ; Gathercole thought that while Childes debt to Marx was quite evident , his attitude to Marxism was at times ambivalent . The Marxist historian ": null
    },
    {
        "Eric Hobsbawm": "eric hobsbawm"
    },
    {
        " later described Childe as the most original English Marxist writer from the days of my youth .   Aware that in the context of the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        ", his affiliation with Marxism could prove dangerous for him, Childe sought to make his Marxist ideas more palatable to his readership. In his archaeological writings, he sparingly made direct reference to Marx. There is a distinction in his published works from the latter part of his life between those that are explicitly Marxist and those in which Marxist ideas and influences are less obvious. Many of Childes fellow British archaeologists did not take his adherence to Marxism seriously, regarding it as something which he did for shock value.          Childe was influenced by Soviet archaeology but remained critical of it, disapproving of how the Soviet government encouraged the countrys archaeologists to assume their conclusions before analysing their data. He was also critical of what he saw as the sloppy approach to ": null
    },
    {
        "typology": "typology"
    },
    {
        " in Soviet archaeology. As a moderate diffusionist, Childe was heavily critical of the Marrist trend in Soviet archaeology, based on the theories of the Georgian philologist ": null
    },
    {
        "Nicholas Marr": "nicholas marr"
    },
    {
        ", which rejected diffusionism in favour of unilinear evolutionism. In his view, it cannot be un-Marxian to understand the spread of domesticated plants, animals, and ideas through diffusionism. Childe did not publicly air these criticisms of his Soviet colleagues, perhaps so as not to offend communist friends or to provide ammunition for right-wing archaeologists. Instead, he publicly praised the Soviet system of archaeology and heritage management, contrasting it favourably with Britains because it encouraged collaboration rather than competition between archaeologists. After first visiting the country in 42 he returned in 42 42 and 42 befriending many Soviet archaeologists, but shortly before his suicide sent a letter to the Soviet archaeological community stating that he was extremely disappointed that they had methodologically fallen behind Western Europe and North America.     Other Marxists—such as ": null
    },
    {
        "George Derwent Thomson": "george derwent thomson"
    },
    {
        " and ": null
    },
    {
        "Neil Faulkner": "neil faulkner"
    },
    {
        "—argued that Childes archaeological work was not truly Marxist because he failed to take into account ": null
    },
    {
        "class struggle": "class struggle"
    },
    {
        " as an instrument of social change, a core tenet of Marxist thought. While class struggle was not a factor Childe considered in his archaeological work, he accepted that historians and archaeologists typically interpreted the past through their own class interests, arguing that most of his contemporaries produced studies with an innate bourgeois agenda. Childe further diverged from orthodox Marxism by not employing ": null
    },
    {
        "dialectics": "dialectics"
    },
    {
        " in his methodology. He also denied Marxisms ability to predict the future development of human society, and—unlike many other Marxists—did not consider humanitys ": null
    },
    {
        "progress": "progress"
    },
    {
        " into ": null
    },
    {
        "pure communism": "communist society"
    },
    {
        " inevitable, instead opining that society could fossilize or become extinct.         Influenced by Marxism, Childe argued that society experienced widescale changes in relatively short periods of time, citing the Industrial Revolution as a modern example. This idea was absent from his earliest work; in studies like The Dawn of European Civilisation he talked of societal change as transition rather than revolution . In writings from the early 42s, such as New Light on the Most Ancient East, he began to describe social change using the term revolution , although had yet to fully develop these ideas. At this point, the term revolution had gained Marxist associations due to Russias ": null
    },
    {
        "October Revolution": "october revolution"
    },
    {
        " of 42 Childe introduced his ideas about revolutions in a 42 presidential address to the Prehistoric Society. Presenting this concept as part of his functional-economic interpretation of the three-age system, he argued that a ": null
    },
    {
        "Neolithic Revolution": "neolithic revolution"
    },
    {
        " initiated the Neolithic era, and that other revolutions marked the start of the Bronze and Iron Ages. The following year, in Man Makes Himself, he combined these Bronze and Iron Age Revolutions into a singular ": null
    },
    {
        "Urban Revolution": "urban revolution"
    },
    {
        " , which corresponded largely to the anthropologist ": null
    },
    {
        "Lewis H. Morgan": "lewis h. morgan"
    },
    {
        "s concept of civilization .     For Childe, the Neolithic Revolution was a period of radical change, in which humans—who were then hunter-gatherers—began cultivating plants and breeding animals for food, allowing for greater control of the food supply and population growth. He believed that the Urban Revolution was largely caused by the development of bronze metallurgy, and in a 42 paper proposed ten traits that he believed were present in the oldest cities: they were larger than earlier settlements, they contained full-time craft specialists, the surplus was collected together and given to a god or king, they witnessed monumental architecture, there was an unequal distribution of social surplus, writing was invented, the sciences developed, naturalistic art developed, trade with foreign areas increased, and the state organisation was based on residence rather than kinship. Childe believed that the Urban Revolution had a negative side, in that it led to increased social stratification into classes and oppression of the majority by a power elite. Not all archaeologists adopted Childes framework of understanding human societal development as a series of transformational revolutions ; many believed that the term revolution was misleading because the processes of agricultural and urban development were gradual transformations.         Through his work, Childe contributed to two of the major theoretical movements in Anglo-American archaeology that developed in the decades after his death, ": null
    },
    {
        "processualism": "processual archaeology"
    },
    {
        " and ": null
    },
    {
        "post-processualism": "post-processualism"
    },
    {
        ". The former emerged in the late 42s, emphasised the idea that archaeology should be a branch of anthropology, sought the discovery of universal laws about society, and believed that archaeology could ascertain objective information about the past. The latter emerged as a reaction to processualism in the late 42s, rejecting the idea that archaeology had access to objective information about the past and emphasising the subjectivity of all interpretation.     The processual archaeologist Colin Renfrew described Childe as one of the fathers of processual thought due to his development of economic and social themes in prehistory , an idea echoed by Faulkner. Trigger argued that Childes work foreshadowed processual thought in two ways: by emphasising the role of change in societal development, and by adhering to a strictly materialist view of the past. Both of these arose from Childes Marxism. Despite this connection, most American processualists ignored Childes work, seeing him as a ": null
    },
    {
        "particularist": "historical particularism"
    },
    {
        " who was irrelevant to their search for generalised laws of societal behaviour. In keeping with Marxist thought, Childe did not agree that such generalised laws existed, believing that behaviour was not universal but was conditioned by socio-economic factors. ": null
    },
    {
        "Peter Ucko": "peter ucko"
    },
    {
        ", one of Childes successors as director of the Institute of Archaeology, highlighted that Childe accepted the ": null
    },
    {
        "subjectivity": "subjectivity"
    },
    {
        " of archaeological interpretation, something in stark contrast to the processualists insistence that archaeological interpretation could be objective. As a result, Trigger thought Childe to be a prototypical post-processual archaeologist .            Childes biographer Sally Green found no evidence that Childe ever had a serious intimate relationship; she assumed he was ": null
    },
    {
        "heterosexual": "heterosexual"
    },
    {
        " because she found no evidence of same-sex attraction. Conversely, his student ": null
    },
    {
        "Don Brothwell": "don brothwell"
    },
    {
        " thought him to be ": null
    },
    {
        "homosexual": "homosexual"
    },
    {
        ". He had many friends of both sexes, although remained awkward and uncouth, without any social graces . Despite his difficulties in relating to others, he enjoyed interacting and socialising with his students, often inviting them to dine with him. He was shy and often hid his personal feelings. Brothwell suggested that these personality traits may reflect undiagnosed ": null
    },
    {
        "Asperger syndrome": "asperger syndrome"
    },
    {
        ".     Childe believed that the study of the past could offer guidance for how humans should act in the present and future. He was known for his ": null
    },
    {
        "radical left-wing": "radical left-wing"
    },
    {
        " views, being a socialist from his undergraduate days. He sat on the committees of several left-wing groups, although avoided involvement in Marxist intellectual arguments within the Communist Party and—with the exception of How Labour Governs—did not commit his non-archaeological opinions to print. Many of his political views are therefore evident only through comments made in private correspondence. Renfrew noted that Childe was liberal-minded on social issues, but thought that—although Childe deplored racism—he did not entirely escape the pervasive nineteenth-century view on distinct differences between different races. Trigger similarly observed racist elements in some of Childes culture-historical writings, including the suggestion that ": null
    },
    {
        "Nordic peoples": "nordic race"
    },
    {
        " had a superiority in physique , although Childe later disavowed these ideas. In a private letter Childe wrote to the archaeologist ": null
    },
    {
        "Christopher Hawkes": "christopher hawkes"
    },
    {
        ", he stated that ": null
    },
    {
        "he disliked Jews": "anti-semitism"
    },
    {
        ".     Childe was an atheist and critic of religion, viewing it as a ": null
    },
    {
        "false consciousness": "false consciousness"
    },
    {
        " based in superstition that served the interests of dominant elites. In History he commented that Magic is a way of making people believe they are going to get what they want, whereas religion is a system for persuading them that they ought to want what they get.  He nevertheless regarded Christianity as being superior over primitive religion, commenting that Christianity as a religion of love surpasses all others in stimulating positive virtue . In a letter written during the 42s, he stated that only in days of exceptional bad temper do I desire to hurt peoples religious convictions .     Childe was fond of driving cars, enjoying the feeling of power he got from them. He often told a story about how he had raced at high speed down ": null
    },
    {
        "Piccadilly": "piccadilly"
    },
    {
        ", London at 42 oclock in the morning for the sheer enjoyment of it, only to be pulled over by a policeman. He loved practical jokes, and allegedly kept a ": null
    },
    {
        "halfpenny": "halfpenny"
    },
    {
        " in his pocket to trick pickpockets. On one occasion he played a joke on the delegates at a Prehistoric Society conference by lecturing them on a theory that the Neolithic monument of ": null
    },
    {
        "Woodhenge": "woodhenge"
    },
    {
        " had been constructed as an imitation of ": null
    },
    {
        "Stonehenge": "stonehenge"
    },
    {
        " by a nouveau riche chieftain. Some audience members failed to realise that he was being ": null
    },
    {
        "tongue in cheek": "tongue in cheek"
    },
    {
        ". He could speak several European languages, having taught himself in early life when he was travelling across the continent.     Childes other hobbies included walking in the British hillsides, attending ": null
    },
    {
        "classical music": "classical music"
    },
    {
        " concerts, and playing the card game ": null
    },
    {
        "contract bridge": "contract bridge"
    },
    {
        ". Fond of poetry, his favourite poet was ": null
    },
    {
        "John Keats": "john keats"
    },
    {
        ", although his favourite poems were ": null
    },
    {
        "William Wordsworth": "william wordsworth"
    },
    {
        "s ": null
    },
    {
        "Ode to Duty": "ode to duty"
    },
    {
        " and ": null
    },
    {
        "Robert Browning": "robert browning"
    },
    {
        "s A Grammarians Funeral . He was not particularly interested in reading novels, but his favourite was ": null
    },
    {
        "D. H. Lawrence": "d. h. lawrence"
    },
    {
        "s  Kangaroo  , a book echoing many of Childes own feelings about Australia. He was a fan of good quality food and drink, and frequented restaurants. Known for his battered, tatty attire, Childe always wore his wide-brimmed black hat—purchased from a hatter in ": null
    },
    {
        "Jermyn Street": "jermyn street"
    },
    {
        ", central London—as well as a tie, which was usually red, a colour chosen to symbolise his socialist beliefs. He regularly wore a black ": null
    },
    {
        "Mackintosh": "mackintosh"
    },
    {
        " raincoat, often carrying it over his arm or draped over his shoulders like a cape. In summer he frequently wore shorts with socks, sock suspenders, and large boots.         On his death, Childe was praised by his colleague Stuart Piggott as the greatest prehistorian in Britain and probably the world . The archaeologist ": null
    },
    {
        "Randall H. McGuire": "randall h. mcguire"
    },
    {
        " later described him as probably the best known and most cited archaeologist of the twentieth century , an idea echoed by Bruce Trigger, while Barbara McNairn labelled him one of the most outstanding and influential figures in the discipline . The archaeologist ": null
    },
    {
        "Andrew Sherratt": "andrew sherratt"
    },
    {
        " described Childe as occupying a crucial position in the history of archaeology.   Sherratt also noted that Childes output, by any standard, was massive . Over the course of his career, Childe published over twenty books and around 42 scholarly articles. The archaeologist ": null
    },
    {
        "Brian Fagan": "brian fagan"
    },
    {
        " described his books as simple, well-written narratives which became archaeological canon between the 42s and early 42s . By 42 he was cited as the most translated Australian author in history, having seen his books published in such languages as Chinese, Czech, Dutch, French, German, Hindi, Hungarian, Italian, Japanese, Polish, Russian, Spanish, Sweden and Turkish. The archaeologists ": null
    },
    {
        "David Lewis-Williams": "david lewis-williams"
    },
    {
        " and David Pearce considered Childe probably the most written about archaeologist in history, commenting that his books were still required reading for those in the discipline in 42          Known as the Great Synthesizer , Childe is primarily respected for developing a synthesis of European and Near Eastern prehistory at a time when most archaeologists focused on regional sites and sequences. Since his death, this framework has been heavily revised following the discovery of ": null
    },
    {
        "radiocarbon dating": "radiocarbon dating"
    },
    {
        ", his interpretations have been largely rejected , and many of his conclusions about Neolithic and Bronze Age Europe have been found to be incorrect. Childe himself believed that his primary contribution to archaeology was in his interpretative frameworks, an analysis supported by Alison Ravetz and Peter Gathercole. According to Sherratt: What is of lasting value in his interpretations is the more detailed level of writing, concerned with the recognition of patterns in the material he described. It is these patterns which survive as classic problems of European prehistory, even when his explanations of them are recognised as inappropriate.  Childes theoretical work had been largely ignored in his lifetime, and remained forgotten in the decades after his death, although it would see a resurgence in the late 42s and early 42s. It remained best known in Latin America, where Marxism remained a core theoretical current among archaeologists throughout the latter 42th century.     Despite his global influence, Childes oeuvre was poorly understood in the United States, where his work on European prehistory never became well known. As a result, in the United States he erroneously gained the reputation of being a Near Eastern specialist and a founder of ": null
    },
    {
        "neo-evolutionism": "neo-evolutionism"
    },
    {
        ", alongside ": null
    },
    {
        "Julian Steward": "julian steward"
    },
    {
        " and ": null
    },
    {
        "Leslie White": "leslie white"
    },
    {
        ", despite the fact that his approach was more subtle and nuanced than theirs. Steward repeatedly misrepresented Childe as a unilinear evolutionist in his writings, perhaps as part of an attempt to distinguish his own multilinear evolutionary approach from the ideas of Marx and Engels. In contrast to this American neglect and misrepresentation, Trigger believed that it was an American archaeologist, ": null
    },
    {
        "Robert McCormick Adams, Jr.": "robert mccormick adams, jr."
    },
    {
        ", who did the most to posthumously develop Childes most innovative ideas . Childe also had a small following of American archaeologists and anthropologists in the 42s who wanted to bring back materialist and Marxist ideas into their research after years in which ": null
    },
    {
        "Boasian": "franz boas"
    },
    {
        " particularism had been dominant within the discipline. In the U.S., his name was also referenced in the 42 blockbuster film  Indiana Jones and the Kingdom of the Crystal Skull .              Following his death, several articles examining Childes impact on archaeology were published. In 42 Bruce Triggers Gordon Childe: Revolutions in Archaeology appeared, which studied the influences that extended over Childes archaeological thought; the same year saw the publication of Barbara McNairns The Method and Theory of V. Gordon Childe, examining his methodological and theoretical approaches to archaeology. The following year, Sally Green published Prehistorian: A Biography of V. Gordon Childe, in which she described him as the most eminent and influential scholar of European prehistory in the twentieth century . Peter Gathercole thought the work of Trigger, McNairn, and Green was extremely important ; Tringham considered it all part of a lets-get-to-know-Childe-better movement.     In July 42 a colloquium devoted to Childes work was held in ": null
    },
    {
        "Mexico City": "mexico city"
    },
    {
        ", marking the 42th anniversary of Man Makes Himselfs publication. In September 42 the University of Queensland s Australian Studies Centre organised a centenary conference for Childe in Brisbane , with presentations examining both his scholarly and his socialist work. In May 42 a conference marking his centenary was held at the UCL Institute of Archaeology in London, co-sponsored by the Institute and the Prehistoric Society, both organisations that he had formerly headed. The conference proceedings were published in a 42 volume edited by David R. Harris , the Institutes director, entitled The Archaeology of V. Gordon Childe: Contemporary Perspectives. Harris stated that the book sought to demonstrate the dynamic qualities of Childes thought, the breadth and depth of his scholarship, and the continuing relevance of his work to contemporary issues in archaeology . In 42 another conference collection was published. Titled Childe and Australia: Archaeology, Politics and Ideas, it was edited by Peter Gathercole, T.H. Irving, and Gregory Melleuish. Further papers appeared on the subject of Childe in ensuing years, looking at such subjects as his personal correspondences, and final resting place.         ": null
    }
]