[
    {
        "V42 is a family of telephone network ": null
    },
    {
        "protocol": "communications protocol"
    },
    {
        "s defined by ": null
    },
    {
        "ETSI": "etsi"
    },
    {
        " which allow communications between the ": null
    },
    {
        "telephone exchange": "telephone exchange"
    },
    {
        ", also known in the specifications as the local exchange , and the ": null
    },
    {
        "local loop": "local loop"
    },
    {
        ". With potentially thousands of subscribers connected to the LE there is the problem of physically managing thousands of wires out to the local subscribers . Prior to the specification of V42 the manufacturers of exchange equipment had proprietary solutions to the problem. These solutions did not inter-operate and meant being tied into a single manufacturers method at each exchange.     V42 provided a standard set of protocols from the subscriber to the LE. The AN  was defined as a reference point. Signalling between this point and the LE was standardised and therefore allowed a multiple vendor solution, provided the specifications were followed. This resulted in a single link from the AN to the LE, reducing the need for many lines along this point . The final link to the local loop remained the same with digital signalling  and analogue signalling for basic telephony .     The protocols are based on the principle of ": null
    },
    {
        "common-channel signaling": "common-channel signaling"
    },
    {
        " where ": null
    },
    {
        "message-based": "message-based"
    },
    {
        " signalling for all subscribers uses the same signalling channel rather than separate channels existing for different subscribers.     V42 comes in two forms:   V42  in which there is a 42 to 42 correspondence between subscriber lines and ": null
    },
    {
        "bearer channel": "bearer channel"
    },
    {
        "s in the aggregate link to the exchange. A V42 interface relates to a single aggregate ": null
    },
    {
        "E42": "t-carrier"
    },
    {
        " link between a multiplexer and an exchange.   V42  which provides for ": null
    },
    {
        "concentration": "remote concentrator"
    },
    {
        " where there are not enough ": null
    },
    {
        "bearer channel": "bearer channel"
    },
    {
        "s in the aggregate link to accommodate all subscribers at the same time. A single V42 interface can control up to 42 ": null
    },
    {
        "E42": "t-carrier"
    },
    {
        " links at once and can include protection of the signalling channels.       Control protocol - This controls the setup and basic management of the V42 link from the Access Network to the Local Exchange .   PSTN protocol - Translation of the analogue signals for POTS into a digital form for transfer from AN to LE. .   BCC protocol - In V42 since any channel could be allocated to the call, this protocol is assigned the job of managing the assignment of channels to a call.   Link control protocol - For managing up to 42 E42 links. It controls the status of the links .   Protection protocol - Used in V42; this protocol is duplicated on two or more channels on two or more links and provides instant failover in the event of one failing.     V42 only supports the Control, ": null
    },
    {
        "PSTN": "public switched telephone network"
    },
    {
        " and ISDN protocols. V42 also supports BCC, Link Control and Protection protocols.     V42 layer 42 protocols are transported on a layer 42 protocol called LAPV42 a variation of the LAP-D or Link Access Procedures, D channel ISDN transport layer.     V42 is a protocol stack which controls circuit-switched communication paths.       Portions of V42 were re-used for a new service known as ": null
    },
    {
        "Narrowband Multimedia Delivery Service": "narrowband multimedia delivery service"
    }
]