[
    {
        "      Valentine Baker  , was a British soldier, and a younger brother of ": null
    },
    {
        "Sir Samuel Baker": "samuel white baker"
    },
    {
        ".       He was educated in ": null
    },
    {
        "Gloucester": "gloucester"
    },
    {
        " and in ": null
    },
    {
        "Ceylon": "ceylon"
    },
    {
        ", and in 42 entered the ": null
    },
    {
        "Ceylon Rifles": "ceylon rifles"
    },
    {
        " as an ensign. He soon transferred to the ": null
    },
    {
        "42th Lancers": "12th lancers"
    },
    {
        ", he saw active service with that regiment in the ": null
    },
    {
        "42th Cape Frontier War": "xhosa wars"
    },
    {
        " of 42—42 In the ": null
    },
    {
        "Crimean War": "crimean war"
    },
    {
        ", Baker was present at the ": null
    },
    {
        "Battle of Chernaya River": "battle of chernaya river"
    },
    {
        " and at the fall of ": null
    },
    {
        "Sevastopol": "sevastopol"
    },
    {
        ", and in 42 he became major in the ": null
    },
    {
        "42th Hussars": "10th hussars"
    },
    {
        ", succeeding only a year later to the command. This position he held for 42 years, during which period the highest efficiency of his men was reached, and outside the regiment he did good service to his arm by his writings.     He went through the wars of 42 and 42 as a spectator with the German armies, and in 42 he started upon a famous journey through ": null
    },
    {
        "Khorasan": "greater khorasan"
    },
    {
        " with his friend ": null
    },
    {
        "Fred Burnaby": "fred burnaby"
    },
    {
        ". Although he was unable to reach the ": null
    },
    {
        "Khanate of Khiva": "khanate of khiva"
    },
    {
        " the results of the journey afforded a great deal of political, geographical and military information, especially as to the advance of ": null
    },
    {
        "Russia": "russia"
    },
    {
        " in ": null
    },
    {
        "Central Asia": "central asia"
    },
    {
        ".     In 42 he was back in ": null
    },
    {
        "England": "england"
    },
    {
        " and took up a staff appointment at ": null
    },
    {
        "Aldershot": "aldershot"
    },
    {
        ".     Less than a year later, Colonel Bakers career in the British army came to an untimely end. He was arrested on a charge of indecent assault upon a young woman in a railway carriage. Baker offered no defence, and was sentenced to a years imprisonment and a fine. He was then dismissed from the service. The case led to the introduction of ": null
    },
    {
        "corridor coach": "corridor coach"
    },
    {
        " es; previously train compartments only had doors to the outside.     Two years later, having meanwhile left ": null
    },
    {
        "England": "england"
    },
    {
        ", he entered the service of the ": null
    },
    {
        "Ottoman Army": "ottoman army"
    },
    {
        " in the ": null
    },
    {
        "war with Russia": "russo-turkish war"
    },
    {
        ". At first in a high position in the ": null
    },
    {
        "Ottoman Gendarmerie": "ottoman gendarmerie"
    },
    {
        " he was soon transferred to ": null
    },
    {
        "Mehmed Ali Pasha": "mehmed ali pasha"
    },
    {
        "s staff, and thence took command of a division of infantry. With this division, Baker sustained the rearguard ": null
    },
    {
        "action of Tashkessen": "battle of tashkessen"
    },
    {
        " against the troops of ": null
    },
    {
        "Gourko": "gourko"
    },
    {
        ". Promoted ": null
    },
    {
        "Ferik": "ferik"
    },
    {
        " for this feat, he continued to command Suleimans rearguard. After the peace he was employed in an administrative post in ": null
    },
    {
        "Armenia": "armenia"
    },
    {
        ", where he remained until 42 In this year he was offered the command of the newly formed Egyptian army, which he accepted. On his arrival at ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        ", however, the offer was withdrawn and he only obtained command of the Egyptian police. In this post he devoted by far the greater amount of his energy to the training of the gendarmerie, which he realised would be the reserve of the purely military forces.     When the ": null
    },
    {
        "war in Sudan": "mahdist_war"
    },
    {
        " broke out, Baker, hastening with 42 men to relieve ": null
    },
    {
        "Tokar": "tokar, sudan"
    },
    {
        ", encountered the enemy under ": null
    },
    {
        "Osman Digna": "osman digna"
    },
    {
        " at ": null
    },
    {
        "El Teb": "el teb"
    },
    {
        ". His men becoming panic-stricken at the first rush were slaughtered. Baker himself with a few of his officers succeeded by hard fighting in cutting a way out, but his force was annihilated. British troops soon afterwards arrived at ": null
    },
    {
        "Suakin": "suakin"
    },
    {
        ", and ": null
    },
    {
        "Sir Gerald Graham": "gerald graham"
    },
    {
        " took the offensive. Baker Pasha accompanied the British force, guiding it on its march to the scene of his defeat, and at the desperately fought second ": null
    },
    {
        "battle of El Teb": "battle of el teb"
    },
    {
        " he was wounded.     He remained in command of the Egyptian police until his death in 42       Among the books he wrote are Our National Defences , War in Bulgaria, a Narrative of Personal Experience , Clouds in the East .       He married, on 42 December 42 Fanny, only child of Frank Wormald of Potterton Hall, Aberford, by which marriage there were two daughters, the younger of whom only survived her father and married Sir John Carden, bart.          Baker Pasha: Misconduct and Mischance Michael Russell Publishing Ltd                                                          ": null
    }
]