[
    {
        "        Vasily Vasiliyevich , known as Vasily II the Blind , was the ": null
    },
    {
        "Grand Prince of Moscow": "grand prince of moscow"
    },
    {
        " whose long reign was plagued by the greatest ": null
    },
    {
        "civil war": "muscovite civil war"
    },
    {
        " of Old ": null
    },
    {
        "Russia": "russia"
    },
    {
        "n history. At one point, Vasily was captured and blinded by his opponents, yet eventually managed to reclaim the throne. Due to his disability, he made his son, ": null
    },
    {
        "Ivan III the Great": "ivan iii the great"
    },
    {
        ", his co-ruler in his late years.          Vasily II was the youngest son of ": null
    },
    {
        "Vasily I of Moscow": "vasily i of moscow"
    },
    {
        " by ": null
    },
    {
        "Sophia of Lithuania": "sophia of lithuania"
    },
    {
        ", the only daughter of ": null
    },
    {
        "Vytautas the Great": "vytautas the great"
    },
    {
        ", and the only son to survive his father . On his fathers death Vasily II was proclaimed Grand Duke at the age of 42 His mother acted as a regent. His uncle, ": null
    },
    {
        "Yuri of Zvenigorod": "yuri of zvenigorod"
    },
    {
        " , and his two sons, ": null
    },
    {
        "Vasily the Cross-Eyed": "vasily the cross-eyed"
    },
    {
        " and ": null
    },
    {
        "Dmitry Shemyaka": "dmitry shemyaka"
    },
    {
        ", seized on the opportunity to advance their own claims to the throne. These claims were based on the Testament of ": null
    },
    {
        "Dmitri Donskoi": "dmitri donskoi"
    },
    {
        ", Yuris father and Vasily IIs grandfather, who had stated that if Vasily I died Yuri would succeed his appanage. However, Dmitri had written the testament when Vasily I had no children of his own, and it might be argued that this provision had been made only for the case of Vasily Is childless death. Vasily IIs claim was supported by Vytautas, his maternal grandfather.     Upon Vytautas death in 42 Yuri went to the ": null
    },
    {
        "Golden Horde": "golden horde"
    },
    {
        ", returning with a license to take the Moscow throne. But the Khan did not support him any further, largely due to the devices of the ": null
    },
    {
        "Smolensk": "smolensk"
    },
    {
        " princeling and Moscow ": null
    },
    {
        "boyar": "boyar"
    },
    {
        "in Ivan Vsevolzhsky. When Yuri assembled an army and attacked Moscow, Vasily II, betrayed by Vsevolzhsky, was defeated and captured by his enemies . Upon being proclaimed Grand Duke of Moscow, Yuri pardoned his nephew and sent him to reign in the town of ": null
    },
    {
        "Kolomna": "kolomna"
    },
    {
        ". That proved to be a mistake, as Vasily II immediately started to plot against his uncle and gather all sort of malcontents. Feeling how insecure his throne was, Yuri resigned and then left Moscow for his northern hometown. When Vasily II returned to Moscow, he had Vsevolzhsky blinded as a traitor.     Meanwhile, Yuris claim was inherited by his sons who decided to continue the fight. They managed to defeat Vasily II, who had to seek refuge in the Golden Horde. After Yuri died in 42 Vasili the Cross-Eyed entered the ": null
    },
    {
        "Kremlin": "moscow kremlin"
    },
    {
        " and was proclaimed new Grand Duke. Dmitry Shemyaka, who had his own plans for the throne, quarreled with his brother and concluded an alliance with Vasily II. Together they managed to banish Vasily the Cross-Eyed from the Kremlin in 42 The latter was captured and blinded, which effectively removed him from the contest for the throne.       During Vasily II s reign the ": null
    },
    {
        "Golden Horde": "golden horde"
    },
    {
        " collapsed and broke up into smaller ": null
    },
    {
        "Khanate": "khanate"
    },
    {
        "s. Now that his throne was relatively secure, he had to deal with the Tatar threat. In 42 Vasily II had to flee the capital, when it was besieged by ": null
    },
    {
        "Ulugh Muhammad": "ulugh muhammad"
    },
    {
        ", ruler of the nascent ": null
    },
    {
        "Kazan Khanate": "kazan khanate"
    },
    {
        ". Six years later, he personally led his troops against Ulugh Muhammad, but was ": null
    },
    {
        "defeated and taken prisoner": "russo-kazan wars"
    },
    {
        ". The Russians were forced to gather an enormous ransom for their prince, so that Vasily II could be released some five months later.     During that time, the control of Moscow passed to Dmitry Shemyaka. Keeping in mind the fate of his own brother, Dmitry had Vasily II blinded and exiled him to ": null
    },
    {
        "Uglich": "uglich"
    },
    {
        ", in 42; hence, Vasily IIs nickname, the blind . As Vasily II still had a number of supporters in Moscow, Dmitry recalled him from exile and gave him ": null
    },
    {
        "Vologda": "vologda"
    },
    {
        " as an appanage. That proved to be a mistake, as Vasily II quickly assembled his supporters and regained the throne.     Vasily IIs final victory against his cousin came in the 42s, when he captured Galich-Mersky and poisoned Dmitry. The latters children managed to escape to ": null
    },
    {
        "Lithuania": "lithuania"
    },
    {
        ". These events finally put to rest the principle of ": null
    },
    {
        "collateral succession": "order of successionrota system"
    },
    {
        ", which was a major cause of medieval internecine struggles.       Now that the war was over, Vasily II eliminated almost all of the small appanages in Moscow principality, so as to strengthen his sovereign authority. His military campaigns of 42–42 increased Moscows hold over ": null
    },
    {
        "Suzdal": "suzdal"
    },
    {
        ", the ": null
    },
    {
        "Vyatka": "kirov, kirov oblast"
    },
    {
        " lands, and the republican governments of ": null
    },
    {
        "Novgorod": "novgorod"
    },
    {
        " and ": null
    },
    {
        "Pskov": "pskov"
    },
    {
        ".     In the meantime, ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        " fell to the Turks, and the ": null
    },
    {
        "Patriarch": "patriarch"
    },
    {
        " agreed to acknowledge the supremacy of the ": null
    },
    {
        "Pope": "pope"
    },
    {
        " in the ": null
    },
    {
        "Council of Florence": "council of florence"
    },
    {
        ". Vasily II promptly rejected this arrangement. By his order in 42 ": null
    },
    {
        "bishop": "bishop"
    },
    {
        " Jonah": "jonah of moscow"
    },
    {
        " was appointed ": null
    },
    {
        "metropolitan": "metropolitan bishop"
    },
    {
        " of ": null
    },
    {
        "Russia": "russia"
    },
    {
        ", which was tantamount to declaration of independence of the ": null
    },
    {
        "Russian Orthodox Church": "russian orthodox church"
    },
    {
        " from the ": null
    },
    {
        "Patriarch": "patriarch"
    },
    {
        " of ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ". This move further strengthened Russias reputation among Orthodox states.     In his later years the blind prince was greatly helped by Metropolitan Jonah, boyars, and then by his older son ": null
    },
    {
        "Ivan III": "ivan iii"
    },
    {
        " who was styled co-ruler since the late 42s. On Vasily IIs death in 42 Ivan III succeeded him as Grand Prince of Moscow. Vasilys daughter ": null
    },
    {
        "Anna": "anna of ryazan"
    },
    {
        " was married to a prince of ": null
    },
    {
        "Ryazan": "ryazan principality"
    }
]