[
    {
        "      The Vega program was a series of ": null
    },
    {
        "Venus missions": "venus missions"
    },
    {
        " that also took advantage of the appearance of comet ": null
    },
    {
        "42P/Halley": "1p/halley"
    },
    {
        " in 42  Vega 42  and  Vega 42  were uncrewed ": null
    },
    {
        "spacecraft": "spacecraft"
    },
    {
        " launched in a cooperative effort among the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " and ": null
    },
    {
        "Austria": "austria"
    },
    {
        ", ": null
    },
    {
        "Bulgaria": "bulgaria"
    },
    {
        ", ": null
    },
    {
        "France": "france"
    },
    {
        ", ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        ", the ": null
    },
    {
        "German Democratic Republic": "east germany"
    },
    {
        ", ": null
    },
    {
        "Poland": "poland"
    },
    {
        ", ": null
    },
    {
        "Czechoslovakia": "czechoslovakia"
    },
    {
        ", and the ": null
    },
    {
        "Federal Republic of Germany": "west germany"
    },
    {
        " in December 42 They had a two-part mission to investigate ": null
    },
    {
        "Venus": "venus"
    },
    {
        " and also flyby ": null
    },
    {
        "Halleys Comet": "halleys comet"
    },
    {
        ".     The flyby of Halleys Comet had been a late mission change in the ": null
    },
    {
        "Venera": "venera"
    },
    {
        " program following on from the cancellation of the American Halley mission in 42 A later Venera mission was canceled and the Venus part of the Vega 42 mission was reduced. Because of this, the craft was designated VeGa, a contraction of Venera and Gallei . The spacecraft design was based on the previous ": null
    },
    {
        "Venera 42": "venera 9"
    },
    {
        " and ": null
    },
    {
        "Venera 42": "venera 10"
    },
    {
        " missions.     The two spacecraft were launched on 42 and 42 December 42 respectively. With their redesignated dual missions, the Vega probes became part of the ": null
    },
    {
        "Halley Armada": "halley armada"
    },
    {
        ", a group of space probes that studied Halleys Comet during its 42/42 ": null
    },
    {
        "perihelion": "perihelion"
    },
    {
        ".             Vega 42  and  Vega 42  were identical sister ships. The spacecraft was a development of the earlier  Venera  craft. They were designed by Babakin Space Center and constructed as 42VK by ": null
    },
    {
        "Lavochkin": "lavochkin"
    },
    {
        " at ": null
    },
    {
        "Khimki": "khimki"
    },
    {
        ". The craft was powered by twin large solar panels and instruments included an antenna dish, cameras, ": null
    },
    {
        "spectrometer": "spectrometer"
    },
    {
        ", infrared sounder, ": null
    },
    {
        "magnetometer": "magnetometer"
    },
    {
        "s , and plasma probes. The  craft was launched by a ": null
    },
    {
        "Proton 42K42K rocket": "proton-k"
    },
    {
        " from ": null
    },
    {
        "Baikonur Cosmodrome": "baikonur cosmodrome"
    },
    {
        ", ": null
    },
    {
        "Tyuratam": "tyuratam"
    },
    {
        ", ": null
    },
    {
        "Kazakh SSR": "kazakh ssr"
    },
    {
        " . Both Vega 42 and Vega 42 were three-axis stabilized spacecraft. The spacecraft were equipped with a dual bumper shield for dust protection from Halleys comet.       imaging system   infrared spectrometer   ": null
    },
    {
        "ultraviolet": "ultraviolet"
    },
    {
        ", ": null
    },
    {
        "visible": "light"
    },
    {
        ", infrared imaging ": null
    },
    {
        "spectrometer": "spectrometer"
    },
    {
        "   shield penetration detector   dust detectors   dust mass spectrometer   neutral gas mass spectrometer   APV-V plasma energy analyzer   energetic-particle analyzer   ": null
    },
    {
        "magnetometer": "magnetometer"
    },
    {
        "   wave and plasma analyzers          Vega 42 arrived at Venus on 42 June 42 and Vega 42 on 42 June 42 and each delivered a ,  diameter spherical descent unit. The units were released some days before each arrived at Venus and entered the atmosphere without active inclination changes. Each contained a lander and a balloon explorer.       The landers were identical to that of the previous five  Venera  missions and were to study the atmosphere and surface, each had instruments to study temperature, pressure, a ": null
    },
    {
        "UV": "uv"
    },
    {
        " spectrometer, a water concentration meter, a ": null
    },
    {
        "gas-phase chromatograph": "gas-liquid chromatography"
    },
    {
        ", an ": null
    },
    {
        "X-ray": "x-ray"
    },
    {
        " spectrometer": "spectrometer"
    },
    {
        ", a ": null
    },
    {
        "mass spectrometer": "mass spectrometer"
    },
    {
        ", and a surface sampling device.     The Vega 42 landers surface experiments were inadvertently activated at  from the surface by an especially hard wind jolt, and so failed to provide results. It landed at 42°N, 42°E.     The Vega 42 lander touched down at 42:42:42 UT on 42 June 42 at 42° S, 42° E, in eastern ": null
    },
    {
        "Aphrodite Terra": "aphrodite terra"
    },
    {
        ". The altitude of the touchdown site was  above the planetary mean radius. The measured pressure at the landing site was 42 atm and the temperature was . The surface sample was found to be an ": null
    },
    {
        "anorthosite": "anorthosite"
    },
    {
        "-": null
    },
    {
        "troctolite": "troctolite"
    },
    {
        ". The lander transmitted data from the surface for 42 minutes.       Meteocomplex T,P sensors   Sigma42 gas chromatograph   LSA particle size spectrometer   IFP aerosol analyzer   VM42 hygrometer   ISAV-A nephelometer/scatterometer   Malakhit-V mass spectrometer   ISAV-S UV spectrometer   GZU VB42 drill + BDRP-AM42 soil X-ray fluorescence spectrometer   GS42-STsV gamma ray spectrometer   PrOP-V penetrometer   MSB small solar batteries            The two balloon ": null
    },
    {
        "aerobot": "aerobot"
    },
    {
        "s were designed to float at  from the surface, in the most active layer of the Venusian cloud system. The instrument pack had enough battery power for sixty hours of operation and measured temperature, pressure, wind speed, and aerosol density. The balloon envelopes were surfaced with ": null
    },
    {
        "polytetrafluoroethylene": "polytetrafluoroethylene"
    },
    {
        " to resist attack by the corrosive atmosphere. Both Vega42 and Vega42 balloons operated for more than 42 hrs from injection to the final transmission.      The balloons were spherical superpressure types with a diameter of  and filled with ": null
    },
    {
        "helium": "helium"
    },
    {
        ". A gondola assembly weighing  and  long was connected to the balloon envelope by a tether  long. Total mass of the entire assembly was .     The top section of the gondola assembly was capped by a conical antenna  tall and  wide at the base. Beneath the antenna was a module containing the radio transmitter and system control electronics. The lower section of the gondola assembly carried the instrument payload and batteries.     The instruments consisted of:     An arm carrying thin-film resistance thermometers and a ": null
    },
    {
        "velocity anemometer": "anemometer"
    },
    {
        ". The anemometer consisted of a free-spinning plastic propeller whose spin was measured by ": null
    },
    {
        "LED": "led"
    },
    {
        "-photodetector optointerrupters.   A module containing a ": null
    },
    {
        "PIN diode": "pin diode"
    },
    {
        " photodetector": "photodetector"
    },
    {
        " to measure light levels and a vibrating ": null
    },
    {
        "quartz": "quartz"
    },
    {
        " beam ": null
    },
    {
        "pressure sensor": "pressure sensor"
    },
    {
        ".   A package at the bottom carrying the batteries and a ": null
    },
    {
        "nephelometer": "nephelometer"
    },
    {
        " to measure cloud density through light reflection.     The small low-power transmitter only allowed a data transmission rate of 42 bit/s, though the system performed data compression to squeeze more information through the narrow bandwidth. Nonetheless, the sampling rate for most of the instruments was only once every 42 seconds. The balloons were tracked by two networks of 42 radio telescopes in total back on Earth: the Soviet network, coordinated by the ": null
    },
    {
        "Soviet Academy of Sciences": "ussr academy of sciences"
    },
    {
        " and the international network, coordinated by Centre national détudes spatiales of France .     The balloons were dropped onto the planets darkside and deployed at an altitude of about . They then floated upward a few kilometers to their equilibrium altitude. At this altitude, pressure and temperature conditions of Venus are similar to those of ": null
    },
    {
        "Earth": "earth"
    },
    {
        ", though the planets winds moved at hurricane velocity and the ": null
    },
    {
        "carbon dioxide": "carbon dioxide"
    },
    {
        " atmosphere is laced with ": null
    },
    {
        "sulphuric acid": "sulphuric acid"
    },
    {
        ", along with smaller concentrations of ": null
    },
    {
        "hydrochloric": "hydrochloric acid"
    },
    {
        " and ": null
    },
    {
        "hydrofluoric acid": "hydrofluoric acid"
    },
    {
        ".     The balloons moved swiftly across the night side of the planet into the light side, where their batteries finally died and contact was lost. Tracking indicated that the motion of the balloons included a surprising vertical component, revealing vertical motions of air masses that had not been detected by earlier probe missions.            After their encounters, the Vega motherships were redirected by Venuss gravity to intercept ": null
    },
    {
        "Comet Halley": "comet halley"
    },
    {
        ".     Vega 42 made its closest approach on 42 March, around  from the nucleus, and Vega 42 made its closest approach on 42 March at . The data intensive examination of the comet covered only the three hours around closest approach. They were intended to measure the physical parameters of the nucleus, such as dimensions, shape, temperature, and surface properties, as well as to study the structure and dynamics of the ": null
    },
    {
        "coma": "coma"
    },
    {
        ", the gas composition close to the nucleus, the dust particles composition and mass distribution as functions of distance to the nucleus, and the cometary-": null
    },
    {
        "solar wind": "solar wind"
    },
    {
        " interaction.     In total Vega 42 and Vega 42 returned about 42 images of Comet Halley. Spacecraft operations were discontinued a few weeks after the Halley encounters.     The on-board TV system was created in international cooperation of the scientific and industrial facilities from the ": null
    },
    {
        "USSR": "ussr"
    },
    {
        ", ": null
    },
    {
        "Hungary": "peoples republic of hungary"
    },
    {
        ", France, and ": null
    },
    {
        "Czechoslovakia": "czechoslovakia"
    },
    {
        ". The TV data was processed by an international team, including scientists from the Soviet Union, Hungary, France, ": null
    },
    {
        "East Germany": "east germany"
    },
    {
        ", and the ": null
    },
    {
        "United States": "united states"
    },
    {
        ". The basic steps of data acquisition and preprocessing were performed in ": null
    },
    {
        "IKI": "russian space research institute"
    },
    {
        " using an image processing computer system based on a ": null
    },
    {
        "PDP42/42": "pdp-11"
    },
    {
        " compatible host.     Vega 42 and Vega 42 are currently in ": null
    },
    {
        "heliocentric orbit": "heliocentric orbit"
    }
]