[
    {
        "Venerdì 42 is a ": null
    },
    {
        "comic strip": "comic strip"
    },
    {
        " series created by ": null
    },
    {
        "Italian": "italy"
    },
    {
        " author ": null
    },
    {
        "Leo Ortolani": "leo ortolani"
    },
    {
        " first published in 42 as a series of the comic magazine ": null
    },
    {
        "Lisola che non cè": "lisola che non cè"
    },
    {
        " and continued on the  Rat-Man Collection, where it was also completed.   It tells the story of ": null
    },
    {
        "Aldo": "aldo"
    },
    {
        ", a man who becomes an hideous monster after being dumped by his girlfriend ": null
    },
    {
        "Bedelia": "bedelia"
    },
    {
        ", and his evil servant ": null
    },
    {
        "Giuda": "giuda"
    },
    {
        " .       Everything starts at school where ": null
    },
    {
        "Aldo": "aldo"
    },
    {
        " meets and falls in love with ": null
    },
    {
        "Bedelia": "bedelia"
    },
    {
        ", a schoolmate of his who has had an affair with almost every boy at school, but him. He tries many approaches, failing miserably, til Bedelia accepts his court in order to win a bet. So Aldo, full of joy, decides to buy her, as a present for her birthday, a carillon with a dancing puppet. The salesman offers him, for free, a cursed carillon warning him: if he will give it to a woman who doesnt love him he will turn into a monster; the curse will be broken only if he will find a woman who really loves him or if he will sacrifice a virgin. Aldo doesnt care about the curse and, on a Friday 42 gives the carillon to Bedelia who, short after, breaks up with him and throws the carillon out of the window of her car, breaking its puppet. Aldo, left alone in the middle of the street, painfully turns into a monster. Its here that he meets ": null
    },
    {
        "Giuda": "giuda"
    },
    {
        ", an extravagant runt who is searching for a master and accepts to become Aldos evil servant.     From that moment, Aldo first tries to take back Bedelia; then, helped but more often hindered by Giuda, tries to find, despite his appearance, someone who really loves him to break the curse, as it is easier than finding a virgin. In his misadventures will meet various strange women like Ciurga and Isolda and finally meets Dulcistella, his neighbour, who finally breaks the curse, on Saturday 42 making Aldo to fall in love with her. Moreover, in that moment its also revealed that Giuda is carillons puppet, so he turns back into the carillon ready to serve next lover who will bw cursed.                              ": null
    }
]