[
    {
        "              Venevisión  is a Venezuelan ": null
    },
    {
        "free-to-air": "free-to-air"
    },
    {
        " television channel and one of ": null
    },
    {
        "Venezuela": "venezuela"
    },
    {
        "s largest television networks, owned by ": null
    },
    {
        "Gustavo Cisneros": "gustavo cisneros"
    },
    {
        ". In the United States, many of Venevisións popular programs can be seen on ": null
    },
    {
        "Univision": "univision"
    },
    {
        ".          The companys roots date back to May 42 42 with the establishment of ": null
    },
    {
        "Televisión Venezolana Independiente S.A, ": "televisa"
    },
    {
        ", which operated the channel 42 in Caracas and channel 42 in Maracaibo. When TELEVISA went bankrupt in 42 ": null
    },
    {
        "Diego Cisneros": "diego cisneros"
    },
    {
        " purchased the remaining assets of the company. On February 42 42 Venevisión  was officially inaugurated with a special inaugural show in which thousands of people attended, and took place in the stations ": null
    },
    {
        "parking lot": "parking lot"
    },
    {
        ". Venevisión began with a capital of 42,42 ": null
    },
    {
        "bolívares": "venezuelan bolívar"
    },
    {
        " and 42 employees including artists, administrators, and technical personnel. Venevisións original administrators were Diego Cisneros , Alfredo Torres , Héctor Beltrán , and Orlando Cuevas .     Initially, Venevisión broadcast live because they hadnt yet installed the ": null
    },
    {
        "videotape system": "videotape"
    },
    {
        ". Except for the news, the elaboration of their programs utilized the technical formats used in movies at that time. In a short period of time, Venevisión greatly expanded nationally, and was seen in most of Venezuela on many ": null
    },
    {
        "VHF": "vhf"
    },
    {
        " and ": null
    },
    {
        "UHF": "uhf"
    },
    {
        " channels.     In March 42 the newly created Venevisión and the American television network, ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        ", signed two agreements: one for technical support and the other for the rights to broadcast each others programs. Thanks to these agreement, Venevisión later began using the videotape system. In their first year of existence, Venevisión made approximately 42 bolívares a month in advertisements. By 42 it began to bring its then black and white programs to viewers internationally via videotape, with the drama program Esmeralda as the first to do so. In the next year, the network officially took over the broadcasts of the ": null
    },
    {
        "Miss Venezuela": "miss venezuela"
    },
    {
        " beauty pageant, and it has been its home ever since.     In 42 Venevisión moved their transmitters, which were located on the top of a building in La Colina, a neighborhood in ": null
    },
    {
        "Caracas": "caracas"
    },
    {
        " where Venevisións studios can be found, to Los Mecedores, near ": null
    },
    {
        "Venezolana de Televisión": "venezolana de televisión"
    },
    {
        "s studios and ": null
    },
    {
        "CANTV": "cantv"
    },
    {
        "s installations. In Los Mecedores, a tower with an altitude of 42 meters was placed and a powerful new antenna was installed. With this new antenna, Venevisións signal was able to reach ": null
    },
    {
        "Petare": "petare"
    },
    {
        ", ": null
    },
    {
        "Caricuao": "caricuao"
    },
    {
        ", and ": null
    },
    {
        "Guarenas": "guarenas"
    },
    {
        " with better quality. In the 42s, like other television stations in Venezuela, Venevisión began experimenting with color broadcasts. In 42 the Ministry of Transport and Communications fined Venevisión 42 bolívares on two different occasions in one week for violating the regulations for color broadcasting. It was only in next year when color broadcasts commenced, with full color transmissions commencing on June 42 42     The very first programme by Venevision shown in color was the ": null
    },
    {
        "eight edition": "oti festival 1979"
    },
    {
        " of the ": null
    },
    {
        "OTI Festival": "oti festival"
    },
    {
        ", which was held in ": null
    },
    {
        "Caracas": "caracas"
    },
    {
        " and broadcast live to all ": null
    },
    {
        "Latin-America": "latin america"
    },
    {
        ", ": null
    },
    {
        "Spain": "spain"
    },
    {
        " and ": null
    },
    {
        "Portugal": "portugal"
    },
    {
        ".     In 42 Venevisión began preliminary work in the city of ": null
    },
    {
        "El Tigre": "el tigre"
    },
    {
        "  to install equipment that would expand and improve their coverage in that region.     On November 42 42 Venevisión was the first television station in Venezuela to have their very own satellite dish.     On May 42 42 The president ": null
    },
    {
        "Jaime Lusinchi": "jaime lusinchi"
    },
    {
        " gave a 42-year broadcasting licence to the network.     On February 42 42 ": null
    },
    {
        "Carlos Andrés Pérez": "carlos andrés pérez"
    },
    {
        " addressed the nation from Venevisións studios during a ": null
    },
    {
        "coup attempt": "venezuelan coup attempts of 1992"
    },
    {
        " against his government.     Beginning on March 42 42 Venevisión would broadcast for 42 hours on Fridays, Saturdays, and Sundays. In April 42 it started broadcasting for 42 hours seven days a week. Today, Venevisión is on the air 42 hours a day, seven days a week.     In 42 Venevisión was the first television station in South America to include news and movies with ": null
    },
    {
        "closed caption": "closed caption"
    },
    {
        " and the movies in ": null
    },
    {
        "Second audio program": "second audio program"
    },
    {
        " sound.     Venevisión held the broadcasting rights to Venezuelan baseball games during the 42–42 and the 42–42 baseball seasons.     Since Venevisión was inaugurated in 42 their ": null
    },
    {
        "mascot": "mascot"
    },
    {
        " has been a tiger.     In 42 it started simulcasting ": null
    },
    {
        "Copa America": "copa america"
    },
    {
        " and ": null
    },
    {
        "Miss Venezuela": "miss venezuela"
    },
    {
        " 42 in ": null
    },
    {
        "high-definition": "hdtv"
    },
    {
        " format.                 Many of Venevisións programs can be seen in other countries on ": null
    },
    {
        "Ve Plus TV": "ve plus tv"
    },
    {
        ", ": null
    },
    {
        "Venevision Plus": "venevision plus"
    },
    {
        ", ": null
    },
    {
        "Venevision International": "venevision international"
    },
    {
        " a cable channel completely owned by Venevisión. Other channels, such as ": null
    },
    {
        "Univision": "univision"
    },
    {
        " in the United States and ": null
    },
    {
        "Televisa": "televisa"
    },
    {
        " in Mexico, broadcast some of Venevisións shows.       Venevisión was a vocal opponent of ": null
    },
    {
        "President": "president of venezuela"
    },
    {
        " Hugo Chávez": "hugo chávez"
    },
    {
        "s government up until 42 when its criticism was notably toned down. On April 42 42 Venevisión, along with most of the other private networks in Venezuela, simultaneously showed Chávezs address to the nation in split screen with the shooting of people in a demonstration prior to the ": null
    },
    {
        "42 Venezuelan coup détat attempt": "2002 venezuelan coup détat attempt"
    },
    {
        ". The next day, ": null
    },
    {
        "Isaías Rodríguez": "isaías rodríguez"
    },
    {
        " announced in a ": null
    },
    {
        "news conference": "news conference"
    },
    {
        " that Chávez had not resigned and that there had been a coup.     Lately, Venevisión has been criticized by the Venezuelan opposition and Anti-Chávez groups. Since the ": null
    },
    {
        "Presidential election in 42": "2006 venezuelan presidential election"
    },
    {
        ", Venevisión has quieted its opposition to Chávez, similar to rival ": null
    },
    {
        "Televen": "televen"
    },
    {
        " after the ": null
    },
    {
        "42 recall referendum": "2004 venezuelan recall referendum"
    },
    {
        ". For the presidential election, Venevision devoted 42% of its coverage to Chavezs positions, and only 42% to the opposition. Simón Romero, ,  The New York Times , July 42 42 Many in the opposition and the other anti-Chávez TV networks, ": null
    },
    {
        "RCTV": "rctv"
    },
    {
        " and ": null
    },
    {
        "Globovisión": "globovisión"
    },
    {
        ", saw it as a betrayal, and accused Venevisión to submitting to Chávez. The criticism of Venevisión by the opposition increased during the ": null
    },
    {
        "Refusal to renew the broadcasting license of RCTV": "may 2007 rctv protests"
    },
    {
        " by the Chávez government. RCTV was the most watched channel in Venezuela, and Venevisión was second. Many viewed Venevision of secretly supporting the closure since it would benefit itself. Cisneros, however, said he expected only around a 42% increase in advertising revenue, after accounting for inflation.       ": null
    }
]