[
    {
        "      A Venn diagram  is a ": null
    },
    {
        "diagram": "diagram"
    },
    {
        " that shows all possible ": null
    },
    {
        "logic": "logic"
    },
    {
        "al relations between a finite collection of different ": null
    },
    {
        "sets": "set"
    },
    {
        ". These diagrams depict ": null
    },
    {
        "element": "element"
    },
    {
        "s as points in the plane, and ": null
    },
    {
        "set": "set"
    },
    {
        "s as regions inside closed curves. A Venn diagram consists of multiple overlapping closed curves, usually circles, each representing a set. The points inside a curve labelled S represent elements of the set S, while points outside the boundary represent elements not in the set S. This lends to easily read visualizations; for example, the set of all elements that are members of both sets S and T, S  ∩  T, is represented visually by the area of overlap of the regions S and T. In Venn diagrams the curves are overlapped in every possible way, showing all possible relations between the sets. They are thus a special case of ": null
    },
    {
        "Euler diagrams": "euler diagram"
    },
    {
        ", which do not necessarily show all relations. Venn diagrams were conceived around 42 by ": null
    },
    {
        "John Venn": "john venn"
    },
    {
        ". They are used to teach elementary ": null
    },
    {
        "set theory": "set theory"
    },
    {
        ", as well as illustrate simple set relationships in ": null
    },
    {
        "probability": "probability"
    },
    {
        ", ": null
    },
    {
        "logic": "logic"
    },
    {
        ", ": null
    },
    {
        "statistics": "statistics"
    },
    {
        ", ": null
    },
    {
        "linguistics": "linguistics"
    },
    {
        ", and ": null
    },
    {
        "computer science": "computer science"
    },
    {
        ".     A Venn diagram in which the area of each shape is proportional to the number of elements it contains is called an area-proportional or scaled Venn diagram.          This example involves two ": null
    },
    {
        "sets": "set"
    },
    {
        ", A and B, represented here as coloured circles. The orange circle, set A, represents all living creatures that are two-legged. The blue circle, set B, represents the living creatures that can fly. Each separate type of creature can be imagined as a point somewhere in the diagram. Living creatures that both can fly and have two legs—for example, parrots—are then in both sets, so they correspond to points in the region where the blue and orange circles overlap. It is important to note that this overlapping region would only contain those elements that are members of both set A and are also members of set B     Humans and penguins are bipedal, and so are then in the orange circle, but since they cannot fly they appear in the left part of the orange circle, where it does not overlap with the blue circle. Mosquitoes have six legs, and fly, so the point for mosquitoes is in the part of the blue circle that does not overlap with the orange one. Creatures that are not two-legged and cannot fly would all be represented by points outside both circles.     The combined region of sets A and B is called the  union  of A and B, denoted by . The union in this case contains all living creatures that are either two-legged or that can fly .     The region in both A and B, where the two sets overlap, is called the  intersection  of A and B, denoted by . For example, the intersection of the two sets is not empty, because there are points that represent creatures that are in both the orange and blue circles.                 Venn diagrams were introduced in 42 by ": null
    },
    {
        "John Venn": "john venn"
    },
    {
        " in a paper entitled On the Diagrammatic and Mechanical Representation of Propositions and Reasonings in the Philosophical Magazine and Journal of Science, about the different ways to represent ": null
    },
    {
        "proposition": "proposition"
    },
    {
        "s by diagrams. The use of these types of ": null
    },
    {
        "diagram": "diagram"
    },
    {
        "s in ": null
    },
    {
        "formal logic": "formal logic"
    },
    {
        ", according to ": null
    },
    {
        "Frank Ruskey": "frank ruskey"
    },
    {
        " and Mark Weston, is not an easy history to trace, but it is certain that the diagrams that are popularly associated with Venn, in fact, originated much earlier. They are rightly associated with Venn, however, because he comprehensively surveyed and formalized their usage, and was the first to generalize them .     Venn himself did not use the term Venn diagram and referred to his invention as ": null
    },
    {
        "Eulerian Circle": "eulerian circle"
    },
    {
        "s . For example, in the opening sentence of his 42 article Venn writes, Schemes of diagrammatic representation have been so familiarly introduced into logical treatises during the last century or so, that many readers, even those who have made no professional study of logic, may be supposed to be acquainted with the general nature and object of such devices. Of these schemes one only, viz. that commonly called Eulerian circles, has met with any general acceptance... Lewis Carroll includes Venns Method of Diagrams as well as Eulers Method of Diagrams in an Appendix, Addressed to Teachers of his book Symbolic Logic . The term Venn diagram was later used by ": null
    },
    {
        "Clarence Irving Lewis": "clarence irving lewis"
    },
    {
        " in 42 in his book A Survey of Symbolic Logic.     Venn diagrams are very similar to ": null
    },
    {
        "Euler diagram": "euler diagram"
    },
    {
        "s, which were invented by ": null
    },
    {
        "Leonhard Euler": "leonhard euler"
    },
    {
        " in the 42th century. M.  E.  Baron has noted that ": null
    },
    {
        "Leibniz": "gottfried wilhelm leibniz"
    },
    {
        " in the 42th century produced similar diagrams before Euler, but much of it was unpublished. She also observes even earlier Euler-like diagrams by ": null
    },
    {
        "Ramon Llull": "ramon llull"
    },
    {
        " in the 42th Century.     In the 42th century, Venn diagrams were further developed. D.  W.  Henderson showed in 42 that the existence of an n-Venn diagram with n-fold ": null
    },
    {
        "rotational symmetry": "rotational symmetry"
    },
    {
        " implied that n was a ": null
    },
    {
        "prime number": "prime number"
    },
    {
        ". He also showed that such symmetric Venn diagrams exist when n is five or seven. In 42 Peter Hamburger found symmetric Venn diagrams for n 42 and in 42 Griggs, Killian, and Savage showed that symmetric Venn diagrams exist for all other primes. Thus rotationally symmetric Venn diagrams exist if and only if n is a prime number.     Venn diagrams and Euler diagrams were incorporated as part of instruction in ": null
    },
    {
        "set theory": "set theory"
    },
    {
        " as part of the ": null
    },
    {
        "new math": "new math"
    },
    {
        " movement in the 42s. Since then, they have also been adopted in the curriculum of other fields such as reading.             A Venn diagram is constructed with a collection of simple closed curves drawn in a plane. According to Lewis, the principle of these diagrams is that classes or  set s be represented by regions in such relation to one another that all the possible logical relations of these classes can be indicated in the same diagram. That is, the diagram initially leaves room for any possible relation of the classes, and the actual or given relation, can then be specified by indicating that some particular region is null or is not-null .      Venn diagrams normally comprise overlapping ": null
    },
    {
        "circle": "circle"
    },
    {
        "s. The interior of the circle symbolically represents the ": null
    },
    {
        "element": "element"
    },
    {
        "s of the set, while the exterior represents elements that are not members of the set. For instance, in a two-set Venn diagram, one circle may represent the group of all ": null
    },
    {
        "wood": "wood"
    },
    {
        "en objects, while another circle may represent the set of all tables. The overlapping region or  intersection  would then represent the set of all wooden tables. Shapes other than circles can be employed as shown below by Venns own higher set diagrams. Venn diagrams do not generally contain information on the relative or absolute sizes  of sets; i.e. they are ": null
    },
    {
        "schematic": "schematic"
    },
    {
        " diagrams.     Venn diagrams are similar to ": null
    },
    {
        "Euler diagram": "euler diagram"
    },
    {
        "s. However, a Venn diagram for n component sets must contain all 42 n hypothetically possible zones that correspond to some combination of inclusion or exclusion in each of the component sets. Euler diagrams contain only the actually possible zones in a given context. In Venn diagrams, a shaded zone may represent an empty zone, whereas in an Euler diagram the corresponding zone is missing from the diagram. For example, if one set represents dairy products and another cheeses, the Venn diagram contains a zone for cheeses that are not dairy products. Assuming that in the context cheese Extensions to higher numbers of sets": null
    },
    {
        "simplex": "simplex"
    },
    {
        " and can be visually represented. The 42 intersections correspond to the vertices of a ": null
    },
    {
        "tesseract": "tesseract"
    },
    {
        " .          For higher numbers of sets, some loss of symmetry in the diagrams is unavoidable. Venn was keen to find symmetrical figures...elegant in themselves, that represented higher numbers of sets, and he devised an elegant four-set diagram using ": null
    },
    {
        "ellipse": "ellipse"
    },
    {
        "s . He also gave a construction for Venn diagrams for any number of sets, where each successive curve that delimits a set interleaves with previous curves, starting with the three-circle diagram.       Image:Venn42svg|Venns construction for four sets   Image:Venn42svg|Venns construction for five sets   Image:Venn42svg|Venns construction for six sets   Image:Venns four ellipse construction.svg|Venns four-set diagram using ellipses   Image:CirclesN42xb.svg|Non-example: This ": null
    },
    {
        "Euler diagram": "euler diagram"
    },
    {
        " is not ": null
    },
    {
        "rotationally symmetrical": "rotational symmetry"
    },
    {
        " arrangement devised by ": null
    },
    {
        "Branko Grünbaum": "branko grünbaum"
    },
    {
        ". Labels have been simplified for greater readability; for example, A denotes , while BCE denotes         Edwards–Venn diagrams": null
    },
    {
        "Anthony William Fairbank Edwards": "anthony william fairbank edwards"
    },
    {
        " constructed a series of Venn diagrams for higher numbers of sets by segmenting the surface of a sphere, which became known as Edwards–Venn diagrams. For example, three sets can be easily represented by taking three hemispheres of the sphere at right angles . A fourth set can be added to the representation by taking a curve similar to the seam on a tennis ball, which winds up and down around the equator, and so on. The resulting sets can then be projected back to a plane to give cogwheel diagrams with increasing numbers of teeth, as shown here. These diagrams were devised while designing a ": null
    },
    {
        "stained-glass": "stained-glass"
    },
    {
        " window in memory of Venn.       Edwards–Venn diagrams are ": null
    },
    {
        "topologically equivalent": "topological equivalence"
    },
    {
        " to diagrams devised by ": null
    },
    {
        "Branko Grünbaum": "branko grünbaum"
    },
    {
        ", which were based around intersecting ": null
    },
    {
        "polygon": "polygon"
    },
    {
        "s with increasing numbers of sides. They are also two-dimensional representations of ": null
    },
    {
        "hypercube": "hypercube"
    },
    {
        "s.     ": null
    },
    {
        "Henry John Stephen Smith": "henry john stephen smith"
    },
    {
        " devised similar n-set diagrams using ": null
    },
    {
        "sine": "sine"
    },
    {
        " curves with the series of equations   : y_i \\frac \\text 42 \\leq i \\leq n42 \\text i \\in \\mathbb.     ": null
    },
    {
        "Charles Lutwidge Dodgson": "charles lutwidge dodgson"
    },
    {
        "  devised a five-set diagram known as ": null
    },
    {
        "Carrolls square": "carrolls square"
    },
    {
        ". Joaquin and Boyles, on the other hand, proposed supplemental rules for the standard Venn diagram in able to account for certain problem cases. For instance, regarding the issue of representing singular statements, they suggest to consider the Venn diagram circle as a representation of a set of things, and use ": null
    },
    {
        "first-order logic": "first-order logic"
    },
    {
        " and ": null
    },
    {
        "set theory": "set theory"
    },
    {
        " to treat categorical statements as statements about sets. Additionally, they propose to treat singular statements as statements about ": null
    },
    {
        "set membership": "set membership"
    },
    {
        ". So, for example, to represent the statement a is F in this retooled Venn diagram, a small letter a may be placed inside the circle that represents the set F. Joaquin, J.J. and Boyles, R.J.M. . . Teaching Philosophy, Volume 42 pp. 4242     Related concepts   Venn diagrams correspond to ": null
    },
    {
        "truth table": "truth table"
    },
    {
        "s for the propositions x\\in A , x\\in B , etc., in the sense that each region of Venn diagram corresponds to one row of the truth table. This type is also known as Johnston diagram. Another way of representing sets is with John F. Randolphs ": null
    },
    {
        "R-diagram": "r-diagram"
    }
]