[
    {
        "      A verb, from the Latin verbum meaning word, is a ": null
    },
    {
        "word": "word"
    },
    {
        "  that in ": null
    },
    {
        "syntax": "syntax"
    },
    {
        " conveys an action , an occurrence , or a state of being . In the usual description of ": null
    },
    {
        "English": "english language"
    },
    {
        ", the basic form, with or without the ": null
    },
    {
        "particle": "grammatical particle"
    },
    {
        " to, is the ": null
    },
    {
        "infinitive": "infinitive"
    },
    {
        ". In many ": null
    },
    {
        "language": "language"
    },
    {
        "s, verbs are ": null
    },
    {
        "inflected": "inflection"
    },
    {
        " to encode ": null
    },
    {
        "tense": "grammatical tense"
    },
    {
        ", ": null
    },
    {
        "aspect": "grammatical aspect"
    },
    {
        ", ": null
    },
    {
        "mood": "grammatical mood"
    },
    {
        ", and ": null
    },
    {
        "voice": "voice"
    },
    {
        ". A verb may also agree with the ": null
    },
    {
        "person": "grammatical person"
    },
    {
        ", ": null
    },
    {
        "gender": "grammatical gender"
    },
    {
        " or ": null
    },
    {
        "number": "grammatical number"
    },
    {
        " of some of its ": null
    },
    {
        "argument": "argument"
    },
    {
        "s, such as its ": null
    },
    {
        "subject": "subject"
    },
    {
        ", or ": null
    },
    {
        "object": "object"
    },
    {
        ". Verbs have tenses: present, to indicate that an action is being carried out; past, to indicate that an action has been done; future, to indicate that an action will be done.            In languages where the verb is inflected, it often agrees with its primary argument in person, number or gender. With the exception of the verb to be, English shows distinctive agreements only in the third person singular, present tense form of verbs, which are marked by adding -s  or -es . The rest of the persons are not distinguished in the verb .     ": null
    },
    {
        "Latin": "latin"
    },
    {
        " and the ": null
    },
    {
        "Romance languages": "romance languages"
    },
    {
        " inflect verbs for ": null
    },
    {
        "tense–aspect–mood": "tense–aspect–mood"
    },
    {
        " , and they agree in person and number  with the subject. ": null
    },
    {
        "Japanese": "japanese language"
    },
    {
        ", like many languages with ": null
    },
    {
        "SOV": "subject–object–verb"
    },
    {
        " word order, inflects verbs for tense-aspect-mood, as well as other categories such as negation, but shows absolutely no agreement with the subject - it is a strictly ": null
    },
    {
        "dependent-marking language": "dependent-marking language"
    },
    {
        ". On the other hand, ": null
    },
    {
        "Basque": "basque language"
    },
    {
        ", ": null
    },
    {
        "Georgian": "georgian language"
    },
    {
        ", and some other languages, have  polypersonal agreement : the verb agrees with the subject, the direct object, and even the secondary object if present, a greater degree of ": null
    },
    {
        "head-marking": "head-marking language"
    },
    {
        " than is found in ": null
    },
    {
        "most European": "standard average european"
    },
    {
        " languages.       Verbs vary by type, and each type is determined by the kinds of words that accompany it and the relationship those words have with the verb itself. Classified by the number of their valency arguments, usually three basic types are distinguished: intransitives, transitives, ditransitives and double transitive verbs. Some verbs have special grammatical uses and hence complements, such as copular verbs ; the verb do used for do-support in questioning and negation, and tense or aspect auxiliaries, e.g., be , have or can . In addition, verbs can be nonfinite, namely, not inflected for tense, and have various special forms such as infinitives, participles or gerunds.        An ": null
    },
    {
        "intransitive verb": "intransitive verb"
    },
    {
        " is one that does not have a direct object. Intransitive verbs may be followed by an ": null
    },
    {
        "adverb": "adverb"
    },
    {
        " or end a sentence. For example: The woman spoke softly. The athlete ran faster than the official. The boy wept.       A ": null
    },
    {
        "transitive verb": "transitive verb"
    },
    {
        " is followed by a noun or ": null
    },
    {
        "noun phrase": "noun phrase"
    },
    {
        ". These noun phrases are not called predicate nouns, but are instead called direct objects because they refer to the object that is being acted upon. For example: My friend read the newspaper. The teenager earned a speeding ticket.     A way to identify a transitive verb is to invert the sentence, making it passive. For example: The newspaper was read by my friend. A speeding ticket was earned by the teenager.       Ditransitive verbs  precede either two noun phrases or a noun phrase and then a prepositional phrase often led by to or for. For example: The players gave their teammates high fives. The players gave high fives to their teammates.     When two noun phrases follow a transitive verb, the first is an indirect object, that which is receiving something, and the second is a direct object, that being acted upon. Indirect objects can be noun phrases or prepositional phrases.        Double transitive verbs  are followed by a noun phrase that serves as a direct object and then a second noun phrase, adjective, or ": null
    },
    {
        "infinitive": "infinitive"
    },
    {
        " phrase. The second element is called a complement, which completes a ": null
    },
    {
        "clause": "clause"
    },
    {
        " that would not otherwise have the same meaning. For example: The young couple considers the neighbors wealthy people. Some students perceive adults quite inaccurately. Sarah deemed her project to be the hardest she has ever completed.       ": null
    },
    {
        "Copular verbs": "copula"
    },
    {
        "  cant be followed by an ": null
    },
    {
        "adverb": "adverb"
    },
    {
        " or end a sentence, but instead must be followed by a noun or adjective, whether in a single word or phrase. Common copulae include be, seem, become, appear, look, and remain. For example: His mother looked worried. Josh remained a reliable friend. Copulae are thought to link the adjective or noun to the subject.     The copular verb be is manifested in eight forms: be, is, am, are, was, were, been, and being in English. These verbs precede nouns or adjectives in a sentence, which become predicate nouns and predicate adjectives similar to those that function with a linking verb. They can also be followed by an adverb of place, which is sometimes referred to as a predicate adverb. For example: Her daughter was a writing tutor. The singers were very nervous. My house is down the street.     Adjectives that come after copular verbs are predicate adjectives, and nouns that come after linking verbs are predicate nouns.           The number of arguments that a verb takes is called its valency or valence. Verbs can be classified according to their valency:    Avalent  : the verb has neither a subject nor an object. Zero valency does not occur in English; in some languages such as ": null
    },
    {
        "Mandarin Chinese": "mandarin chinese"
    },
    {
        ", weather verbs like snow take no subject or object.    Intransitive  : the verb only has a ": null
    },
    {
        "subject": "subject"
    },
    {
        ". For example: he runs , it falls .    Transitive  : the verb has a subject and a ": null
    },
    {
        "direct object": "direct object"
    },
    {
        ". For example: she eats fish , we hunt nothing .    Ditransitive  : the verb has a subject, a direct object, and an indirect object. For example: He gives her a flower or She gave John the watch.   A few English verbs, particularly those concerned with financial transactions, take four arguments, as in Pat 42 sold Chris 42 a lawnmower 42 for $42 42 or Chris 42 paid Pat 42 $42 42 for a lawnmower 42 .     ": null
    },
    {
        "Weather verb": "weather verb"
    },
    {
        "s often appear to be ": null
    },
    {
        "impersonal": "impersonal verb"
    },
    {
        " in ": null
    },
    {
        "null-subject language": "null-subject language"
    },
    {
        "s like ": null
    },
    {
        "Spanish": "spanish language"
    },
    {
        ", where the verb llueve means It rains . In English, French and German, they require a ": null
    },
    {
        "dummy pronoun": "dummy pronoun"
    },
    {
        ", and therefore formally have a valency of 42 However, as verbs in Spanish incorporate the subject as a TAM suffix, Spanish is not actually a null-subject language, unlike Mandarin . Such verbs in Spanish also have a valency of 42     Intransitive and transitive verbs are the most common, but the impersonal and  objective verbs  are somewhat different from the norm. In the objective the verb takes an object but no subject; the nonreferent subject in some uses may be marked in the verb by an incorporated dummy pronoun similar to that used with the English weather verbs. Impersonal verbs in null subject languages take neither subject nor object, as is true of other verbs, but again the verb may show incorporated dummy pronouns despite the lack of subject and object phrases.     Verbs are often flexible with regard to valency. In non-valency marking languages such as English, a transitive verb can often drop its object and become intransitive; or an intransitive verb can take an object and become transitive. For example, in English the verb move has no grammatical object in he moves ; but in he moves the car, the subject and object are distinct and the verb has a different valency. Some verbs in English, however, have historically derived forms that show change of valency in some causative verbs, such as fall-fell-fallen:fell-felled-felled; rise-rose-risen:raise-raised-raised; cost-cost-cost:cost-costed-costed.     In valency marking languages, valency change is shown by inflecting the verb in order to change the valency. In ": null
    },
    {
        "Kalaw Lagaw Ya": "kalaw lagaw ya"
    },
    {
        " of Australia, for example, verbs distinguish valency by argument agreement suffixes and TAM endings:   Nui mangema He arrived earlier today    Palai mangemanu They arrived earlier today   Thana mangemainu They arrived earlier today   Verb structure: manga-i- TAM arrive+active+singular/dual/plural+TAM   Nuidh wapi manganu He took the fish earlier today    Nuidh wapi mangamanu He took the two fish earlier today   Nuidh wapil mangamainu He took the fish earlier today   Verb structure: manga-Ø- TAM arrive+attainative+singular/dual/plural+TAM     The verb stem manga- to take/come/arrive at the destination takes the active suffix -i  ref  /ref ref nameDahl  /ref ref  /ref  ref nameDahl/ ref  /ref  ref  /ref  ref  /ref  ref  /ref ": null
    }
]