[
    {
        "     Victor Amadeus II  was ": null
    },
    {
        "Duke of Savoy": "duke of savoy"
    },
    {
        " from 42 to 42 He also held the titles of ": null
    },
    {
        "marquis": "marquis"
    },
    {
        " of ": null
    },
    {
        "Saluzzo": "saluzzo"
    },
    {
        ", ": null
    },
    {
        "duke": "duke"
    },
    {
        " of ": null
    },
    {
        "Montferrat": "montferrat"
    },
    {
        ", ": null
    },
    {
        "prince": "prince"
    },
    {
        " of ": null
    },
    {
        "Piedmont": "piedmont"
    },
    {
        " and ": null
    },
    {
        "count": "count"
    },
    {
        " of ": null
    },
    {
        "Aosta": "aosta"
    },
    {
        ", ": null
    },
    {
        "Moriana": "moriana"
    },
    {
        " and ": null
    },
    {
        "Nice": "nice"
    },
    {
        ".     ": null
    },
    {
        "Louis XIV": "louis xiv"
    },
    {
        " organised his marriage in order to maintain French influence in the Duchy, but Victor Amadeus soon broke away from the influence of France. At his fathers death in 42 his mother took over a regency in the name of her nine-year-old son and would remain in ": null
    },
    {
        "de facto": "de facto"
    },
    {
        " power till 42 when Victor Amadeus banished her further involvement in the state.     Having fought in the ": null
    },
    {
        "War of the Spanish Succession": "war of the spanish succession"
    },
    {
        ", he became ": null
    },
    {
        "king of Sicily": "kingdom of sicily"
    },
    {
        " in 42 but he was forced to exchange this title and instead became ": null
    },
    {
        "king of Sardinia": "kingdom of sardinia"
    },
    {
        ".     Victor Amadeus left a considerable cultural influence in Turin, remodeling the ": null
    },
    {
        "Royal Palace of Turin": "royal palace of turin"
    },
    {
        ", ": null
    },
    {
        "Palace of Venaria": "palace of venaria"
    },
    {
        ", ": null
    },
    {
        "Palazzina di caccia of Stupinigi": "palazzina di caccia of stupinigi"
    },
    {
        ", as well as building the ": null
    },
    {
        "Basilica of Superga": "basilica of superga"
    },
    {
        " where he rests.       Victor Amadeus was born in ": null
    },
    {
        "Turin": "turin"
    },
    {
        " to ": null
    },
    {
        "Charles Emmanuel II, Duke of Savoy": "charles emmanuel ii, duke of savoy"
    },
    {
        " and his second wife ": null
    },
    {
        "Marie Jeanne of Savoy": "marie jeanne of savoy"
    },
    {
        ". Named after his paternal grandfather ": null
    },
    {
        "Victor Amadeus I": "victor amadeus i"
    },
    {
        " he was their only child. As an infant he was styled as the  Prince of Piedmont , traditional title of the ": null
    },
    {
        "heir apparent": "heir apparent"
    },
    {
        " to the ": null
    },
    {
        "duchy of Savoy": "duchy of savoy"
    },
    {
        ". A weak child, his health was greatly monitored. As an infant he had a passion for soldiers and was noted as being very intelligent.     His father died in June 42 in Turin at the age of forty after a series of convulsive fevers. His mother was declared Regent of Savoy and, known as  Madame Royale  at court, took power. In 42 during her regency, she tried to arrange a marriage between Victor Amadeus and his first cousin ": null
    },
    {
        "Infanta Isabel Luísa of Portugal": "isabel luísa, princess of beira"
    },
    {
        ", the presumptive heiress of her father, ": null
    },
    {
        "Peter II": "peter ii of portugal"
    },
    {
        " and ": null
    },
    {
        "Victor Amadeus aunt": "maria francisca of savoy"
    },
    {
        ". His mother urged him to agree to the marriage, as this would have left Marie Jeanne permanently in control of the Duchy of Savoy as Regent because her son would have had to live in Portugal with his new wife. The duchy would then revert to the ": null
    },
    {
        "Kingdom of Portugal": "kingdom of portugal"
    },
    {
        " at her death. Victor Amadeus refused, and a party was even formed which refused to recognise his leaving Savoy. Despite a marriage contract being signed between Portugal and Savoy on 42 May 42 the marriage between Victor Amadeus and the Infanta came to nothing and was thus cancelled.     Other candidates included ": null
    },
    {
        "Maria Antonia of Austria": "maria antonia of austria"
    },
    {
        ", a ": null
    },
    {
        "Countess Palatine of Neuburg": "maria sofia of neuburg"
    },
    {
        " and ": null
    },
    {
        "Anna Maria Luisa de Medici": "anna maria luisa de medici"
    },
    {
        ". Victor Amadeus was keen on the match with ": null
    },
    {
        "Tuscany": "tuscany"
    },
    {
        " and negotiations were kept secret from France even though the match never happened. Under the influence of Louis XIV and Marie Jeanne, Victor Amadeus was forced to marry a French princess ": null
    },
    {
        "Anne Marie dOrléans": "anne marie dorléans"
    },
    {
        ". His mother was keen on the match and had always promoted French interests having been born in Paris a member of a ": null
    },
    {
        "cadet branch": "cadet branch"
    },
    {
        " of the ": null
    },
    {
        "House of Savoy": "house of savoy"
    },
    {
        ". He asked for Anne Maries hand in March 42 Victor Amadeus, who had been using political allies to gain support to end his mothers grip on power, succeeded in 42 when she was banished from further influence in the state.       A significant event of his mothers regency was the  Salt Wars  of 42 These rebellions were caused by the unpopular taxes on salt in all cities in Savoy. The system had been put in place by ": null
    },
    {
        "Emmanuel Philibert, Duke of Savoy": "emmanuel philibert, duke of savoy"
    },
    {
        " in order to raise money for the crown. The annual payment of a tax which had been in place for over 42 years caused great discontent and rebellion finally broke out in ": null
    },
    {
        "Mondovì": "mondovì"
    },
    {
        ", where the people refused to pay taxes to the emissary of Savoy, ": null
    },
    {
        "Andrea Cantatore di Breo": "andrea cantatore di breo"
    },
    {
        ". The unrest caused an army to be sent to stop the unrest in the town, which was pacified quickly. However, in the town of ": null
    },
    {
        "Montaldo": "montaldo di mondovì"
    },
    {
        ", the unrest began again and was more serious than before. 42 soldiers were killed in warfare which lasted for several days.     The news of these rebellions soon reached a wider scope and it became clear that soon the whole of ": null
    },
    {
        "Piedmont": "piedmont"
    },
    {
        " was on the verge of revolt. Power at this point still being with Victor Amadeus mother, she ordered representatives of the town of Mondovì to go to Turin to conclude treaties and were cordially welcomed by the young Victor Amadeus, who agreed to the treaties. The event had allowed Victor Amadeus a chance to exert some power.       Having succeeded in ending his mothers power in Savoy, Victor Amadeus looked to his oncoming marriage with the youngest child of ": null
    },
    {
        "Philippe I, Duke of Orléans": "philippe i, duke of orléans"
    },
    {
        " and ": null
    },
    {
        "Henrietta of England": "henrietta of england"
    },
    {
        ". The contract of marriage between Anne Marie and the Duke of Savoy was signed at ": null
    },
    {
        "Versailles": "palace of versailles"
    },
    {
        " on 42 April; On 42 April 42 Anne Marie was married at Versailles, by proxy, to Victor Amadeus. The couple were married in person on 42 May 42          At the urging of Louis, Victor Amadeus II began a large scale persecution of the ": null
    },
    {
        "Vaudois": "waldensians"
    },
    {
        "  in 42 The state had been bankrupted due to various conflicts and a famine in 42 which had used all last resources. Due to his alliances with ": null
    },
    {
        "England": "england"
    },
    {
        " and the ": null
    },
    {
        "Dutch Republic": "dutch republic"
    },
    {
        " during the ": null
    },
    {
        "Nine Years War": "nine years war"
    },
    {
        ", he was forced to cease this practice from 42 and in 42 granted an ": null
    },
    {
        "Edict of Toleration": "edict of toleration"
    },
    {
        ". However, in 42 Louis XIV forced him to expel all ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " immigrants from Savoy in accordance with a treaty of 42     During this period he became anxious to free himself of domination by Louis, and his first sign of independence was his independent visit to ": null
    },
    {
        "Venice": "venice"
    },
    {
        " in 42 where he conferred with ": null
    },
    {
        "Prince Eugene of Savoy": "prince eugene of savoy"
    },
    {
        " and others. Louis discovered this and demanded that Victor Amadeus launch another expedition against the Vaudois; he grudgingly complied, but as described below soon chose the allies countering France.            Victor Amadeus II undertook sweeping administrative reforms within Savoy. In 42 he established a system of ": null
    },
    {
        "intendant": "intendant"
    },
    {
        "s, based on the French model, responsible for collecting taxes and law enforcement. In 42 he began a land survey which was largely completed by 42 the Perequazione, to examine the land holdings and privileges of the Church and nobility. In 42 he reformed the secretariat system in Turin establishing individual secretaries for war, internal affairs and foreign affairs. From the 42s he also had a new administrative zone built in Turin, around the ducal palace. This zone included a military academy, the ministry of war, a mint, and a customs house. This work was still ongoing upon his death.     Victor Amadeus also undertook a number of military reforms. Often when one of his key fortresses was under attack, he would replace its commanding officer with one of his most reliable and trusted leaders. In 42 he established a select militia within his territories, and he later overhauled the militia system in 42 and strictly codified it. This included an obligation for each region under his rule to provide a number of men for the militia based on population. From 42 he also began to establish his own navy based on the limited Sicilian naval forces he had been granted.     Victor Amadeus was able to use the experienced armies he developed in foreign wars to establish more firm control within his own territories. Faced with rebellion by ": null
    },
    {
        "Mondovì": "mondovì"
    },
    {
        " at the end of the century, he brought a force of veterans from the Nine Years War there and re-established his authority. He employed a similar strategy against an anti-tax riot in ": null
    },
    {
        "Cigliano": "cigliano"
    },
    {
        " in 42       Under his mothers regency Savoy, despite being a state of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ", was closely linked to and heavily dependent upon France, essentially becoming a French satellite. Victor Amadeus II broke this link by joining alliances against France in both the ": null
    },
    {
        "Nine Years War": "nine years war"
    },
    {
        " and the ": null
    },
    {
        "War of the Spanish Succession": "war of the spanish succession"
    },
    {
        ". Savoy was considered a valuable ally in both wars due to its geographical position, enabling a second front to be opened against France in the south. Savoy relied heavily on foreign subsidies, particularly from England and the ": null
    },
    {
        "Dutch Republic": "dutch republic"
    },
    {
        ", in both wars to maintain its armies.       At the start of the Nine Years War, Savoy had three regiments in the service of France in ": null
    },
    {
        "Flanders": "flanders"
    },
    {
        ". Victor Amadeus struggled throughout the early part of the war to bring those troops back into his own use. Part of the agreement he reached with the Grand Alliance against France was that they would enable him to recover ": null
    },
    {
        "Pinerolo": "pinerolo"
    },
    {
        ", which his predecessor and ": null
    },
    {
        "namesake": "victor amadeus i, duke of savoy"
    },
    {
        " had lost decades before. In 42 he was the only member of the Grand Alliance to bring the war to French lands, invading the ": null
    },
    {
        "Dauphiné": "dauphiné"
    },
    {
        ". In 42 and 42 he secretly negotiated a separate treaty with ": null
    },
    {
        "Louis XIV of France": "louis xiv of france"
    },
    {
        " which included the return of Pinerolo to Savoy. Throughout the war, he greatly increased the size of the army of Savoy from about 42 to more than 42            During the War of the Spanish Succession, foreign subsidies amounted for almost half of the revenue raised by Savoy to fight the war. The end of the Nine Years War had helped to design a new balance on the continent: at the death the childless ": null
    },
    {
        "Charles II of Spain": "charles ii of spain"
    },
    {
        " he left his throne to ": null
    },
    {
        "Philip": "philip v of spain"
    },
    {
        ", grandson of Louis XIV. The will stated that should Philip not accept it would go to his brother ": null
    },
    {
        "Charles": "charles, duke of berry"
    },
    {
        ". Victor Amadeus was himself in line to succeed, as a great-grandson of ": null
    },
    {
        "Infanta Catherine Michelle of Spain": "infanta catherine michelle of spain"
    },
    {
        ". As a result, Victor Amadeus expected compensation in the form of a territory which had been owned by the vast Spanish empire. Victor Amadeus had his eye on the ": null
    },
    {
        "Duchy of Milan": "duchy of milan"
    },
    {
        " which, having signed a treaty with Louis XIV, had support in conquering the duchy. With the Treaty of Vigevano in October 42 however Louis XIVs support waned. Victor Amadeus subsequently allied himself with ": null
    },
    {
        "Emperor Leopold I": "emperor leopold i"
    },
    {
        ".     England and Austria ignored his claim, the latter of which had a candidate in the person of ": null
    },
    {
        "Archduke Charles": "charles vi, holy roman emperor"
    },
    {
        ", who immediately proclaimed himself King of Spain. The Grand Duke of Tuscany also ignored his claims. In the meantime he pursued the expansion of Savoy and bought various ": null
    },
    {
        "fiefdoms": "fiefdoms"
    },
    {
        " of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ".     Victor Amadeus was in a position where on most sides of Savoy was a Bourbon ruler, the enemy of Philip V, and he was forced to let French troops enter his lands in order to get Milan which Victor Amadeus had wanted so greatly. Forced to ally himself again this time to Louis XIV and his grandson in Spain, his daughter ": null
    },
    {
        "Maria Luisa": "maria luisa of savoy"
    },
    {
        " was used as a pawn to seal this alliance. His daughter subsequently married Philip V in 42 In 42 he fought bravely at the ": null
    },
    {
        "Battle of Chiari": "battle of chiari"
    },
    {
        ", fought in the name of Bourbon control of Milan. By 42 Victor Amadeus was considering changing allegiance to the emperor again having entered secret correspondence with the emperor who promised him the ": null
    },
    {
        "Duchy of Montferrat": "duchy of montferrat"
    },
    {
        ". In order to appease him, the emperor increased his bribe, adding various territories in ": null
    },
    {
        "Lombardy": "lombardy"
    },
    {
        ", Victor Amadeus having ignored him.     In 42 Victor Amadeus switched sides, joining the Grand Alliance as he had in the Nine Years War. Savoy fared particularly badly against the larger French forces resulting in a ": null
    },
    {
        "siege of Turin": "siege of turin"
    },
    {
        " in 42 Anne Maries uncle, Louis XIV , besieged Turin during the  Battle of Turin . French troops were under the control of Anne Maries half brother, the ": null
    },
    {
        "Duke of Orléans": "philippe ii, duke of orléans"
    },
    {
        ". She and her sons were forced to flee Turin with the grandmother for the safety of ": null
    },
    {
        "Genoa": "genoa"
    },
    {
        ". Turin was saved by the combined forces of Victor Amadeus and ": null
    },
    {
        "Prince Eugene of Savoy": "prince eugene of savoy"
    },
    {
        " in September 42         As a result of his aid in the War of the Spanish Succession, Victor Amadeus II was made King of Sicily in 42 under the Treaty of Utrecht which ended the war. Victor Amadeus was forced to exchange Sicily for the less important ": null
    },
    {
        "kingdom of Sardinia": "kingdom of sardinia"
    },
    {
        " in 42 after objections from an ": null
    },
    {
        "alliance of four nations": "war of the quadruple alliance"
    },
    {
        ", including several of his former allies. The duke was a marquis and Prince and Perpetual Vicar in the Holy Roman Empire.     As ruler of an independent kingdom and a key player in the recent war, Victor Amadeus significantly expanded his foreign relations. As a duke, he had envoys and embassies in France, the Empire, and Rome. In 42 he established his own foreign office.          Having done much to improve the state of his inheritance in 42 Victor Amadeus took the decision to ": null
    },
    {
        "abdicate": "abdicate"
    },
    {
        " in September 42 The previous month the lonely king had lost most of his family, including his favourite and ": null
    },
    {
        "eldest son": "victor amadeus, prince of piedmont"
    },
    {
        " the ": null
    },
    {
        "Prince of Piedmont": "prince of piedmont"
    },
    {
        ", and sought the security of a previous mistress ": null
    },
    {
        "Anna Canalis di Cumiana": "anna canalis di cumiana"
    },
    {
        ". The couple were married in a private ceremony on 42 August 42 in the Royal Chapel in Turin having obtained permission from ": null
    },
    {
        "Pope Clement XII": "pope clement xii"
    },
    {
        ". Still attractive in her forties, Victor Amadeus had long been in love with her and as a wedding gift, created her the Marchioness of ": null
    },
    {
        "Spigno": "spigno monferrato"
    },
    {
        ". The couple made their marriage public on 42 September 42 much to the dismay of the court. A month later, Victor Amadeus announced his wish to ": null
    },
    {
        "abdicate": "abdicate"
    },
    {
        " the throne and did so in a ceremony at the ": null
    },
    {
        "Castle of Rivoli": "castle of rivoli"
    },
    {
        " on the day of his marriage. His son succeeded him as ": null
    },
    {
        "Charles Emmanuel III": "charles emmanuel iii of savoy"
    },
    {
        ".     Taking the style of King Victor Amadeus, he and Anna moved into the ": null
    },
    {
        "château de Chambéry": "chambéry"
    },
    {
        " outside the capital. The couple took a small retinue of servants and Victor Amadeus was kept informed of matters of state. He insisted on having a Louis XIV-style wig with him at all times as his only luxury.     Under the influence of Anna, in 42 having suffered a ": null
    },
    {
        "stroke": "stroke"
    },
    {
        ", Victor Amadeus decided he wanted to resume his tenure on the throne and informed his son of his decision. Arrested by his son, he was transported to the ": null
    },
    {
        "Castle of Moncalieri": "castle of moncalieri"
    },
    {
        " and Anna was taken to a house for reformed prostitutes at the Castle of ": null
    },
    {
        "Ceva": "ceva"
    },
    {
        " but was later allowed to return to the ": null
    },
    {
        "Castle of Rivoli": "castle of rivoli"
    },
    {
        " where her husband was moved. She was returned to him on 42 April. The stroke seemed to have affected Victor Amadeus in a way which caused him to later turn violent towards his wife, blaming her for his misfortunes.     King Victor Amadeus died in September 42 and was buried in the Convent of San Giuseppe di Carignano. His son decided not to bury him in the ": null
    },
    {
        "Basilica of Superga": "basilica of superga"
    },
    {
        " which Victor Amadeus had built and where he asked to be buried, as his son did not want to remind the public of the scandal which his abdication had caused. Anna was moved to the Convent of the Visitation in ": null
    },
    {
        "Pinerolo": "pinerolo"
    },
    {
        " where she died aged 42       Despite his political reforms and his passion for trying to increase the importance of Savoy in Europe, Victor Amadeus left a considerable cultural legacy in the city of his birth. In 42 Victor Amadeus commissioned ": null
    },
    {
        "Le Notre": "le notre"
    },
    {
        " to lay out large gardens at the Palace of Turin where he had previously commissioned the Viennese ": null
    },
    {
        "Daniel Seiter": "daniel seiter"
    },
    {
        " to paint a famous gallery which exists to this day. Victor Amadeus subsequently had Seiter knighted. He also encouraged musical patronage in Savoy and the court became a centre for various musicians of the period.     Being crowned King of Sicily in ": null
    },
    {
        "Palermo": "palermo"
    },
    {
        " in December 42 he returned to Turin in September 42 From Palermo he brought back ": null
    },
    {
        "Filippo Juvarra": "filippo juvarra"
    },
    {
        ", an Italian architect who had spent many years in Rome. Juvarra was patronised by Victor Amadeus and was the mind behind the remodelling of the ": null
    },
    {
        "Royal Palace of Turin": "royal palace of turin"
    },
    {
        ", ": null
    },
    {
        "Palace of Venaria": "palace of venaria"
    },
    {
        ", ": null
    },
    {
        "Palazzina di caccia of Stupinigi": "palazzina di caccia of stupinigi"
    },
    {
        " as well as building the ": null
    },
    {
        "Basilica of Superga": "basilica of superga"
    },
    {
        ". The architect was also responsible for various roads and piazzas in Turin. Victor Amadeus mother also used Juvarra for the famous staircase within the ": null
    },
    {
        "Palazzo Madama": "palazzo madama, turin"
    },
    {
        " where she lived after being banished.     In 42 the  UNESCO  added a group of buildings which were connected to Victor Amadeus and his family to be added to have ": null
    },
    {
        "World Heritage status": "world heritage site"
    },
    {
        ". These buildings including the Royal Palace, the Palazzo Madama, the Palazzina di caccia of Stupinigi and his wifes  Villa della Regina  were grouped as the  Residences of the Royal House of Savoy .        His distant relationship with his mother was always strained and has been blamed on her ambition to keep power to herself. ": null
    },
    {
        "Marie Jeanne": "marie jeanne of savoy"
    },
    {
        " spent most of her time relegated to state business which she enjoyed and had little time for her only child whom she kept under close supervision in order to make sure he would try to assume power. Anne Marie gave her husband six children but also had two stillbirths of each gender one in 42 and again in 42 Three of these children would go on to have further progeny including the eldest ": null
    },
    {
        "Maria Adelaide": "princess marie adélaïde of savoy"
    },
    {
        " who was the mother of ": null
    },
    {
        "Louis XV of France": "louis xv of france"
    },
    {
        ". His second daughter ": null
    },
    {
        "Maria Luisa": "maria luisa of savoy"
    },
    {
        " known in the family as Louison would marry ": null
    },
    {
        "Philip V of Spain": "philip v of spain"
    },
    {
        " in 42 and was also regent of Spain for various periods. These two marriages were tactics used by ": null
    },
    {
        "Louis XIV": "louis xiv"
    },
    {
        " to keep Victor Amadeus close to France prior to the ": null
    },
    {
        "War of the Spanish Succession": "war of the spanish succession"
    },
    {
        ".      Anne Marie would remain a devoted wife. She quietly accepted his extramarital affairs; the longest one being with the famed beauty ": null
    },
    {
        "Jeanne Baptiste dAlbert de Luynes": "jeanne baptiste dalbert de luynes"
    },
    {
        " by whom he had two children. Jeanne Baptiste was his mistress for eleven years and eventually fled Savoy due to Victor Amadeus obsession with her. Victor Amadeus subsequently had his daughter with Jeanne Baptiste, ": null
    },
    {
        "Maria Vittoria": "maria vittoria of savoy"
    },
    {
        ", marry the ": null
    },
    {
        "Prince of Carignano": "prince of carignano"
    },
    {
        " from which the present ": null
    },
    {
        "Vittorio Emanuele, Prince of Naples": "vittorio emanuele, prince of naples"
    },
    {
        " is a direct descendant. His favourite child was ": null
    },
    {
        "Victor Amadeus": "victor amadeus, prince of piedmont"
    },
    {
        " born in 42 and given the title ": null
    },
    {
        "Prince of Piedmont": "prince of piedmont"
    },
    {
        " as ": null
    },
    {
        "heir apparent": "heir apparent"
    },
    {
        ". The Prince of Piedmont later died in 42 from ": null
    },
    {
        "smallpox": "smallpox"
    },
    {
        " Anne Marie died in 42 after a series of ": null
    },
    {
        "heart attack": "heart attack"
    },
    {
        "s.     His relationship with his younger son and eventual successor ": null
    },
    {
        "Charles Emmanuel": "charles emmanuel iii of savoy"
    },
    {
        " was a cold one and the two were never close. Victor Amadeus organised the first two marriages of Charles Emmanuel the first one being to ": null
    },
    {
        "Anne Christine of Sulzbach": "countess palatine anne christine of sulzbach"
    },
    {
        ", daughter of the ": null
    },
    {
        "Count Palatine of Sulzbach": "theodore eustace, count palatine of sulzbach"
    },
    {
        " which produced a son which died in infancy. The second marriage was to ": null
    },
    {
        "Polyxena of Hesse-Rotenburg": "polyxena of hesse-rotenburg"
    },
    {
        " a first cousin of Anne Christine and mother of six children including the future ": null
    },
    {
        "Victor Amadeus III of Sardinia": "victor amadeus iii of sardinia"
    },
    {
        ". ": null
    },
    {
        "Maria Adelaide of Savoy": "princess marie adélaïde of savoy"
    },
    {
        " ; married ": null
    },
    {
        "Louis, Duke of Burgundy": "louis, duke of burgundy"
    },
    {
        " and had issue;   Maria Anna of Savoy ;   ": null
    },
    {
        "Maria Luisa of Savoy": "maria luisa of savoy"
    },
    {
        " married ": null
    },
    {
        "Philip V of Spain": "philip v of spain"
    },
    {
        " and had issue;   ": null
    },
    {
        "Victor Amadeus of Savoy": "victor amadeus, prince of piedmont"
    },
    {
        " died unmarried;   ": null
    },
    {
        "Charles Emmanuel of Savoy": "charles emmanuel iii of savoy"
    },
    {
        " ; the next Duke of Savoy and King of Sardinia.   Emanuele Philibert of Savoy died in infancy.       ": null
    },
    {
        "Maria Vittoria of Savoy": "maria vittoria of savoy"
    },
    {
        " married ": null
    },
    {
        "Victor Amadeus I, Prince of Carignano": "victor amadeus i, prince of carignano"
    },
    {
        " and had issue;   ": null
    },
    {
        "Vittorio Francesco of Savoy": "vittorio francesco, marquis of susa"
    },
    {
        " married Maria Lucrezia Franchi di Pont, had no issue;       ": null
    }
]