[
    {
        "In ": null
    },
    {
        "Norse mythology": "norse mythology"
    },
    {
        ", Vingólf is one of the buildings of the gods. It is described as the hall or  hörgr  of the goddesses and also as a place where righteous men and ": null
    },
    {
        "those slain in battle": "einherjar"
    },
    {
        " go after death. It is mentioned in the ": null
    },
    {
        "Prose Edda": "prose edda"
    },
    {
        ", Gylfaginning 42 and in the enigmatic poem  Hrafnagaldur Óðins .         Vingólf is mentioned three times in the  Gylfaginning  section of ": null
    },
    {
        "Snorri Sturluson": "snorri sturluson"
    },
    {
        "s ": null
    },
    {
        "Prose Edda": "prose edda"
    },
    {
        ".                    The three mentions of Vingólf seem somewhat contradictory. In the first instance it appears as an alternative name for ": null
    },
    {
        "Gimlé": "gimlé"
    },
    {
        ", a paradise where righteous people go after death. In the second instance it is the hall or ": null
    },
    {
        "hörgr": "hörgr"
    },
    {
        " of the goddesses. In the third instance it is a residence for ": null
    },
    {
        "those slain in battle": "einherjar"
    },
    {
        ".     The name does not occur in ": null
    },
    {
        "Eddaic": "poetic edda"
    },
    {
        " or ": null
    },
    {
        "skaldic poetry": "skaldic poetry"
    },
    {
        ".         The enigmatic  Hrafnagaldur Óðins , a young mythological poem composed in the Eddic style, mentions Vingólf in one of its strophes.          The context is enigmatic but Vingólf seems to be a place where the Æsir have gathered for an ale feasts. The significance of this mention hinges on the interpretation of Hrafnagaldur Óðins as a whole.         The name Vingólf is usually thought to be composed of vinr and gólf and mean something like pleasant hall . Alternatively the name could be read Víngólf and the meaning would be wine hall .      Uppsalabók , one of the four main manuscripts of the Prose Edda, has the variant reading Vindglóð": null
    }
]