[
    {
        "                 Adeline Virginia Woolf  was an English writer, considered one of the most important ": null
    },
    {
        "modernist": "modernist literature"
    },
    {
        " 42th-century authors and also a pioneer in the use of ": null
    },
    {
        "stream of consciousness": "stream of consciousness"
    },
    {
        " as a ": null
    },
    {
        "narrative device": "narration"
    },
    {
        ".     Woolf was born into an affluent household in ": null
    },
    {
        "South Kensington": "south kensington"
    },
    {
        ", London, the seventh child in a ": null
    },
    {
        "blended family": "blended family"
    },
    {
        " of eight. Her mother, ": null
    },
    {
        "Julia Prinsep Jackson": "julia stephen"
    },
    {
        ", celebrated as a ": null
    },
    {
        "Pre-Raphaelite": "pre-raphaelite"
    },
    {
        " artists model, had three children from her first marriage, while Woolfs father, ": null
    },
    {
        "Leslie Stephen": "leslie stephen"
    },
    {
        ", a notable ": null
    },
    {
        "man of letters": "man of letters"
    },
    {
        ", had one previous daughter. The Stephens produced another four children, including the modernist painter ": null
    },
    {
        "Vanessa Bell": "vanessa bell"
    },
    {
        ". While the boys in the family received college educations, the girls were ": null
    },
    {
        "home-schooled": "home-schooled"
    },
    {
        " in ": null
    },
    {
        "English classics": "english literature"
    },
    {
        " and ": null
    },
    {
        "Victorian literature": "victorian literature"
    },
    {
        ". An important influence in Virginia Woolfs early life was the summer home the family used in ": null
    },
    {
        "St Ives, Cornwall": "st ives, cornwall"
    },
    {
        ", where she first saw the ": null
    },
    {
        "Godrevy Lighthouse": "godrevy lighthouse"
    },
    {
        ", which was to become central in her novel  To the Lighthouse  .     Woolfs childhood came to an abrupt end in 42 with the death of her mother and her first ": null
    },
    {
        "mental breakdown": "mental breakdown"
    },
    {
        ", followed two years later by the death of her stepsister and a mother figure to her, Stella Duckworth. From 42 to 42 she attended the Ladies Department of ": null
    },
    {
        "Kings College London": "kings college london"
    },
    {
        ", where she studied classics and history and came into contact with early reformers of ": null
    },
    {
        "womens higher education": "female educationmodern period"
    },
    {
        " and the ": null
    },
    {
        "womens rights movement": "womens rights movement"
    },
    {
        ". Other important influences were her ": null
    },
    {
        "Cambridge": "university of cambridge"
    },
    {
        "-educated brothers and unfettered access to her fathers vast library.     Encouraged by her father, Woolf began writing professionally in 42 Her fathers death in 42 caused another mental breakdown for Woolf. Following his death, the Stephen family moved from Kensington to the more ": null
    },
    {
        "bohemian": "bohemianism"
    },
    {
        " Bloomsbury": "bloomsbury"
    },
    {
        ", where they adopted a free-spirited lifestyle. It was in ": null
    },
    {
        "Bloomsbury": "bloomsbury"
    },
    {
        " where, in conjunction with the brothers intellectual friends, they formed the artistic and literary ": null
    },
    {
        "Bloomsbury Group": "bloomsbury group"
    },
    {
        ".     Following her 42 marriage to ": null
    },
    {
        "Leonard Woolf": "leonard woolf"
    },
    {
        ", the couple founded the ": null
    },
    {
        "Hogarth Press": "hogarth press"
    },
    {
        " in 42 which published much of her work. The couple rented a home in Sussex and moved there permanently in 42 Throughout her life, Woolf was troubled by her mental illness. She was institutionalized several times and attempted suicide at least twice. Her illness is considered to have been ": null
    },
    {
        "bipolar disorder": "bipolar disorder"
    },
    {
        ", for which there was no effective intervention during her lifetime. In 42 at age 42 Woolf died by putting rocks in her coat pockets and drowning herself in the ": null
    },
    {
        "River Ouse": "river ouse, sussex"
    },
    {
        " at ": null
    },
    {
        "Lewes": "lewes"
    },
    {
        ".     During the ": null
    },
    {
        "interwar period": "interwar period"
    },
    {
        ", Woolf was an important part of Londons literary and artistic society. In 42 she published her first novel,  The Voyage Out , through her half-brothers publishing house, ": null
    },
    {
        "Gerald Duckworth and Company": "gerald duckworth and company"
    },
    {
        ". Her best-known works include the novels  Mrs Dalloway  ,  To the Lighthouse  and  Orlando  . She is also known for her essays, including  A Room of Ones Own  , in which she wrote the much-quoted ": null
    },
    {
        "dictum": "dictum"
    },
    {
        ", A woman must have money and a room of her own if she is to write fiction.     Woolf became one of the central subjects of the 42s movement of ": null
    },
    {
        "feminist criticism": "feminist criticism"
    },
    {
        " and her works have since garnered much attention and widespread commentary for inspiring ": null
    },
    {
        "feminism": "feminism"
    },
    {
        ". Her works have been translated into more than 42 languages. A large body of literature is dedicated to her life and work, and she has been the subject of plays, novels and films. Woolf is commemorated today by statues, societies dedicated to her work and a building at the ": null
    },
    {
        "University of London": "university of london"
    },
    {
        ".                       Virginia Woolf was born Adeline Virginia Stephen on 42 January 42 at 42 ": null
    },
    {
        "Hyde Park Gate": "hyde park gate"
    },
    {
        " in ": null
    },
    {
        "South Kensington": "south kensington"
    },
    {
        ", London to ": null
    },
    {
        "Julia ": "julia stephen"
    },
    {
        " and ": null
    },
    {
        "Leslie Stephen": "leslie stephen"
    },
    {
        " , writer, historian, essayist, biographer and mountaineer. Julia Jackson was born in 42 in ": null
    },
    {
        "Calcutta": "kolkata"
    },
    {
        ", ": null
    },
    {
        "Bengal": "bengal"
    },
    {
        ", ": null
    },
    {
        "British India": "british india"
    },
    {
        " to John Jackson and Maria Mia Theodosia Pattle, from two ": null
    },
    {
        "Anglo-Indian": "anglo-indian"
    },
    {
        " families. John Jackson ": null
    },
    {
        "FRCS": "frcs"
    },
    {
        " was the third son of George Jackson and Mary Howard of Bengal, a physician who spent 42 years with the ": null
    },
    {
        "Bengal Medical Service": "bengal medical service"
    },
    {
        " and ": null
    },
    {
        "East India Company": "east india company"
    },
    {
        " and a professor at the fledgling ": null
    },
    {
        "Calcutta Medical College": "calcutta medical college"
    },
    {
        ". While John Jackson was an almost invisible presence, the Pattle family  were famous beauties, and moved in the upper circles of Bengali society. The seven Pattle sisters married into important families. ": null
    },
    {
        "Julia Margaret Cameron": "julia margaret cameron"
    },
    {
        " was a celebrated photographer, while Virginia married ": null
    },
    {
        "Earl Somers": "third earl somers"
    },
    {
        ", and their daughter, Julia Jacksons cousin, was ": null
    },
    {
        "Lady Henry Somerset": "lady henry somerset"
    },
    {
        ", the temperance leader. Julia moved to England with her mother at the age of two and spent much of her early life with another of her mothers sisters, Sarah Monckton Pattle. Sarah and her husband ": null
    },
    {
        "Henry Thoby Prinsep": "henry thoby prinsep"
    },
    {
        ", conducted an artistic and literary ": null
    },
    {
        "salon": "salon"
    },
    {
        " at ": null
    },
    {
        "Little Holland House": "little holland house"
    },
    {
        " where she came into contact with a number of ": null
    },
    {
        "Pre-Raphaelite": "pre-raphaelite brotherhood"
    },
    {
        " painters such as ": null
    },
    {
        "Edward Burne-Jones": "edward burne-jones"
    },
    {
        ", for whom she ": null
    },
    {
        "modelled": "modelled"
    },
    {
        ".     Julia was the youngest of three sisters and Adeline Virginia Stephen was named after her mothers eldest sister Adeline Maria Jackson  and her mothers aunt Virginia Pattle . Because of the tragedy of her aunt Adelines death the previous year, the family never used Virginias first name. The Jacksons were a well educated, literary and artistic proconsular middle-class family. In 42 Julia Jackson married ": null
    },
    {
        "Herbert Duckworth": "herbert duckworth"
    },
    {
        ", a ": null
    },
    {
        "barrister": "barrister"
    },
    {
        ", but within three years was left a widow with three infant children. She was devastated and entered a prolonged period of mourning, abandoning her faith and turning to nursing and philanthropy.   Julia and Herbert Duckworth had three children; ": null
    },
    {
        "George": "george herbert duckworth"
    },
    {
        " , a senior civil servant, married Lady Margaret Herbert 42   Stella , died aged 42 ": null
    },
    {
        "Gerald": "gerald duckworth"
    },
    {
        " , founder of ": null
    },
    {
        "Duckworth Publishing": "duckworth publishing"
    },
    {
        ", married Cecil Alice Scott-Chad 42     Leslie Stephen was born in 42 in South Kensington to ": null
    },
    {
        "Sir James": "james stephen"
    },
    {
        " and Lady Jane Catherine Stephen , daughter of ": null
    },
    {
        "John Venn": "john venn"
    },
    {
        ", rector of ": null
    },
    {
        "Clapham": "clapham"
    },
    {
        ". The Venns were the centre of the ": null
    },
    {
        "evangelical": "evangelical"
    },
    {
        " Clapham sect": "clapham sect"
    },
    {
        ". Sir James Stephen was the ": null
    },
    {
        "under secretary": "under secretary"
    },
    {
        " at the ": null
    },
    {
        "Colonial Office": "colonial office"
    },
    {
        ", and with another Clapham member, ": null
    },
    {
        "William Wilberforce": "william wilberforce"
    },
    {
        ", was responsible for the passage of the ": null
    },
    {
        "Slavery Abolition Bill": "slavery abolition bill"
    },
    {
        " in 42 In 42 he was appointed ": null
    },
    {
        "Regius Professor of Modern History": "regius professor of modern history"
    },
    {
        " at ": null
    },
    {
        "Cambridge University": "cambridge university"
    },
    {
        ". As a family of educators, lawyers and writers the Stephens represented the elite intellectual aristocracy. While his family were distinguished and intellectual, they were less colourful and aristocratic than Julia Jacksons. A graduate and ": null
    },
    {
        "fellow": "fellow"
    },
    {
        " of ": null
    },
    {
        "Cambridge University": "cambridge university"
    },
    {
        " he renounced his faith and position to move to London where he became a notable ": null
    },
    {
        "man of letters": "man of letters"
    },
    {
        ". In addition he was a ": null
    },
    {
        "rambler": ":wikt:rrambler"
    },
    {
        " and ": null
    },
    {
        "mountaineer": "mountaineer"
    },
    {
        ", described as a gaunt figure with the ragged red brown beard...a formidable man, with an immensely high forehead, steely-blue eyes, and a long pointed nose . In the same year as Julia Jacksons marriage, he wed Harriet Marian Thackeray , youngest daughter of ": null
    },
    {
        "William Makepeace Thackeray": "william makepeace thackeray"
    },
    {
        ", who bore him a daughter, Laura , but died in childbirth in 42 Laura turned out to be ": null
    },
    {
        "developmentally handicapped": "developmental disability"
    },
    {
        ". and was eventually ": null
    },
    {
        "institutionalised": "institutionalised"
    },
    {
        ".     The widowed Julia Duckworth knew Leslie Stephen through her friendship with Minnys elder sister ": null
    },
    {
        "Anne Isabella Ritchie": "anne isabella ritchie"
    },
    {
        " and had developed an interest in his agnostic writings. She was present the night Minny died and later, tended to Leslie Stephen and helped him move next door to her on Hyde Park Gate so Laura could have some companionship with her own children.  Both were preoccupied with mourning and although they developed a close friendship and intense correspondence, agreed it would go no further. Leslie Stephen proposed to her in 42 an offer she declined, but when Anny married later that year she accepted him and they were married on 42 March 42 He and Laura then moved next door into Julias house, where they lived till his death in 42 Julia was 42 and Leslie was 42     Their first child, ": null
    },
    {
        "Vanessa": "vanessa bell"
    },
    {
        ", was born on 42 May 42 Julia, having presented her husband with a child, and now having five children to care for, had decided to limit her family to this. However, despite the fact that the couple took precautions , contraception was a very imperfect art in the nineteenth century  resulting in the birth of three more children over the next four years.                  Virginia Woolf provides insight into her early life in her autobiographical essays, including Reminiscences , 42 Hyde Park Gate  and  A Sketch of the Past  . Other essays that provide insight into this period include Leslie Stephen . She also alludes to her childhood in her fictional writing. In  To the Lighthouse  , her depiction of the life of the Ramsays in the ": null
    },
    {
        "Hebrides": "hebrides"
    },
    {
        " is an only thinly disguised account of the Stephens in Cornwall and the ": null
    },
    {
        "Godrevy Lighthouse": "godrevy lighthouse"
    },
    {
        " they would visit there. However, Woolfs understanding of her mother and family evolved considerably between 42 and 42 in which the somewhat distant, yet revered figure of her mother becomes more nuanced and filled in.     In February 42 with her sister Vanessa, Woolf began the Hyde Park Gate News, ": null
    },
    {
        "chronicling": "chronicling"
    },
    {
        " life and events within the Stephen family, and modelled on the popular magazine ": null
    },
    {
        "Tit-Bits": "tit-bits"
    },
    {
        ". Initially this was mainly Vanessas and Thobys articles, but very soon Virginia became the main contributor, with Vanessa as editor. Their mothers response when it first appeared was Rather clever I think . The following year the Stephen sisters also used photography to supplement their insights, as did Stella Duckworth. Vanessa Bells 42 portrait of her sister and parents in the Library at Talland House  was one of the familys favourites, and was written about lovingly in Leslie Stephens memoir. In 42   Virginia began her first diary, which she kept for the next twelve years, and a notebook in 42     Virginia was, as she describes it, born into a large connection, born not of rich parents, but of well-to-do parents, born into a very communicative, literate, letter writing, visiting, articulate, late nineteenth century world . It was a well-connected family consisting of six children, with two ": null
    },
    {
        "half brothers": "half brothers"
    },
    {
        " and a half sister , another half sister, Laura , and an older sister, ": null
    },
    {
        "Vanessa": "vanessa bell"
    },
    {
        " and brother ": null
    },
    {
        "Thoby": "thoby stephen"
    },
    {
        ". The following year, another brother ": null
    },
    {
        "Adrian": "adrian stephen"
    },
    {
        " followed. The handicapped Laura Stephen lived with the family until she was institutionalised in 42 Julia and Leslie had four children together: ": null
    },
    {
        "Vanessa": "vanessa bell"
    },
    {
        " Nessa , married ": null
    },
    {
        "Clive Bell": "clive bell"
    },
    {
        " 42   ": null
    },
    {
        "Thoby": "thoby stephen"
    },
    {
        " , founded ": null
    },
    {
        "Bloomsbury Group": "bloomsbury group"
    },
    {
        " Leonard Woolf": "leonard woolf"
    },
    {
        " 42   ": null
    },
    {
        "Adrian": "adrian stephen"
    },
    {
        " , married ": null
    },
    {
        "Karin Costelloe": "karin costelloe"
    },
    {
        " 42     Virginia was born at 42 Hyde Park Gate and lived there till her fathers death in 42 Number 42 Hyde Park Gate, South Kensington, lay at the south east end of Hyde Park Gate, a narrow ": null
    },
    {
        "cul-de-sac": "cul-de-sac"
    },
    {
        " running south from ": null
    },
    {
        "Kensington Road": "kensington road"
    },
    {
        ", just west of the ": null
    },
    {
        "Royal Albert Hall": "royal albert hall"
    },
    {
        ", and opposite ": null
    },
    {
        "Kensington Gardens": "kensington gardens"
    },
    {
        " and ": null
    },
    {
        "Hyde Park": "hyde park, london"
    },
    {
        ", where the family regularly took their walks . Built in 42 by Henry Payne of ": null
    },
    {
        "Hammersmith": "hammersmith"
    },
    {
        " as one of a row of single family ": null
    },
    {
        "townhouses": "townhouses"
    },
    {
        " for the upper middle class, it soon became too small for their expanding family. At the time of their marriage, it consisted of a ": null
    },
    {
        "basement": "basement"
    },
    {
        ", two stories and an ": null
    },
    {
        "attic": "attic"
    },
    {
        ". In July 42 Leslie Stephen obtained the services of ": null
    },
    {
        "J.  W. Penfold": "j. & nbsp;w. penfold"
    },
    {
        ", architect, to add additional living space above and behind the existing structure. The substantial renovations added a new top floor , with three bedrooms and a study for himself, converted the original attic into rooms, and added the first bathroom.  It was a tall but narrow townhouse, that at that time had no running water. Virginia would later describe it as a very tall house on the left hand side near the bottom which begins by being ": null
    },
    {
        "stucco": "stucco"
    },
    {
        " and ends by being red brick; which is so high and yet—as I can say now that we have sold it—so rickety that it seems as if a very high wind would topple it over .     The servants worked downstairs in the basement. The ground floor had a drawing room, separated by a curtain from the servants ": null
    },
    {
        "pantry": "pantry"
    },
    {
        " and a library. Above this on the first floor were Julia and Leslies bedrooms. On the next floor were the Duckworth childrens rooms, and above them the day and night ": null
    },
    {
        "nurseries": "nursery"
    },
    {
        " of the Stephen children occupied two further floors. Finally in the attic, under the ": null
    },
    {
        "eaves": "eaves"
    },
    {
        ", were the servants bedrooms, accessed by a back staircase. Life at 42 Hyde Park Gate was also divided symbolically, as Virginia put it The division in our lives was curious. Downstairs there was pure convention: upstairs pure intellect. But there was no connection between them , the worlds typified by George Duckworth and Leslie Stephen. Their mother, it seems, was the only one who could span this divide. The house was described as dimly lit and crowded with furniture and paintings. Within it the younger Stephens formed a close-knit group. Life in London differed sharply from their summers in Cornwall, their outdoor activities consisting mainly of walks in nearby Kensington Gardens, where they would play ": null
    },
    {
        "Hide-and-Seek": "hide-and-seek"
    },
    {
        ", and sail their boats on the ": null
    },
    {
        "Round Pond": "round pond"
    },
    {
        ", while indoors, it revolved around their lessons.     Leslie Stephens eminence as an editor, critic, and biographer, and his connection to William Thackeray, meant that his children were raised in an environment filled with the influences of ": null
    },
    {
        "Victorian literary society": "victorian literature"
    },
    {
        ". ": null
    },
    {
        "Henry James": "henry james"
    },
    {
        ", ": null
    },
    {
        "George Henry Lewes": "george henry lewes"
    },
    {
        ", ": null
    },
    {
        "Alfred Tennyson": "alfred tennyson"
    },
    {
        ", ": null
    },
    {
        "Thomas Hardy": "thomas hardy"
    },
    {
        ", ": null
    },
    {
        "Edward Burne-Jones": "edward burne-jones"
    },
    {
        " and Virginias honorary godfather, ": null
    },
    {
        "James Russell Lowell": "james russell lowell"
    },
    {
        ", were among the visitors to the house. Julia Stephen was equally well connected. Her aunt was a pioneering early photographer ": null
    },
    {
        "Julia Margaret Cameron": "julia margaret cameron"
    },
    {
        " who was also a visitor to the Stephen household. The two Stephen sisters, Vanessa and Virginia, were almost three years apart in age, and exhibited some ": null
    },
    {
        "sibling rivalry": "sibling rivalry"
    },
    {
        ". Virginia christened her older sister the saint and was far more inclined to exhibit her cleverness than her more reserved sister. Virginia resented the domesticity Victorian tradition forced on them, far more than her sister. They also competed for Thobys affections. Virginia would later confess her ambivalence over this rivalry to ": null
    },
    {
        "Duncan Grant": "duncan grant"
    },
    {
        " in 42 indeed one of the concealed worms of my life has been a sisters jealousy – of a sister I mean; and to feed this I have invented such a myth about her that I scarce know one from tother .     Virginia showed an early affinity for writing. Although both parents disapproved of formal education for females, writing was considered a respectable profession for women, and her father encouraged her in this respect. Later, she would describe this as ever since I was a little creature, scribbling a story in the manner of Hawthorne on the green plush sofa in the drawing room at St. Ives while the grown-ups dined . By the age of five she was writing letters and could tell her father a story every night. Later, she, Vanessa and Adrian would develop the tradition of inventing a serial about their next-door neighbours, every night in the nursery, or in the case of St. Ives, of spirits that resided in the garden. It was her fascination with books that formed the strongest bond between her and her father. For her tenth birthday, she received an ink-stand, a blotter, drawing book and a box of writing implements.          Leslie Stephen was in the habit of hiking in Cornwall, and in the spring of 42 he came across a large white house in ": null
    },
    {
        "St Ives, Cornwall": "st ives, cornwall"
    },
    {
        ", and took out a lease on it that September. Although it had limited amenities, its main attraction was the view overlooking Porthminster Bay towards the ": null
    },
    {
        "Godrevy Lighthouse": "godrevy lighthouse"
    },
    {
        ", which the young Virginia could see from the upper windows and was to be the central figure in her To the Lighthouse . It was a large square house, with a ": null
    },
    {
        "terraced": "terraced"
    },
    {
        " garden, divided by hedges, sloping down towards the sea. Each year between 42 and 42 from mid-July to mid-September the Stephen family leased Talland House  as a summer residence. Leslie Stephen, who referred to it thus: a pocket-paradise , described it as The pleasantest of my memories... refer to our summers, all of which were passed in Cornwall, especially to the thirteen summers at St Ives. There we bought the lease of Talland House: a small but roomy house, with a garden of an acre or two all up and down hill, with quaint little terraces divided by hedges of ": null
    },
    {
        "escallonia": "escallonia"
    },
    {
        ", a grape-house and kitchen-garden and a so-called orchard beyond . It was in Leslies words, a place of intense domestic happiness . Virginia herself described the house in great detail:       In both London and Cornwall, Julia was perpetually entertaining, and was notorious for her manipulation of her guests lives, constantly ": null
    },
    {
        "matchmaking": "matchmaking"
    },
    {
        " in the belief everyone should be married, the domestic equivalence of her philanthropy. As her husband observed, My Julia was of course, though with all due reserve, a bit of a matchmaker . Amongst their guests in 42 were the Brookes, whose children, including ": null
    },
    {
        "Rupert Brooke": "rupert brooke"
    },
    {
        ", played with the Stephen children. Rupert and his group of Cambridge ": null
    },
    {
        "Neo-pagans": "neo-pagans"
    },
    {
        " would come to play an important role in their lives in the years prior to the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ". While Cornwall was supposed to be a summer respite, Julia Stephen soon immersed herself in the work of caring for the sick and poor there, as well as in London.  Both at Hyde Park Gate and Talland House, the family mingled with much of the countrys literary and artistic circles. Frequent guests included literary figures such as ": null
    },
    {
        "Henry James": "henry james"
    },
    {
        " and George Meredith, as well as James Russell Lowell, and the children were exposed to much more intellectual conversations than their mothers at Little Holland House. The family did not return, following Julia Stephens death in May 42     For the children, it was the highlight of the year, and Virginias most vivid childhood memories were not of London but of Cornwall. In a diary entry of 42 March 42 she described why she felt so connected to Talland House, looking back to a summer day in August 42 Why am I so incredibly and incurably romantic about Cornwall? Ones past, I suppose; I see children running in the garden … The sound of the sea at night … almost forty years of life, all built on that, permeated by that: so much I could never explain . Cornwall inspired aspects of her work, in particular the St Ives Trilogy of  Jacobs Room  , To the Lighthouse , and  The Waves  .          Julia Stephen fell ill with influenza in February 42 and never properly recovered, dying on 42 May, when Virginia was only 42 This was a pivotal moment in her life and the beginning of her struggles with mental illness. Essentially, her life had fallen apart. The Duckworths were travelling abroad at the time of their mothers death, and Stella returned immediately to take charge and assume her role. That summer, rather than return to the memories of St Ives, the Stephens went to ": null
    },
    {
        "Freshwater, Isle of Wight": "freshwater, isle of wight"
    },
    {
        ", where a number of their mothers family lived. It was there that Virginia had the first of her many ": null
    },
    {
        "nervous breakdown": "nervous breakdown"
    },
    {
        "s, and Vanessa was forced to assume some of her mothers role in caring for Virginias mental state. Stella became engaged to Jack Hills the following year and they were married on 42 April 42 making Virginia even more dependent on her older sister.     George Duckworth also assumed some of their mothers role, taking upon himself the task of ": null
    },
    {
        "bringing them out into society": "debut"
    },
    {
        ". First Vanessa, then Virginia, in both cases an equal disaster, for it was not a ": null
    },
    {
        "rite of passage": "rite of passage"
    },
    {
        " which resonated with either girl and attracted a scathing critique by Virginia regarding the conventional expectations of young upper class women Society in those days was a perfectly competent, perfectly complacent, ruthless machine. A girl had no chance against its fangs. No other desires – say to paint, or to write – could be taken seriously . Rather her priorities were to escape from the Victorian conventionality of the downstairs drawing room to a room of ones own to pursue her writing aspirations. She would revisit this criticism in her depiction of Mrs Ramsay stating the duties of a Victorian mother in To the Lighthouse an unmarried woman has missed the best of life .     The death of Stella Duckworth on 42 July 42 after a long illness, was a further blow to Virginias sense of self, and the family dynamics. Woolf described the period following the death of both her mother and Stella as 42–42 – the seven unhappy years , referring to the lash of a random unheeding flail that pointlessly and brutally killed the two people who should, normally and naturally, have made those years, not perhaps happy but normal and natural . In April 42 their father became ill, and although he underwent surgery later that year he never fully recovered, dying on 42 February 42 Virginias fathers death precipitated a further breakdown. Later, Virginia would describe this time as one in which she was dealt successive blows as a broken ": null
    },
    {
        "chrysalis": "chrysalis"
    },
    {
        " with wings still creased. Chrysalis occurs many times in Woolfs writing but the broken chrysalis was an image that became a ": null
    },
    {
        "metaphor": "metaphor"
    },
    {
        " for those exploring the relationship between Woolf and grief. At his death, Leslie Stephens net worth was £42 42s. 42d.        In the late nineteenth century, education was sharply divided along gender lines, a tradition that Virginia would note and condemn in her writing. Boys were sent to school, and in upper-middle-class families such as the Stephens, this involved private boys schools, often ": null
    },
    {
        "boarding schools": "boarding schools"
    },
    {
        ", and university.  Girls, if they were afforded the luxury of education, received it from their parents, ": null
    },
    {
        "governesses": "governesses"
    },
    {
        " and ": null
    },
    {
        "tutors": "tutors"
    },
    {
        ". Virginia was educated by her parents who shared the duty. There was a small classroom off the back of the drawing room, with its many windows, which they found perfect for quiet writing and painting. Julia taught the children Latin, French and History, while Leslie taught them mathematics. They also received piano lessons. Supplementing their lessons was the childrens unrestricted access to Leslie Stephens vast library, exposing them to much of the literary ": null
    },
    {
        "canon": "canon"
    },
    {
        ", resulting in a greater depth of reading than any of their Cambridge contemporaries, Virginias reading being described as greedy . Later, she would recall  After ": null
    },
    {
        "Public School": "public school"
    },
    {
        ", the boys in the family all attended ": null
    },
    {
        "Cambridge University": "cambridge university"
    },
    {
        ". The girls derived some indirect benefit from this, as the boys introduced them to their friends. Another source was the conversation of their fathers friends, to whom they were exposed. Leslie Stephen described his circle as most of the literary people of mark...clever young writers and barristers, chiefly of the radical persuasion...we used to meet on Wednesday and Sunday evenings, to smoke and drink and discuss the universe and the reform movement .      Later, between the ages of 42 and 42 she was able to pursue higher education. She took courses of study, some at degree level, in beginning and advanced Ancient Greek, intermediate Latin and German, together with continental and English history at the Ladies Department of ": null
    },
    {
        "Kings College London": "kings college london"
    },
    {
        " at nearby 42 ": null
    },
    {
        "Kensington Square": "kensington square"
    },
    {
        " between 42 and 42 She studied Greek under the eminent scholar George Charles Winter Warr, professor of Classical Literature at Kings. In addition she had private tutoring in German, Greek and Latin. One of her Greek tutors was ": null
    },
    {
        "Clara Pater": "clara pater"
    },
    {
        " , who taught at Kings. Another was ": null
    },
    {
        "Janet Case": "janet elizabeth case"
    },
    {
        ", who involved her in the ": null
    },
    {
        "womens rights movement": "womens rights movement"
    },
    {
        ", and whose ": null
    },
    {
        "obituary": "obituary"
    },
    {
        " Virginia would later write in 42 Her experiences there led to her 42 essay On Not Knowing Greek. Her time at Kings also brought her into contact with some of the early reformers of ": null
    },
    {
        "womens higher education": "female educationmodern period"
    },
    {
        " such as the principal of the Ladies Department, ": null
    },
    {
        "Lilian Faithfull": "lilian faithfull"
    },
    {
        " , in addition to Pater. Her sister Vanessa also enrolled at the Ladies Department . Although the Stephen girls could not attend Cambridge, they were to be profoundly influenced by their brothers experiences there. When Thoby went up to Trinity in 42 he became friends with a circle of young men, including ": null
    },
    {
        "Clive Bell": "clive bell"
    },
    {
        ", ": null
    },
    {
        "Lytton Strachey": "lytton strachey"
    },
    {
        ", ": null
    },
    {
        "Leonard Woolf": "leonard woolf"
    },
    {
        " and ": null
    },
    {
        "Saxon Sydney-Turner": "saxon sydney-turner"
    },
    {
        ", that he would soon introduce to his sisters at the ": null
    },
    {
        "Trinity May Ball": "trinity may ball"
    },
    {
        " in 42 These men formed a reading group they named the Midnight Society.       Although Virginia expressed the opinion that her father was her favourite parent, and although she had only just turned thirteen when her mother died, she was profoundly influenced by her mother throughout her life. It was Virginia who famously stated that for we think back through our mothers if we are women , and invoked the image of her mother repeatedly throughout her life in her diaries, her letters and a number of her autobiographical essays, including Reminiscences , 42 Hyde Park Gate  and  A Sketch of the Past  , frequently evoking her memories with the words I see her ... . She also alludes to her childhood in her fictional writing. In  To the Lighthouse  , the artist, Lily Briscoe, attempts to paint Mrs Ramsay, a complex character based on Julia Stephen, and repeatedly comments on the fact that she was astonishingly beautiful . Her depiction of the life of the Ramsays in the ": null
    },
    {
        "Hebrides": "hebrides"
    },
    {
        " is an only thinly disguised account of the Stephens in Cornwall and the ": null
    },
    {
        "Godrevy Lighthouse": "godrevy lighthouse"
    },
    {
        " they would visit there. However, Woolfs understanding of her mother and family evolved considerably between 42 and 42 in which the somewhat distant, yet revered figure becomes more nuanced and filled in.     While her father painted Julia Stephens work in terms of reverence, Woolf drew a sharp distinction between her mothers work and the mischievous philanthropy which other women practise so complacently and often with such disastrous results . She describes her degree of sympathy, engagement, judgement and decisiveness, and her sense of both irony and the absurd. She recalls trying to recapture the clear round voice, or the sight of the beautiful figure, so upright and distinct, in its long shabby cloak, with the head held at a certain angle, so that the eye looked straight out at you . Julia Stephen dealt with her husbands ": null
    },
    {
        "depressions": "depression"
    },
    {
        " and his need for attention, which created resentment in her children, boosted his self-confidence, nursed her parents in their final illness, and had many commitments outside the home that would eventually wear her down. Her frequent absences and the demands of her husband instilled a sense of insecurity in her children that had a lasting effect on her daughters. In considering the demands on her mother, Woolf described her father as fifteen years her elder, difficult, exacting, dependent on her and reflected that this was at the expense of the amount of attention she could spare her young children, a general presence rather than a particular person to a child , reflecting that she rarely ever spent a moment alone with her mother, someone was always interrupting . Woolf was ambivalent about all this, yet eager to separate herself from this model of utter selflessness. In To the Lighthouse, she describes it as boasting of her capacity to surround and protect, there was scarcely a shell of herself left for her to know herself by; all was so lavished and spent . At the same time, she admired the strengths of her mothers womanly ideals. Given Julias frequent absences and commitments, the young Stephen children became increasingly dependent on Stella Duckworth, who emulated her mothers selflessness, as Woolf wrote Stella was always the beautiful attendant handmaid ... making it the central duty of her life .     Julia Stephen greatly admired her husbands intellect, and although she knew her own mind, thought little of her own. As Woolf observed she never belittled her own works, thinking them, if properly discharged, of equal, though other, importance with her husbands . She believed with certainty in her role as the centre of her activities, and the person who held everything together, with a firm sense of what was important and valuing devotion. Of the two parents, Julias nervous energy dominated the family . While Virginia identified most closely with her father, Vanessa stated her mother was her favourite parent. ": null
    },
    {
        "Angelica Garnett": "angelica garnett"
    },
    {
        " recalls how Virginia asked Vanessa which parent she preferred, although Vanessa considered it a question that one ought not to ask , she was unequivocal in answering Mother  yet the centrality of her mother to Virginias world is expressed in this description of her Certainly there she was, in the very centre of that great Cathedral space which was childhood; there she was from the very first . Virginia observed that her half-sister, Stella, the oldest daughter, led a life of total subservience to her mother, incorporating her ideals of love and service. Virginia quickly learned, that like her father, being ill was the only reliable way of gaining the attention of her mother, who prided herself on her sickroom nursing.     Other issues the children had to deal with was Leslie Stephens temper, Woolf describing him as the tyrant father . Eventually, she became deeply ambivalent about her father. He had given her his ring on her eighteenth birthday and she had a deep emotional attachment as his literary heir, writing about her great devotion for him . Yet, like Vanessa, she also saw him as victimiser and tyrant. She had a lasting ambivalence towards him through her life, albeit one that evolved. Her adolescent image was of an Eminent Victorian and tyrant but as she grew older she began to realise how much of him was in her I have been dipping into old letters and fathers memoirs....so candid and reasonable and transparent—and had such a fastidious delicate mind, educated, and transparent , she wrote . She was in turn both fascinated and condemnatory of Leslie Stephen She has haunted me: but then, so did that old wretch my father. . . . I was more like him than her, I think; and therefore more critical: but he was an adorable man, and somehow, tremendous .       Much has been made of Virginias statements that she was continually ": null
    },
    {
        "sexually abused": "sexually abused"
    },
    {
        " during the whole time that she lived at 42 Hyde Park Gate, as a possible cause of her mental health issues,  although there are likely to be a number of contributing factors . She states that she first remembers being molested by Gerald Duckworth when she was six years old. It has been suggested that this led to a lifetime of sexual fear and resistance to   masculine authority. Against a background of over-committed and distant parents, suggestions that this was a ": null
    },
    {
        "dysfunctional family": "dysfunctional family"
    },
    {
        " must be evaluated. These include evidence of sexual abuse of the Stephen girls by their older Duckworth stepbrothers, and by their cousin, ": null
    },
    {
        "James Kenneth Stephen": "james kenneth stephen"
    },
    {
        " , at least of Stella Duckworth. Laura is also thought to have been abused. The most graphic account is by ": null
    },
    {
        "Louise DeSalvo": "louise desalvo"
    },
    {
        ", but other authors and reviewers have been more cautious. Lee states that, The evidence is strong enough, and yet ambiguous enough, to open the way for conflicting psychobiographical interpretations that draw quite different shapes of Virginia Woolfs interior life .              On their fathers death, the Stephens first instinct was to escape from the dark house of yet more mourning, and this they did immediately, accompanied by George, travelling to ": null
    },
    {
        "Manorbier": "manorbier"
    },
    {
        ", on the coast of Pembrokeshire on 42 February. There, they spent a month, and it was there that Virginia first came to realise her destiny was as a writer, as she recalls in her diary of 42 September 42 They then further pursued their new found freedom by spending April in Italy and France, where they met up with ": null
    },
    {
        "Clive Bell": "clive bell"
    },
    {
        " again. Virginia then suffered her second nervous breakdown, and first ": null
    },
    {
        "suicidal": "suicidal"
    },
    {
        " attempt on 42 May, and ": null
    },
    {
        "convalesced": "convalesced"
    },
    {
        " over the next three months.     Before their father died, the Stephens had discussed the need to leave South Kensington in the ": null
    },
    {
        "West End": "west end of london"
    },
    {
        ", with its tragic memories and their parents relations. George Duckworth was 42 his brother Gerald 42 The Stephen children were now between 42 and 42 Virginia was 42 Vanessa and Adrian decided to sell 42 Hyde Park Gate in respectable South Kensington and move to ": null
    },
    {
        "Bloomsbury": "bloomsbury"
    },
    {
        ". ": null
    },
    {
        "Bohemian": "bohemianism"
    },
    {
        " Bloomsbury, with its characteristic leafy squares seemed sufficiently far away, geographically and socially, and was a much cheaper neighbourhood to rent in . They had not inherited much and they were unsure about their finances. Also, Bloomsbury was close to the ": null
    },
    {
        "Slade School": "slade school"
    },
    {
        " which Vanessa was then attending. While Gerald was quite happy to move on and find himself a bachelor establishment, George who had always assumed the role of quasi-parent decided to accompany them, much to their dismay. It was then that Lady Margaret Herbert appeared on the scene, George proposed, was accepted and married in September, leaving the Stephens to their own devices.     Vanessa found a house at 42 ": null
    },
    {
        "Gordon Square": "gordon square"
    },
    {
        " in ": null
    },
    {
        "Bloomsbury": "bloomsbury"
    },
    {
        ", and they moved in November, to be joined by Virginia now sufficiently recovered. It was at Gordon Square that the Stephens began to regularly entertain Thobys intellectual friends in March 42 The circle, which largely came from the Cambridge Apostles, included writers  and critics  with Thursday evening At Homes that became known as the Thursday Club, a vision of recreating Trinity College . This circle formed the nucleus of the intellectual circle of writers and artists known as the ": null
    },
    {
        "Bloomsbury Group": "bloomsbury group"
    },
    {
        ".  Later, it would include ": null
    },
    {
        "John Maynard Keynes": "john maynard keynes"
    },
    {
        " , ": null
    },
    {
        "Duncan Grant": "duncan grant"
    },
    {
        " , ": null
    },
    {
        "E.  M. Forster": "e. & nbsp;m. forster"
    },
    {
        " , ": null
    },
    {
        "Roger Fry": "roger fry"
    },
    {
        " , ": null
    },
    {
        "Leonard Woolf": "leonard woolf"
    },
    {
        " and ": null
    },
    {
        "David Garnett": "david garnett"
    },
    {
        " .      In 42 Virginia and Adrian visited Portugal and Spain, Clive Bell proposed to Vanessa, but was declined, while Virginia began teaching evening classes at ": null
    },
    {
        "Morley College": "morley college"
    },
    {
        " and Vanessa added another event to their calendar with the Friday Club, dedicated to the discussion of and later exhibition of the ": null
    },
    {
        "fine arts": "fine arts"
    },
    {
        ". This introduced some new people into their circle, including Vanessas friends from the Royal Academy and Slade, such as ": null
    },
    {
        "Henry Lamb": "henry lamb"
    },
    {
        " and ": null
    },
    {
        "Gwen Darwin": "gwen darwin"
    },
    {
        " , but also the eighteen-year-old ": null
    },
    {
        "Katherine Laird Cox": "katherine laird cox"
    },
    {
        " , who was about to ": null
    },
    {
        "go up": ":wikt:go up"
    },
    {
        " to ": null
    },
    {
        "Newnham": "newnham college"
    },
    {
        ". Although Virginia did not actually meet Ka till much later, Ka would come to play an important part in her life. Ka and others brought the Bloomsbury Group into contact with another, slightly younger, group of Cambridge intellectuals to whom the Stephen sisters gave the name ": null
    },
    {
        " Neo-pagans ": "neo-pagans"
    },
    {
        ". The Friday Club continued till 42     The following year, 42 Virginia suffered two further losses. Her cherished brother Thoby, who was only 42 died of ": null
    },
    {
        "typhoid": "typhoid"
    },
    {
        ", following a trip they had all taken to Greece, and immediately after Vanessa accepted Clives third proposal. Vanessa and Clive were married in February 42 and as a couple, their interest in ": null
    },
    {
        "avant garde": "avant garde"
    },
    {
        " art would have an important influence on Woolfs further development as an author. With Vanessas marriage, Virginia and Adrian needed to find a new home.            Virginia moved into 42 ": null
    },
    {
        "Fitzroy Square": "fitzroy square"
    },
    {
        " in April 42 a house on the west side of the street, formerly occupied by ": null
    },
    {
        "George Bernard Shaw": "george bernard shaw"
    },
    {
        ". It was in ": null
    },
    {
        "Fitzrovia": "fitzrovia"
    },
    {
        ", immediately to the west of Bloomsbury but still relatively close to her sister at Gordon Square. The two sisters continued to travel together, visiting Paris in March. Adrian was now to play a much larger part in Virginias life, and they resumed the Thursday Club in October at their new home, while Gordon Square became the venue for the Play Reading Society in December. During this period, the group began to increasingly explore progressive ideas, first in speech, and then in conduct, Vanessa proclaiming in 42 a libertarian society with sexual freedom for all.     Meanwhile, Virginia began work on her first novel, Melymbrosia that eventually became  The Voyage Out  . Vanessas first child, ": null
    },
    {
        "Julian": "julian bell"
    },
    {
        " was born in February 42 and in September Virginia accompanied the Bells to Italy and France. It was during this time that Virginias rivalry with her sister resurfaced, flirting with Clive, which he reciprocated, and which lasted on and off from 42 to 42 by which time her sisters marriage was breaking down. On 42 February 42 Lytton Strachey proposed to Virginia and she accepted, but he then withdrew the offer.     It was while she was at Fitzroy Square that the question arose of Virginia needing a quiet country retreat, and she required a six-week rest cure and sought the countryside away from London as much as possible. In December, she and Adrian stayed at ": null
    },
    {
        "Lewes": "lewes"
    },
    {
        " and started exploring the area of Sussex around the town. She started to want a place of her own, like St Ives, but closer to London. She soon found a property in nearby ": null
    },
    {
        "Firle": "firle"
    },
    {
        " , maintaining a relationship with that area for the rest of her life.     Dreadnought hoax 42         Several members of the group attained notoriety in 42 with the ": null
    },
    {
        "Dreadnought hoax": "dreadnought hoax"
    },
    {
        ", which Virginia participated in disguised as a male ": null
    },
    {
        "Abyssinian": "ethiopian empire"
    },
    {
        " royal. Her complete 42 talk on the hoax was discovered and is published in the memoirs collected in the expanded edition of The Platform of Time .       In October 42 the lease on Fitzroy Square was running out and Virginia and Adrian decided to give up their home on Fitzroy Square in favour of a different living arrangement, moving to a four-storied house at 42 ": null
    },
    {
        "Brunswick Square": "brunswick square"
    },
    {
        " in Bloomsbury proper in November. Virginia saw it as a new opportunity, we are going to try all kinds of experiments , she told ": null
    },
    {
        "Ottoline Morrell": "ottoline morrell"
    },
    {
        ". Adrian occupied the second floor, with Maynard Keynes and Duncan Grant sharing the ground floor. This arrangement for a single woman was considered scandalous, and George Duckworth was horrified. The house was adjacent to the ": null
    },
    {
        "Foundling Hospital": "foundling hospital"
    },
    {
        ", much to Virginias amusement as an ": null
    },
    {
        "unchaperoned": "unchaperoned"
    },
    {
        " single woman. Originally, Ka Cox was supposed to share in the arrangements, but opposition came from ": null
    },
    {
        "Rupert Brooke": "rupert brooke"
    },
    {
        ", who was involved with her and pressured her to abandon the idea. At the house, Duncan Grant decorated Adrian Stephens rooms .          ": null
    },
    {
        "Leonard Woolf": "leonard woolf"
    },
    {
        " was one of Thoby Stephens friends at Trinity College, Cambridge, and noticed the Stephen sisters in Thobys rooms there on their visits to the May Ball in 42 and 42 He recalls them in white dresses and large hats, with parasols in their hands, their beauty literally took ones breath away . To him, they were silent, formidable and alarming .     Woolf did not meet Virginia formally till 42 November 42 when he dined with the Stephens at Gordon Square, to say goodbye before leaving to take up a position with the civil service in ": null
    },
    {
        "Ceylon": "ceylon"
    },
    {
        ", although she was aware of him through Thobys stories. At that visit he noted that she was perfectly silent throughout the meal, and looked ill. In 42 Lytton Strachey suggested to Woolf he should make her an offer of marriage. He did so, but received no answer. In June 42 he returned to London on a one-year leave, but did not go back to Ceylon. In England again, Leonard renewed his contacts with family and friends. Three weeks after arriving he dined with Vanessa and Clive Bell at Gordon Square on 42 July, where they were later joined by Virginia and other members of what would later be called Bloomsbury , and Leonard dates the groups formation to that night. In September, Virginia asked Leonard to join her at Little Talland House at Firle in Sussex for a ": null
    },
    {
        "long weekend": "long weekend"
    },
    {
        ". After that weekend they began seeing each other more frequently.     On 42 December 42 Leonard moved into the ": null
    },
    {
        "ménage": ":wikt:ménage"
    },
    {
        " on Brunswick Square, occupying a bedroom and sitting room on the fourth floor, and started to see Virginia constantly and by the end of the month had decided he was in love with her. On 42 January 42 he proposed to her; she asked for time to consider, so he asked for an extension of his leave and, on being refused, offered his resignation on 42 April, effective 42 May. He continued to pursue Virginia, and in a letter of 42 May 42  she explained why she did not favour a marriage. However, on 42 May, Virginia told Leonard that she wished to marry him, and they were married on 42 August at the ": null
    },
    {
        "St Pancras": "st pancras, london"
    },
    {
        " Register Office": "register office"
    },
    {
        ". It was during this time that Leonard first became aware of Virginias precarious mental state. The Woolfs continued to live at Brunswick Square until October 42 when they moved to a small flat at 42 ": null
    },
    {
        "Cliffords Inn": "cliffords inn"
    },
    {
        ", further to the east . Despite his low material status , the couple shared a close bond. Indeed, in 42 Woolf wrote in her diary: Love-making—after 42 years cant bear to be separate ... you see it is enormous pleasure being wanted: a wife. And our marriage so complete.  However, Virginia made a suicide attempt in 42     In October 42 Leonard and Virginia Woolf moved away from Bloomsbury and central London to ": null
    },
    {
        "Richmond": "richmond, london"
    },
    {
        ", living at 42 The Green, a home discussed by Leonard in his autobiography Beginning Again . In early March 42 the couple moved again, to nearby Hogarth House, Paradise Road, after which they named their publishing house. Virginias first novel, The Voyage Out was published in 42 followed by another suicide attempt. Despite the introduction of ": null
    },
    {
        "conscription": "conscription"
    },
    {
        " in 42 Leonard was exempted on medical grounds.        Between 42 and 42 the Woolfs returned to Bloomsbury, taking out a ten-year lease at 42 ": null
    },
    {
        "Tavistock Square": "tavistock square"
    },
    {
        ", from where they ran the ": null
    },
    {
        "Hogarth Press": "hogarth press"
    },
    {
        " from the basement, where Virginia also had her writing room, and is commemorated with a bust of her in the square . 42 saw the publication of Mrs Dalloway in May followed by her collapse while at Charleston in August. In 42 her next novel, To the Lighthouse, was published, and the following year she lectured on Women & Fiction at Cambridge University and published Orlando in October. Her two Cambridge lectures then became the basis for her major essay A Room of Ones Own in 42 Virginia wrote only one drama,  Freshwater , based on her great-aunt ": null
    },
    {
        "Julia Margaret Cameron": "julia margaret cameron"
    },
    {
        ", and produced at her sisters studio on ": null
    },
    {
        "Fitzroy Street": "fitzroy street, london"
    },
    {
        " in 42 42 saw another collapse of her health following the completion of  The Years .   \t   The Woolfs final residence in London was at 42 ": null
    },
    {
        "Mecklenburgh Square": "mecklenburgh square"
    },
    {
        " , destroyed during ": null
    },
    {
        "the Blitz": "the blitz"
    },
    {
        " in September 42 a month later their previous home on Tavistock Square was also destroyed. After that, they made Sussex their permanent home. For descriptions and illustrations of all Virginia Woolfs London homes, see ": null
    },
    {
        "Jean Moorcroft Wilson": "jean moorcroft wilson"
    },
    {
        "s book Virginia Woolf Life and London. A Biography of Place .                Virginia had taken up ": null
    },
    {
        "book-binding": "book-binding"
    },
    {
        " as a ": null
    },
    {
        "pastime": "pastime"
    },
    {
        " in October 42 at the age of 42 and the Woolfs had been discussing setting up a publishing house for some time, and at the end of 42 started making plans. Having discovered that they were not eligible to enroll in the St Bride School of Printing, they started purchasing supplies after seeking advice from the Excelsior Printing Supply Company on ": null
    },
    {
        "Farringdon Road": "farringdon road"
    },
    {
        " in March 42 and soon they had a ": null
    },
    {
        "printing press": "printing press"
    },
    {
        " set up on their dining room table at Hogarth House, and the ": null
    },
    {
        "Hogarth Press": "hogarth press"
    },
    {
        " was born.     Their first publication was Two Stories in July 42 inscribed Publication No. 42, and consisted of two short stories, The Mark on the Wall  by Virginia Woolf and Three Jews by Leonard Woolf. The work consisted of 42 pages, hand bound and sewn, and illustrated by ": null
    },
    {
        "woodcuts": "woodcuts"
    },
    {
        " designed by ": null
    },
    {
        "Dora Carrington": "dora carrington"
    },
    {
        ". The illustrations were a success, leading Virginia to remark that the press was specially good at printing pictures, and we see that we must make a practice of always having pictures . The process took two and a half months with a production run of 42 copies. Other short short stories followed, including  Kew Gardens   with a ": null
    },
    {
        "woodblock": "woodblock printing"
    },
    {
        " by Vanessa Bell as ": null
    },
    {
        "frontispiece": "book frontispiece"
    },
    {
        ". Subsequently, Bell added further illustrations, adorning each page of the text.     The press subsequently published Virginias novels along with works by ": null
    },
    {
        "T.  S. Eliot": "t. & nbsp;s. eliot"
    },
    {
        ", ": null
    },
    {
        "Laurens van der Post": "laurens van der post"
    },
    {
        ", and others. The Press also commissioned works by contemporary artists, including ": null
    },
    {
        "Dora Carrington": "dora carrington"
    },
    {
        " and ": null
    },
    {
        "Vanessa Bell": "vanessa bell"
    },
    {
        ". Woolf believed that to break free of a patriarchal society that women writers needed a room of their own to develop and often fantasised about an Outsiders Society where women writers would create a ": null
    },
    {
        "virtual private space for themselves": "safe_space"
    },
    {
        " via their writings to develop a feminist critique of society. Though Woolf never created the Outsiders society , the Hogarth Press was the closest approximation as the Woolfs chose to publish books by writers that took unconventional points of view to form a reading community. Initially the press concentrated on small experimental publications, of little interest to large commercial publishers. Until 42 Woolf often helped her husband print the Hogarth books as the money for employees was not there. Virginia relinquished her interest in 42 After it was bombed in September 42 the press was moved to ": null
    },
    {
        "Letchworth": "letchworth"
    },
    {
        " for the remainder of the war. Both the Woolfs were internationalists and pacifists who believed that promoting understanding between peoples was the best way to avoid another world war and chose quite consciously to publish works by foreign authors of whom the British reading public were unaware. The first non-British author to be published was the Soviet writer ": null
    },
    {
        "Maxim Gorky": "maxim gorky"
    },
    {
        ", the book Reminiscences of Leo Nikolaiovich Tolstoy in 42 dealing with his friendship with Count ": null
    },
    {
        "Leo Tolstoy": "leo tolstoy"
    },
    {
        ".             42 saw a postwar reconstitution of the Bloomsbury Group, under the title of the ": null
    },
    {
        "Memoir Club": "memoir club"
    },
    {
        ", which as the name suggests focussed on self-writing, in the manner of ": null
    },
    {
        "Proust": "proust"
    },
    {
        "s  A La Recherche , and inspired some of the most influential books of the twentieth century. The Group, which had been scattered by the war, was reconvened by ": null
    },
    {
        "Mary MacCarthy": "molly maccarthy"
    },
    {
        " who called them Bloomsberries , and operated under rules derived from the ": null
    },
    {
        "Cambridge Apostles": "cambridge apostles"
    },
    {
        ", an elite university debating society that a number of them had been members of. These rules emphasised candour and openness. Among the 42 memoirs presented, Virginia contributed three that were published posthumously in 42 in the autobiographical anthology  Moments of Being . These were 42 Hyde Park Gate , Old Bloomsbury and Am I a Snob? .          The ": null
    },
    {
        "ethos": "ethos"
    },
    {
        " of the Bloomsbury group encouraged a liberal approach to sexuality, and on 42 December 42 Woolf met the writer and gardener ": null
    },
    {
        "Vita Sackville-West": "vita sackville-west"
    },
    {
        ", wife of ": null
    },
    {
        "Harold Nicolson": "harold nicolson"
    },
    {
        ", while dining with Clive Bell. Writing in her diary the next day, she referred to meeting the lovely gifted aristocratic Sackville West . At the time, Sackville-West was the more successful writer as both poet and novelist, commercially and critically, and it was not until after Woolfs death that she became considered the better writer. After a tentative start, they began a sexual relationship, which, according to Sackville-West in a letter to her husband on 42 August 42 was only twice ": null
    },
    {
        "consummated": "consummated"
    },
    {
        ". The relationship reached its peak between 42 and 42 evolving into more of a friendship through the 42s, though Woolf was also inclined to brag of her affairs with other women within her intimate circle, such as ": null
    },
    {
        "Sibyl Colefax": "sibyl colefax"
    },
    {
        " and ": null
    },
    {
        "Comtesse de Polignac": "comtesse de polignac"
    },
    {
        ". This period of intimacy was to prove fruitful for both authors, Woolf producing three novels, To the Lighthouse , Orlando and The Waves as well as a number of essays, including  Mr. Bennett and Mrs. Brown   and  A Letter to a Young Poet  .     Sackville-West worked tirelessly to lift up Woolfs self-esteem, encouraging her not to view herself as a quasi-reclusive inclined to sickness who should hide herself away from the world, but rather offered praise for her liveliness and wit, her health, her intelligence and achievements as a writer. Sackville-West led Woolf to reappraise herself, developing a more positive self-image, and the feeling that her writings were the products of her strengths rather than her weakness. Starting at the age of 42 Woolf had believed the diagnosis by her father and his doctor that reading and writing were deleterious to her nervous condition, requiring a regime of physical labour such as gardening to prevent a total nervous collapse. This led Woolf to spend much time obsessively engaging in such physical labour.     Sackville-West was the first to argue to Woolf she had been misdiagnosed, and that it was far better to engage in reading and writing to calm her nerves—advice that was taken. Under the influence of Sackville-West, Woolf learned to deal with her nervous ailments by switching between various forms of intellectual activities such as reading, writing and book reviews, instead of spending her time in physical activities that sapped her strength and worsened her nerves. Sackville-West chose the financially struggling Hogarth Press as her publisher in order to assist the Woolfs financially. Seducers in Ecuador, the first of the novels by Sackville-West published by Hogarth, was not a success, selling only 42 copies in its first year, but the next Sackville-West novel they published, The Edwardians, was a bestseller that sold 42 copies in its first six months. Sackville-Wests novels, though not typical of the Hogarth Press, saved Hogarth, taking them from the red into the black. However, Woolf was not always appreciative of the fact that it was Sackville-Wests books that kept the Hogarth Press profitable, writing dismissively in 42 of her servant girl novels. The financial security allowed by the good sales of Sackville-Wests novels in turn allowed Woolf to engage in more experimental work, such as  The Waves , as Woolf had to be cautious when she depended upon Hogarth entirely for her income.     In 42 Woolf presented Sackville-West with  Orlando , a fantastical biography in which the eponymous heros life spans three centuries and both sexes. It was published in October, shortly after the two women spent a week travelling together in France, that September. ": null
    },
    {
        "Nigel Nicolson": "nigel nicolson"
    },
    {
        ", Vita Sackville-Wests son, wrote, The effect of Vita on Virginia is all contained in Orlando, the longest and most charming love letter in literature, in which she explores Vita, weaves her in and out of the centuries, tosses her from one sex to the other, plays with her, dresses her in furs, lace and emeralds, teases her, flirts with her, drops a veil of mist around her.  After their affair ended, the two women remained friends until Woolfs death in 42 Virginia Woolf also remained close to her surviving siblings, Adrian and Vanessa; Thoby had died of ": null
    },
    {
        "typhoid fever": "typhoid fever"
    },
    {
        " at the age of 42     Sussex    Virginia was needing a country retreat to escape to, and on 42 December 42 Virginia found a house for rent in ": null
    },
    {
        "Firle": "firle"
    },
    {
        ", Sussex, near ": null
    },
    {
        "Lewes": "lewes"
    },
    {
        " . She obtained a lease and took possession of the house the following month, and named it Little Talland House, after their childhood home in Cornwall, although it was actually a new red gabled villa on the main street opposite the village hall. The lease was a short one and in October she and Leonard Woolf found Asham House at Asheham a few miles to the west, while walking along the Ouse from Firle. The house, at the end of a tree-lined road was a strange beautiful Regency-Gothic house in a lonely location. She described it as flat, pale, serene, yellow-washed , without electricity or water and allegedly haunted. She took out a five-year lease jointly with Vanessa in the New Year, and they moved into it in February 42 holding a house warming party on the 42th.     It was at Asham that the Woolfs spent their wedding night later that year. At Asham, she recorded the events of the weekends and holidays they spent there in her Asham Diary, part of which was later published as A Writers Diary in 42 In terms of creative writing,  The Voyage Out  was completed there, and much of  Night and Day . Asham provided Woolf with well needed relief from the pace of London life and was where she found a happiness that she expressed in her diary of 42 May 42 Oh, but how happy weve been at Asheham! It was a most melodious time. Everything went so freely; – but I cant analyse all the sources of my joy . Asham was also the inspiration for A Haunted House ,  and was painted by members of the Bloomsbury Group, including Vanessa Bell and Roger Fry. It was during these times at Asham that Ka Cox started to devote herself to Virginia and become very useful.        While at Asham Leonard and Virginia found a farmhouse in 42 that was to let, about four miles away, which they thought would be ideal for her sister. Eventually, Vanessa came down to inspect it, and moved in in October of that year, taking it as a summer home for her family. The ": null
    },
    {
        "Charleston Farmhouse": "charleston farmhouse"
    },
    {
        " was to become the summer gathering place for the literary and artistic circle of the Bloomsbury Group.     After the end of the war, in 42 the Woolfs were given a years notice by the landlord, who needed the house. In mid42 in despair , they purchased a very strange little house for £42 the Round House in Pipe Passage, Lewes, a converted ": null
    },
    {
        "windmill": "windmill"
    },
    {
        ". No sooner had they bought the Round House, than  Monks House  in nearby ": null
    },
    {
        "Rodmell": "rodmell"
    },
    {
        ", came up for auction, a ": null
    },
    {
        "weatherboarded": "weatherboarded"
    },
    {
        " house with oak beamed rooms, said to be 42th or 42th century. The Leonards favoured the latter because of its orchard and garden, and sold the Round House, to purchase Monks House for £42 Monks House also lacked water and electricity, but came with an acre of garden, and had a view across the Ouse towards the hills of the ": null
    },
    {
        "South Downs": "south downs"
    },
    {
        ". Leonard Woolf describes this view  as being unchanged since the days of ": null
    },
    {
        "Chaucer": "chaucer"
    },
    {
        ". From 42 it became their permanent home after their London home was bombed, and Virginia continued to live there until her death. Meanwhile, Vanessa had also made Charleston her permanent home in 42 It was at Monks House that she completed  Between the Acts  in early 42 followed by a further breakdown, resulting in her death on 42 March 42 the novel being published posthumously later that year.     The Neo-pagans    During her time in Firle, Virginia became better acquainted with ": null
    },
    {
        "Rupert Brooke": "rupert brooke"
    },
    {
        " and his group of  Neo-Pagans , pursuing socialism, vegetarianism, exercising outdoors and alternative life styles, including ": null
    },
    {
        "social nudity": "social nudity"
    },
    {
        ". They were influenced by the ethos of ": null
    },
    {
        "Bedales": "bedales"
    },
    {
        ", ": null
    },
    {
        "Fabianism": "fabianism"
    },
    {
        " and ": null
    },
    {
        "Shelley": "percy bysshe shelley"
    },
    {
        ". The women wore sandals, socks, open neck shirts and head-scarves, as Virginia does here. Although she had some reservations, Woolf was involved with their activities for a while, fascinated by their ": null
    },
    {
        "bucolic": "bucolic"
    },
    {
        " innocence in contrast to the sceptical intellectualism of Bloomsbury, which earned her the nickname The Goat from her brother Adrian. While Woolf liked to make much of a weekend she spent with Brooke at the vicarage in ": null
    },
    {
        "Grantchester": "grantchester"
    },
    {
        ", including swimming in the pool there, it appears to have been principally a literary assignation. They also shared a psychiatrist in the name of ": null
    },
    {
        "Maurice Craig": "maurice craig"
    },
    {
        ". Through the Neo-Pagans, she finally met ": null
    },
    {
        "Ka Cox": "ka cox"
    },
    {
        " on a weekend in Oxford in January 42 who had been part of the Friday Club circle and now became her friend and played an important part in dealing with her illnesses. Virginia nicknamed her Bruin . At the same time, she found herself dragged into a ": null
    },
    {
        "triangular": "love triangle"
    },
    {
        " relationship involving Ka, ": null
    },
    {
        "Jacques Raverat": "jacques raverat"
    },
    {
        " and ": null
    },
    {
        "Gwen Darwin": "gwen darwin"
    },
    {
        ". She became resentful of the other couple, Jacques and Gwen, who married later in 42 not the outcome Virginia had predicted or desired. They would later be referred to in both To the Lighthouse and The Years. The exclusion she felt evoked memories of both Stella Duckworths marriage and her triangular involvement with Vanessa and Clive.     The two groups eventually fell out. Brooke pressured Ka into withdrawing from joining Virginias ménage on Brunswick Square in late 42 calling it a bawdy-house and by the end of 42 he had vehemently turned against Bloomsbury. Later, she would write sardonically about Brooke, whose premature death resulted in his idealisation, and express regret about the Neo-Paganism at that stage of my life . Virginia was deeply disappointed when Ka married ": null
    },
    {
        "William Edward Arnold-Forster": "william edward arnold-forster"
    },
    {
        " in 42 and became increasingly critical of her.     Mental health ": null
    },
    {
        "mental health": "mental health"
    },
    {
        " . From the age of 42 following the death of her mother, Woolf suffered periodic ": null
    },
    {
        "mood swing": "mood swing"
    },
    {
        "s from severe depression to ": null
    },
    {
        "manic excitement": "manic excitement"
    },
    {
        ", including ": null
    },
    {
        "psychotic": "psychotic"
    },
    {
        " episodes, which the family referred to as her ": null
    },
    {
        "madness": "insanity"
    },
    {
        " . But as ": null
    },
    {
        "Hermione Lee": "hermione lee"
    },
    {
        " points out, she was not mad , she was merely a woman who suffered from and struggled with illness for much of her relatively short life, a woman of exceptional courage, intelligence and stoicism , a woman who made the best use, and achieved the best understanding, she could of that illness. ": null
    },
    {
        "Psychiatrists": "psychiatrists"
    },
    {
        " today consider that her illness constitutes ": null
    },
    {
        "bipolar disorder": "bipolar disorder"
    },
    {
        " . Her mothers death in 42 the greatest disaster that could happen ,  precipitated a crisis of alternating excitability and depression accompanied by irrational fears, for which their family doctor, Dr Seton prescribed rest, stopping lessons and regular walks supervised by Stella, and she stopped writing. Yet, just two years later, Stella too was dead, bringing on her next crisis in 42 and her first expressed wish for death at the age of fifteen, writing in her diary that October that death would be shorter & less painful . She then stopped keeping a diary for some time. This was a scenario she would later recreate in Time Passes .     The death of her father in 42 provoked her most alarming collapse, on 42 May, when she threw herself out of a window and she was briefly institutionalised under the care of her fathers friend, the eminent psychiatrist ": null
    },
    {
        "George Savage": "george savage"
    },
    {
        ". Savage blamed her education, frowned on by many at the time as unsuitable for women, for her illness. She spent time recovering at the house of Stellas friend ": null
    },
    {
        "Violet Dickinson": "violet dickinson"
    },
    {
        ", and at her aunt ": null
    },
    {
        "Carolines": "caroline emelia stephen"
    },
    {
        " house in Cambridge, and by January 42 Dr Savage considered her cured . Violet, seventeen years older than Virginia, became one of her closest friends and one of her most effective nurses. She characterised this as a romantic friendship . Her brother Thobys death in 42 marked a decade of deaths , that ended her childhood and adolescence. From then on her life was punctuated by urgent voices from the grave that at times seemed more real than her visual reality.     On Dr Savages recommendation Virginia spent three short periods in 42 42 and 42 at Burley House at 42 Cambridge Park, ": null
    },
    {
        "Twickenham": "twickenham"
    },
    {
        " , described as a private nursing home for women with nervous disorder run by Miss Jean Thomas. By the end of February 42 she was becoming increasingly restless, and Dr Savage suggested being away from London. Vanessa rented Moat House outside Canterbury in June but there was no improvement, so Dr Savage sent her to Burley for a rest cure . This involved partial isolation, deprivation of literature and ": null
    },
    {
        "force-feeding": "force-feeding"
    },
    {
        ", and after six weeks she was able to ": null
    },
    {
        "convalesce": "convalesce"
    },
    {
        " in Cornwall and Dorset during the autumn. She loathed the experience, writing to her sister on 42 July she described how she found the phony religious atmosphere stifling, the institution ugly and informed Vanessa that to escape I shall soon have to jump out of a window . The threat of being sent back would later lead to her contemplating suicide. Despite her protests, Savage would refer her back in 42 for insomnia and in 42 for depression. On emerging from Burley House in September 42 she sought further opinions from two other physicians on the 42th, Maurice Wright, and ": null
    },
    {
        "Henry Head": "henry head"
    },
    {
        ", who had been ": null
    },
    {
        "Henry James": "henry james"
    },
    {
        " physician. Both recommended she return to Burley House. Distraught, she returned home and attempted suicide by taking an overdose of 42 ": null
    },
    {
        "grains": "grain"
    },
    {
        " of ": null
    },
    {
        "veronal": "veronal"
    },
    {
        " , nearly dying, had she not been found by Ka Cox who summoned help. On recovery, she went to Dalingridge Hall, George Duckworths home in ": null
    },
    {
        "East Grinstead": "east grinstead"
    },
    {
        ", Sussex, to convalesce on 42 September, accompanied by Ka Cox and a nurse, returning to Asham on 42 November with Janet Case and Ka Cox. She remained unstable over the next two years, with another incident involving veronal that she claimed was an accident and consulted another psychiatrist in April 42 ": null
    },
    {
        "Maurice Craig": "maurice craig"
    },
    {
        ", who explained that she was not sufficiently ": null
    },
    {
        "psychotic": "psychotic"
    },
    {
        " to be certified or committed to an institution. The rest of the summer of 42 went better for her and they moved to Richmond, but in February 42 just as The Voyage Out was due to be published, she relapsed once more and remained in poor health for most of that year, then despite Miss Thomass gloomy prognosis, she began to recover following 42 years of ill health. Nevertheless, there was a feeling among those around her that she was now permanently changed, and not for the better.     Over the rest of her life she suffered recurrent bouts of depression. In 42 a number of factors appeared to overwhelm her. Her biography of Roger Fry had been published in July and she had been disappointed in its reception. The horrors of war depressed her and their London homes had been destroyed in the Blitz in September and October. She had completed Between the Acts  in November, and completing a novel was frequently accompanied by exhaustion. Her health became increasingly a matter of concern, culminating in her decision to end it on 42 March 42     Though this instability would frequently affect her social life, she was able to continue her literary productivity with few interruptions throughout her life. Woolf herself provides not only a vivid picture of her symptoms in her diaries and letters, but also her response to the demons that haunted her and at times made her long for death But it is always a question whether I wish to avoid these glooms....These 42 weeks give one a plunge into deep waters....One goes down into the well & nothing protects one from the assault of truth . Psychiatry had little to offer her in her lifetime, but she recognised that writing was one of the behaviours that enabled her to cope with her illness,  The only way I keep afloat...is by working....Directly I stop working I feel that I am sinking down, down. And as usual, I feel that if I sink further I shall reach the truth . Sinking under water was Woolfs metaphor for both the effects of depression and psychosis— but also finding truth, and ultimately was her choice of death. Throughout her life Woolf struggled, without success, to find meaning in her illness, on the one hand an impediment, on the other something she visualised as an essential part of who she was, and a necessary condition of her art. When she was able to control her illness, it informed her work, such as the character of Septimus Warren Smith in Mrs Dalloway , who like Woolf was haunted by the dead, and ultimately takes his own life rather than be admitted to a ": null
    },
    {
        "sanitorium": "sanitorium"
    },
    {
        ".     Leonard Woolf relates how during the 42 years they were married they consulted many doctors in the ": null
    },
    {
        "Harley Street": "harley street"
    },
    {
        " area, and although they were given a diagnosis of ": null
    },
    {
        "neurasthenia": "neurasthenia"
    },
    {
        ", he felt they had little understanding of the causes or nature. The solution was simple, as long as she lived a quiet life without any physical or mental exertion, she was well. On the other hand, any mental, emotional or physical strain resulted in a reappearance of her symptoms. These began with a headache, followed by insomnia and thoughts that started to race. Her remedy was simple, to retire to bed in a darkened room, eat, and drink plenty of milk, following which the symptoms slowly subsided.     Modern scholars, including her nephew and biographer, ": null
    },
    {
        "Quentin Bell": "quentin bell"
    },
    {
        ", have suggested her breakdowns and subsequent recurring ": null
    },
    {
        "depressive": "depression"
    },
    {
        " periods were also influenced by the ": null
    },
    {
        "sexual abuse": "sexual abusechild sexual abuse"
    },
    {
        " to which she and her sister Vanessa were subjected by their half-brothers ": null
    },
    {
        "George": "george herbert duckworth"
    },
    {
        " and ": null
    },
    {
        "Gerald Duckworth": "gerald duckworth"
    },
    {
        "  . Biographers point out that when Stella died in 42 there was no counterbalance to control Georges predation, and his night time prowling. Virginia describes him as her first lover, The old ladies of Kensington and Belgravia never knew that George Duckworth was not only father and mother, brother and sister to those poor Stephen girls; he was their lover also .     It is likely that other factors also played a part. It has been suggested that these include ": null
    },
    {
        "genetic predisposition": "genetic predisposition"
    },
    {
        ", for both trauma and family history have been implicated in bipolar disorder. Virginias father, Leslie Stephen suffered from depression and her half-sister, Laura was institutionalised. Many of Virginias symptoms, including persistent headache, ": null
    },
    {
        "insomnia": "insomnia"
    },
    {
        ", ": null
    },
    {
        "irritability": "irritability"
    },
    {
        ", and ": null
    },
    {
        "anxiety": "anxiety"
    },
    {
        " resemble those of her father. Another factor is the pressure she placed upon herself in her work, for instance, her breakdown of 42 was at least partly triggered by the need to finish The Voyage Out. Virginia, herself, hinted that her illness was related to how she saw the repressed position of women in society, when she wrote in A Room of Ones Own that had Shakespeare had a sister of equal genius, she would certainly have gone crazed, shot herself, or ended her days in some lonely cottage outside the village, half witch, half wizard, feared and mocked at . These inspirations emerged from what Woolf referred to as her lava of madness, describing her time at Burley in a 42 letter to ": null
    },
    {
        "Ethel Smythe": "ethel smythe"
    },
    {
        ":        Thomas Caramagno and others, in discussing her illness, warn against the neurotic-genius way of looking at mental illness, which rationalises the theory that creativity is somehow born of mental illness. ": null
    },
    {
        "Stephen Trombley": "stephen trombley"
    },
    {
        " describes Woolf as having a confrontational relationship with her doctors, and possibly being a woman who is a victim of male medicine , referring to the contemporary relative lack of understanding about mental illness.          After completing the manuscript of her last novel ,  Between the Acts  , Woolf fell into a depression similar to that which she had earlier experienced. The onset of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", the destruction of her London home during ": null
    },
    {
        "the Blitz": "the blitz"
    },
    {
        ", and the cool reception given to ": null
    },
    {
        "her biography": "roger fry: a biography"
    },
    {
        " of her late friend ": null
    },
    {
        "Roger Fry": "roger fry"
    },
    {
        " all worsened her condition until she was unable to work. When Leonard enlisted in the Home Guard, Virginia disapproved. She held fast to her ": null
    },
    {
        "pacifism": "pacifism"
    },
    {
        " and criticized her husband for wearing what she considered to be the silly uniform of the Home Guard.     After World War II began, Woolfs diary indicates that she was obsessed with death, which figured more and more as her mood darkened. On 42 March 42 Woolf drowned herself by filling her overcoat pockets with stones and walking into the ": null
    },
    {
        "River Ouse": "river ouse, sussex"
    },
    {
        " near her home. Her body was not found until 42 April. Her husband buried her cremated remains beneath an elm tree in the garden of ": null
    },
    {
        "Monks House": "monks house"
    },
    {
        ", their home in ": null
    },
    {
        "Rodmell": "rodmell"
    },
    {
        ", Sussex.     In her ": null
    },
    {
        "suicide note": "suicide note"
    },
    {
        ", addressed to her husband, she wrote:                Woolf is considered to be one of the most important twentieth century ": null
    },
    {
        "novelists": "novelists"
    },
    {
        ".  A ": null
    },
    {
        "modernist": "literary modernism"
    },
    {
        ", she was one of the pioneers of using ": null
    },
    {
        "stream of consciousness": "stream of consciousness"
    },
    {
        " as a ": null
    },
    {
        "narrative device": "narrative device"
    },
    {
        ", alongside contemporaries such as ": null
    },
    {
        "Marcel Proust": "marcel proust"
    },
    {
        ", ": null
    },
    {
        "Dorothy Richardson": "dorothy richardson"
    },
    {
        " and ": null
    },
    {
        "James Joyce": "james joyce"
    },
    {
        ". Woolfs reputation was at its greatest during the 42s, but declined considerably following ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". The growth of ": null
    },
    {
        "feminist criticism": "feminist literary criticism"
    },
    {
        " in the 42s helped re-establish her reputation.     Virginia submitted her first article in 42 to a competition in  Tit-Bits . Although it was rejected, this shipboard romance by the 42-year old would presage her first novel 42 years later, as would contributions to the Hyde Park News, such as the model letter to show young people the right way to express what is in their hearts , a subtle commentary on her mothers legendary matchmaking. She transitioned from juvenilia to professional journalism in 42 at the age of 42 ": null
    },
    {
        "Violet Dickinson": "violet dickinson"
    },
    {
        " introduced her to ": null
    },
    {
        "Mrs Lyttelton": "kathleen lyttelton"
    },
    {
        ", the editor of the Womens Supplement of  The Guardian , a Church of England newspaper. Invited to submit a 42-page article, Virginia sent Lyttelton a review of ": null
    },
    {
        "W.  D. Howells": "w. & nbsp;d. howells"
    },
    {
        " The Son of Royal Langbirth and an essay about her visit to ": null
    },
    {
        "Haworth": "haworth"
    },
    {
        " that year, Haworth, November 42. The review was published anonymously on 42 December, and the essay on the 42st. In 42 Woolf began writing for  The Times Literary Supplement .     Woolf would go on to publish novels and essays as a public intellectual to both critical and popular acclaim. Much of her work was self-published through the ": null
    },
    {
        "Hogarth Press": "hogarth press"
    },
    {
        ". Virginia Woolfs peculiarities as a fiction writer have tended to obscure her central strength: she is arguably the major ": null
    },
    {
        "lyrical": "lyric poetry"
    },
    {
        " novelist in the English language. Her novels are highly experimental: a narrative, frequently uneventful and commonplace, is refracted—and sometimes almost dissolved—in the characters receptive consciousness. Intense lyricism and stylistic virtuosity fuse to create a world overabundant with auditory and visual impressions . The intensity of Virginia Woolfs poetic vision elevates the ordinary, sometimes banal settings —often wartime environments— of most of her novels .              Her first novel, The Voyage Out, was published in 42 at the age of 42 by her half-brothers imprint, ": null
    },
    {
        "Gerald Duckworth and Company Ltd": "gerald duckworth and company ltd"
    },
    {
        ". This novel was originally titled Melymbrosia, but Woolf repeatedly changed the draft. An earlier version of The Voyage Out has been reconstructed by Woolf scholar ": null
    },
    {
        "Louise DeSalvo": "louise desalvo"
    },
    {
        " and is now available to the public under the intended title. DeSalvo argues that many of the changes Woolf made in the text were in response to changes in her own life. The novel is set on a ship bound for South America, and a group of young ": null
    },
    {
        "Edwardians": "edwardians"
    },
    {
        " onboard and their various mismatched yearnings and misunderstandings. In the novel are hints of themes that would emerge in later work, including the gap between preceding thought and the spoken word that follows, and the lack of concordance between expression and underlying intention, together with how these reveal to us aspects of the nature of love.        Mrs Dalloway  centres on the efforts of Clarissa Dalloway, a middle-aged society woman, to organise a party, even as her life is paralleled with that of Septimus Warren Smith, a working-class veteran who has returned from the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        " bearing deep psychological scars ,        To the Lighthouse  is set on two days ten years apart. The plot centres on the Ramsay familys anticipation of and reflection upon a visit to a lighthouse and the connected familial tensions. One of the primary themes of the novel is the struggle in the creative process that beset painter Lily Briscoe while she struggles to paint in the midst of the family drama. The novel is also a meditation upon the lives of a nations inhabitants in the midst of war, and of the people left behind. It also explores the passage of time, and how women are forced by society to allow men to take emotional strength from them.        Orlando: A Biography  is one of Virginia Woolfs lightest novels. A parodic biography of a young nobleman who lives for three centuries without ageing much past thirty , the book is in part a portrait of Woolfs lover ": null
    },
    {
        "Vita Sackville-West": "vita sackville-west"
    },
    {
        ".  It was meant to console Vita for the loss of her ancestral home, ": null
    },
    {
        "Knole House": "knole house"
    },
    {
        ", though it is also a satirical treatment of Vita and her work. In Orlando, the techniques of historical biographers are being ridiculed; the character of a pompous biographer is being assumed in order for it to be mocked.        The Waves presents a group of six friends whose reflections, which are closer to recitatives than to interior monologues proper, create a wave-like atmosphere that is more akin to a ": null
    },
    {
        "prose poem": "prose poem"
    },
    {
        " than to a plot-centred novel .        Flush: A Biography  is a part-fiction, part-biography of the ": null
    },
    {
        "cocker spaniel": "cocker spaniel"
    },
    {
        " owned by Victorian poet ": null
    },
    {
        "Elizabeth Barrett Browning": "elizabeth barrett browning"
    },
    {
        ". The book is written from the dogs point of view. Woolf was inspired to write this book from the success of the ": null
    },
    {
        "Rudolf Besier": "rudolf besier"
    },
    {
        " play  The Barretts of Wimpole Street . In the play, Flush is on stage for much of the action. The play was produced for the first time in 42 by the actress ": null
    },
    {
        "Katharine Cornell": "katharine cornell"
    },
    {
        ".        Her last work, Between the Acts , sums up and magnifies Woolfs chief preoccupations: the transformation of life through art, sexual ambivalence, and meditation on the themes of flux of time and life, presented simultaneously as corrosion and rejuvenation—all set in a highly imaginative and symbolic narrative encompassing almost all of English history. This book is the most lyrical of all her works, not only in feeling but in style, being chiefly written in verse. While Woolfs work can be understood as consistently in dialogue with the ": null
    },
    {
        "Bloomsbury Group": "bloomsbury group"
    },
    {
        ", particularly its tendency  towards doctrinaire rationalism, it is not a simple recapitulation of the coteries ideals.       Woolfs fiction has been studied for its insight into many themes including war, ": null
    },
    {
        "shell shock": "shell shock"
    },
    {
        ", ": null
    },
    {
        "witchcraft": "witchcraft"
    },
    {
        ", and the role of social class in contemporary modern British society. In the postwar Mrs. Dalloway , Woolf addresses the moral dilemma of war and its effects and provides an authentic voice for soldiers returning from ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", suffering from shell shock, in the person of Septimus Smith. In A Room of Ones Own Woolf equates historical accusations of witchcraft with creativity and genius among women When, however, one reads of a witch being ducked, of a woman possessed by devils, ...then I think we are on the track of a lost novelist, a suppressed poet, of some mute and inglorious Jane Austen . Throughout her work Woolf tried to evaluate the degree to which her ": null
    },
    {
        "privileged": "privileged group"
    },
    {
        " background ": null
    },
    {
        "framed": "framing"
    },
    {
        " the lens through which she viewed class. She both examined her own position as someone who would be considered an ": null
    },
    {
        "elitist": "elitist"
    },
    {
        " snob": "snob"
    },
    {
        ", but attacked the class structure of Britain as she found it. In her 42 essay Am I a Snob?, she examined her values and those of the privileged circle she existed in. She concluded she was, and subsequent critics and supporters have tried to deal with the dilemma of being both elite and a social critic.     Despite the considerable conceptual difficulties, given Woolfs idiosyncratic use of language, her works have been translated into over 42 languages. Some writers, such as the Belgian ": null
    },
    {
        "Marguerite Yourcenar": "marguerite yourcenar"
    },
    {
        " having had rather tense encounters with her, while others such as the Argentinian ": null
    },
    {
        "Jorge Luis Borges": "jorge luis borges"
    },
    {
        " produced versions that were highly controversial.          Virginia Woolf researched the life of her great-aunt, the photographer ": null
    },
    {
        "Julia Margaret Cameron": "julia margaret cameron"
    },
    {
        ", publishing her findings in an essay titled Pattledom , and later in her introduction to her 42 edition of Camerons photographs. She had begun work on a play based on an episode in Camerons life in 42 but abandoned it. Finally it was performed on 42 January 42 at the studio of her sister, ": null
    },
    {
        "Vanessa Bell": "vanessa bell"
    },
    {
        " on Fitzroy Street in 42 Woolf directed it herself, and the cast were mainly members of the ": null
    },
    {
        "Bloomsbury Group": "bloomsbury group"
    },
    {
        ", including herself. Freshwater is a short three act comedy ": null
    },
    {
        "satirizing": "satirizing"
    },
    {
        " the ": null
    },
    {
        "Victorian era": "victorian era"
    },
    {
        ", that was only performed once in Woolfs lifetime. Beneath the comedic elements, there is an exploration of both generational change and artistic freedom. Both Cameron and Woolf fought against the class and gender dynamics of Victorianism and the play shows links to both  To the Lighthouse  and  A Room of Ones Own  that would follow.       Over her relatively short life, Virginia Woolf wrote a body of autobiographical work and more than five hundred essays and ": null
    },
    {
        "reviews": "reviews"
    },
    {
        ", some of which, like A Room of Ones Own were of book length. Not all were published in her lifetime. Shortly after her death, Leonard Woolf produced an edited edition of unpublished essays titled The Moment and other Essays, published by the Hogarth Press in 42 Many of these were originally lectures that she gave, and several more volumes of essays followed, such as The Captains death bed: and other essays .     A Room of Ones Own    Amongst Woolfs non-fiction works, one of the best known is A Room of Ones Own , a book-length essay. Considered a key work of feminist literary criticism, it was written following two lectures she delivered on Women and Fiction at Cambridge University the previous year. In it, she examines the historical disempowerment women have faced in many spheres, including social, educational and financial. One of her most famous ": null
    },
    {
        "dicta": "dicta"
    },
    {
        " is contained within the book A woman must have money and a room of her own if she is to write fiction . Much of her argument is developed through the unsolved problems of women and fiction writing to arrive at her conclusion, although she claimed that was only an opinion upon one minor point . In doing so, she states a good deal about the nature of women and fiction, employing a quasi-fictional style as she examines where women writers failed because of lack of resources and opportunities, examining along the way the experiences of the ": null
    },
    {
        "Brontës": "brontë family"
    },
    {
        ", ": null
    },
    {
        "George Eliot": "george eliot"
    },
    {
        " and ": null
    },
    {
        "George Sand": "george sand"
    },
    {
        ", as well as the fictional character of ": null
    },
    {
        "Shakespeare": "shakespeare"
    },
    {
        "s sister, equipped with the same genius but not position. She contrasted these women who accepted a deferential status, to ": null
    },
    {
        "Jane Austen": "jane austen"
    },
    {
        " who wrote entirely as a woman.       A major influence on Woolf from 42 onward was Russian literature as Woolf adopted many of its aesthetic conventions. The style of ": null
    },
    {
        "Fyodor Dostoyevsky": "fyodor dostoyevsky"
    },
    {
        " with his depiction of a fluid mind in operation helped to influence Woolfs writings about a discontinuous writing process , though Woolf objected to Dostoyevskys obsession with psychological extremity and the tumultuous flux of emotions in his characters together with his right-wing, monarchist politics as Dostoyevsky was an ardent supporter of the autocracy of the ": null
    },
    {
        "Russian Empire": "russian empire"
    },
    {
        ". In contrast to her objections to Dostoyevskys exaggerated emotional pitch , Woolf found much to admire in the work of ": null
    },
    {
        "Anton Chekhov": "anton chekhov"
    },
    {
        " and ": null
    },
    {
        "Leo Tolstoy": "leo tolstoy"
    },
    {
        ". Woolf admired Chekhov for his stories of ordinary people living their lives, doing banal things and plots that had no neat endings. From Tolstoy, Woolf drew lessons about how a novelist should depict a characters psychological state and the interior tension within. From ": null
    },
    {
        "Ivan Turgenev": "ivan turgenev"
    },
    {
        ", Woolf drew the lessons that there are multiple Is when writing a novel, and the novelist needed to balance those multiple versions of him- or herself to balance the mundane facts of a story vs. the writers overreaching vision, which required a total passion for art.     Another influence on Woolf was the American writer ": null
    },
    {
        "Henry David Thoreau": "henry david thoreau"
    },
    {
        ", with Woolf writing in a 42 essay that her aim as a writer was to follow Thoreau by capturing the moment, to burn always with this hard, gem-like flame while praising Thoreau for his statement The millions are awake enough for physical labor, but only one in hundreds of millions is awake enough to a poetic or divine life. To be awake is to be alive . Woolf praised Thoreau for his simplicity in finding a way for settling free the delicate and complicated machinery of the soul . Like Thoreau, Woolf believed that it was silence that set the mind free to really contemplate and understand the world. Both authors believed in a certain transcendental, mystical approach to life and writing, where even banal things could be capable of generating deep emotions if one had enough silence and the presence of mind to appreciate them. Woolf and Thoreau were both concerned with the difficulty of human relationships in the modern age. Other notable influences include ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        ", ": null
    },
    {
        "George Eliot": "george eliot"
    },
    {
        ", ": null
    },
    {
        "Leo Tolstoy": "leo tolstoy"
    },
    {
        ", ": null
    },
    {
        "Marcel Proust": "marcel proust"
    },
    {
        ", ": null
    },
    {
        "Anton Chekhov": "anton chekhov"
    },
    {
        ", ": null
    },
    {
        "Emily Brontë": "emily brontë"
    },
    {
        ", ": null
    },
    {
        "Daniel Defoe": "daniel defoe"
    },
    {
        ", ": null
    },
    {
        "James Joyce": "james joyce"
    },
    {
        ", and ": null
    },
    {
        "E.  M. Forster": "e. & nbsp;m. forster"
    },
    {
        ".                  see , ,         see also ": null
    },
    {
        "The Voyage Out": "the voyage out"
    },
    {
        " &   see also ": null
    },
    {
        "Night and Day": "night and day"
    },
    {
        " &   see also ": null
    },
    {
        "Jacobs Room": "jacobs room"
    },
    {
        " &   see also ": null
    },
    {
        "Mrs Dalloway": "mrs dalloway"
    },
    {
        " &   see also ": null
    },
    {
        "To the Lighthouse": "to the lighthouse"
    },
    {
        " & Complete text, also   see also ": null
    },
    {
        "Orlando: A Biography": "orlando: a biography"
    },
    {
        " &   see also ": null
    },
    {
        "The Waves": "the waves"
    },
    {
        " &   see also ": null
    },
    {
        "The Years": "the years"
    },
    {
        " &   see also ": null
    },
    {
        "Between the Acts": "between the acts"
    },
    {
        " &         see also ": null
    },
    {
        "A Haunted House and Other Short Stories": "a haunted house and other short stories"
    },
    {
        " &   see also ": null
    },
    {
        "The Mark on the Wall": "the mark on the wall"
    },
    {
        " &   see also ": null
    },
    {
        "Kew Gardens": "kew gardens"
    },
    {
        " &         see also ": null
    },
    {
        "Flush: A Biography": "flush: a biography"
    },
    {
        " &         see also ": null
    },
    {
        "Freshwater": "freshwater"
    },
    {
        "         see also ": null
    },
    {
        "Roger Fry: A Biography": "roger fry: a biography"
    },
    {
        " &          see also ": null
    },
    {
        "A Room of Ones Own": "a room of ones own"
    },
    {
        " &   see also ": null
    },
    {
        "Mr. Bennett and Mrs. Brown": "mr. bennett and mrs. brown"
    },
    {
        " &   see also ": null
    },
    {
        "A Letter to a Young Poet": "a letter to a young poet"
    },
    {
        " &   see also ": null
    },
    {
        "Three Guineas": "three guineas"
    },
    {
        " &      ;Collections                    &        ;Contributions                    , in    , in                                                                                         In her lifetime, Woolf was outspoken on many topics that were considered controversial, some of which are now considered progressive, others regressive. She was an ardent ": null
    },
    {
        "feminist": "feminist"
    },
    {
        " at a time when womens rights were barely recognised, and ": null
    },
    {
        "anti-colonialist": "anti-colonialist"
    },
    {
        ", anti-imperialist and a ": null
    },
    {
        "pacifist": "pacifist"
    },
    {
        " when ": null
    },
    {
        "chauvinism": "chauvinism"
    },
    {
        " was popular. On the other hand, she has been criticised for views on class and race in her private writings and published works. Like many of her contemporaries, some of her writing is now considered offensive. As a result, she is considered polarising, a revolutionary feminist and socialist hero or a purveyor of ": null
    },
    {
        "hate speech": "hate speech"
    },
    {
        ".      Works such as A Room of Ones Own  and Three Guineas  are frequently taught as icons of feminist literature in courses that would be very critical of some of her views expressed elsewhere. She has also been the recipient of considerable ": null
    },
    {
        "homophobic": "homophobic"
    },
    {
        " and ": null
    },
    {
        "misogynist": "misogynist"
    },
    {
        " criticism.       Virginia Woolf was born into a non-religious family and is regarded, along with her fellow Bloomsberries ": null
    },
    {
        "E.M. Forster": "e.m. forster"
    },
    {
        " and ": null
    },
    {
        "G.E. Moore": "g.e. moore"
    },
    {
        ", as a ": null
    },
    {
        "humanist": "humanism"
    },
    {
        ". Both her parents were prominent agnostic atheists. Her father, ": null
    },
    {
        "Leslie Stephen": "leslie stephen"
    },
    {
        ", had become famous in polite society for his writings which expressed and publicised reasons to doubt the veracity of religion. Woolfs mother, ": null
    },
    {
        "Julia Stephen": "julia stephen"
    },
    {
        ", wrote the book Agnostic Women , which argued that agnosticism could be a highly moral approach to life.     Woolf was a critic of Christianity. In a letter to ": null
    },
    {
        "Ethel Smyth": "ethel smyth"
    },
    {
        ", she gave a scathing denunciation of the religion, seeing it as self-righteous egotism and stating my Jew has more religion in one toenail—more human love, in one hair.  Woolf stated in her private letters that she thought of herself as an atheist.            ": null
    },
    {
        "Hermione Lee": "hermione lee"
    },
    {
        " cites a number of extracts from Woolfs writings that many, including Lee, would consider offensive, and these criticisms can be traced back as far as those of ": null
    },
    {
        "Wyndham Lewis": "wyndham lewis"
    },
    {
        " and ": null
    },
    {
        "Q.D. Leavis": "q.d. leavis"
    },
    {
        " in the 42s and 42s. Other authors provide more nuanced contextual interpretations, and stress the complexity of her character and the apparent inherent contradictions in analysing her apparent flaws. She could certainly be off-hand, rude and even cruel in her dealings with other authors, translators and biographers, such as her treatment of ": null
    },
    {
        "Ruth Gruber": "ruth gruber"
    },
    {
        ". Some authors, particularly ": null
    },
    {
        "postcolonial": "postcolonial"
    },
    {
        " feminists dismiss her as privileged, ": null
    },
    {
        "elitist": "elitist"
    },
    {
        ", ": null
    },
    {
        "classist": "classist"
    },
    {
        ", racist, and ": null
    },
    {
        "antisemitic": "antisemitic"
    },
    {
        ".     Woolfs ": null
    },
    {
        "tendentious": ":wikt:tendentious"
    },
    {
        " expressions, including prejudicial feelings against ": null
    },
    {
        "disabled": "disabled"
    },
    {
        " people have often been the topic of academic criticism:   The first quotation is from a diary entry of September 42 and runs e fact is the lower classes are detestable. The remainder follow the first in reproducing stereotypes standard to upper-class and upper-middle class life in the early twentieth century: imbeciles should certainly be killed ; Jews are greasy; a crowd is both an ontological mass and is, again, detestable ; Germans are akin to vermin; some baboon faced intellectuals mix with sad green dressed negroes and negresses, looking like chimpanzees at a peace conference; Kensington High St. revolts ones stomach with its innumerable women of incredible mediocrity, drab as dishwater .       Though accused of ": null
    },
    {
        "anti-semitism": "anti-semitism"
    },
    {
        ", the treatment of Judaism and Jews by Woolf is complex and far from straightforward. She was happily married to a ": null
    },
    {
        "Jewish": "jewish"
    },
    {
        " man but often wrote about Jewish characters using stereotypical archetypes and generalisations. For instance, she described some of the Jewish characters in her work in terms that suggested they were physically repulsive or dirty. On the other hand, she could criticise her own views: How I hated marrying a Jew — how I hated their nasal voices and their oriental jewelry, and their noses and their wattles — what a snob I was: for they have immense vitality, and I think I like that quality best of all . These attitudes have been construed to reflect, not so much anti-semitism, but ": null
    },
    {
        "tribalism": "tribalism"
    },
    {
        "; she married outside her social grouping, and Leonard Woolf, too, expressed misgivings about marrying a ": null
    },
    {
        "gentile": "gentile"
    },
    {
        ". Leonard, a penniless Jew from Putney , lacked the material status of the Stephens and their circle.     While travelling on a cruise to Portugal, she protested at finding a great many ": null
    },
    {
        "Portuguese Jews": "portuguese jews"
    },
    {
        " on board, and other repulsive objects, but we keep clear of them . Furthermore, she wrote in her diary: I do not like the Jewish voice; I do not like the Jewish laugh. Her 42 short story,  The Duchess and the Jeweller   has been considered anti-semitic.     Yet Woolf and her husband Leonard came to despise and fear the 42s fascism and antisemitism. Her 42 book  Three Guineas  was an indictment of fascism and what Woolf described as a recurring propensity among patriarchal societies to enforce repressive societal mores by violence.       Though at least one biography of Virginia Woolf appeared in her lifetime, the first authoritative study of her life was published in 42 by her nephew Quentin Bell. ": null
    },
    {
        "Hermione Lee": "hermione lee"
    },
    {
        "s 42 biography Virginia Woolf provides a thorough and authoritative examination of Woolfs life and work, which she discussed in an interview in 42 In 42 ": null
    },
    {
        "Louise DeSalvo": "louise desalvo"
    },
    {
        " and Mitchell A. Leaska edited The Letters of Vita Sackville-West and Virginia Woolf. Julia Briggss Virginia Woolf: An Inner Life focuses on Woolfs writing, including her novels and her commentary on the creative process, to illuminate her life. The sociologist Pierre Bourdieu also uses Woolfs literature to understand and analyse gender domination.       The intense scrutiny of Virginia Woolfs literary output  has inevitably led to speculation as to her mothers influence, including ": null
    },
    {
        "psychoanalytic": "psychoanalytic"
    },
    {
        " studies of mother and daughter.  Woolf states that, my first memory, and in fact it is the most important of all my memories  is of her mother. Her memories of her mother are memories of an obsession,  starting with her first major breakdown on her mothers death in 42 the loss having a profound lifelong effect. In many ways, her mothers profound influence on Virginia Woolf is conveyed in the latters recollections, there she is; beautiful, emphatic ... closer than any of the living are, lighting our random lives as with a burning torch, infinitely noble and delightful to her children .     Woolf described her mother as an invisible presence in her life, and Ellen Rosenman argues that the mother-daughter relationship is a constant in Woolfs writing. She describes how Woolfs ": null
    },
    {
        "modernism": "modernism"
    },
    {
        " needs to be viewed in relationship to her ": null
    },
    {
        "ambivalence": "ambivalence"
    },
    {
        " towards her Victorian mother, the centre of the formers female identity, and her voyage to her own sense of ": null
    },
    {
        "autonomy": "autonomy"
    },
    {
        ". To Woolf, Saint Julia was both a ": null
    },
    {
        "martyr": "martyr"
    },
    {
        " whose perfectionism was intimidating and a source of deprivation, by her absences real and virtual and premature death. Julias influence and memory pervades Woolfs life and work, she has haunted me , she wrote.       Recently, studies of Virginia Woolf have focused on feminist and lesbian themes in her work, such as in the 42 collection of critical essays, Virginia Woolf: Lesbian Readings, edited by Eileen Barrett and Patricia Cramer. In 42 Virginia Woolf took a grassroots approach to informing and inspiring feminism. She addressed undergraduate women at the ODTAA Society at Girton College, Cambridge and the Arts Society at Newnham College with two papers that eventually became  A Room of Ones Own  . Woolfs best-known nonfiction works,  A Room of Ones Own   and  Three Guineas  , examine the difficulties that female writers and intellectuals faced because men held disproportionate legal and ": null
    },
    {
        "economic power": "economic power"
    },
    {
        ", as well as the future of women in education and society, as the societal effects of industrialization and birth control had not yet fully been realized. In  The Second Sex  , ": null
    },
    {
        "Simone de Beauvoir": "simone de beauvoir"
    },
    {
        " counts, of all women who ever lived, only three female writers—": null
    },
    {
        "Emily Brontë": "emily brontë"
    },
    {
        ", Woolf and sometimes ": null
    },
    {
        "Katherine Mansfield": "katherine mansfield"
    },
    {
        "— have explored the given.         Whos Afraid of Virginia Woolf?  is a 42 play by ": null
    },
    {
        "Edward Albee": "edward albee"
    },
    {
        ". It examines the structure of the marriage of an American middle-aged academic couple, Martha and George. ": null
    },
    {
        "Mike Nichols": "mike nichols"
    },
    {
        " directed a ": null
    },
    {
        "film version": "whos afraid of virginia woolf?"
    },
    {
        " in 42 starring ": null
    },
    {
        "Elizabeth Taylor": "elizabeth taylor"
    },
    {
        " and ": null
    },
    {
        "Richard Burton": "richard burton"
    },
    {
        ". Taylor won the 42 ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        " for Best Actress for the role.    Me! Im Afraid of Virginia Woolf , a 42 TV play, references the title of the Edward Albee play and features an English literature teacher who has a poster of her. It was written by ": null
    },
    {
        "Alan Bennett": "alan bennett"
    },
    {
        " and directed by ": null
    },
    {
        "Stephen Frears": "stephen frears"
    },
    {
        ".   The artwork  The Dinner Party  features a place setting for Woolf.  Poetic Justice , by British musician Steve Harley, contains a tribute to Woolf, specifically her most adventurous novel, in its closing track: Riding the Waves . ": null
    },
    {
        "Pulitzer Prize": "pulitzer prize"
    },
    {
        "-winning novel  The Hours  focused on three generations of women affected by Woolfs novel  Mrs Dalloway . In 42 a ": null
    },
    {
        "film version": "the hours"
    },
    {
        " of the novel was released starring ": null
    },
    {
        "Nicole Kidman": "nicole kidman"
    },
    {
        " as Woolf. Kidman won the 42 ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        " for her portrayal.   Susan Sellers novel Vanessa and Virginia explores the close sibling relationship between Woolf and her sister, Vanessa Bell. It was adapted for the stage by Elizabeth Wright in 42 and first performed by Moving Stories Theatre Company.   Priya Parmars 42 novel Vanessa and Her Sister also examined the Stephen sisters relationship during the early years of their association with what became known as the Bloomsbury Group. ": null
    },
    {
        "National Portrait Gallery": "national portrait gallery, london"
    },
    {
        " from July to October 42 The House at the End of Hope Street,  Woolf is featured as one of the women who has lived in the titular house.   Virginia is portrayed by both ": null
    },
    {
        "Lydia Leonard": "lydia leonard"
    },
    {
        " and ": null
    },
    {
        "Catherine McCormack": "catherine mccormack"
    },
    {
        " in the BBCs three-part drama series  Life in Squares  . ": null
    },
    {
        "doodle": "google doodle"
    },
    {
        " celebrating her 42th birthday. ": null
    },
    {
        "Barnes & Noble": "barnes  &  noble"
    },
    {
        " stores, Woolf is featured in Gary Kellys Author Mural Panels, an imprint of the Barnes & Noble Author brand  that also features other notable authors like ": null
    },
    {
        "Hurston": "zora neale hurston"
    },
    {
        ", ": null
    },
    {
        "Tagore": "rabindranath tagore"
    },
    {
        ", and ": null
    },
    {
        "Kafka": "franz kafka"
    },
    {
        ".       A number of Virginia Woolfs works have been adapted for the screen, and her play Freshwater  is the basis for a 42 ": null
    },
    {
        "chamber opera": "chamber opera"
    },
    {
        ",  Freshwater , by ": null
    },
    {
        "Andy Vores": "andy vores"
    },
    {
        ". The final segment of the 42 ": null
    },
    {
        "Anthology film": "anthology film"
    },
    {
        "  London Unplugged  is adapted from her short story  Kew Gardens . Septimus and Clarissa, a stage adaptation of Mrs. Dalloway was created and produced by the New York-based ensemble Ripe Time in 42 at the Baruch Performing Arts Center. It was adapted by Ellen McLaughlin and directed and devised by Rachel Dickstein. It was nominated for a 42 Drama League award for Outstanding Production, a Drama Desk nomination for Outstanding Score and a Joe A. Calloway Award nomination for outstanding direction     Legacy    Virginia Woolf is known for her contributions to twentieth-century literature and her essays, as well as the influence she has had on literary, particularly feminist criticism. A number of authors have stated that their work was influenced by Virginia Woolf, including ": null
    },
    {
        "Margaret Atwood": "margaret atwood"
    },
    {
        ", ": null
    },
    {
        "Michael Cunningham": "michael cunningham"
    },
    {
        ", ": null
    },
    {
        "Gabriel García Márquez": "gabriel garcía márquez"
    },
    {
        ", and ": null
    },
    {
        "Toni Morrison": "toni morrison"
    },
    {
        ". Her ": null
    },
    {
        "iconic": "iconic"
    },
    {
        " image is instantly recognisable from the Beresford portrait of her at twenty to the Beck and Macgregor portrait in her mothers dress in  Vogue  at forty-four  or ": null
    },
    {
        "Man Ray": "man ray"
    },
    {
        "s cover of  Time  magazine  at 42 More postcards of Woolf are sold by the ": null
    },
    {
        "National Portrait Gallery": "national portrait gallery, london"
    },
    {
        ", London than any other person. Her image is ubiquitous, and can be found on tea towels to T-shirts.     Virginia Woolf is studied around the world, with organisations such as the Virginia Woolf Society, and The Virginia Woolf Society of Japan. In addition trusts such as the Asham Trust have been set up to encourage writers, in her honour. Although she had no descendants, a number of her extended family are notable.       In 42 Woolf was honoured by her alma mater of Kings College London with the opening of the Virginia Woolf Building on ": null
    },
    {
        "Kingsway": "kingsway, london"
    },
    {
        ", with a plaque commemorating her time there and her contributions , together with ": null
    },
    {
        "this exhibit": ":file:auto-icon of virginia woolf at kings college london.jpg"
    },
    {
        " depicting her accompanied by a quotation London itself perpetually attracts, stimulates, gives me a play & a story & a poem from her 42 diary. ": null
    },
    {
        "Bust": "bust"
    },
    {
        "s of Virginia Woolf have been erected at her home in ": null
    },
    {
        "Rodmell": "rodmell"
    },
    {
        ", Sussex and at Tavistock Square, London where she lived between 42 and 42     In 42 Woolf was one of the inaugural honorees in the ": null
    },
    {
        "Rainbow Honor Walk": "rainbow honor walk"
    },
    {
        ", a ": null
    },
    {
        "walk of fame": "list of halls and walks of fame"
    },
    {
        " in San Francisco’s ": null
    },
    {
        "Castro neighborhood": "castro district, san francisco"
    },
    {
        " noting ": null
    },
    {
        "LGBTQ": "lgbtq"
    },
    {
        " people who have made significant contributions in their fields.           see , , ,                                                                                                ": null
    }
]