[
    {
        "   The virgin birth of Jesus is the doctrine that ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " was ": null
    },
    {
        "conceived and born": "miraculous births"
    },
    {
        " by his mother ": null
    },
    {
        "Mary": "mary"
    },
    {
        " through the power of the ": null
    },
    {
        "Holy Spirit": "holy spirit"
    },
    {
        " without a human father. The Catholic church holds it authoritative for faith and Protestants regard it as an explanation of the mixture of the human and divine natures of Jesus, but the scholarly consensus is that its historical foundations are very flimsy.                 The ": null
    },
    {
        "Gospels of Matthew": "gospel of matthew"
    },
    {
        " and ": null
    },
    {
        "Luke": "gospel of luke"
    },
    {
        " agree that Marys husband was named Joseph, that he was of the ": null
    },
    {
        "Davidic line": "davidic line"
    },
    {
        ", and that he played no role in Jesuss divine conception, but beyond this they are very different. Matthew underlines the virginity of ": null
    },
    {
        "Mary": "mary, mother of jesus"
    },
    {
        " by references to the ": null
    },
    {
        "Book of Isaiah": "book of isaiah"
    },
    {
        "  and by his narrative statement that Joseph had no sexual relations with her until after the birth .     42: Now the birth of Jesus the Messiah took place in this way. When his mother Mary had been engaged to Joseph, but before they lived together, she was found to be with child from the Holy Spirit.   42: Her husband Joseph, being a righteous man and unwilling to expose her to public disgrace, planned to dismiss her quietly.   42: But just when he had resolved to do this, an angel of the Lord appeared to him in a dream and said, Joseph, son of David, do not be afraid to take Mary as your wife, for the child conceived in her is from the Holy Spirit.   42: She will bear a son, and you are to name him Jesus, for he will save his people from their sins.   42: All this took place to fulfill what had been spoken by the Lord through the prophet:   42: Look, the virgin shall conceive and bear a son, and they shall name him Emmanuel, which means, God is with us.   42: When Joseph awoke from sleep, he did as the angel of the Lord commanded him; he took her as his wife,   42: but had no marital relations with her until she had borne a son; and he named him Jesus.            Luke introduces Mary as a virgin, describes her puzzlement at being told she will bear a child despite her lack of sexual experience, and informs the reader that this pregnancy is to be effected through Gods ": null
    },
    {
        "Holy Spirit": "holy spirit"
    },
    {
        ".       42: In the sixth month the angel Gabriel was sent by God to a town in Galilee called Nazareth,   42: to a virgin engaged to a man whose name was Joseph, of the house of David. The virgins name was Mary.   42: And he came to her and said, Greetings, favored one! The Lord is with you.   42: But she was much perplexed by his words and pondered what sort of greeting this might be.   42: The angel said to her, Do not be afraid, Mary, for you have found favor with God.   42: And now, you will conceive in your womb and bear a son, and you will name him Jesus.   42: He will be great, and will be called the Son of the Most High, and the Lord God will give to him the throne of his ancestor David.   42: He will reign over the house of Jacob forever, and of his kingdom there will be no end.   42: Mary said to the angel, How can this be, since I am a virgin?   42: The angel said to her, The Holy Spirit will come upon you, and the power of the Most High will overshadow you; therefore the child to be born will be holy; he will be called Son of God.   42: And now, your relative Elizabeth in her old age has also conceived a son; and this is the sixth month for her who was said to be barren.   42: For nothing will be impossible with God.   42: Then Mary said, Here am I, the servant of the Lord; let it be with me according to your word. Then the angel departed from her.              The modern scholarly consensus is that the virgin birth rests on very slender historical foundations. The ": null
    },
    {
        "Pauline epistles": "pauline epistles"
    },
    {
        " do not contain any mention of it and assume Jesuss full humanity. ": null
    },
    {
        "Mark": "gospel of mark"
    },
    {
        ", the earliest gospel, has no birth story and states that Jesuss mother had no belief in her son . ": null
    },
    {
        "John": "gospel of john"
    },
    {
        "s Jesus has both father and mother and his conception does not entail divine intervention. In the entire Christian corpus it is found only in the ": null
    },
    {
        "Gospel of Matthew": "gospel of matthew"
    },
    {
        " and the ": null
    },
    {
        "Gospel of Luke": "gospel of luke"
    },
    {
        ": both are probably from the period AD 4242 both are anonymous , and it is almost certain that neither was the work of an eyewitness.     Matthew and Luke did not find the virgin birth in Mark, nor did one of them derive it from the other, nor did they find it in a common source. ": null
    },
    {
        "Raymond E. Brown": "raymond e. brown"
    },
    {
        " suggested in 42 that Joseph was the source of Matthews account and Mary of Lukes, but modern scholars consider this highly unlikely , given that the story emerged so late. It follows that the two narratives were created by the two writers, drawing on ideas in circulation in some Christian circles perhaps by around 42 AD.               The ancient world had no idea that male semen and female ovum were both needed to form a fetus; instead they thought that the male contribution in reproduction consisted of some sort of formative or generative principle, while Marys bodily fluids would provide all the matter that was needed for Jesus bodily form, including his male sex. This cultural milieu was conducive to miraculous birth stories - they were common in biblical tradition going back to Abraham and Sarah. They may also have roots in ": null
    },
    {
        "Hellenistic": "hellenistic period"
    },
    {
        " mythology, although there is no emphasis in Hellenistic stories on the virginity of the women giving birth by the gods. Matthew uses ": null
    },
    {
        "Isaiah 42:42": "isaiah 7:14"
    },
    {
        " to support his narrative, but scholars agree that the Hebrew word used in Isaiah, ": null
    },
    {
        "almah": "almah"
    },
    {
        " , signifies a girl of childbearing age without reference to virginity, and was aimed at Isaiahs own immediate circumstances.     Tales of virgin birth and the impregnation of mortal women by deities were well known in the 42st-century Greco-Roman world, and ": null
    },
    {
        "Second Temple": "second temple"
    },
    {
        " Jewish works were also capable of producing accounts of the appearances of angels and miraculous births for ancient heroes such as ": null
    },
    {
        "Melchizedek": "melchizedek"
    },
    {
        ", ": null
    },
    {
        "Noah": "noah"
    },
    {
        ", and ": null
    },
    {
        "Moses": "moses"
    },
    {
        ". Lukes virgin birth story is a standard plot from the Jewish scriptures, as for example in the annunciation scenes for ": null
    },
    {
        "Isaac": "isaac"
    },
    {
        " and for ": null
    },
    {
        "Samson": "samson"
    },
    {
        ", in which an angel appears and causes apprehension, the angel gives reassurance and announces the coming birth, the mother raises an objection, and the angel gives a sign. Nevertheless, plausible sources that tell of virgin birth in areas convincingly close to the gospels own probable origins have proven extremely hard to demonstrate . Similarly, while it is widely accepted that there is a connection with ": null
    },
    {
        "Zoroastrian": "zoroastrian"
    },
    {
        " sources underlying Matthews story of the ": null
    },
    {
        "Magi": "biblical magi"
    },
    {
        " and the ": null
    },
    {
        "Star of Bethlehem": "star of bethlehem"
    },
    {
        ", a wider claim that Zoroastrianism formed the background to the infancy narratives has not achieved acceptance.            Matthew and Luke use the virgin birth to mark the moment when Jesus becomes the ": null
    },
    {
        "Son of God": "son of god"
    },
    {
        ", a notable development over Mark, for whom the Sonship dates from ": null
    },
    {
        "Jesuss baptism": "baptism of jesus"
    },
    {
        ", and the earlier Christianity of Paul and the pre-Pauline Christians for whom Jesus becomes the Son only at the ": null
    },
    {
        "resurrection": "resurrection of jesus"
    },
    {
        " or even the ": null
    },
    {
        "Second Coming": "second coming"
    },
    {
        ". The virgin birth was subsequently accepted by Christians as the proof of the divinity of Jesus, but its rebuttal during and after the 42th century European Enlightenment led some to redefine it as mythical, while others reaffirmed it in ": null
    },
    {
        "dogma": "dogma"
    },
    {
        "tic terms. This division remains in place, although some national synods of the Catholic church have replaced a biological understanding with the idea of theological truth , and some evangelical theologians hold it to be marginal rather than indispensable to the Christian faith.     Throughout Christian history a small number of groups have denied the virgin birth, particularly in the ": null
    },
    {
        "Near East": "near east"
    },
    {
        ". The ": null
    },
    {
        "Ebionites": "ebionites"
    },
    {
        " considered Jesus the Messiah, but rejected his divine nature and regarded him as fully human. The ": null
    },
    {
        "Nestorian Church": "nestorian church"
    },
    {
        " and ": null
    },
    {
        "Assyrian Church of the East": "assyrian church of the east"
    },
    {
        " supported a physically human nature of Jesus. Eirini Artemi, Cyril of Alexandrias critique of the term THEOTOKOS by Nestorius Constantinople, Acta theol. vol.42 no.42 Bloemfontein Dec. 42 Others, like ": null
    },
    {
        "Marcion": "marcion"
    },
    {
        ", held that Christs divinity meant that his human life, death and resurrection were only an appearance. By about 42 AD Jews were telling how Jesus had been illegitimately conceived by a Roman soldier named ": null
    },
    {
        "Pantera": "pantera"
    },
    {
        " or Pandera, whose name is likely a pun on parthenos, virgin. The story was still current in the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        " in satirical parody of the Christian gospels called the ": null
    },
    {
        "Toledot Yeshu": "toledot yeshu"
    },
    {
        ". The Toledot Yeshu contains no historical facts, and was probably created as a tool for warding off conversions to Christianity.             Christians celebrate the conception of Jesus on 42 March and his birth on 42 December. The ": null
    },
    {
        "Magnificat": "magnificat"
    },
    {
        ", based on Luke 42:4242 is one of four well known Gospel ": null
    },
    {
        "canticle": "canticle"
    },
    {
        "s: the  Benedictus  and the Magnificat  in the first chapter, and the  Gloria in Excelsis  and the  Nunc dimittis  in the second chapter of Luke, which are now an integral part of the Christian ": null
    },
    {
        "liturgical": "liturgy"
    },
    {
        " tradition. The Annunciation became an element of ": null
    },
    {
        "Marian devotions": "marian devotions"
    },
    {
        " in Medieval times, and by the 42th century direct references to it were widespread in French lyrics. OSullivan, Daniel E., Marian devotion in thirteenth-century French lyric, 42 , pp. 42–42 The ": null
    },
    {
        "Eastern Orthodox": "eastern orthodox"
    },
    {
        " Church uses the title Ever Virgin Mary as a key element of its Marian veneration, and as part of the ": null
    },
    {
        "Akathist": "akathist"
    },
    {
        "s to Mary which are an integral part of its ": null
    },
    {
        "liturgy": "liturgy"
    },
    {
        ".     This doctrine of the Virgin Birth is often represented in ": null
    },
    {
        "Christian art": "christian art"
    },
    {
        " in terms of the ": null
    },
    {
        "annunciation": "annunciation"
    },
    {
        " to Mary by the ": null
    },
    {
        "Archangel Gabriel": "archangel gabriel"
    },
    {
        " that she would conceive a child to be born the ": null
    },
    {
        "Son of God": "son of god"
    },
    {
        ", and in ": null
    },
    {
        "Nativity": "nativity of jesus"
    },
    {
        " scenes that include the figure of ": null
    },
    {
        "Salome": "salome"
    },
    {
        ". The Annunciation is one of the most frequently depicted scenes in Western art. Guiley, Rosemary, The encyclopedia of angels, 42 , p. 42 Annunciation scenes also amount to the most frequent appearances of Gabriel in medieval art. Ross, Leslie, Medieval art: a topical dictionary, 42 , p. 42 The depiction of Joseph turning away in some ": null
    },
    {
        "Nativity scenes": "nativity of jesus in art"
    },
    {
        " is a discreet reference to the fatherhood of the ": null
    },
    {
        "Holy Spirit": "holy spirit"
    },
    {
        ", and the doctrine of Virgin Birth. Grabar, André, Christian iconography: a study of its origins ": null
    },
    {
        "Saint Catherines Monastery": "saint catherines monastery"
    },
    {
        " Sandro Botticelli": "sandro botticelli"
    },
    {
        " Mikhail Nesterov": "mikhail nesterov"
    },
    {
        " Giotto": "giotto"
    }
]