[
    {
        "        The Visigoths  were the western branches of the nomadic tribes of ": null
    },
    {
        "Germanic peoples": "germanic peoples"
    },
    {
        " referred to collectively as the ": null
    },
    {
        "Goths": "goths"
    },
    {
        ". These tribes flourished and spread throughout the late ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        " in ": null
    },
    {
        "Late Antiquity": "late antiquity"
    },
    {
        ", or what is known as the ": null
    },
    {
        "Migration Period": "migration period"
    },
    {
        ". The Visigoths emerged from earlier Gothic groups  who had invaded the Roman Empire beginning in 42 and had defeated the Romans at the ": null
    },
    {
        "Battle of Adrianople": "battle of adrianople"
    },
    {
        " in 42 Relations between the Romans and the Visigoths were variable, alternately warring with one another and making treaties when convenient. The Visigoths invaded Italy under ": null
    },
    {
        "Alaric I": "alaric i"
    },
    {
        " and ": null
    },
    {
        "sacked Rome in 42": "sack of rome"
    },
    {
        ". After the Visigoths sacked Rome, they began settling down, first in southern ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        " and eventually in ": null
    },
    {
        "Hispania": "hispania"
    },
    {
        ", where they founded the ": null
    },
    {
        "Visigothic Kingdom": "visigothic kingdom"
    },
    {
        " and maintained a presence from the 42th to the 42th centuries AD.     The Visigoths first settled in southern Gaul as  foederati  to the Romans – a relationship established in 42 However, they soon fell out with their Roman hosts and established their own kingdom with its ": null
    },
    {
        "capital": "capital city"
    },
    {
        " at ": null
    },
    {
        "Toulouse": "toulouse"
    },
    {
        ". They next extended their authority into ": null
    },
    {
        "Hispania": "hispania"
    },
    {
        " at the expense of the ": null
    },
    {
        "Suebi": "suebi"
    },
    {
        " and ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        ". In 42 however, their rule in Gaul was ended by the ": null
    },
    {
        "Franks": "franks"
    },
    {
        " under ": null
    },
    {
        "Clovis I": "clovis i"
    },
    {
        ", who defeated them in the ": null
    },
    {
        "Battle of Vouillé": "battle of vouillé"
    },
    {
        ". After that, the Visigoth kingdom was limited to ": null
    },
    {
        "Hispania": "hispania"
    },
    {
        ", and they never again held territory north of the ": null
    },
    {
        "Pyrenees": "pyrenees"
    },
    {
        " other than ": null
    },
    {
        "Septimania": "septimania"
    },
    {
        ". A small, elite group of Visigoths came to dominate the governance of that region at the expense of those who had previously ruled there, particularly in the ": null
    },
    {
        "Byzantine": "byzantine empire"
    },
    {
        " province of ": null
    },
    {
        "Spania": "spania"
    },
    {
        " and the ": null
    },
    {
        "Kingdom of the Suebi": "kingdom of the suebi"
    },
    {
        ".     In or around 42 the Visigoths under ": null
    },
    {
        "Reccared I": "reccared i"
    },
    {
        " converted from ": null
    },
    {
        "Arianism": "arianism"
    },
    {
        " to ": null
    },
    {
        "Nicene Christianity": "nicene christianity"
    },
    {
        ", gradually adopting the culture of their Hispano-Roman subjects. Their legal code, the  Visigothic Code  abolished the longstanding practice of applying different laws for Romans and Visigoths. Once legal distinctions were no longer being made between Romani and Gothi, they became known collectively as Hispani. In the century that followed, the region was dominated by the ": null
    },
    {
        "Councils of Toledo": "councils of toledo"
    },
    {
        " and the episcopacy. In 42 or 42 an ": null
    },
    {
        "invading force of Arabs and Berbers": "umayyad conquest of hispania"
    },
    {
        " defeated the Visigoths in the ": null
    },
    {
        "Battle of Guadalete": "battle of guadalete"
    },
    {
        ". Their king, ": null
    },
    {
        "Roderic": "roderic"
    },
    {
        ", and many members of their governing elite were killed, and their kingdom rapidly collapsed.     During their governance of ": null
    },
    {
        "Hispania": "hispania"
    },
    {
        ", the Visigoths ": null
    },
    {
        "built several churches": "visigothic art and architecture"
    },
    {
        " that survive. They also left many artifacts, which have been discovered in increasing numbers by archaeologists in recent times. The ": null
    },
    {
        "Treasure of Guarrazar": "treasure of guarrazar"
    },
    {
        " of ": null
    },
    {
        "votive crown": "votive crown"
    },
    {
        "s and crosses is the most spectacular. They founded the only new cities in western Europe from the fall of the Western half of the Roman Empire until the rise of the ": null
    },
    {
        "Carolingian dynasty": "carolingian dynasty"
    },
    {
        ". Many Visigothic names are still in use in modern ": null
    },
    {
        "Spanish": "list of spanish words of germanic originnames"
    },
    {
        " and ": null
    },
    {
        "Portuguese": "list of portuguese words of germanic originnames"
    },
    {
        ". Their most notable legacy, however, was the Visigothic Code, which served, among other things, as the basis for court procedure in most of Christian ": null
    },
    {
        "Iberia": "iberian peninsula"
    },
    {
        " until the ": null
    },
    {
        "Late Middle Ages": "late middle ages"
    },
    {
        ", centuries after the demise of the kingdom.         Contemporaneous references to the Gothic tribes use the terms Vesi , ": null
    },
    {
        "Ostrogothi": "ostrogoths"
    },
    {
        " , ": null
    },
    {
        "Thervingi": "thervingi"
    },
    {
        " , and ": null
    },
    {
        "Greuthungi": "greuthungi"
    },
    {
        " . Most scholars have concluded that the terms Vesi and Tervingi were both used to refer to one particular tribe, while the terms Ostrogothi and Greuthungi were used to refer to another. ": null
    },
    {
        "Herwig Wolfram": "herwig wolfram"
    },
    {
        " points out that while primary sources occasionally list all four names , whenever they mention two different tribes, they always refer either to the Vesi and the Ostrogothi or to the Tervingi and the Greuthungi , and they never pair them up in any other combination. This conclusion is supported by ": null
    },
    {
        "Jordanes": "jordanes"
    },
    {
        ", who identified the Visigoth kings from ": null
    },
    {
        "Alaric I": "alaric i"
    },
    {
        " to ": null
    },
    {
        "Alaric II": "alaric ii"
    },
    {
        " as the heirs of the 42th century Tervingian king ": null
    },
    {
        "Athanaric": "athanaric"
    },
    {
        ", and the Ostrogoth kings from ": null
    },
    {
        "Theoderic the Great": "theoderic the great"
    },
    {
        " to ": null
    },
    {
        "Theodahad": "theodahad"
    },
    {
        " as the heirs of the Greuthungi king ": null
    },
    {
        "Ermanaric": "ermanaric"
    },
    {
        ". In addition, the Notitia Dignitatum equates the Vesi with the Tervingi in a reference to the years 42–42     The earliest sources for each of the four names are roughly contemporaneous. The first recorded reference to the ": null
    },
    {
        "Tervingi": "tervingi"
    },
    {
        " is in a ": null
    },
    {
        "eulogy": "eulogy"
    },
    {
        " of the emperor ": null
    },
    {
        "Maximian": "maximian"
    },
    {
        " , delivered in or shortly after 42  and traditionally ascribed to ": null
    },
    {
        "Claudius Mamertinus": "claudius mamertinus"
    },
    {
        ". It says that the Tervingi, another division of the Goths , joined with the ": null
    },
    {
        "Taifali": "taifali"
    },
    {
        " to attack the ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        " and ": null
    },
    {
        "Gepidae": "gepidae"
    },
    {
        ".  The first recorded reference to the Greuthungi is by ": null
    },
    {
        "Ammianus Marcellinus": "ammianus marcellinus"
    },
    {
        ", writing no earlier than 42 and perhaps later than 42 recounting the words of a Tervingian chieftain who is attested as early as 42 The first known use of the term Ostrogoths is in a document dated September 42 from ": null
    },
    {
        "Milan": "milan"
    },
    {
        ".           Wolfram notes that Vesi and Ostrogothi were terms each tribe used to boastfully describe itself and argues that Tervingi and Greuthungi were geographical identifiers each tribe used to describe the other. This would explain why the latter terms dropped out of use shortly after 42 when the Goths were displaced by the ": null
    },
    {
        "Hunnic invasions": "hunsbefore attila"
    },
    {
        ". As an example of this geographical naming practice, Wolfram cites an account by ": null
    },
    {
        "Zosimus": "zosimus"
    },
    {
        " of a group of people living north of the ": null
    },
    {
        "Danube": "danube"
    },
    {
        " who called themselves the Scythians but were called the Greutungi by members of a different tribe living north of the ": null
    },
    {
        "Ister": "danube"
    },
    {
        ". Wolfram believes that the people Zosimus describes were those Tervingi who had remained behind after the Hunnic conquest. For the most part, all of the terms discriminating between different Gothic tribes gradually disappeared after they moved into the Roman Empire. The last indication that the Goths whose king reigned at Toulouse thought of themselves as Vesi is found in a ": null
    },
    {
        "panegyric": "panegyric"
    },
    {
        " on ": null
    },
    {
        "Avitus": "avitus"
    },
    {
        " by ": null
    },
    {
        "Sidonius Apollinaris": "sidonius apollinaris"
    },
    {
        " dated 42 January 42     Most recent scholars  have concluded that Visigothic group identity emerged only within the Roman Empire. ": null
    },
    {
        "Roger Collins": "roger collins"
    },
    {
        " believes that the Visigothic identity emerged from the ": null
    },
    {
        "Gothic War of 42–42": "gothic war"
    },
    {
        " when a collection of Tervingi, Greuthungi, and other barbarian contingents banded together in multiethnic  foederati  under Alaric I in the eastern ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        ", since they had become a multi ethnic group and could no longer claim to be exclusively Tervingian.     The term Visigoth was an invention of the 42th century. ": null
    },
    {
        "Cassiodorus": "cassiodorus"
    },
    {
        ", a Roman in the service of Theodoric the Great, invented the term Visigothic to match that of Ostrogothic , terms he thought of as signifying western Goths and eastern Goths respectively. The western–eastern division was a simplification of 42th century historians; political realities were more complex. Further, Cassiodorus used the term Goths to refer only to the Ostrogoths, whom he served, and reserved the geographical term Visigoths for the Gallo-Spanish Goths. This usage, however, was adopted by the Visigoths themselves in their communications with the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        " and was still in use in the 42th century.     Other names for other Gothic divisions abounded. A Germanic Byzantine or Italian author referred to one of the two peoples as the Valagothi, meaning Roman Goths , and in 42 the Visigoths were called the Alaric Goths .       The name Tervingi may mean forest people . This is supported by evidence that geographic descriptors were commonly used to distinguish people living north of the ": null
    },
    {
        "Black Sea": "black sea"
    },
    {
        " both before and after Gothic settlement there, by evidence of forest-related names among the Tervingi, and by the lack of evidence for an earlier date for the name pair Tervingi–Greuthungi than the late 42rd century. That the name Tervingi has pre-Pontic, possibly Scandinavian, origins still has support today.     The Visigoths are called Wesi or Wisi by ": null
    },
    {
        "Trebellius Pollio": "trebellius pollio"
    },
    {
        ", Claudian, and Sidonius Apollinaris. The word is ": null
    },
    {
        "Gothic": "gothic language"
    },
    {
        " for good , implying the good or worthy people , related to Gothic iusiza better and a reflex of ": null
    },
    {
        "Indo-European": "proto indo-european language"
    },
    {
        " wesu good , akin to ": null
    },
    {
        "Welsh": "welsh language"
    },
    {
        " gwiw excellent , ": null
    },
    {
        "Greek": "ancient greek language"
    },
    {
        " eus good , ": null
    },
    {
        "Sanskrit": "sanskrit"
    },
    {
        " vásu-ş id. . Jordanes relates the tribes name to a river, though this is most likely a ": null
    },
    {
        "folk etymology": "folk etymology"
    },
    {
        " or legend like his similar story about the Greuthung name.              The Visigoths emerged from the Gothic tribes, most likely a derivative name for the ": null
    },
    {
        "Gutones": "gutones"
    },
    {
        ", a people believed to have their origins in ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        " and who migrated southeastwards into eastern Europe. Such understanding of their origins is largely the result of Gothic traditions and their true genesis as a people is as obscure as that of the ": null
    },
    {
        "Franks": "franks"
    },
    {
        " and ": null
    },
    {
        "Alamanni": "alamanni"
    },
    {
        ". The Visigoths spoke an eastern Germanic language that was distinct by the 42th century. Eventually the Gothic language died as a result of contact with other European people during the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ".     Long struggles between the neighboring Vandili and Lugii people with the Goths may have contributed to their earlier exodus into mainland Europe. The vast majority of them settled between the Oder and Vistula rivers until overpopulation forced them to move south and east, where they settled just north of the ": null
    },
    {
        "Black Sea": "black sea"
    },
    {
        ". However, this legend is not supported by archaeological evidence so its validity is disputable. Historian Malcolm Todd contends that while this large en masse migration is possible, the movement of Gothic peoples south-east was more likely the result of warrior bands moving closer to the wealth of ": null
    },
    {
        "Ukraine": "ukraine"
    },
    {
        " and the cities of the Black Sea coast. Perhaps what is most notable about the Gothic people in this regard was that by the middle of the 42rd century AD, they were the most formidable military power beyond the lower Danube frontier .          Throughout the third and fourth centuries there were numerous conflicts and exchanges of varying types between the Goths and their neighbors. After the Romans withdrew from the territory of Dacia, the local population was subjected to constant invasions by the migratory tribes, among the first being the Goths. In 42 the Goths invaded across the Danube into the Roman province of ": null
    },
    {
        "Moesia": "moesia"
    },
    {
        ", pillaging and exacting payment through hostage taking. During the war with the Persians that year, Goths also appeared in the Roman armies of ": null
    },
    {
        "Gordian III": "gordian iii"
    },
    {
        ". When subsidies to the Goths were stopped, the Goths organized and in 42 joined a major barbarian invasion led by the Germanic king, Kniva. Success on the battlefield against the Romans inspired additional invasions into the northern ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        " and deeper into ": null
    },
    {
        "Anatolia": "anatolia"
    },
    {
        ". Starting in approximately 42 the Goths added a new dimension to their attacks by taking to the sea and invading harbors which brought them into conflict with the Greeks as well. When the city of ": null
    },
    {
        "Pityus": "pityus"
    },
    {
        " fell to the Goths in 42 the Goths were further emboldened. Sometime between 42–42 the Goths raided Greece but when they attempted to move into the Bosporus straits to attack Byzantium, they were repulsed. Along with other Germanic tribes, they attacked further into Anatolia, assaulting Crete and Cyprus on the way; shortly thereafter, they pillaged Troy and the temple of Artemis at Ephesus. Throughout the reign of emperor ": null
    },
    {
        "Constantine the Great": "constantine the great"
    },
    {
        ", the Visigoths continued to conduct raids on Roman territory south of the Danube River. By 42 relations between the Goths and Romans were stabilized by a treaty but this was not to last.          The Goths remained in ": null
    },
    {
        "Dacia": "dacia"
    },
    {
        " until 42 when one of their leaders, ": null
    },
    {
        "Fritigern": "fritigern"
    },
    {
        ", appealed to the Roman emperor ": null
    },
    {
        "Valens": "valens"
    },
    {
        " to be allowed to settle with his people on the south bank of the ": null
    },
    {
        "Danube": "danube river"
    },
    {
        ". Here, they hoped to find refuge from the ": null
    },
    {
        "Huns": "huns"
    },
    {
        ". Valens permitted this, as he saw in them a splendid recruiting ground for his army . However, a ": null
    },
    {
        "famine": "famine"
    },
    {
        " broke out and Rome was unwilling to supply them with either the food they were promised or the land. Generally, the Goths were abused by the Romans, who began forcing the now starving Goths to trade away their children so as to stave off starvation. Open revolt ensued, leading to 42 years of plundering throughout the Balkans, the death of a Roman Emperor and a disastrous defeat of the Roman army.     The ": null
    },
    {
        "Battle of Adrianople": "battle of adrianople"
    },
    {
        " in 42 was the decisive moment of the war. The Roman forces were slaughtered and the Emperor ": null
    },
    {
        "Valens": "valens"
    },
    {
        " was killed during the fighting. Precisely how Valens fell remains uncertain but Gothic legend tells of how the emperor was taken to a farmhouse, which was set on fire above his head, a tale made more popular by its symbolic representation of a heretical emperor receiving hells torment. Many of Romes leading officers and some of their most elite fighting men died during the battle which struck a major blow to Roman prestige and the Empires military capabilities. Adrianople shocked the Roman world and eventually forced the Romans to negotiate with and settle the tribe within the empires boundaries, a development with far-reaching consequences for the eventual ": null
    },
    {
        "fall of Rome": "fall of the western roman empire"
    },
    {
        ". Fourth-century Roman soldier and historian ": null
    },
    {
        "Ammianus Marcellinus": "ammianus marcellinus"
    },
    {
        " ended his chronology of Roman history with this battle.     Despite the severe consequences for Rome, Adrianople was not nearly as productive overall for the Visigoths and their gains were short-lived. Still confined to a small and relatively impoverished province of the Empire, another Roman army was being gathered against them, an army which also had amid its ranks other disaffected Goths. Intense campaigns against the Visigoths followed their victory at Adrianople for upwards of three years. Approach routes across the Danube provinces were effectively sealed off by concerted Roman efforts, and while there was no decisive victory to claim, it was essentially a Roman triumph ending in a treaty in 42 The treaty struck with the Goths was to be the first foedus on imperial Roman soil. It required these semi-autonomous Germanic tribes to raise troops for the Roman army in exchange for arable land and freedom from Roman legal structures within the Empire.             The new emperor, ": null
    },
    {
        "Theodosius I": "theodosius i"
    },
    {
        ", made peace with the rebels, and this peace held essentially unbroken until Theodosius died in 42 In that year, the Visigoths most famous king, ": null
    },
    {
        "Alaric I": "alaric i"
    },
    {
        ", made a bid for the throne, but controversy and intrigue erupted between the East and West, as General ": null
    },
    {
        "Stilicho": "stilicho"
    },
    {
        " tried to maintain his position in the empire. Theodosius was succeeded by his incompetent sons: ": null
    },
    {
        "Arcadius": "arcadius"
    },
    {
        " in the east and ": null
    },
    {
        "Honorius": "flavius augustus honorius"
    },
    {
        " in the west. In 42 Alaric was named military commander of the eastern Illyrian prefecture by Arcadius.     Over the next 42 years, an uneasy peace was broken by occasional conflicts between Alaric and the powerful Germanic generals who commanded the Roman armies in the east and west, wielding the real power of the empire. Finally, after the western general Stilicho was executed by Honorius in 42 and the Roman legions massacred the families of thousands of barbarian soldiers who were trying to assimilate into the Roman empire, Alaric decided to march on Rome. After two defeats in Northern Italy and a siege of Rome ended by a negotiated pay-off, Alaric was cheated by another Roman faction. He resolved to cut the city off by capturing its port. On August 42 42 however, Alarics troops entered Rome through the ": null
    },
    {
        "Salarian Gate": "salarian gate"
    },
    {
        ", and ": null
    },
    {
        "sacked the city": "sack of rome"
    },
    {
        ". However, Rome, while still the official capital, was no longer the de facto seat of the government of the Western Roman Empire. From the late 42s up to 42 ": null
    },
    {
        "Milan": "milan"
    },
    {
        " was the seat of government, but after the siege of Milan the Imperial Court moved to ": null
    },
    {
        "Ravenna": "ravenna"
    },
    {
        " in 42 Honorius visited Rome often, and after his death in 42 the emperors resided mostly there. Romes fall severely shook the Empires confidence, especially in the West. Loaded with booty, Alaric and the Visigoths extracted as much as they could with the intention of leaving Italy from Basilicata to northern ": null
    },
    {
        "Africa": "africa"
    },
    {
        ". Alaric died before the disembarkation and was buried supposedly near the ruins of Croton. He was succeeded by his wifes brother.               The Visigothic Kingdom was a Western European power in the 42th to 42th centuries, created in Gaul when the Romans lost their control of the western half of their empire. For a brief period, the Visigoths controlled the strongest kingdom in Western Europe. In response to the invasion of ": null
    },
    {
        "Roman Hispania": "hispania"
    },
    {
        " of 42 by the ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        ", ": null
    },
    {
        "Alans": "alans"
    },
    {
        " and ": null
    },
    {
        "Suebi": "suebi"
    },
    {
        ", ": null
    },
    {
        "Honorius": "honorius"
    },
    {
        ", the emperor in the West, enlisted the aid of the Visigoths to regain control of the territory. From 42 to 42 the Visigoths caused so much damage to Rome and the immediate periphery that nearly a decade later, the provinces in and around the city were only able to contribute one-seventh of their previous tax shares.     In 42 Honorius rewarded his Visigothic ": null
    },
    {
        "federates": "foederati"
    },
    {
        " by giving them land in ": null
    },
    {
        "Gallia Aquitania": "gallia aquitania"
    },
    {
        " on which to settle after they had attacked the four tribes – Sueves, Asding and Siling Vandala and Alans – who had crossed the Rhine near Mainz the last day of 42 and eventually were invited into Spain by a Roman usurper in the Fall of 42 . This was probably done under hospitalitas, the rules for billeting army soldiers. The settlement formed the nucleus of the future Visigothic kingdom that would eventually expand across the ": null
    },
    {
        "Pyrenees": "pyrenees"
    },
    {
        " and onto the Iberian peninsula. That Visigothic settlement proved paramount to Europes future as had it not been for the Visigothic warriors who fought side-by-side with the Roman troops under general ": null
    },
    {
        "Flavius Aetius": "flavius aetius"
    },
    {
        ", it is perhaps possible that ": null
    },
    {
        "Attila": "attila"
    },
    {
        " would have seized control of Gaul, rather than the Romans being able to retain dominance.     The Visigoths second great king, ": null
    },
    {
        "Euric": "euric"
    },
    {
        ", unified the various quarreling factions among the Visigoths and, in 42 forced the Roman government to come to terms, but the emperor did not legally recognize Gothic sovereignty; instead the emperor was content to be called a friend  to the Visigoths, while requiring them to address him as lord . Between 42–42 Euric captured most of southern Gaul. According to historian J. B. Bury, Euric was probably the greatest of the Visigothic kings for he managed to secure territorial gains denied to his predecessors and even acquired access to the ": null
    },
    {
        "Mediterranean Sea": "mediterranean sea"
    },
    {
        ". At his death, the Visigoths were the most powerful of the successor states to the Western Roman Empire and were at the very height of their power. Not only had Euric secured significant territory, he and his son, ": null
    },
    {
        "Alaric II": "alaric ii"
    },
    {
        ", who succeeded him, adopted Roman administrative and bureaucratic governance, including Romes tax gathering policies and legal codes.          At this point, the Visigoths were also the dominant power in the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        ", quickly crushing the ": null
    },
    {
        "Alans": "alans"
    },
    {
        " and forcing the ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        " into ": null
    },
    {
        "north Africa": "north africa"
    },
    {
        ". By 42 the Visigothic Kingdom, centred at ": null
    },
    {
        "Toulouse": "toulouse"
    },
    {
        ", controlled Aquitania and ": null
    },
    {
        "Gallia Narbonensis": "gallia narbonensis"
    },
    {
        " and most of Hispania with the exception of the ": null
    },
    {
        "Kingdom of the Suebi": "kingdom of the suebi"
    },
    {
        " in the northwest and small areas controlled by the ": null
    },
    {
        "Basques": "basques"
    },
    {
        " and ": null
    },
    {
        "Cantabri": "cantabri"
    },
    {
        "ans. Any survey of western Europe taken during this moment would have led one to conclude that the very future of Europe itself depended on the Visigoths . However, in 42 the Franks under Clovis I defeated the Visigoths in the ": null
    },
    {
        "Battle of Vouillé": "battle of vouillé"
    },
    {
        " and wrested control of Aquitaine. King Alaric II was killed in battle. ": null
    },
    {
        "French": "france"
    },
    {
        " national myths romanticize this moment as the time when a previously divided Gaul morphed into the united kingdom of ": null
    },
    {
        "Francia": "francia"
    },
    {
        " under Clovis.     Visigothic power throughout Gaul was not lost in its entirety due to the support from the powerful Ostrogothic king in Italy, ": null
    },
    {
        "Theodoric the Great": "theodoric the great"
    },
    {
        ", whose forces pushed Clovis I and his armies out of Visigothic territories. Theodoric the Greats assistance was not some expression of ethnic altruism, but formed part of his plan to extend his power across Spain and its associated lands.     After Alaric IIs death, Visigothic nobles spirited his heir, the child-king ": null
    },
    {
        "Amalaric": "amalaric"
    },
    {
        ", first to ": null
    },
    {
        "Narbonne": "narbonne"
    },
    {
        ", which was the last Gothic outpost in Gaul, and further across the Pyrenees into Hispania. The center of Visigothic rule shifted first to ": null
    },
    {
        "Barcelona": "barcelona"
    },
    {
        ", then inland and south to ": null
    },
    {
        "Toledo": "toledo, spain"
    },
    {
        ". From 42 to 42 the Visigoths were ruled by Theoderic the Great of the Ostrogoths as de jure regent for the young Amalaric. Theodorics death in 42 however, enabled the Visigoths to restore their royal line and re-partition the Visigothic kingdom through Amalaric, who incidentally, was more than just Alaric IIs son; he was also the grandson of Theodoric the Great through his daughter Theodegotho. Amalaric reigned independently for five years. Following Amalarics assassination in 42 another Ostrogothic ruler, Theudis took his place. For the next seventeen years, Theudis held the Visigothic throne.     Sometime in 42 the Visigoth ": null
    },
    {
        "Athanagild": "athanagild"
    },
    {
        " sought military assistance from Justinian I and while this aide helped Athanagild win his wars, the Romans had much more in mind. Granada and southernmost ": null
    },
    {
        "Baetica": "baetica"
    },
    {
        " were lost to representatives of the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        "  who had been invited in to help settle this Visigothic dynastic struggle, but who stayed on, as a hoped-for spearhead to a Reconquest of the far west envisaged by emperor ": null
    },
    {
        "Justinian I": "justinian i"
    },
    {
        ". Imperial Roman armies took advantage of Visigothic rivalries and established a government at Córdoba.        The last Arian Visigothic king, ": null
    },
    {
        "Liuvigild": "liuvigild"
    },
    {
        ", conquered most of the northern regions in 42 the Suevic kingdom in 42 and regained part of the southern areas lost to the ": null
    },
    {
        "Byzantines": "byzantine empire"
    },
    {
        ", which King ": null
    },
    {
        "Suintila": "suintila"
    },
    {
        " recovered in 42 The kingdom survived until 42 when King ": null
    },
    {
        "Roderic": "roderic"
    },
    {
        " was killed while opposing an invasion from the south by the ": null
    },
    {
        "Umayyad Caliphate": "umayyad caliphate"
    },
    {
        " in the ": null
    },
    {
        "Battle of Guadalete": "battle of guadalete"
    },
    {
        ". This marked the beginning of the ": null
    },
    {
        "Umayyad conquest of Hispania": "umayyad conquest of hispania"
    },
    {
        ", when most of Spain came under ": null
    },
    {
        "Islam": "islam"
    },
    {
        "ic rule in the early 42th century.     A Visigothic nobleman, ": null
    },
    {
        "Pelayo": "pelagius of asturias"
    },
    {
        ", is credited with beginning the Christian  Reconquista  of Iberia in 42 when he defeated the Umayyad forces in the ": null
    },
    {
        "Battle of Covadonga": "battle of covadonga"
    },
    {
        " and established the ": null
    },
    {
        "Kingdom of Asturias": "kingdom of asturias"
    },
    {
        " in the northern part of the peninsula. Other Visigoths who refused to adopt the Muslim faith or live under their rule, fled north to the kingdom of the ": null
    },
    {
        "Franks": "franks"
    },
    {
        ", and Visigoths played key roles in the empire of ": null
    },
    {
        "Charlemagne": "charlemagne"
    },
    {
        " a few generations later. In the early years of the ": null
    },
    {
        "Emirate of Córdoba": "emirate of córdoba"
    },
    {
        ", a group of Visigoths who remained under Muslim dominance constituted the personal bodyguard of the ": null
    },
    {
        "Emir": "emir"
    },
    {
        ", ": null
    },
    {
        "al-Haras": "al-haras"
    },
    {
        ".     During their long reign in Spain, the Visigoths were responsible for the ": null
    },
    {
        "only new cities founded in Western Europe between the 42th and 42th centuries": "visigothic kingdomfounding of cities"
    },
    {
        ". It is certain that they founded four: ": null
    },
    {
        "Reccopolis": "reccopolis"
    },
    {
        ", Victoriacum , Luceo, and ": null
    },
    {
        "Olite": "olite"
    },
    {
        ". There is also a possible fifth city ascribed to them by a later Arabic source: Baiyara . All of these cities were founded for military purposes and three of them in celebration of victory. Despite the fact that the Visigoths reigned in Spain for upwards of 42 years, there are few remnants of the Gothic language borrowed into ": null
    },
    {
        "Spanish": "spanish language"
    },
    {
        ".": null
    }
]