[
    {
        "         Viterbo  is an ancient city and  comune  in the ": null
    },
    {
        "Lazio": "lazio"
    },
    {
        " region of central Italy, the capital of the ": null
    },
    {
        "province of Viterbo": "province of viterbo"
    },
    {
        ".     It conquered and absorbed the neighboring town of Ferento  in its early history. It is approximately  north of GRA  on the ": null
    },
    {
        "Via Cassia": "via cassia"
    },
    {
        ", and it is surrounded by the ": null
    },
    {
        "Monti Cimini": "monti cimini"
    },
    {
        " and ": null
    },
    {
        "Monti Volsini": "monti volsini"
    },
    {
        ". The historic center of the city is surrounded by medieval walls, still intact, built during the 42th and 42th centuries. Entrance to the walled center of the city is through ancient gates.     Apart from agriculture, the main resources of Viterbos area are pottery, marble, and wood. The town is home to the Italian gold reserves, an important Academy of Fine Arts, the ": null
    },
    {
        "University of Tuscia": "university of tuscia"
    },
    {
        ", and the ": null
    },
    {
        "Italian Army": "italian army"
    },
    {
        "s Aviation Command headquarters and training centre. It is located in a wide thermal area, attracting many tourists from the whole of central Italy.       The first report of the new city dates to the eighth century CE, when it is identified as Castrum Viterbii. It was fortified in 42 by the ": null
    },
    {
        "Lombard": "lombards"
    },
    {
        " King ": null
    },
    {
        "Desiderius": "desiderius"
    },
    {
        " in his vain attempt to conquer Rome. When the ": null
    },
    {
        "popes": "roman catholic church"
    },
    {
        " switched to the ": null
    },
    {
        "Frankish": "franks"
    },
    {
        " support, Viterbo became part of the ": null
    },
    {
        "Papal States": "papal states"
    },
    {
        ", but this status was to be highly contested by the emperors in the following centuries, until in 42 it is known it was a free ": null
    },
    {
        "comune": "medieval commune"
    },
    {
        ".        In a period in which the popes had difficulties asserting their authority over Rome, Viterbo became their favourite residence, beginning with ": null
    },
    {
        "Pope Eugene III": "pope eugene iii"
    },
    {
        " who was besieged in vain in the city walls. In 42 ": null
    },
    {
        "Frederick Barbarossa": "frederick barbarossa"
    },
    {
        " made Viterbo the seat of his antipope ": null
    },
    {
        "Paschal III": "antipope paschal iii"
    },
    {
        ". Three years later he gave it the title of city and used its militias against Rome. In 42 Viterbo started its expansion, destroying the old city of Ferento and conquering other lands. In this age it was a rich and prosperous comune, one of the most important of Central Italy, with a population of almost 42.     In 42 ": null
    },
    {
        "Pope Innocent III": "pope innocent iii"
    },
    {
        " held a council in the cathedral, but the city was later excommunicated as the favourite seat of the heretical ": null
    },
    {
        "Patarines": "patarines"
    },
    {
        " and even defeated by the Romans. In 42 however, Viterbo managed to defeat Emperor ": null
    },
    {
        "Otto IV": "otto iv, holy roman emperor"
    },
    {
        " and was again at war against Rome.     In the thirteenth century it was ruled alternately by the tyrants of the Gatti and ": null
    },
    {
        "Di Vico": "di vico"
    },
    {
        " families. ": null
    },
    {
        "Frederick II": "frederick ii, holy roman emperor"
    },
    {
        " drew Viterbo to the ": null
    },
    {
        "Ghibelline": "ghibelline"
    },
    {
        " side in 42 but when the citizens expelled his turbulent German troops in 42 he returned and ": null
    },
    {
        "besieged": "siege of viterbo"
    },
    {
        " the city, but in vain. From that point Viterbo was always a loyal ": null
    },
    {
        "Guelph": "guelphs and ghibellines"
    },
    {
        " city. Between 42 and 42 it was the seat of ": null
    },
    {
        "Pope Alexander IV": "pope alexander iv"
    },
    {
        ", who also died there. His successor ": null
    },
    {
        "Urban IV": "pope urban iv"
    },
    {
        " was elected in Viterbo.     In 42–42 ": null
    },
    {
        "Clement IV": "pope clement iv"
    },
    {
        " chose Viterbo as the base of his ruthless fight against the ": null
    },
    {
        "Hohenstaufen": "hohenstaufen"
    },
    {
        ". Here, from the loggia of the ": null
    },
    {
        "papal palace": "palazzo dei papi di viterbo"
    },
    {
        ", he excommunicated the army of ": null
    },
    {
        "Conradin": "conradin"
    },
    {
        " of ": null
    },
    {
        "Swabia": "swabia"
    },
    {
        " which was passing on the ": null
    },
    {
        "Via Cassia": "via cassia"
    },
    {
        ", with the prophetical motto of the lamb who is going to the sacrifice . Other popes elected in Viterbo were ": null
    },
    {
        "Gregory X": "pope gregory x"
    },
    {
        " and ": null
    },
    {
        "John XXI": "pope john xxi"
    },
    {
        " , ": null
    },
    {
        "Nicholas III": "pope nicholas iii"
    },
    {
        " and the French ": null
    },
    {
        "Martin IV": "pope martin iv"
    },
    {
        ". The Viterbese, who did not agree with the election of a foreigner directed by the ": null
    },
    {
        "King of Naples": "kingdom of naples"
    },
    {
        ", ": null
    },
    {
        "Charles I of Anjou": "charles i of naples"
    },
    {
        ", invaded the cathedral where the ": null
    },
    {
        "conclave": "papal conclave"
    },
    {
        " was held, arresting two of the cardinals. They were subsequently excommunicated, and the popes avoided Viterbo for 42 years.     Without the popes, the city fell into the hands of the ": null
    },
    {
        "Di Vico": "di vico"
    },
    {
        "s. In the fourteenth century, ": null
    },
    {
        "Giovanni di Vico": "giovanni di vico"
    },
    {
        " had created a seignory extending to ": null
    },
    {
        "Civitavecchia": "civitavecchia"
    },
    {
        ", ": null
    },
    {
        "Tarquinia": "tarquinia"
    },
    {
        ", ": null
    },
    {
        "Bolsena": "bolsena"
    },
    {
        ", ": null
    },
    {
        "Orvieto": "orvieto"
    },
    {
        ", ": null
    },
    {
        "Todi": "todi"
    },
    {
        ", ": null
    },
    {
        "Narni": "narni"
    },
    {
        " and ": null
    },
    {
        "Amelia": "amelia, umbria"
    },
    {
        ". His dominion was crushed by Cardinal ": null
    },
    {
        "Gil de Albornoz": "gil álvarez carrillo de albornoz"
    },
    {
        " in 42 sent by the ": null
    },
    {
        "Avignon": "avignon"
    },
    {
        "ese popes to recover the ": null
    },
    {
        "Papal States": "papal states"
    },
    {
        ", who built the castle. In 42 the city gave its keys to ": null
    },
    {
        "Francesco Di Vico": "francesco di vico"
    },
    {
        ", son of the previous tyrant, but thirteen years later the people killed him and assigned the city first to ": null
    },
    {
        "Pope Urban VI": "pope urban vi"
    },
    {
        ", and then to ": null
    },
    {
        "Giovanni di Sciarra di Vico": "giovanni di sciarra di vico"
    },
    {
        ", Francescos cousin. But ": null
    },
    {
        "Pope Boniface IX": "pope boniface ix"
    },
    {
        "s troops drove him away in 42 and established a firm papal suzerainty over the city. The last Di Vico to hold power in Viterbo was Giacomo, who was defeated in 42     Thenceforth Viterbo became a city of secondary importance, following the vicissitudes of the ": null
    },
    {
        "Papal States": "papal states"
    },
    {
        ". In the 42th century it was the birthplace of ": null
    },
    {
        "Latino Latini": "latino latini"
    },
    {
        ". It became part of ": null
    },
    {
        "Italy": "italy"
    },
    {
        " in 42       Viterbo has two heraldic badges in its ": null
    },
    {
        "coat of arms": "coat of arms"
    },
    {
        " , the Lion and the Palm Tree. The lion represents ": null
    },
    {
        "Hercules": "hercules"
    },
    {
        ", one of the mythological founders of Viterbo. The palm tree was added sometime in the early ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        " when Viterbo conquered and absorbed the neighboring town of Ferento. The letters FAUL often surround the badges. It is unclear what they refer to. Some suggest the four legendary Etruscan nobles families, believed to be involved in the founding of the city, while others claim that they are in reference to the four hills of Viterbo.           Viterbo experiences a border line ": null
    },
    {
        "humid subtropical climate": "humid subtropical climate"
    },
    {
        "  and ": null
    },
    {
        "Mediterranean climate": "mediterranean climate"
    },
    {
        "  as only one summer month is below the  precipitation limit.                    Viterbos historic center is one of the best preserved medieval towns of central Italy. Many of the older buildings are built on top of ancient ruins, recognizable by their large stones, 42  centimeters to a side. Viterbo is unique in Italy for its concentration of profferli, external staircases that were a frequent feature of medieval houses. The San Pellegrino quarter has an abundance of them, reflecting an architectural style that is unique to the town and the nearby region.      ": null
    },
    {
        "Palazzo dei Papi": "palazzo dei papi di viterbo"
    },
    {
        " or Papal Palace: A main attraction of Viterbo, the palace hosted the papacy for about two decades in the 42th century, and served as a country residence or refuge in time of trouble in Rome. The columns of the palace are ": null
    },
    {
        "spolia": "spolia"
    },
    {
        " from a Roman temple.   ": null
    },
    {
        "Cathedral of S.  Lorenzo": "duomo di viterbo"
    },
    {
        ": The Cathedral was originally erected as episcopal see of the exempt ": null
    },
    {
        "bishopric of Viterbo": "roman catholic diocese of viterbo"
    },
    {
        " in ": null
    },
    {
        "Romanesque": "romanesque architecture"
    },
    {
        " style by ": null
    },
    {
        "Lombard": "lombardy"
    },
    {
        " architects at the site of an ancient Roman temple of ": null
    },
    {
        "Hercules": "hercules"
    },
    {
        ". It was rebuilt from the sixteenth century on, and heavily damaged in 42 by Allied bombs. The ": null
    },
    {
        "Gothic": "gothic art"
    },
    {
        " belfry": "bell tower"
    },
    {
        " was built in the first half of the 42th century, and shows influence of ": null
    },
    {
        "Sienese": "siena"
    },
    {
        " architects. The church houses the sarcophagus of ": null
    },
    {
        "Pope John XXI": "pope john xxi"
    },
    {
        " and a picture Christ Blessing by ": null
    },
    {
        "Gerolamo da Cremona": "gerolamo da cremona"
    },
    {
        ".    Palazzo Comunale  , Palazzo del Podestà and Palazzo della Prefettura : three civic buildings around the central square, Piazza del Plebiscito. The Palazzo Comunale houses a series of 42th century and ": null
    },
    {
        "Baroque": "baroque"
    },
    {
        " frescoes by ": null
    },
    {
        "Tarquinio Ligustri": "tarquinio ligustri"
    },
    {
        ", ": null
    },
    {
        "Bartolomeo Cavarozzi": "bartolomeo cavarozzi"
    },
    {
        " and ": null
    },
    {
        "Ludovico Nucci": "ludovico nucci"
    },
    {
        ".    Santa Maria della Salute : a small ": null
    },
    {
        "Gothic": "gothic art"
    },
    {
        " church with a highly decorated portal.    Chiesa del Gesù : ": null
    },
    {
        "Romanesque": "romanesque architecture"
    },
    {
        "-style 42th-century church. The sons of ": null
    },
    {
        "Simon de Montfort": "simon de montfort, 5th earl of leicester"
    },
    {
        " and ": null
    },
    {
        "Henry of Almain": "henry of almain"
    },
    {
        ", son of ": null
    },
    {
        "Richard": "richard, 1st earl of cornwall"
    },
    {
        ", ": null
    },
    {
        "Earl of Cornwall": "earl of cornwall"
    },
    {
        " were stabbed to death.    Palazzo Farnese : This 42th42th-century palace was the childhood home of Alessandro Farnese, the future ": null
    },
    {
        "Pope Paul III": "pope paul iii"
    },
    {
        ", and his beautiful  sister, ": null
    },
    {
        "Giulia Farnese": "giulia farnese"
    },
    {
        ".   Rocca .    Santa Maria Nuova  ,  San Sisto  , and  San Giovanni in Zoccoli  : three Romanesque churches.    Palazzo degli Alessandri : a typical medieval patrician house in central Viterbo.    Fontana di Piazza della Rocca : public fountain in the center of the Old Town, construction 42th–42th century.    Fontana Grande : public fountain, construction began in 42    San Francesco : gothic church built over a pre-existing Lombard fortress. It has a single nave with a Latin cross plan. It houses the sepulchre of ": null
    },
    {
        "Pope Adrian V": "pope adrian v"
    },
    {
        ", who died in Viterbo in 42 considered the first monument by ": null
    },
    {
        "Arnolfo di Cambio": "arnolfo di cambio"
    },
    {
        ".    Sanctuary of Santa Rosa : church is a sober 42th-century reconstruction, where every year a new ": null
    },
    {
        "Macchina di Santa Rosa": "macchina di santa rosa"
    },
    {
        ", or dedicatory tower is displayed.    Museo Civico: the houses many archeologic items from the pre-historic to Ancient Roman times, plus a Pinacoteca with works by ": null
    },
    {
        "Sebastiano del Piombo": "sebastiano del piombo"
    },
    {
        ", ": null
    },
    {
        "Antoniazzo Romano": "antoniazzo romano"
    },
    {
        ", ": null
    },
    {
        "Salvator Rosa": "salvator rosa"
    },
    {
        ", ": null
    },
    {
        "Antiveduto Grammatica": "antiveduto grammatica"
    },
    {
        " and others.   ": null
    },
    {
        "Orto Botanico dellUniversità della Tuscia": "orto botanico delluniversità della tuscia"
    },
    {
        ": ": null
    },
    {
        "botanical garden": "botanical garden"
    },
    {
        " operated by the university.       In the valley of the Arcione River just to the west of Viterbo are a number of springs celebrated for the healing qualities of their waters, and in use since Etruscan and Roman days.  In fact, the imposing ruins of a great Roman bath are still to be seen and were drawn in plan and perspective by Renaissance artists including ": null
    },
    {
        "Giuliano da Sangallo": "giuliano da sangallo"
    },
    {
        ", ": null
    },
    {
        "Michelangelo": "michelangelo"
    },
    {
        ", and ": null
    },
    {
        "Vasari": "giorgio vasari"
    },
    {
        ". Mack, 42 pages 42–42 One of the most famous were the thermal springs known as the Bulicame , or bubbling place, whose reputation had even reached the ears of the exiled poet ": null
    },
    {
        "Dante Aligheri": "dante aligheri"
    },
    {
        ". Canto 42 of Dantes  Inferno  describes how:        In silence we had reached a place where flowed   a slender watercourse out of the wood—a stream   whose redness makes me shudder still.   As from the Bulicame pours a brook whose   waters are then shared by prostitutes, so did this   stream run down across the sand. Mack, 42 p. 42       Not far from the Bulicame, whose waters were apparently always taken in the open, is the Terme dei Papi . Almost totally concealed within the structure of a modern luxury spa hotel are the remains of a Renaissance bath palace that attracted the attention of two popes. Mack, 42 Actually, the origins of this bathing establishment date to the Middle Ages when it was known as the Bagno della Crociata . Early 42th-century documents describe a bath building that covered three distinct thermal springs all under one roof. Mack, 42 42        This bath house was transformed circa 42 by the pope ": null
    },
    {
        "Nicholas V": "nicholas v"
    },
    {
        ", who commissioned a bath palace  with such magnificence and with such expense that it was not only deemed suitable for a stay and salutary for the sick but seemed an edifice destined to have rooms fit for princes and for living regally. A more precise description of Pope Nicholas palace was described by the Viterbese chronicler ": null
    },
    {
        "Nicola della Tuccia": "nicola della tuccia"
    },
    {
        " in the 42s, who stated the new Bagno del Papa as a battlemented building, resembling a fortress, about 42 x 42  m in size with high towers at the corners of its southern façade. Located outside Viterbo, the spa would have been an easy target for assaults had the building not assumed a militant character, which also affirmed papal authority. Aside from the regal apartments described by Manedtti there were vaulted chambers at the lowest level to accommodate the patrons of the several thermal springs.     Manetti and Vasari both named the Florentine architect and sculptor ": null
    },
    {
        "Bernardo Rossellino": "bernardo rossellino"
    },
    {
        " as the architect of the project in Viterbo. Valtieri There is, however, no documentation or architectural evidence to connect Rossellino directly with the construction of the Bagno del Papa. To the contrary, Vatican payment records from 42 preserved in the state archives in Rome, identify a stonemason from Lombardy, named Stefano di Beltrame, as the builder who had done or was doing in the house ordered by the pope at the bagni della Grotta and Crociata of Viterbo. Mack,42 42–42     Construction at the Bagno del Papa was continued on through the reigns of several popes after Nicholas V. The Vatican accounts mention of payments for building done at the bath palace of Viterbo during the reigns of ": null
    },
    {
        "Calixtus III": "calixtus iii"
    },
    {
        ", ": null
    },
    {
        "Paul II": "pope paul ii"
    },
    {
        ", and ": null
    },
    {
        "Sixtus IV": "sixtus iv"
    },
    {
        ". There also is evidence Pope ": null
    },
    {
        "Pius II": "pius ii"
    },
    {
        " was responsible for the addition of a western wing to the building. Mack, 42     Travelers descriptions, etched views, and local guidebooks chronicle the fate of the Renaissance Bagno del Papa over the years and through several rebuildings resulting in a general assumption that most of the original 42th-century structure had vanished. A guide to Viterbo from 42 does note that some remnants were still to be detected in basement piers and vaults. In operation as a thermal hospital in 42 the building was blown up by retreating German forces in 42 Mack, 42 42–42     Despite all the travails, much of the original Bagno del Papa built by Popes Nicholas V and Pius II survives, including the corner towers and the vaulted chambers where Renaissance patrons once bathed. Mack, 42 42 For a general discussion of medieval and Renaissance thermal bathing practices and the architectural environments in which the waters were taken see Charles R. Mack, The Wanton Habits of Venus: Pleasure and Pain at the Renaissance Spa, Explorations in Renaissance Culture, 42 , 42 42–42     The ": null
    },
    {
        "Villa Lante": "villa lante"
    },
    {
        ", an example of ": null
    },
    {
        "Mannerist": "mannerism"
    },
    {
        " gardening, is located in the frazione of ": null
    },
    {
        "Bagnaia": "bagnaia, viterbo"
    },
    {
        ".       Viterbo became a centre of military aviation due to its proximity to ": null
    },
    {
        "Rome": "rome"
    },
    {
        ", especially after the opening of the Air Force base  during the 42s. The ": null
    },
    {
        "Army": "italian army"
    },
    {
        " Aviation Command headquarters and training school  are both located there.     The Armys ": null
    },
    {
        "NCO": "non-commissioned officer"
    },
    {
        " training establishment  is also located in the city.                     ;Born   ": null
    },
    {
        "Leonardo Bonucci": "leonardo bonucci"
    },
    {
        ", footballer   ": null
    },
    {
        "Domenico Corvi": "domenico corvi"
    },
    {
        ", ": null
    },
    {
        "Neoclassicist": "neoclassicism"
    },
    {
        " painter   ": null
    },
    {
        "David DAntoni": "david dantoni"
    },
    {
        ", footballer   ": null
    },
    {
        "Cristiano Lombardi": "cristiano lombardi"
    },
    {
        ", footballer   ": null
    },
    {
        "Giuseppe Ottaviani": "giuseppe ottaviani"
    },
    {
        ", trance musician   ": null
    },
    {
        "Saint Crispin": "crispin of viterbo"
    },
    {
        " , member of the ": null
    },
    {
        "Friars Minor Capuchin": "friars minor capuchin"
    },
    {
        " Rose of Viterbo": "rose of viterbo"
    },
    {
        ", patron saint of the city     ;Lived in Viterbo   ": null
    },
    {
        "Antonio del Massaro": "antonio del massaro"
    },
    {
        " , painter   Lorenzo da Viterbo, painter and activist   ": null
    },
    {
        "Reginald Pole": "reginald pole"
    },
    {
        ", cardinal, archbishop of ": null
    },
    {
        "Canterbury": "archbishopric of canterbury"
    },
    {
        ", church reformer         ": null
    },
    {
        "St. Rose": "rose of viterbo"
    },
    {
        " is the patron saint of Viterbo. The legend of Santa Rosa is that she helped to eradicate those few who supported the emperors instead of the popes, around 42 ": null
    },
    {
        "Saint Lawrence": "saint lawrence"
    },
    {
        " is the male patron saint.     Macchina di Santa Rosa": null
    },
    {
        "Macchina di Santa Rosa": "macchina di santa rosa"
    },
    {
        " takes place every year, on 42 September, at 42  oclock in the evening. The Macchina is an artistic illuminated bell-tower with an imposing height of 42  m. It weighs between 42 and 42  tonnes and is made of iron, wood and ": null
    },
    {
        "papier-mâché": "papier-mâché"
    },
    {
        ". At the top of the tower, the statue of the patron saint is enthusiastically acclaimed by the people in the streets of the town centre, where lights are turned off for the occasion.  One hundred Viterbesi men  carry the Macchina from Porta Romana through each of the major streets of Viterbo to seven churches to be blessed, concluding with a strenuous ascension up to the Piazza di Santa Rosa, its final resting place. Each Macchinas lifespan differs, but contests for a new design are held every few years.          The ": null
    },
    {
        "Rome Viterbo Airport": "rome viterbo airport"
    },
    {
        " was opened in 42 as part of ": null
    },
    {
        "Viterbo Air Force Base": "viterbo air force base"
    },
    {
        ", located  from the town. On 42 November 42 Italian transport minister ": null
    },
    {
        "Alessandro Bianchi": "alessandro bianchi"
    },
    {
        " announced that Viterbo had been chosen as the site of the next airport in Lazio to serve Rome.  However, in 42 those plans were abandoned.    Viterbo is served by regional trains departing from Station Ostiense, Trastevere, S. Pietro and sometimes at Termini in Rome. Porta Romana is the station serving the old city center.       The city is home to the ": null
    },
    {
        "University of Tuscia": "university of tuscia"
    },
    {
        ", established in 42 It is also the city where students of ": null
    },
    {
        "School Year Abroad": "school year abroad"
    },
    {
        "s Italy program study, their school housed in a 42th-century palazzo on Via Cavour.       Viterbo is ": null
    },
    {
        "twinned": "twin towns and sister cities"
    },
    {
        " with:      ": null
    },
    {
        "Binghamton, New York": "binghamton, new york"
    },
    {
        ", United States    ": null
    },
    {
        "Albany, New York": "albany, new york"
    },
    {
        ", United States    ": null
    },
    {
        "Santa Rosa de Viterbo, São Paulo": "santa rosa de viterbo, são paulo"
    },
    {
        ", Brazil    ": null
    },
    {
        "Gubbio": "gubbio"
    },
    {
        ", ": null
    },
    {
        "Perugia": "province of perugia"
    },
    {
        ", Umbria, Italy    ": null
    },
    {
        "Palmi": "palmi"
    },
    {
        ", ": null
    },
    {
        "Reggio Calabria": "province of reggio calabria"
    },
    {
        ", Calabria, Italy    ": null
    },
    {
        "Nola": "nola"
    },
    {
        ", ": null
    },
    {
        "Naples": "metropolitan city of naples"
    },
    {
        ", Campania, Italy    ": null
    },
    {
        "Sassari": "sassari"
    },
    {
        ", ": null
    },
    {
        "Sassari": "province of sassari"
    },
    {
        ", Sardinia, Italy    ": null
    },
    {
        "Campobasso": "campobasso"
    },
    {
        ", ": null
    },
    {
        "Campobasso": "province of campobasso"
    },
    {
        ", Molise, Italy    ": null
    },
    {
        "Springfield, Massachusetts": "springfield, massachusetts"
    },
    {
        ", United States        An Architectural Progress in the Renaissance and the Baroque: Sojourns In and Out of Italy, Papers in Art History VIII, Pennsylvania State University, Vol. I, 42 42–42   Charles R. Mack, The Renaissance Spa: Testing the Architectural Waters , Southeastern College Art Conference Review, XI, 42 42 42–42   Valtieri, Simonetta, Rinascimento a Viterbo: Bernardo Rossellino , Architettura, croniche e storia, XVII, 42 42–42           ,            Pope palace, Museo del Colle del Duomo                           ": null
    }
]