[
    {
        "     A vocoder  is a ": null
    },
    {
        "category": "speech codingcategories"
    },
    {
        " of ": null
    },
    {
        "voice codec": "voice codec"
    },
    {
        " that ": null
    },
    {
        "analyzes and synthesizes": "synthesizeranalysis/resynthesis"
    },
    {
        " the human voice signal for ": null
    },
    {
        "audio data compression": "audio data compression"
    },
    {
        ", ": null
    },
    {
        "multiplexing": "multiplexing"
    },
    {
        ", ": null
    },
    {
        "voice encryption": "voice encryption"
    },
    {
        " or voice transformation.     The earliest type of vocoder, the channel vocoder, was originally developed as a voice codec for ": null
    },
    {
        "telecommunications": "telecommunications"
    },
    {
        " applications in the 42s for ": null
    },
    {
        "coding": "code"
    },
    {
        " speech to conserve ": null
    },
    {
        "bandwidth": "bandwidth"
    },
    {
        " in transmission.     By ": null
    },
    {
        "encrypting": "encryption"
    },
    {
        " the control signals, voice transmission can be secured against interception. Its primary use in this fashion is for secure radio communication. The advantage of this method of encryption is that none of the original signal is sent, only envelopes of the bandpass filters. The receiving unit needs to be set up in the same filter configuration to re-synthesize a version of the original signal spectrum.     The vocoder has also been used extensively as an ": null
    },
    {
        "electronic musical instrument": "electronic musical instrument"
    },
    {
        ". The decoder portion of the vocoder, called a ": null
    },
    {
        "voder": "voder"
    },
    {
        ", can be used independently for ": null
    },
    {
        "speech synthesis": "speech synthesis"
    },
    {
        ".          The ": null
    },
    {
        "human voice": "human voice"
    },
    {
        " consists of sounds generated by the opening and closing of the ": null
    },
    {
        "glottis": "glottis"
    },
    {
        " by the ": null
    },
    {
        "vocal cords": "vocal folds"
    },
    {
        ", which produces a periodic waveform with many ": null
    },
    {
        "harmonic": "harmonic"
    },
    {
        "s. This basic sound is then ": null
    },
    {
        "filter": "audio filter"
    },
    {
        "ed by the nose and throat  to produce differences in harmonic content  in a controlled way, creating the wide variety of sounds used in speech. There is another set of sounds, known as the ": null
    },
    {
        "unvoiced": "voiceless consonant"
    },
    {
        " and ": null
    },
    {
        "plosive": "stop consonant"
    },
    {
        " sounds, which are created or modified by the mouth in different fashions.     The vocoder examines speech by measuring how its spectral characteristics change over time. This results in a series of signals representing these modified frequencies at any particular time as the user speaks. In simple terms, the signal is split into a number of frequency bands and the level of signal present at each frequency band gives the instantaneous representation of the spectral energy content. To recreate speech, the vocoder simply reverses the process, processing a broadband noise source by passing it through a stage that filters the frequency content based on the originally recorded series of numbers.     Specifically, in the encoder, the input is passed through a multiband ": null
    },
    {
        "filter": "band-pass filter"
    },
    {
        ", then each band is passed through an ": null
    },
    {
        "envelope follower": "envelope follower"
    },
    {
        ", and the control signals from the envelope followers are transmitted to the decoder. The decoder applies these control signals to corresponding amplifiers of the filter channels for ": null
    },
    {
        "re-synthesis": "synthesizeranalysis/resynthesis"
    },
    {
        ".     Information about the instantaneous frequency of the original voice signal is discarded; it was not important to preserve this for the purposes of the vocoders original use as an encryption aid. It is this dehumanizing aspect of the vocoding process that has made it useful in creating special voice effects in popular music and audio entertainment.     The vocoder process sends only the parameters of the vocal model over the communication link, instead of a point-by-point recreation of the waveform. Since the parameters change slowly compared to the original speech waveform, the bandwidth required to transmit speech can be reduced. This allows more speech channels to utilize a given ": null
    },
    {
        "communication channel": "communication channel"
    },
    {
        ", such as a radio channel or a ": null
    },
    {
        "submarine cable": "submarine communications cable"
    },
    {
        ".     Analog vocoders typically analyze an incoming signal by splitting the signal into a number of tuned frequency bands or ranges. A ": null
    },
    {
        "modulator": "modulation"
    },
    {
        " and ": null
    },
    {
        "carrier signal": "carrier signal"
    },
    {
        " are sent through a series of these tuned ": null
    },
    {
        "bandpass filter": "bandpass filter"
    },
    {
        "s. In the example of a typical robot voice, the modulator is a ": null
    },
    {
        "microphone": "microphone"
    },
    {
        " and the carrier is noise or a ": null
    },
    {
        "sawtooth waveform": "sawtooth waveform"
    },
    {
        ". There are usually between eight and 42 bands.     The amplitude of the modulator for each of the individual analysis bands generates a voltage that is used to control amplifiers for each of the corresponding carrier bands. The result is that frequency components of the modulating signal are mapped onto the carrier signal as discrete amplitude changes in each of the frequency bands. .     Often there is an unvoiced band or ": null
    },
    {
        "sibilance": "sibilance"
    },
    {
        " channel. This is for frequencies that are outside the analysis bands for typical speech but are still important in speech. Examples are words that start with the letters s, f, ch or any other sibilant sound. These can be mixed with the carrier output to increase clarity. The result is recognizable speech, although somewhat mechanical sounding. Vocoders often include a second system for generating unvoiced sounds, using a ": null
    },
    {
        "noise generator": "noise generator"
    },
    {
        " instead of the ": null
    },
    {
        "fundamental frequency": "fundamental frequency"
    },
    {
        ".     In the channel vocoder algorithm, among the two components of an ": null
    },
    {
        "analytic signal": "analytic signal"
    },
    {
        ", considering only the ": null
    },
    {
        "amplitude": "amplitude"
    },
    {
        " component and simply ignoring the ": null
    },
    {
        "phase": "instantaneous phase"
    },
    {
        " component tends to result in an unclear voice; on methods for rectifying this, see ": null
    },
    {
        "phase vocoder": "phase vocoder"
    },
    {
        ".               The development of a vocoder was started in 42 by ": null
    },
    {
        "Bell Labs": "bell labs"
    },
    {
        " engineer ": null
    },
    {
        "Homer Dudley": "homer dudley"
    },
    {
        ",    who was granted patents for it,  on March 42 42       and  on Nov 42 42           Then, to show the ": null
    },
    {
        "speech synthesis": "speech synthesis"
    },
    {
        " ability of its ": null
    },
    {
        "decoder": "audio decoder"
    },
    {
        " part, ": null
    },
    {
        "the Voder": "the voder"
    },
    {
        " , was introduced to the public at the AT & T building at the 42–42 New York Worlds Fair.       The Voder consisted of a switchable pair of ": null
    },
    {
        "electronic oscillator": "electronic oscillator"
    },
    {
        " and ": null
    },
    {
        "noise generator": "noise generator"
    },
    {
        " as a sound source of ": null
    },
    {
        "pitched": "pitch"
    },
    {
        " tone and ": null
    },
    {
        "hiss": "noise"
    },
    {
        ", 42-band ": null
    },
    {
        "resonator filter": "band-pass filter"
    },
    {
        "s with ": null
    },
    {
        "variable-gain amplifier": "variable-gain amplifier"
    },
    {
        "s as a ": null
    },
    {
        "vocal tract": "vocal tract"
    },
    {
        ", and the manual controllers including a set of pressure-sensitive keys for filter control, and a ": null
    },
    {
        "foot pedal": "expression pedal"
    },
    {
        " for ": null
    },
    {
        "pitch control": "pitch control"
    },
    {
        " of tone.   ; based on  See: .   The filters controlled by keys convert the tone and the hiss into ": null
    },
    {
        "vowel": "vowel"
    },
    {
        "s, ": null
    },
    {
        "consonant": "consonant"
    },
    {
        "s, and ": null
    },
    {
        "inflection": "inflection"
    },
    {
        "s. This was a complex machine to operate, but a skilled operator could produce recognizable speech.      A demonstration of the ": null
    },
    {
        "Voder": "voder"
    },
    {
        " .       Dudleys vocoder was used in the ": null
    },
    {
        "SIGSALY": "sigsaly"
    },
    {
        " system, which was built by ": null
    },
    {
        "Bell Labs": "bell labs"
    },
    {
        " engineers in 42 SIGSALY was used for encrypted high-level voice communications during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". The KO42 voice coder was released in 42 in limited quantities; it was a close approximation to the SIGSALY at 42 bps. In 42 KY42 THESEUS  42 bps voice coder used solid state logic to reduce the weight to  from SIGSALYs 42 tons, and in 42 the HY42 voice coder, a 42-channel 42 bps system, weighted  and was the last implementation of a channel vocoder in a secure speech system.      Later work in this field has since used digital ": null
    },
    {
        "speech coding": "speech coding"
    },
    {
        ". The most widely used speech coding technique is ": null
    },
    {
        "linear predictive coding": "linear predictive coding"
    },
    {
        " ,  which was first proposed by ": null
    },
    {
        "Fumitada Itakura": "fumitada itakura"
    },
    {
        " of ": null
    },
    {
        "Nagoya University": "nagoya university"
    },
    {
        " and Shuzo Saito of ": null
    },
    {
        "Nippon Telegraph and Telephone": "nippon telegraph and telephone"
    },
    {
        " in 42  Another speech coding technique, ": null
    },
    {
        "adaptive differential pulse-code modulation": "adaptive differential pulse-code modulation"
    },
    {
        " , was developed by P. Cummiskey, ": null
    },
    {
        "Nikil S. Jayant": "nikil jayant"
    },
    {
        " and ": null
    },
    {
        "James L. Flanagan": "james l. flanagan"
    },
    {
        " at ": null
    },
    {
        "Bell Labs": "bell labs"
    },
    {
        " in 42          Terminal equipment for ": null
    },
    {
        "Digital Mobile Radio ": "digital mobile radio"
    },
    {
        " based systems.   Digital Trunking   DMR TDMA   Digital Voice Scrambling and Encryption   ": null
    },
    {
        "Digital WLL": "wireless local loop"
    },
    {
        " VoIP Systems": "voip"
    },
    {
        " Ernst Rothauser": "ernst rothauser"
    },
    {
        " Dissertation and patents on vocoder technology          Even with the need to record several frequencies, and additional unvoiced sounds, the compression of vocoder systems is impressive. Standard speech-recording systems capture frequencies from about 42  Hz to 42  Hz, where most of the frequencies used in speech lie, typically using a sampling rate of 42  kHz . The sampling resolution is typically 42 or more bits per sample resolution , for a final data rate in the range of 42–42 kbit/s, but a good vocoder can provide a reasonably good simulation of voice with as little as 42 kbit/s of data.     Toll quality voice coders, such as ITU G.42 are used in many telephone networks. G.42 in particular has a final data rate of 42 kbit/s with superb voice quality. G.42 achieves slightly worse quality at data rates of 42 kbit/s and 42 kbit/s. Many voice vocoder systems use lower data rates, but below 42 kbit/s voice quality begins to drop rapidly.     Several vocoder systems are used in ": null
    },
    {
        "NSA encryption systems": "nsa encryption systems"
    },
    {
        ":   LPC42 ": null
    },
    {
        "FIPS": "federal information processing standard"
    },
    {
        " Pub 42 42 bit/s, which uses ": null
    },
    {
        "linear predictive coding": "linear predictive coding"
    },
    {
        " Code-excited linear prediction": "code-excited linear prediction"
    },
    {
        " , 42 and 42 bit/s, Federal Standard 42 used in ": null
    },
    {
        "STU-III": "stu-iii"
    },
    {
        " Continuously variable slope delta modulation": "continuously variable slope delta modulation"
    },
    {
        " , 42 kbit/s, used in wide band encryptors such as the ": null
    },
    {
        "KY42": "ky-57"
    },
    {
        ".   ": null
    },
    {
        "Mixed-excitation linear prediction": "mixed-excitation linear prediction"
    },
    {
        " , MIL STD 42 42 bit/s, used in the Future Narrowband Digital Terminal ": null
    },
    {
        "FNBDT": "secure communications interoperability protocol"
    },
    {
        ", ": null
    },
    {
        "NSA": "national security agency"
    },
    {
        "s 42st century secure telephone.   ": null
    },
    {
        "Adaptive Differential Pulse Code Modulation": "adaptive differential pulse code modulation"
    },
    {
        " , former ": null
    },
    {
        "ITU-T": "itu telecommunication standardization sector"
    },
    {
        " G.42 42 kbit/s used in ": null
    },
    {
        "STE": "secure terminal equipment"
    },
    {
        " secure telephone          Vocoders are also currently used in developing ": null
    },
    {
        "psychophysics": "psychophysics"
    },
    {
        ", ": null
    },
    {
        "linguistics": "linguistics"
    },
    {
        ", ": null
    },
    {
        "computational neuroscience": "computational neuroscience"
    },
    {
        " and ": null
    },
    {
        "cochlear implant": "cochlear implant"
    },
    {
        " research.     Modern vocoders that are used in communication equipment and in voice storage devices today are based on the following algorithms:   ": null
    },
    {
        "Algebraic code-excited linear prediction": "algebraic code-excited linear prediction"
    },
    {
        "   \t   Mixed-excitation linear prediction": "mixed-excitation linear prediction"
    },
    {
        "   \t   Multi-band excitation": "multi-band excitation"
    },
    {
        "   \t   Sinusoidal-Pulsed Representation   \t   Robust Advanced Low-complexity Waveform Interpolation   \t   Tri-Wave Excited Linear Prediction   \t   Noise Robust Vocoder   \t          Since the late 42s, most non-musical vocoders have been implemented using ": null
    },
    {
        "linear prediction": "linear prediction"
    },
    {
        ", whereby the target signals spectral envelope is estimated by an all-pole ": null
    },
    {
        "IIR": "infinite impulse response"
    },
    {
        " filter": "digital filter"
    },
    {
        ". In linear prediction coding, the all-pole filter replaces the bandpass filter bank of its predecessor and is used at the encoder to whiten the signal and again at the decoder to re-apply the spectral shape of the target speech signal.     One advantage of this type of filtering is that the location of the linear predictors spectral peaks is entirely determined by the target signal, and can be as precise as allowed by the time period to be filtered. This is in contrast with vocoders realized using fixed-width filter banks, where spectral peaks can generally only be determined to be within the scope of a given frequency band. LP filtering also has disadvantages in that signals with a large number of constituent frequencies may exceed the number of frequencies that can be represented by the linear prediction filter. This restriction is the primary reason that LP coding is almost always used in tandem with other methods in high-compression voice coders.       Waveform-interpolative vocoder was developed in AT & T ": null
    },
    {
        "Bell Laboratories": "bell laboratories"
    },
    {
        " around 42 by W.B. Kleijn, and subsequently a low- complexity version was developed by AT & T for the DoD secure vocoder competition. Notable enhancements to the WI coder were made at the ": null
    },
    {
        "University of California, Santa Barbara": "university of california, santa barbara"
    },
    {
        ". AT & T holds the core patents related to WI, and other institutes hold additional patents. Using these patents as a part of WI coder implementation requires licensing from all IPR holders.                                 For ": null
    },
    {
        "music": "music"
    },
    {
        "al applications, a source of musical sounds is used as the carrier, instead of extracting the fundamental frequency. For instance, one could use the sound of a ": null
    },
    {
        "synthesizer": "synthesizer"
    },
    {
        " as the input to the filter bank, a technique that became popular in the 42s.       ": null
    },
    {
        "Werner Meyer-Eppler": "werner meyer-eppler"
    },
    {
        ", a German scientist with a special interest in electronic voice synthesis, published a thesis in 42 on ": null
    },
    {
        "electronic music": "electronic music"
    },
    {
        " and ": null
    },
    {
        "speech synthesis": "speech synthesis"
    },
    {
        " from the viewpoint of ": null
    },
    {
        "sound synthesis": "sound synthesis"
    },
    {
        ".  Later he was instrumental in the founding of the ": null
    },
    {
        "Studio for Electronic Music": "studio for electronic music"
    },
    {
        " of ": null
    },
    {
        "WDR": "westdeutscher rundfunk"
    },
    {
        " in Cologne, in 42         One of the first attempts to use a vocoder in creating music was the Siemens Synthesizer at the Siemens Studio for Electronic Music, developed between 42 and 42       Details of the Siemens Electronic Music Studio, exhibited at the ": null
    },
    {
        "Deutsches Museum": "deutsches museum"
    },
    {
        ".     In 42 ": null
    },
    {
        "Robert Moog": "robert moog"
    },
    {
        " developed one of the first ": null
    },
    {
        "solid-state": "solid state"
    },
    {
        " musical vocoders for the electronic music studio of the ": null
    },
    {
        "University at Buffalo": "university at buffalo, the state university of new york"
    },
    {
        ".      In 42 ": null
    },
    {
        "Bruce Haack": "bruce haack"
    },
    {
        " built a prototype vocoder, named Farad after ": null
    },
    {
        "Michael Faraday": "michael faraday"
    },
    {
        ".  It was first featured on The Electronic Record For Children released in 42 and then on his rock album  The Electric Lucifer  released in 42     A sample of earlier Vocoder.     In 42 ": null
    },
    {
        "Wendy Carlos": "wendy carlos"
    },
    {
        " and ": null
    },
    {
        "Robert Moog": "robert moog"
    },
    {
        " built another musical vocoder, a ten-band device inspired by the vocoder designs of ": null
    },
    {
        "Homer Dudley": "homer dudley"
    },
    {
        ". It was originally called a spectrum encoder-decoder, and later referred to simply as a vocoder. The carrier signal came from a Moog ": null
    },
    {
        "modular synthesizer": "modular synthesizer"
    },
    {
        ", and the modulator from a ": null
    },
    {
        "microphone": "microphone"
    },
    {
        " input. The output of the ten-band vocoder was fairly intelligible, but relied on specially articulated ": null
    },
    {
        "speech": "speech communication"
    },
    {
        ". Later improved vocoders use a high-pass filter to let some ": null
    },
    {
        "sibilance": "sibilant consonant"
    },
    {
        " through from the microphone; this ruins the device for its original speech-coding application, but it makes the talking synthesizer effect much more intelligible.     ": null
    },
    {
        "Phil Collins": "phil collins"
    },
    {
        " used a vocoder to provide a vocal effect for his 42 international hit single ": null
    },
    {
        "In the Air Tonight": "in the air tonight"
    },
    {
        " .      Vocoders have appeared on pop recordings from time to time, most often simply as a ": null
    },
    {
        "special effect": "special effect"
    },
    {
        " rather than a featured aspect of the work. However, many experimental electronic artists of the ": null
    },
    {
        "new-age music": "new-age music"
    },
    {
        " genre often utilize vocoder in a more comprehensive manner in specific works, such as ": null
    },
    {
        "Jean Michel Jarre": "jean michel jarre"
    },
    {
        "  and ": null
    },
    {
        "Mike Oldfield": "mike oldfield"
    },
    {
        " .     Vocoder module and use by M. Oldfield can be clearly seen on his Live At Montreux 42 DVD .     There are also some artists who have made vocoders an essential part of their music, overall or during an extended phase. Examples include the German ": null
    },
    {
        "synthpop": "synthpop"
    },
    {
        " group ": null
    },
    {
        "Kraftwerk": "kraftwerk"
    },
    {
        ", ": null
    },
    {
        "Stevie Wonder": "stevie wonder"
    },
    {
        " and jazz/fusion keyboardist ": null
    },
    {
        "Herbie Hancock": "herbie hancock"
    },
    {
        " during his late 42s period. In 42 ": null
    },
    {
        "Neil Young": "neil young"
    },
    {
        " used a Sennheiser Vocoder VSM42 on six of the nine tracks on  Trans .  Perhaps the most heard, yet often unrecognized, example of the use of a vocoder in popular music, is on ": null
    },
    {
        "Michael Jackson": "michael jackson"
    },
    {
        "s 42 album  Thriller , in the song ": null
    },
    {
        "P.Y.T. ": "p.y.t."
    },
    {
        " . During the first few seconds of the song, the background voicings ooh-ooh, ooh, ooh , behind his spoken words, exemplify the heavily modulated sound of his voice through a Vocoder.  The bridge features a vocoder as well , courtesy of session musician ": null
    },
    {
        "Michael Boddicker": "michael boddicker"
    },
    {
        ".     ": null
    },
    {
        "Coldplay": "coldplay"
    },
    {
        " have used a vocoder in some of their songs. For example, in ": null
    },
    {
        "Major Minus": "major minus"
    },
    {
        " and ": null
    },
    {
        "Hurts Like Heaven": "hurts like heaven"
    },
    {
        " , both from the album  Mylo Xyloto  , ": null
    },
    {
        "Chris Martin": "chris martin"
    },
    {
        "s vocals are mostly vocoder-processed. ": null
    },
    {
        "Midnight": "midnight"
    },
    {
        " , from  Ghost Stories  , also features Martin singing through a vocoder.  The hidden track X Marks The Spot from ": null
    },
    {
        "A Head Full of Dreams": "a head full of dreams"
    },
    {
        " has also been recorded through a vocoder.     Noisecore band ": null
    },
    {
        "Atari Teenage Riot": "atari teenage riot"
    },
    {
        " have used vocoders in variety of their songs and live performances such as ": null
    },
    {
        "Live at the Brixton Academy": "live at brixton academy"
    },
    {
        " alongside other digital audio technology both old and new.     Red Hot Chili Peppers song By the Way uses a vocoder effect on Anthony Kiedis vocals.     Among the most consistent uses of vocoder in emulating the human voice are ": null
    },
    {
        "Daft Punk": "daft punk"
    },
    {
        ", who have used this instrument from their first album  Homework  to their latest work  Random Access Memories  and consider the convergence of technological and human voice the identity of their musical project .  For instance, the lyrics of ": null
    },
    {
        "Around the World": "around the world"
    },
    {
        " are integrally vocoder-processed, ": null
    },
    {
        "Get Lucky": "get lucky"
    },
    {
        " features a mix of natural and processed human voices, and ": null
    },
    {
        "Instant Crush": "instant crush"
    },
    {
        " features ": null
    },
    {
        "Julian Casablancas": "julian casablancas"
    },
    {
        " singing into a vocoder.            Robot voices became a recurring element in popular music during the 42th century. Apart from vocoders, several other methods of producing variations on this effect include: the ": null
    },
    {
        "Sonovox": "sonovox"
    },
    {
        ", ": null
    },
    {
        "Talk box": "talk box"
    },
    {
        ", and ": null
    },
    {
        "Auto-Tune": "auto-tune"
    },
    {
        ",    A sample of ": null
    },
    {
        "Auto-Tune": "auto-tune"
    },
    {
        " effect . linear prediction vocoders, ": null
    },
    {
        "speech synthesis": "speech synthesis"
    },
    {
        ",    A sample of earlier computer based ": null
    },
    {
        "speech synthesis": "speech synthesis"
    },
    {
        " and song synthesis, by ": null
    },
    {
        "John Larry Kelly, Jr.": "john larry kelly, jr."
    },
    {
        " and ": null
    },
    {
        "Louis Gerstman": "louis gerstman"
    },
    {
        " at ": null
    },
    {
        "Bell Labs": "bell labs"
    },
    {
        ", using ": null
    },
    {
        "IBM 42": "ibm 704"
    },
    {
        " computer. The demo song “": null
    },
    {
        "Daisy Bell": "daisy bell"
    },
    {
        "”, musical accompanied by ": null
    },
    {
        "Max Mathews": "max mathews"
    },
    {
        ", impressed ": null
    },
    {
        "Arthur C. Clarke": "arthur c. clarke"
    },
    {
        " and later he used it in the climactic scene of the screenplay for his novel  42: A Space Odyssey .    A sample of ": null
    },
    {
        "speech synthesis": "speech synthesis"
    },
    {
        ". ": null
    },
    {
        "ring modulation": "ring modulation"
    },
    {
        " and ": null
    },
    {
        "comb filter": "comb filter"
    },
    {
        ".        Vocoders are used in ": null
    },
    {
        "television production": "television production"
    },
    {
        ", ": null
    },
    {
        "filmmaking": "filmmaking"
    },
    {
        " and games, usually for robots or talking computers.   The robot voices of the ": null
    },
    {
        "Cylons": "cylon"
    },
    {
        " in  Battlestar Galactica  were created with an EMS Vocoder 42 The ": null
    },
    {
        "42 version": "doctor who themehistory1980s"
    },
    {
        " of the  Doctor Who  theme, as arranged and recorded by ": null
    },
    {
        "Peter Howell": "peter howell"
    },
    {
        ", has a section of the main melody generated by a Roland SVC42 Vocoder. A vocoder was also used to create the iconic voice of ": null
    },
    {
        "Soundwave": "soundwave"
    },
    {
        ", a character from the ": null
    },
    {
        "Transformers": "transformers"
    },
    {
        " series.     In 42 the ": null
    },
    {
        "Supermarionation": "supermarionation"
    },
    {
        " series  Captain Scarlet and the Mysterons  It was used in the closing credits theme of the first 42 episodes to provide the repetition of the words Captain Scarlet .     In 42 ": null
    },
    {
        "Isao Tomita": "isao tomita"
    },
    {
        "s first ": null
    },
    {
        "electronic music": "electronic music"
    },
    {
        " album Electric Samurai: Switched on Rock was an early attempt at applying ": null
    },
    {
        "speech synthesis": "speech synthesis"
    },
    {
        " technique  in ": null
    },
    {
        "electronic rock": "electronic rock"
    },
    {
        " and ": null
    },
    {
        "pop music": "electropop"
    },
    {
        ". The album featured electronic renditions of contemporary ": null
    },
    {
        "rock": "rock music"
    },
    {
        " and ": null
    },
    {
        "pop": "pop music"
    },
    {
        " songs, while utilizing synthesized voices in place of human voices. In 42 he utilized synthesized voices in his popular ": null
    },
    {
        "classical music": "classical music"
    },
    {
        " album  Snowflakes are Dancing , which became a worldwide success and helped to popularize electronic music. ": null
    },
    {
        "Emerson, Lake and Palmer": "emerson, lake and palmer"
    },
    {
        " used it for the album  Brain Salad Surgery  . ": null
    }
]