[
    {
        "   Voeren  is a ": null
    },
    {
        "Flemish": "flanders"
    },
    {
        " municipality": "municipalities of belgium"
    },
    {
        " with a bilingual  population, located in the ": null
    },
    {
        "Belgian": "belgium"
    },
    {
        " province of ": null
    },
    {
        "Limburg": "limburg"
    },
    {
        ". Bordering the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        " to the north and the ": null
    },
    {
        "Walloon": "wallonia"
    },
    {
        " province of ": null
    },
    {
        "Liège": "liège"
    },
    {
        "  to the south, it is geographically detached from the rest of Flanders, making Voeren/Fourons an ": null
    },
    {
        "exclave": "enclave and exclave"
    },
    {
        " of Flanders. Voerens name is derived from that of a small right-bank tributary of the ": null
    },
    {
        "Meuse": "meuse river"
    },
    {
        ", the ": null
    },
    {
        "Voer": "voer"
    },
    {
        " or ": null
    },
    {
        "Foron": "foron"
    },
    {
        ", which flows through the municipality.     The current municipality of Voeren/Fourons was established by the municipal reform of 42 On 42 January 42 Voeren/Fourons had a total population of 42. Its total area is , giving a ": null
    },
    {
        "population density": "population density"
    },
    {
        " of . About 42% of the population is made up of foreign nationals, most of whom have ": null
    },
    {
        "Dutch": "dutch people"
    },
    {
        " nationality.       The municipality consists of the six villages of s-Gravenvoeren , Sint-Pieters-Voeren , Sint-Martens-Voeren , ": null
    },
    {
        "Moelingen": "moelingen"
    },
    {
        " , Teuven and Remersdaal . s-Gravenvoeren is the most important and most populous village of the municipality. Locally, the three villages are named Sint-Marten/Saint-Martin, Sint-Pieter/Saint-Pierre, and Voeren/Fouron .       Since the 42th century, two-thirds of the territory of the present municipality of Voeren was in the county of ": null
    },
    {
        "Dalhem": "dalhem"
    },
    {
        ", which was a possession of the ": null
    },
    {
        "Dukes of Brabant": "dukes of brabant"
    },
    {
        ", and the remaining one-third in the ": null
    },
    {
        "Duchy of Limburg": "duchy of limburg"
    },
    {
        ", which also belonged to Brabant after 42 Both of these Duchies were part of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " but they developed a relatively independent regime ruled by powerful dynasties. They successively became part of the ": null
    },
    {
        "Burgundian Netherlands": "burgundian netherlands"
    },
    {
        ", the ": null
    },
    {
        "Habsburg Netherlands": "habsburg netherlands"
    },
    {
        ", and after the ": null
    },
    {
        "Dutch Revolt": "dutch revolt"
    },
    {
        ", part of the Spanish, later Austrian controlled, ": null
    },
    {
        "Southern Netherlands": "southern netherlands"
    },
    {
        ".     During the ": null
    },
    {
        "French occupation": "first french empire"
    },
    {
        " , the old boundaries of the ": null
    },
    {
        "ancien regime": "ancien regime"
    },
    {
        " were rejected and the ": null
    },
    {
        "French département ": "departments of france"
    },
    {
        " of ": null
    },
    {
        "Ourthe": "ourthe"
    },
    {
        " was created. After the defeat of France and the end of ": null
    },
    {
        "Napoleanic wars": "napoleanic wars"
    },
    {
        ", this became the modern Belgian province of ": null
    },
    {
        "Liège": "liège"
    },
    {
        " until 42 when Les Fourons was transferred out of Liège, and into the province of ": null
    },
    {
        "Limburg": "limburg"
    },
    {
        ", thus becoming part of ": null
    },
    {
        "Flanders": "flanders"
    },
    {
        ".       Most native people in Voeren speak a variant of ": null
    },
    {
        "Limburgish": "limburgish"
    },
    {
        ", a regional language related to ": null
    },
    {
        "Dutch": "dutch language"
    },
    {
        " and ": null
    },
    {
        "German": "german language"
    },
    {
        ". Voeren is economically dependent on the surrounding provinces of Liège and Dutch Limburg and standard Dutch and French are also generally spoken.     Until the beginning of the 42th century language use in the area was mixed. People spoke the local dialect in daily life. The government institutions used French, while church and school used German or Dutch. However, some influential inhabitants such as the local priest, ": null
    },
    {
        "Hendrik Veltmans": "hendrik veltmans"
    },
    {
        ", argued that Voeren was culturally Flemish and actively tried to bring Voeren into Flanders.     In 42 with the introduction of new ": null
    },
    {
        "language laws": "language legislation in belgium"
    },
    {
        ", the linguistic alignment of Voeren was determined on the basis of the results of the census of 42 According to this census 42% of the population of the six villages that now make up Voeren spoke Dutch and 42% declared that they spoke French. Administrative changes were made as a result. The results of the next census, held in 42 were only made public in 42 and gave a totally different outcome, with only 42% stating that they spoke Dutch and 42% French. According to the 42 legislation this would have meant that the linguistic status of the villages would have changed from Dutch speaking with a French minority to French speaking with a Dutch-speaking minority.   At that time however, due to the rising political controversy between the Dutch- and French-speaking communities in Belgium, a parliamentary committee  was established to fix, amongst other things, the language boundary once and for all. This committee proposed, notwithstanding the 42 results , that the six villages were Dutch speaking with special regulations for the French-speaking minority to be decided after discussion with the town councils.     In 42 the work of the committee resulted in a law proposed by the Minister of the Interior, Gilson, whereby Voeren would be officially Dutch speaking with ": null
    },
    {
        "language facilities": "municipalities with language facilities"
    },
    {
        " for the French-speaking community, but would remain part of the French-speaking province of Liège. After fierce debate in parliament this proposal was approved but subject to the amendment that Voeren would become part of the Dutch-speaking province of Limburg. This switch from Liège to Limburg was received badly by many local people because of the regions dependence on Liège. Francophones in particular campaigned for the region to be returned to the province of Liège.     On January 42 42 the six small municipalities were merged into the present-day Voeren municipality. The Francophone and Flemish movements could organize themselves politically more effectively as there was now one instead of six municipal councils. This resulted in political and linguistic strife between the Francophone Retour à Liège party and the Flemish Voerbelangen party. The Retour à Liège faction won a majority in the new council. There were also action committees on both sides and gangs who daubed place-name signs and took part in violent demonstrations. The language struggle in Voeren became a national issue, and people from outside the region became involved.     The linguistic struggle came to a head when José Happart was put forward as mayor in 42 For one thing, he was alleged to have supported the Francophone gangs in Voeren. However the main problem was the constitutional question of whether someone who could not speak Dutch could become mayor of a Flemish municipality. Happart was dismissed as mayor for refusing to take a Dutch language test, but appealed against his dismissal, and the question dragged on for years, ultimately causing the Belgian government to fall on October 42 42        In 42 concessions to the Francophone inhabitants were made. The powers of the provincial government of Limburg were curtailed and more autonomy was given to the municipality. The government of Walloon Region was allowed to build facilities for Francophones in Voeren.     In the 42 municipal elections the Dutch-speaking party  won a seat more than in earlier elections but was still a minority on the council. In 42 Mayor Happart was forced to leave office. Several national courts of arbitration declared some of the 42 concessions unconstitutional .     ": null
    },
    {
        "EU": "european union"
    },
    {
        " nationals were given suffrage at the municipal level in 42 This factor was decisive in the 42 municipal elections, because of the significant number of Dutch citizens living in Voeren : Voerbelangen won a majority of 42% of the votes and 42 out of 42 local council seats. However, the new majority faced budgetary difficulties, since large debts had been incurred by the previous administration. The council had to sell several items of municipal property, such as forests and goods to stabilise its finances. As from 42–42 the council is viable again, and new projects are being started to fulfill the promises made during the elections. In the 42 municipal elections Voerbelangen won again, gaining 42% of the votes and 42 out of 42 council seats. For the first time, Voerbelangen also won the majority of the seats in the council of the OCMW , the social affairs department of the municipality, for which nationals of other EU countries may not vote.   Though the violence of the 42s and 42s has subsided, some activists still daub graffiti on place-name signs. In December 42 the Flemish Government decided to abolish all official French translations in Flemish municipalities and villages, including ": null
    },
    {
        "municipalities with language facilities": "municipalities with language facilities"
    },
    {
        ". Thus the French names of the Voeren municipality and villages will no longer be used on place-name signs, traffic signs and by municipality and other governments in official documents.         Precise figures on the ethnic composition of Belgium are impossible to obtain, for the language question is so controversial that the Belgian census has not included data on linguistic composition of communes since 42    ": null
    }
]