[
    {
        "         Voorhout  is a village and former municipality in the western ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", in the province of ": null
    },
    {
        "South Holland": "south holland"
    },
    {
        ". The former municipality covered an area of 42  km² of which 42  km² is covered by water, and had a population of 42 in 42 Together with ": null
    },
    {
        "Sassenheim": "sassenheim"
    },
    {
        " and ": null
    },
    {
        "Warmond": "warmond"
    },
    {
        ", it became part of the ": null
    },
    {
        "Teylingen": "teylingen"
    },
    {
        " municipality on January 42 42 Voorhout is located in an area called the Dune and Bulb Region .     It also included the communities of ": null
    },
    {
        "Piet Gijzenbrug": "piet gijzenbrug"
    },
    {
        " and ": null
    },
    {
        "Teijlingen": "teijlingen"
    },
    {
        " with the ": null
    },
    {
        "Slot Teylingen": "slot teylingen"
    },
    {
        ".              In 42 Voorhout celebrated its 42th anniversary. A letter mentioning Voorhout from 42 had been preserved. This letter states that count ": null
    },
    {
        "Dirk II of Holland": "dirk ii, count of holland"
    },
    {
        " granted the church of “Foranholte” to the ": null
    },
    {
        "Egmond Abbey": "egmond abbey"
    },
    {
        ". The second part of the name –holte or –hout is a reference to the dune area that was supposedly very wooded at the time. Settlements arose around this area, and Voorhout arose in front of a forest. The nearby ": null
    },
    {
        "Noordwijkerhout": "noordwijkerhout"
    },
    {
        " also refers to this forest, just like ": null
    },
    {
        "Holland": "holland"
    },
    {
        ", which is a degeneration of Holtland, meaning woodland.     The area was inhabited far before 42 with ": null
    },
    {
        "Roman": "roman empire"
    },
    {
        " coins from around 42 years ago having been found. In 42 at the Rijnsburgerweg a farmer found 42 bronze axes and 42 chisel, about 42 years old. They are now on display in the ": null
    },
    {
        "Rijksmuseum van Oudheden": "rijksmuseum van oudheden"
    },
    {
        " in ": null
    },
    {
        "Leiden": "leiden"
    },
    {
        ".     Since 42 the nobles of Teylingen take an important role in the area. In the ": null
    },
    {
        "Slot Teylingen": "slot teylingen"
    },
    {
        " Dutch counts regularly meet. The most important inhabitant of the castle was ": null
    },
    {
        "Jacoba van Beieren": "jacoba van beieren"
    },
    {
        ". Voorhout still remained a small settlement. In 42 there were only 42 recorded houses in Voorhout.     In 42 the ": null
    },
    {
        "Leidsevaart": "leidsevaart"
    },
    {
        " was dug. It was a canal going from ": null
    },
    {
        "Haarlem": "haarlem"
    },
    {
        " to ": null
    },
    {
        "Leiden": "leiden"
    },
    {
        ". Because of this Voorhout started to grow slowly. In 42 the train track Haarlem-Leiden was opened and Voorhout got two stops, Station Piet Gijzenbrug in the hamlet of Piet Gijzenbrug near Noordwijk, and another called Station Voorhout. In 42 Voorhout has about 42 inhabitants. Until ": null
    },
    {
        "World war 42": "world war 2"
    },
    {
        " the main source of income in Voorhout was from the flower bulb industry. After 42 both train stations in Voorhout get closed for passenger transport and roads are constructed.     In 42 about 42 people lived in Voorhout and in 42 that number grew to 42 The fast growth is caused by the new neighbourhood Oosthout. In 42 Voorhout gets a ": null
    },
    {
        "train station": "voorhout railway station"
    },
    {
        " again. Because of the construction of new neighborhoods the population grew very much. On January 42 42 Voorhout counts 42 inhabitants. Today only a small amount of the population still works in bulb cultivation. Most inhabitants work outside of Voorhout. On January 42 42 the municipalities of Voorhout, ": null
    },
    {
        "Warmond": "warmond"
    },
    {
        " and ": null
    },
    {
        "Sassenheim": "sassenheim"
    },
    {
        " merge to form the new municipality called ": null
    },
    {
        "Teylingen": "teylingen"
    },
    {
        " to the dismay of some of the inhabitants.         ": null
    },
    {
        "Herman Boerhaave": "herman boerhaave"
    },
    {
        " , botanist, humanist and physician of European fame   ": null
    },
    {
        "Edwin van der Sar": "edwin van der sar"
    },
    {
        " , football player   ": null
    },
    {
        "Rob van Dijk": "rob van dijk"
    },
    {
        " , football player       ": null
    },
    {
        "Jacqueline of Bavaria": "jacqueline of bavaria"
    },
    {
        " , Countess of Holland, lived for a few years in Slot Teylingen   ": null
    },
    {
        "Carlo lAmi": "carlo lami"
    },
    {
        ", old football player and later goalkeepers trainer by AFC Ajax, in Amsterdam   Joris Schouten , politician   Chiara Tissen , actress and writer   E.M. Uhlenbeck , linguist   ": null
    },
    {
        "Truus van Aalten": "truus van aalten"
    },
    {
        " , actress, she ran a souvenir import/export business in Voorhout after 42 after the Nazis ended her career as a film comedian in Germany   ": null
    },
    {
        "Marco van Basten": "marco van basten"
    },
    {
        ", former football player and later a coach at AFC Ajax, SC Heerenveen and AZ Alkmaar   ": null
    },
    {
        "Frank van Borssele": "frank van borssele"
    },
    {
        " , Stadholder of Holland and Zeeland provinces, Count of Oostervant, fourth husband of Jacoba van Beieren, lived for a few years in Slot Teylingen   ": null
    },
    {
        "Edwin van der Sar": ":nl:edwin van der sar"
    },
    {
        " , goalkeeper for AFC Ajax, Juventus, Fulham, Manchester United and the National team, started career at VV Foreholte       Teylingen Castle, in Dutch: ": null
    },
    {
        "Slot Teylingen": ":nl:slot teylingen"
    },
    {
        "   The Boerhaave House, in Dutch:    Small Church, in Dutch: ": null
    },
    {
        "Kleine Kerk": ":nl:kleine kerk"
    },
    {
        "   Saint-Bartholomew Church , in Dutch: ": null
    },
    {
        "Sint-Bartholomeüskerk ": ":nl:sint-bartholomeüskerk"
    },
    {
        " Poldermolen Hoop Doet Leven": ":nl:hoop doet leven"
    },
    {
        "   Tulipland Panorama, in Dutch:    The Hooghkamer Farm, in Dutch:    Rijnoord Farm, in Dutch:    Klein Bouwlust Farm, in Dutch:    Noordhout Farm, in Dutch: ": null
    },
    {
        "Noordhout": ":nl:noordhout"
    },
    {
        "         VV Foreholte, football club   h.v. Foreholte, handball club   MHC Voorhout, hockey club   SV Voorhout, tennis club   TV Voorhout, tennis club   De Columbiaan, swimming club   Forwodians, basketball club   Bacluvo, badminton club   Inspiration, majorets and twirl club       Sint Cecilia, Roman Catholic music organisation                          ": null
    }
]