[
    {
        "Vorden is a former ": null
    },
    {
        "municipality": "municipality"
    },
    {
        " and a town in the eastern ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", about 42 kilometres south-east of Zutphen. On 42 January 42 the municipality merged with Hummelo en Keppel, Steenderen, Hengelo en Zelhem, to form the new municipality ": null
    },
    {
        "Bronckhorst": "bronckhorst"
    },
    {
        ".     Vorden is intersected by the road from ": null
    },
    {
        "Zutphen": "zutphen"
    },
    {
        " to ": null
    },
    {
        "Ruurlo": "ruurlo"
    },
    {
        " and by the Baak creek , which flows to the IJssel. Vorden is located on the Zutphen - Winterswijk railway line, which was opened in 42 and has a central station on the station road.       The name Vorden occurred for the first time in documents from 42 AD. The town has long had a predominantly agricultural function. At the end of the 42th and beginning of the 42th century this started to change, when some industry and self-employed started to flourish.     Vorden is known for its eight castles: Vorden , Onstein, Medler, Hackfort, Kieftskamp, Wierse, Wildenborg and Den Bramel.     The surrounding area of Vorden is known to hold equestrian events periodically including an annual fox hunt, now replaced by ": null
    },
    {
        "drag hunting": "drag hunting"
    },
    {
        ", in late autumn.       In the Middle Ages Vorden originated on a deck area located on the Vordensche brook, close to house Vorden. The village probably owes its name to the word Voorde, which means ford. In 42 it became an independent parish. Until 42 Vorden was an independent municipality, but as a result of a municipal reorganisation, on 42 January of that year, Vorden merged with the neighboring municipalities of Hummelo and Keppel, Steenderen, Hengelo and Zelhem to form the municipality of Bronckhorst. Other centers in the former municipality were Delden, Kranenburg, Linde, Medler, Mossel, Veldwijk, Vierakker, Wichmond, Wientjesvoort and Wildenborch.     In 42 the centre of Vorden was redesigned, with a number of roads being moved and in some places the pavements were also made wider. In addition, trees have been planted and a new parking lot has been laid out for long-term parkers.       Vorden is best known for the eight castles it has, making it one of the most castles-rich villages in the Netherlands. House Vorden is on the outskirts of the village, the other seven are in a circle around it.     House Vorden was first mentioned in 42 In 42 during the Eighty Years War, it was looted and restored thirty years later. In 42 it was restored and functioned as a town hall. In 42 the municipality of Vorden sold the castle to a private individual. Since then the castle has been used as a wedding location.     Hackfort Castle was first mentioned in 42 After being partially destroyed by a fire in 42 during the Eighty Years War, it was rebuilt. The current façade in Louis XVI style got it in 42 Nowadays it is divided into apartments.     Castle Den Bramel of the version mentioned for the first time in 42 and that from about 42 little more remains; the current building dates largely from the period 4242     The Kieftskamp Castle in Louis XV style, was erected in 42 In 42 and 42 it was expanded.     The Wildenborch Castle is a former manor, first mentioned in 42 After devastation in 42 it was rebuilt between 42 and 42 In the 42th century it was largely demolished. The remaining gate tower became part of a new country house built in 42 The son of the clients was the poet Anthony Staring, who lived there from 42 to 42 The rebuilding of 42 was undone in 42     De Wiersse Castle was first mentioned in 42 In the meantime, it was rebuilt in 42 In the 42th century and in 42 it underwent renovations.     Castle Onstein, in Louis XIV style, was built in 42 on a spot where a mansion from 42 had previously stood. Nowadays in the possession of Hans Melchers.     The Medler Castle, is a mansion dating from the 42th century, which was later renovated several times.     The Enzerinck Castle, is a neoclassical country house built in 4242 The Wientjesvoort dating from 42 has the same style.       Shops and Supermarkets: The majority of the stores can be found at the Dorpsstraat, Zutphenseweg, Burgemeester Galleestraat and the Raadhuisstraat. There are several supermarkets, drug stores and clothing stores.     Weekly market: Every week a market takes place on Friday morning in the center of Vorden, around the N.H. Church. The weekly market includes fish stalls, bakers stalls, and food stalls / sellers.     Schools: Vorden has five primary schools: the Dorpsschool , the Vordering , the Hoge and the Kraanvogel . Since autumn 42 the Hofakker has been added, for education on an anthroposophical basis. Vorden also has secondary school t Beeckland ; this is part of the Ulenhof College in Doetinchem.         The eight-castle route is 42 kilometers in total and there are eight castles on the way.   The Berend Route, a bike ride of about 42 kilometers around Vorden.   The Pieterpad runs through Vorden. The route leads from Pieterburen on the Groningen Wadden Sea coast to the Sint-Pietersberg near Maastricht.   The Trekvogelpad  ": null
    },
    {
        "Henrica Iliohan": "henrica iliohan"
    },
    {
        " , suffragist                                 ": null
    }
]