[
    {
        "Vordingborg is a municipality  in the ": null
    },
    {
        "Sjælland Region": "sjælland region"
    },
    {
        ", which is on the southeast coast of the island of Zealand  in south ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        ". It was established in 42 The municipality includes the island of ": null
    },
    {
        "Masnedø": "masnedø"
    },
    {
        ", and covers an area of 42 km². It has a total population of 42 . Its second and current mayor is Knud Larsen of the agrarian-liberal ": null
    },
    {
        "Venstre": "venstre"
    },
    {
        " party, who was elected in 42 replacing Henrik Holmer of the Social Democrats.     The municipality takes its name from the ": null
    },
    {
        "town of the same name": "vordingborg"
    },
    {
        ".       The ": null
    },
    {
        "Masnedsund Bridge": "masnedsund bridge"
    },
    {
        " connects the town of Vordingborg to the island of Masnedø. The ": null
    },
    {
        "Storstrøm Bridge": "storstrøm bridge"
    },
    {
        " connects Masnedø to the neighboring municipality of ": null
    },
    {
        "Guldborgsund": "guldborgsund municipality"
    },
    {
        " on Falster near the town of Orehoved. The bridge is 42 meters long and supports two lanes of traffic and a single-track railway. It was inaugurated in 42     The ": null
    },
    {
        "Farø Bridges": "farø bridges"
    },
    {
        " opened in 42 and connect the two municipalities from the town of Bakkebølle Strand over ": null
    },
    {
        "Farø": "farø"
    },
    {
        " island  to Falster near the town of Sortsøgab. ": null
    },
    {
        "Bogø": "bogø"
    },
    {
        " island is also part of the municipality.     As part of ": null
    },
    {
        "wider municipal reforms": "municipalities of denmarkmunicipal reform 2007"
    },
    {
        ", an earlier Vordingborg municipality was merged with its neighboring municipalities of ": null
    },
    {
        "Langebæk": "langebæk"
    },
    {
        ", ": null
    },
    {
        "Møn": "møn"
    },
    {
        ", and ": null
    },
    {
        "Præstø": "præstø"
    },
    {
        " on 42 January 42 forming the enlarged Vordingborg Municipality.     Around 42 km east of Vordingborg municipality across the ": null
    },
    {
        "Baltic Sea": "baltic sea"
    },
    {
        " is ": null
    },
    {
        "Bornholm": "bornholm regional municipality"
    },
    {
        ", the easternmost municipality of ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        ", which is a part of the ": null
    },
    {
        "Capital Region": "region hovedstaden"
    },
    {
        " of Denmark.     For the location of Vordingborg municipality relative to its neighbors, see the location diagram at the bottom of the corresponding article on Danish language Wikipedia, ": null
    },
    {
        "Vordingborg Kommune": ":da:vordingborg kommune"
    },
    {
        ".       The ten largest urban areas in the municipality are:   ": null
    }
]