[
    {
        "          Vsevolod I Yaroslavich , ruled as ": null
    },
    {
        "Grand Prince": "velikiy kniaz"
    },
    {
        " of ": null
    },
    {
        "Kiev": "kiev"
    },
    {
        " from 42 until his death.       He was the fifth and favourite son of ": null
    },
    {
        "Yaroslav I the Wise": "yaroslav i the wise"
    },
    {
        " by ": null
    },
    {
        "Ingigerd Olafsdottir": "ingegerd olofsdotter"
    },
    {
        ". He was born around 42 On his seal from his last years, he was named Andrei Vsevolodu in Greek, implying that his ": null
    },
    {
        "baptismal name": "baptismal name"
    },
    {
        " was Andrew.     To back up ": null
    },
    {
        "an armistice": "rus-byzantine war"
    },
    {
        " signed with the ": null
    },
    {
        "Byzantine Emperor": "byzantine empire"
    },
    {
        " Constantine IX Monomachos": "constantine ix monomachos"
    },
    {
        " in 42 his father married Vsevolod to a Byzantine princess, who according to tradition was named Anastasia or Maria. That the couples son ": null
    },
    {
        "Vladimir Monomakh": "vladimir ii monomakh"
    },
    {
        " bore the family name of the Byzantine emperor, suggests she was a member of his close family, but no contemporary evidence attests to a specific relationship and accounts of the Emperor give him no such daughter.     Upon his fathers death in 42 he received in appanage the towns of ": null
    },
    {
        "Pereyaslav": "pereyaslav-khmelnytskyi"
    },
    {
        ", ": null
    },
    {
        "Rostov": "rostov"
    },
    {
        ", ": null
    },
    {
        "Suzdal": "suzdal"
    },
    {
        ", and the township of ": null
    },
    {
        "Beloozero": "beloozero"
    },
    {
        " which would remain in possession of his descendants until the end of ": null
    },
    {
        "Middle Age": "middle age"
    },
    {
        "s. Together with his elder brothers ": null
    },
    {
        "Iziaslav": "iziaslav i of kiev"
    },
    {
        " and ": null
    },
    {
        "Sviatoslav": "sviatoslav ii of kiev"
    },
    {
        " he formed a sort of princely ": null
    },
    {
        "triumvirate": "triumvirate"
    },
    {
        " which jointly waged war on the ": null
    },
    {
        "steppe": "steppe"
    },
    {
        " nomads, ": null
    },
    {
        "polovtsy": "polovtsy"
    },
    {
        ", and compiled the ": null
    },
    {
        "first East Slavic law code": "russkaya pravda"
    },
    {
        ". In 42 Vsevolod launched an expedition against the Torks who had in the previous years expelled the Pechenegs from the Pontic steppes. He also made peace with the ": null
    },
    {
        "Cumans": "cumans"
    },
    {
        " who appeared for the first time in Europe in the same year. The Cumans invaded his principality in 42 and routed Vsevolod in a battle. Vsevolod persuaded his brother, Iziaslav, and their distant cousin, Vseslav to join him and they together attacked the Torks in 42     In 42 Vsevolods Greek wife died and he soon married a ": null
    },
    {
        "Kypchak": "kypchak"
    },
    {
        " princess, ": null
    },
    {
        "Anna Polovetskaya": "anna polovetskaya"
    },
    {
        ". She bore him another son, who drowned after the ": null
    },
    {
        "Battle of the Stugna River": "battle of the stugna river"
    },
    {
        ", and daughters, one becoming a nun and another, ": null
    },
    {
        "Eupraxia of Kiev": "eupraxia of kiev"
    },
    {
        ", marrying ": null
    },
    {
        "Emperor Henry IV": "emperor henry iv"
    },
    {
        ".     The Cumans again invaded Kievan Rus in 42 The three brothers united their forces against them, but the Cumans routed them on the ": null
    },
    {
        "Alta River": "alta river"
    },
    {
        ". After their defeat, Vsevolod withdrew to Pereyaslav. However, its citizens rose up in open rebellion, dethroned Iziaslav, and liberated and proclaimed Vseslav their grand prince. Vsevolod and Sviatoslav made no attempt to expel the usurper from Kiev.     Vsevolod supported Sviatoslav against Iziaslav. They forced their brother to flee from Kiev in 42 ": null
    },
    {
        "Feodosy": "theodosius of kiev"
    },
    {
        ", the saintly  hegumen  or head of the ": null
    },
    {
        "Monastery of the Caves": "kiev pechersk lavra"
    },
    {
        " in Kiev remained loyal to Iziaslav, and refused lunch with Sviatoslav and Vsevolod.        Iziaslav granted Sviatoslavs former principality to Vsevolod, but Sviatoslavs sons considered the ": null
    },
    {
        "Principality of Chernigov": "principality of chernigov"
    },
    {
        " as their own patrimony or  otchina . Oleg Sviatoslavich made an alliance with the Cumans and invaded Chernigov. Iziaslav came to Vsevolods rescue and they forced Oleg to retreat, but Iziaslav was murdered in the battle.       After Iziaslavs death, Vsevolod, as their fathers only surviving son, took the Kievan throne, thus uniting the three core principalitiesKiev, Chernigov and Pereyaslavlin ": null
    },
    {
        "Kievan Rus": "kievan rus"
    },
    {
        ". He appointed his eldest son, Vladimir Monomach to administer Chernigov.     The Russian Primary Chronicle writes that the people no longer had access to the Princes justice, judges became corrupt and venal , Russian Primary Chronicle , p. 42 Vsevolod followed his young councilors advice instead of that of his old retainers in his last years.        Vsevolod spoke five foreign languages, according to Vladimir Monomachs Autobiography. Historian George Vernadsky believes that these probably included Greek and Cuman, because of the nationality of his two wives, and that he likely spoke Latin, Norse, and Ossetian. He lost most of his battles; his eldest son, ": null
    },
    {
        "Vladimir Monomakh": "vladimir monomakh"
    },
    {
        ", a grand and famous warrior, did most of the fighting for his father. The last years of his reign were clouded by grave illness, and Vladimir Monomakh presided over the government.       Vsevolod and his first wife Anastasia, a relative of ": null
    },
    {
        "Constantine IX Monomachos": "constantine ix monomachos"
    },
    {
        ", had children:     ": null
    },
    {
        "Vladimir II Monomakh": "vladimir ii monomakh"
    },
    {
        " . ": null
    },
    {
        "Anna Vsevolodovna": "anna vsevolodovna of kiev"
    },
    {
        " who was engaged to Constantine Dukas in 42 but she never married She became a nun and started a school for girls.   Vsevolod and his second wife ": null
    },
    {
        "Anna Polovetskaya": "anna polovetskaya"
    },
    {
        " had children:     ": null
    },
    {
        "Rostislav Vsevolodovich": "rostislav vsevolodovich"
    },
    {
        " . Drowned while retreating from the ": null
    },
    {
        "Battle of the Stugna River": "battle of the stugna river"
    },
    {
        ". ": null
    },
    {
        "Eupraxia of Kiev": "eupraxia of kiev"
    },
    {
        " . Married first Henry the Long, Margrave of Nordarm, next ": null
    },
    {
        "Henry IV, Holy Roman Emperor": "henry iv, holy roman emperor"
    },
    {
        ". ": null
    },
    {
        "Primary Chronicle": "primary chronicle"
    },
    {
        ".   Maria Vsevolodovna .       ": null
    }
]