[
    {
        "              Víctor Balaguer i Cirera  was a ": null
    },
    {
        "Spanish": "spaniards"
    },
    {
        " politician": "politician"
    },
    {
        " and author, was born at ": null
    },
    {
        "Barcelona": "barcelona"
    },
    {
        "  on 42 December 42 and was educated at the university of his native city.       His first dramatic essay, Pepín el jorobado, was placed on the Barcelona stage when he was fourteen years of age, and at nineteen he was publicly crowned after the production of his second play, Don Enrique el Dadivoso. From 42 to 42 he was the chief of the Liberal party in Barcelona, and as proprietor and editor of El Conseller did much to promote the growth of ": null
    },
    {
        "Catalan": "catalonia"
    },
    {
        " patriotism. But it was not till 42 that he wrote his first poem in ": null
    },
    {
        "Catalan": "catalan language"
    },
    {
        "--a copy of verses to the Virgin of ": null
    },
    {
        "Montserrat": "montserrat"
    },
    {
        ". He was the author of Historia de Cataluña y de la Corona de Aragón in 42 volumes .     Henceforward he frequently adopted the pseudonym of Lo Trovador de Montserrat ; in 42 he helped to restore the ": null
    },
    {
        "Jocs Florals": "jocs florals"
    },
    {
        " , and in 42 was proclaimed mestre en gay saber. He was removed to ": null
    },
    {
        "Madrid": "madrid"
    },
    {
        ", took a prominent part in political life, and in 42 emigrated to ": null
    },
    {
        "Provence": "provence"
    },
    {
        ".     On the expulsion of Queen ": null
    },
    {
        "Isabella II of Spain": "isabella ii of spain"
    },
    {
        ", he returned to ": null
    },
    {
        "Spain": "spain"
    },
    {
        ", represented ": null
    },
    {
        "Manresa": "manresa"
    },
    {
        " in the Cortes, and in 42—42 was successively minister of the colonies and of finance. He resigned office at the restoration, but finally followed his party in rallying to the dynasty; he was appointed vice-president of Congress, and was subsequently a senator. He died at ": null
    },
    {
        "Madrid": "madrid"
    }
]