[
    {
        "In ": null
    },
    {
        "Norse mythology": "norse mythology"
    },
    {
        ", Völsung  was the son of ": null
    },
    {
        "Rerir": "rerir"
    },
    {
        " and the eponymous ancestor of the ill-fortuned Völsung clan , which includes the well known Norse hero ": null
    },
    {
        "Sigurð": "sigurð"
    },
    {
        ". He was murdered by the ": null
    },
    {
        "Geatish king": "geatish king"
    },
    {
        " Siggeir": "siggeir"
    },
    {
        " and later avenged by one of his sons, ": null
    },
    {
        "Sigmund": "sigmund"
    },
    {
        ", and his daughter ": null
    },
    {
        "Signy": "signy"
    },
    {
        ", who was married to Siggeir.     Völsungs story is recorded in the ": null
    },
    {
        "Völsung Cycle": "völsung cycle"
    },
    {
        ", a series of ": null
    },
    {
        "legend": "legend"
    },
    {
        "s about the clan. The earliest extant versions of the cycle were recorded in ": null
    },
    {
        "medieval": "middle ages"
    },
    {
        " Iceland": "iceland"
    },
    {
        "; the tales of the cycle were expanded with local ": null
    },
    {
        "Scandinavian folklore": "scandinavian folklore"
    },
    {
        ", including that of ": null
    },
    {
        "Helgi Hundingsbane": "helgi hundingsbane"
    },
    {
        " , and form the material of the epic poems in the ": null
    },
    {
        "Elder Edda": "elder edda"
    },
    {
        " and of , which preserves material from lost poems. Völsung is also the subject matter of the ": null
    },
    {
        "Middle High German": "middle high german"
    },
    {
        " epic poem": "epic poem"
    },
    {
        "  and is mentioned as  in the ": null
    },
    {
        "Old English": "old english"
    },
    {
        " epic  Beowulf .       Völsung was the great-grandson of ": null
    },
    {
        "Odin": "odin"
    },
    {
        " himself, and it was Odins consort ": null
    },
    {
        "Frigg": "frigg"
    },
    {
        " who made sure that Völsung would be born. Völsungs parents, who were the king and queen of ": null
    },
    {
        "Hunaland": "hunaland"
    },
    {
        ", could not have any children until the goddess sent them an apple of fertility carried by the giantess ": null
    },
    {
        "Hljod": "hljod"
    },
    {
        ". Völsungs father, ": null
    },
    {
        "Rerir": "rerir"
    },
    {
        ", died shortly after this, but his wife was pregnant for six years, until she had had enough. She commanded that the child be delivered by ": null
    },
    {
        "caesarean section": "caesarean section"
    },
    {
        ", an operation that in those days cost the life of the mother. Völsung was a strong child and he kissed his mother before she died.     He was immediately proclaimed king of Hunaland and when he had grown up he married the same giantess Hljod. Together they had ten sons and one daughter, including the twins ": null
    },
    {
        "Signy": "signy"
    },
    {
        ", their daughter, and ": null
    },
    {
        "Sigmund": "sigmund"
    },
    {
        ", the most courageous and beautiful of their sons.     Völsung built himself a great hall in the centre of which stood a large oak tree called the ": null
    },
    {
        "Barnstokkr": "barnstokkr"
    },
    {
        ". ": null
    },
    {
        "Siggeir": "siggeir"
    },
    {
        ", the ": null
    },
    {
        "King of the Geats": "king of the geats"
    },
    {
        ", soon arrived and proposed to Signy. Both Völsung and his sons approved, but Signy was less enthusiastic.     A great wedding was held in the hall, when suddenly a stranger appeared. He was a tall old man with only one eye and could not be anyone but ": null
    },
    {
        "Odin": "odin"
    },
    {
        ". He went to the oak tree, took his sword and stuck it deep into the trunk. Odin told everyone that the sword was meant for the man who could pull the sword from the oak tree. Then he vanished.     Everyone at the wedding tried to pull the sword but only Sigmund succeeded, and he did so effortlessly. Siggeir, his brother-in-law, offered thrice its weight in gold for the sword, but Sigmund scornfully said no. This greatly angered Siggeir, and he swore that one day the sword would be his and he would be avenged on the Völsung family. He returned home the next day, ending the wedding feast early. Before he left he invited the Völsungs to conclude the feast with him when the winter had passed.     Three months later Völsung and his sons sailed to Siggeirs land. They were met by Signy, who warned them that Siggeir intended to ambush them. They refused to turn back, whereupon Signy cried and implored them to go home. Soon they were attacked by Siggeirs army. Völsung fell and his ten sons were taken captive.     For the continued story, see ": null
    },
    {
        "Sigmund": "sigmund"
    },
    {
        ".       The story of Völsung and his children, from the marriage of Signy to Siggeir to Sigmunds vengeance on Siggeir, is retold in the novelette Vengeance by ": null
    },
    {
        "Arthur Gilchrist Brodeur": "arthur gilchrist brodeur"
    },
    {
        ", which appeared in the magazine  Adventure , June 42 42 Brodeur was a professor at Berkeley and became well known for his scholarship on Beowulf and other Norse sagas.     As Völsungakviđa en Nýja  ": null
    },
    {
        "J. R. R. Tolkien": "j. r. r. tolkien"
    },
    {
        " retells the story in the Old Norse verse style of the  Poetic Edda . It was published posthumously together with a poetic retelling of the ": null
    },
    {
        "Niflung saga": "nibelung"
    },
    {
        " under the title,  The Legend of Sigurd and Gudrún .     The Völsung tale was also the inspiration for much of ": null
    },
    {
        "Richard Wagner": "richard wagner"
    },
    {
        "s second and third operas of the ": null
    },
    {
        "Ring cycle": "ring of the nibelung"
    },
    {
        ". Siegmund and his twin sister Sieglinde reconnect and fall in love in Die Walküre , and Siegmund pulls the sword from the tree. Their son Siegfried goes on to become a hero in the following opera, Siegfried": null
    }
]