[
    {
        "      The Völsunga saga  is a ": null
    },
    {
        "legendary saga": "legendary saga"
    },
    {
        ", a late ": null
    },
    {
        "42th century poetic": "13th century in poetry"
    },
    {
        " rendition in the ": null
    },
    {
        "Icelandic language": "icelandic language"
    },
    {
        " of the origin and decline of the ": null
    },
    {
        "Völsung": "völsung"
    },
    {
        " clan .     The saga covers themes including the power struggles among Sigurds ancestors; Sigurds killing of the dragon ": null
    },
    {
        "Fafnir": "fafnir"
    },
    {
        "; and the influence of the cursed ring ": null
    },
    {
        "Andvaranaut": "andvaranaut"
    },
    {
        ".       Two of the main themes of the saga are the male responsibility of rewarding friends and punishing acts of shame, and the female responsibility of goading for revenge. Together these create much of the contention in the saga.     It is largely based on ": null
    },
    {
        "epic poetry": "epic poetry"
    },
    {
        " of the historic ": null
    },
    {
        "Elder Edda": "elder edda"
    },
    {
        ". The earliest known pictorial representation of this tradition is the ": null
    },
    {
        "Ramsund carving": "ramsund carving"
    },
    {
        ", ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ", which was created c. 42 AD.     The origins of the material are considerably older, however, and it in part echoes real events in Central Europe during the ": null
    },
    {
        "Migration Period": "migration period"
    },
    {
        ", chiefly the destruction of the ": null
    },
    {
        "Kingdom of the Burgundians": "kingdom of the burgundians"
    },
    {
        " by the ": null
    },
    {
        "Huns": "huns"
    },
    {
        " in the fifth century. Some of the poems contained in the ": null
    },
    {
        "Elder Edda": "elder edda"
    },
    {
        " relate episodes from the Völsung legend. On the other hand, the only surviving medieval manuscript of the saga, Ny kgl. Saml. 42 b 42to, which is held by the Royal Library of Denmark, dates to about 42 In this manuscript, the saga leads straight in to  Ragnars saga loðbrókar .       The saga can be divided into five phases: the preliminary generations; Sigurd and his foster family; Sigurd and the Gjukingar; Gudrun and the Budlingar; and Gudruns last marriage.       The first chapters tell of the generations which came prior to Sigurd, beginning with Sigi, a man banished from his homeland for murdering his neighbors ": null
    },
    {
        "thrall": "thrall"
    },
    {
        ". After much adventuring, Sigi settles down to rule over the Huns. His wifes brothers eventually become envious of Sigis power and wealth and raise an army against him. In the ensuing battle, Sigi is killed and his in-laws take over the kingdom. Sigis son Rerir then avenges his fathers death, killing his uncles and regaining his fathers throne. After many years, Rerir becomes ill and dies, and shortly thereafter his wife gives birth to their son, Volsung. Volsung grows up and marries Hljod, the daughter of a giant. Volsung and Hljod have eleven children, the two eldest being the boy and girl twins ": null
    },
    {
        "Sigmund": "sigmund"
    },
    {
        " and ": null
    },
    {
        "Signy": "signy"
    },
    {
        ".     At Signys wedding to King Siggeir, Sigmund offends his new brother-in-law. This triggers a series of revenge killings, beginning with Siggeir luring King Volsung and his sons into a trap. Volsung is killed, and his sons put in stocks. Over the course of several nights, all of his sons save Sigmund are killed by a she-wolf. He is saved by his sister Signy, who then helps Sigmund make a hiding place in the woods. As time goes on, Signy has two sons by Siggeir. She sends her boys to Sigmund to help him avenge the death of the Volsungs. However, both boys fail to pass a test of bravery and are killed by their uncle Sigmund at their mothers insistence, as she deems them unfit for vengeance. Signy then tricks her brother Sigmund into sleeping with her, and their son Sinfjotli becomes a powerful man raised with only one purpose: to avenge his uncles and grandfather. Eventually Sigmund and Sinfjotli manage to kill Siggeir, and after this Sigmund returns to his own country, retakes his fathers throne, and rules there for many years.     As an old man, Sigmund marries Hjordis, the daughter of King Eylimi. The suitor she rejected in Sigmunds favor brings an army against him, and Sigmund is mortally wounded in the battle. In the aftermath, Hjordis finds her husband and he entrusts to her the shards of his sword, prophesying that they will be reforged someday for their yet unborn son. He dies, and Hjordis is taken in by Alf, son of Hjalprek, king of Denmark. Shortly thereafter she gives birth to Sigurd, her son by Sigmund. Sigurd is fostered in Hjalpreks court by Regin, his tutor, and grows to manhood there.       Hjordis gives birth to ": null
    },
    {
        "Sigurd": "sigurd"
    },
    {
        ", who is strong, brave, and very popular. She then marries the Kings son Alf, and ": null
    },
    {
        "Regin": "regin"
    },
    {
        ", the son of King Hreidmar, educates Sigurd. Sigurd enters the forest looking for a horse and meets Odin, who gives him ": null
    },
    {
        "Grani": "grani"
    },
    {
        ", who is descended from ": null
    },
    {
        "Sleipnir": "sleipnir"
    },
    {
        ", and better than any other horse. Regin entices Sigurd to go after the dragon Fafnir so he can become rich.     Then Regin tells Sigurd a story: His father Hreidmar had three sons: himself, Otr, and Fafnir. Otr was an otter-like fisherman, Fafnir large and fierce, and Regin himself was skilled with ironwork. One day Odin, Loki and Hœnir are fishing and kill Otr in his otter shape, skin and eat him. King Hreidmar finds out and demands they fill and cover the skin with gold. Loki goes out and takes the dwarf ": null
    },
    {
        "Andvari": "andvari"
    },
    {
        "’s gold and the ransom is paid. The dwarf curses the ring ": null
    },
    {
        "Andvaranaut": "andvaranaut"
    },
    {
        " , saying it will bring death to anyone who owns it. Fafnir later kills his father, hides the body, and takes all the treasure to his hoard. He turns into an evil dragon, and Regin became a smith for the king.     Regin makes two swords one after another for Sigurd, but they break when he tests them. Sigurds mother gives him the pieces of his fathers broken sword and Regin reforges ": null
    },
    {
        "Gram": "gram"
    },
    {
        ". Sigurd tests it and splits the iron anvil down to its base, and promises to kill Fafnir after he avenges his father. First he goes to the soothsayer ": null
    },
    {
        "Gripir": "grípisspá"
    },
    {
        " and asks about his fate. Gripir tells him after some hesitation, and Sigurd returns to Regin, saying he must avenge his father and other kinsmen before he kills Fafnir. Sigurd sails to Hundings kingdom and kills many and burns settlements. A brutal battle ensues between him and King Lyngvi and Hundings sons, and Sigurd kills them all with Gram. He returns to Regin to prepare to meet Fafnir.     Sigurd goes to ": null
    },
    {
        "Fafnir": "fafnir"
    },
    {
        "’s territory and digs a ditch to hide in and stab Fafnir from. ": null
    },
    {
        "Odin": "odin"
    },
    {
        " comes and advises him to dig several ditches for the blood to flow into. He does so, and stabs Fafnir through the heart as he crawls over the ditch. As Fafnir is dying, he asks Sigurd about his lineage and says that his gold and Regin will be Sigurds death. Sigurd returns to Regin, who was hiding in the heather during Fafnirs slaying. Regin drinks Fafnirs blood and asks Sigurd to roast Fafnirs heart and let him eat it. Sigurd tests whether the heart is fully cooked and licks his finger, and suddenly understands the speech of birds. He overhears the nuthatches talking to each other about Regins plan to kill him, and that he should rather eat the heart himself, kill Regin, take the gold, and go to ": null
    },
    {
        "Brynhild": "brynhild"
    },
    {
        ". Sigurd kills Regin, eats some of the heart, takes as much treasure as he can carry, including the ": null
    },
    {
        "Helm of Terror": "helm of awe"
    },
    {
        ", and Andvaranaut, and rides off on Grani.     Sigurd rides to the land of the ": null
    },
    {
        "Franks": "franks"
    },
    {
        " and finds a sleeping warrior. He removes the helmet, discovers it is a woman, and cuts her ": null
    },
    {
        "chainmail": "mail"
    },
    {
        " open. She wakes and tells him Odin stabbed her with a sleeping thorn and mandated that she must marry, but she refuses to marry any man who knows fear. Brynhild gives him beer and recites a poem about how to use different ": null
    },
    {
        "magical runes": "runic magic"
    },
    {
        ". Following this, Brynhild gives Sigurd several pieces of sound advice on how to navigate society and survive, and they agree to marry each other.       Sigurd rides to the estate of Heimr. Heimr is married to Brekkhild, Brynhilds sister. Sigurd catches sight of Brynhild weaving a golden tapestry in the castle. Alsvid tells him to not think about women, but after Brynhild saying they are not fated to be together, they renew their vows.     King ": null
    },
    {
        "Gjuki": "gjúki"
    },
    {
        " is married to ": null
    },
    {
        "Grimhild": "grimhild"
    },
    {
        ", who is skilled in magic, and their sons are Gunnar, Hogni, and Guttorm. Their sister ": null
    },
    {
        "Gudrun": "gudrun"
    },
    {
        " has a dream about a golden hawk, which Brynhild interprets as her future husband. They then talk of Sigurds excellence and the prophecies about him before his birth. Then Gudrun has a dream about a handsome stag, which Brynhild interprets as Sigurd, and prophecises she will marry, but soon lose Sigurd, marry Atli , lose her brothers, and then kill Atli.     Sigurd comes to Gjuki with Grani and all his treasure. Grimhild gives him a drink and he forgets about Brynhild. Gunnar and the others swear brotherhood with Sigurd, and he marries Gudrun. Gudrun eats some of the dragons heart, and bears Sigurd a son, Sigmund. Meanwhile, Grimhild encourages Gunnar to marry Brynhild. Sigurd and the three brothers ride to King Budli for Gunnar to ask for Brynhilds hand. She is inside a hall surrounded by fire. Sigurd and Gunnar exchange shapes, and Sigurd goes and asks Brynhild to marry him as Gunnar. Brynhild reluctantly agrees because of her oath, and leaves her daughter ": null
    },
    {
        "Aslaug": "aslaug"
    },
    {
        " by Sigurd to be raised with Heimr.     Brynhild and Gudrun are arguing about whose husband is better, and Gudrun shows her the ring which Brynhild had given Sigurd. Brynhild recognizes the ring and realizes she has been tricked. She tells Gunnar she knows he deceived her and that she will kill him and seek revenge on Grimhild. Brynhild takes to her room and Sigurd comes to try to make amends by asking her to marry him, but she doesnt accept his offer, and instead wants to die and bring doom upon everyone involved.     Gunnar consults with his brothers whether they should kill Sigurd to keep Brynhild or not. They decide to give snake and wolfs meat to Guttorm to turn him violent and kill Sigurd. He goes into Sigurds bed chamber and stabs him while asleep. Sigurd wakes up and before dying, throws Gram after him as he leaves, cutting him in two. Brynhild laughs when she hears Gudrun sobbing, Gudrun tells Gunnar he made a big mistake by killing Sigurd. Brynhild also tells Gunnar he has made a mistake and stabs herself and before she dies, foretells the rest of Gunnars and Gudruns future. Gunnar fulfills Brynhilds last request, that he put her on a bonfire with Sigurd, Guttorm, and Sigurds 42-year-old son.       Everyone mourns Sigurds death and Gudrun runs away, ending up with King Half in Denmark. Grimhild finds Gudrun and orders her to marry King Atli against her will, which she does, unhappily. Atli has a dream that he is fed his children, and Gudrun interprets it that his sons will die and many other bad things. Gudrun sends her brothers a runic message warning them about Atli, but the messenger Vingi alters it, inviting her brothers to come. Hognis wife Kostbera sees the message is false and tells him. Kostbera tells her dream to Hogni, in which she predicts the treachery of Atli, and Hognis death, but he doesn’t believe her. Gunnars wife Glaumvor also has symbolic dreams predicting Gunnars betrayal by Atli and his death, and he eventually gives up trying to interpret them differently, and says he will probably have a short life. Gunnar and Hogni go with Vingi to Atli. Vingi reveals he betrayed them, and Gunnar and Hogni kill him with their axe handles.     Atli says he wants Sigurds gold and will avenge Sigurd by killing his brothers-in-law. Gudrun tries to stop the fighting, but then puts on armor, picks up a sword and fights with her brothers. Many of Atlis champions are killed. Of their army, only Gunnar and Hogni survive and are captured. Hognis heart is cut out and shown to Gunnar. Gunnar is placed in a ": null
    },
    {
        "snake pit": "snake pit"
    },
    {
        " and Gudrun brings him a harp which he plays with his toes. All the snakes fall asleep except one, which bites his heart and kills him.     Gudrun and Atli hold a funeral feast. Gudrun kills Atlis two sons, and gives their blood and hearts to Atli to eat and drink. Atli says she deserves to be killed. Hognis son ": null
    },
    {
        "Niflung": "nibelung"
    },
    {
        " wants to avenge his father, so he and Gudrun stab Atli while he is asleep. After he dies, Gudrun sets the hall on fire and all Atlis retainers die while fighting each other in panic.       Gudrun and Sigurds daughter is ": null
    },
    {
        "Svanhild": "svanhildr"
    },
    {
        ", radiantly beautiful. Gudrun goes to the sea to drown herself, but gets swept away and to the court of King Jonakr, who marries her. They have ": null
    },
    {
        "three sons": "jonakrs sons"
    },
    {
        ": Hamdir, Sorli, and Erp, and Svanhild is raised with them.     King ": null
    },
    {
        "Jormunrek": "ermanaric"
    },
    {
        " wants to marry Svanhild, but Bikki convinces Jormunreks son Randver that he would be a better match for her than his father, so he and Svanhild get together. Upon Bikkis advice, Jormunrek hangs Randver and has horses trample Svanhild to death.     Gudrun encourages her sons to kill Jormunrek and avenge Svanhild. Gudruns sons ask Erp if he will help them kill Jormunrek, but he gives an ambivalent answer they misunderstand as arrogance, so they kill him, coming to regret it afterwards. They meet Jormunrek and cut off his hands and feet, but Erp would have cut off Jormunreks head, which would have kept Jormunrek from calling for his housecarls. The housecarls are unable to kill Gudruns sons with sharp weapons. Odin then appears as an old one-eyed man and advises Jormunreks housecarls to have the avengers killed with stones, which they do.         Throughout the saga, elements of the supernatural are interwoven into the narrative. One recurring theme is the periodic appearance of ": null
    },
    {
        "Odin": "odin"
    },
    {
        ", the foremost among Norse deities, associated with “war, wisdom, ecstasy, and poetry.” He is typically depicted as a mysterious, hooded old man with one eye.     Odin appears a number of times to assist characters with his magic and powers. At the start of the saga, he guides his son ": null
    },
    {
        "Sigi": "sigi"
    },
    {
        " out of the underworld. He also sends a wish maiden to Sigis son ": null
    },
    {
        "Rerir": "rerir"
    },
    {
        " with an enchanted apple that finally allowed Rerir and his wife to have a child. Later, he appears as an old, one-eyed stranger and sticks his sword into the tree ": null
    },
    {
        "Barnstokkr": "barnstokkr"
    },
    {
        " during a feast at the palace of King ": null
    },
    {
        "Völsung": "völsung"
    },
    {
        ", declaring that “he who draws this sword out of the trunk shall receive it from me as a gift, and he himself shall prove that he has never carried a better sword than this one,” which King Volsungs son ": null
    },
    {
        "Sigmund": "sigmund"
    },
    {
        " does.     Odin also directly intervenes during key points in the narrative. During a battle, Odin, again in the guise of an old, one-eyed man, breaks Sigmunds sword, turning the tide of the battle and ultimately leading to his death. He also stabs Brynhild with a sleeping thorn and curses her never to win another battle as an act of revenge for killing Hjalmgunnar, a rival king to whom Odin had promised victory.       In the latter half of the saga the ring ": null
    },
    {
        "Andvaranaut": "andvaranaut"
    },
    {
        " serves as a connection and explanation for the characters troubles. Loki killed Otr, the son of Hreidmar. As compensation for Otrs death, Loki coerced a dwarf named Andvari into repaying the debt with gold. Andvari tried to hold onto one gold ring and when Loki forced him to give it up Andvari cursed the ring saying, This ring...and indeed the entire treasure, will be the death of whoever owns it. This plays out as one character after another is killed soon after they receive the ring. Otrs brother Fafnir killed his father in order to get the ring and then turned into a dragon to protect it. Sigurd then kills ": null
    },
    {
        "Fafnir": "fafnir"
    },
    {
        " taking the ring and giving it to Brynhildr. The ring is then brought into Queen Grimhilds family after her children marry Sigurd and Bryhildr. The story of Andvaranaut is thought to have inspired ": null
    },
    {
        "J.R.R Tolkien": "j.r.r tolkien"
    },
    {
        "s  The Lord of the Rings .         The ": null
    },
    {
        "Middle High German": "middle high german"
    },
    {
        " epic poem  Nibelungenlied  is related in content. The relative historical accuracy and origin of both works are a subject of academic research—however, whilst traditionally the stories from the Poetic Edda and Völsunga saga were assumed to contain an earlier or more original version, the actual development of the different texts is more complex—for more details see ": null
    },
    {
        "Nibelungenlied § Origins": "nibelungenliedorigins"
    },
    {
        ".     Among the more notable adaptations of this text are ": null
    },
    {
        "Richard Wagner": "richard wagner"
    },
    {
        "s tetralogy of music dramas  Der Ring des Nibelungen , ": null
    },
    {
        "Ernest Reyer": "ernest reyer"
    },
    {
        "s opera  Sigurd , ": null
    },
    {
        "Henrik Ibsen": "henrik ibsen"
    },
    {
        "s  The Vikings at Helgeland , and ": null
    },
    {
        "William Morris": "william morris"
    },
    {
        "s epic poem  The Story of Sigurd the Volsung and the Fall of the Niblungs . ": null
    },
    {
        "J. R. R. Tolkien": "j. r. r. tolkien"
    },
    {
        "s  The Legend of Sigurd and Gudrún  is derived instead from the Volsung poems in the ": null
    },
    {
        "Elder Edda": "elder edda"
    },
    {
        "; Tolkien himself thought the author of the Saga had made a jumble of things.     The saga is also one inspiration for ": null
    },
    {
        "Þráinn Bertelssons": "þráinn bertelsson"
    },
    {
        " satirical crime novel  Valkyrjur  .           , literal translation,    , with Icelandic text      , English translation with Norse transcription from manuscript Nks 42 b, 42°                , Norse text with translations by: A. Bugge ; Winkel Horn , Nils Fredrik Sander            , literary adaption   Some sections edited into prose in:   Story of Sigurd  in ": null
    },
    {
        "Andrew Lang": "andrew lang"
    },
    {
        "s  The Red Fairy Book    ": null
    }
]