[
    {
        "     Walo  was a kingdom on the lower ": null
    },
    {
        "Senegal River": "senegal river"
    },
    {
        " in West Africa, in what are now ": null
    },
    {
        "Senegal": "senegal"
    },
    {
        " and ": null
    },
    {
        "Mauritania": "mauritania"
    },
    {
        ". It included parts of the valley proper and areas north and south, extending to the Atlantic Ocean. To the north were Moorish emirates; to the south was the kingdom of ": null
    },
    {
        "Cayor": "cayor"
    },
    {
        "; to the east was ": null
    },
    {
        "Jolof": "jolof kingdom"
    },
    {
        ".     Waalo had a complicated political and social system, which has a continuing influence on ": null
    },
    {
        "Wolof": "wolof people"
    },
    {
        " culture in Senegal today, especially its highly formalized and rigid caste system. The kingdom was indirectly hereditary, ruled by three matrilineal families: the Logar, the Tedyek and the ": null
    },
    {
        "Joos": "joos maternal dynasty"
    },
    {
        ", all from ": null
    },
    {
        "different ethnic": ":category:senegambian languages"
    },
    {
        " backgrounds. The Joos were of ": null
    },
    {
        "Serer": "serer people"
    },
    {
        " origin. This ": null
    },
    {
        "Serer matriclan": "serer maternal clans"
    },
    {
        " was established in Waalo by ": null
    },
    {
        "Lingeer Ndoye Demba": "lingeer ndoye demba"
    },
    {
        " of ": null
    },
    {
        "Sine": "kingdom of sine"
    },
    {
        ". Her grandmother ": null
    },
    {
        "Lingeer Fatim Beye": "lingeer fatim beye"
    },
    {
        " is the matriarch and early ancestor of this dynasty. These matrilineal families engaged in constant dynastic struggles to become ": null
    },
    {
        "Brak": "brak"
    },
    {
        " or king of Waalo, as well as warring with Waalos neighbors. The royal title ": null
    },
    {
        "Lingeer": "lingeer"
    },
    {
        " means queen or royal princess, used by the Serer and Wolof.     Waalo was founded in 42 The semi-legendary figure ": null
    },
    {
        "NDiadiane Ndiaye": "ndiadiane ndiaye"
    },
    {
        ", was from this kingdom. The mysterious figure went on to rule the ": null
    },
    {
        "Jolof Empire": "jolof empire"
    },
    {
        ". Under NDdiadian, Jolof made Waalo a vassal.     The royal capital of Waalo was first ": null
    },
    {
        "Ndiourbel": "ndiourbel"
    },
    {
        " on the north bank of the ": null
    },
    {
        "Senegal River": "senegal river"
    },
    {
        " , then ": null
    },
    {
        "Ndiangué": "richard toll"
    },
    {
        " on the south bank of the river, then the capital was moved to ": null
    },
    {
        "Nder": "nder"
    },
    {
        " on the west shore of the ": null
    },
    {
        "Lac de Guiers": "lac de guiers"
    },
    {
        ". Waalo was subject to constant raids for slaves not only from the Moors but also in the internecine wars.     The Brak ruled with a kind of legislature, the ": null
    },
    {
        "Seb Ak Baor": "seb ak baor"
    },
    {
        ", over a complicated hierarchy of officials and dignitaries. Women had high positions and figure prominently in the political and military history.     Waalo had lucrative treaties with the French, who had established their base at the island of Saint-Louis  near the mouth of the river. Waalo was paid fees for every boatload of gum arabic or slaves that was shipped on the river, in return for its protection of the trade.     Eventually, this protection became ineffective. Vassals of Waalo, like ": null
    },
    {
        "Beetyo ": "beetyo"
    },
    {
        " split off. In all, Waalo had 42 kings since its founding.     Waalo had its own traditional African religion. The ruling class was slow to accept Islam, which had spread in the valley; the Brak converted only in the 42th century.         ": null
    }
]