[
    {
        "        Sir Walter Scott, 1st Baronet   was a Scottish historical novelist, poet, playwright and historian. Many of his works remain classics of both English-language literature and of ": null
    },
    {
        "Scottish literature": "scottish literature"
    },
    {
        ". Famous titles include  Ivanhoe ,  Rob Roy ,  Old Mortality ,  The Lady of the Lake ,  Waverley ,  The Heart of Midlothian  and  The Bride of Lammermoor .     Although primarily remembered for his extensive literary works and his political engagement, Scott was an ": null
    },
    {
        "advocate": "advocate"
    },
    {
        ", judge and legal administrator by profession, and throughout his career combined his writing and editing work with his daily occupation as ": null
    },
    {
        "Clerk of Session": "clerk of session"
    },
    {
        " and ": null
    },
    {
        "Sheriff-Depute": "sheriff court"
    },
    {
        " of ": null
    },
    {
        "Selkirkshire": "selkirkshire"
    },
    {
        ".     A prominent member of the ": null
    },
    {
        "Tory": "tory"
    },
    {
        " establishment in Edinburgh, Scott was an active member of the ": null
    },
    {
        "Highland Society": "royal highland and agricultural society of scotland"
    },
    {
        ", served a long term as President of the ": null
    },
    {
        "Royal Society of Edinburgh": "royal society of edinburgh"
    },
    {
        " and was a Vice President of the ": null
    },
    {
        "Society of Antiquaries of Scotland": "society of antiquaries of scotland"
    },
    {
        " .      Scotts knowledge of history, and his facility with literary technique, made him a seminal figure in the establishment of the ": null
    },
    {
        "historical novel": "historical novel"
    },
    {
        " genre, as well as an exemplar of European literary ": null
    },
    {
        "Romanticism": "romanticism"
    },
    {
        ".              Walter Scott was born on 15 August 1771. He was the ninth child of Walter Scott, a ": null
    },
    {
        "Writer to the Signet": "society of writers to her majestys signet"
    },
    {
        " and Anne Rutherford . His father was a member of a cadet branch of the Scott Clan, and his mother descended from the Haliburton family, the descent from whom granted Walters family the hereditary right of burial in ": null
    },
    {
        "Dryburgh Abbey": "dryburgh abbey"
    },
    {
        ".  Via the Haliburton family, Walter was a cousin of the pre-eminent contemporaneous property developer ": null
    },
    {
        "James Burton": "james burton"
    },
    {
        ", who was a Haliburton who had shortened his surname, and of his son, the architect ": null
    },
    {
        "Decimus Burton": "decimus burton"
    },
    {
        ".  Walter subsequently became a member of the ": null
    },
    {
        "Clarence Club": "clarence club"
    },
    {
        ", of which the Burtons were also members.       Five of Walters siblings died in infancy, and a sixth died when he was five months of age. Walter was born in a third-floor flat on College Wynd in the ": null
    },
    {
        "Old Town": "old town, edinburgh"
    },
    {
        " of ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        ", a narrow alleyway leading from the ": null
    },
    {
        "Cowgate": "cowgate"
    },
    {
        " to the gates of the ": null
    },
    {
        "University of Edinburgh": "university of edinburgh"
    },
    {
        " .  He survived a childhood bout of ": null
    },
    {
        "polio": "polio"
    },
    {
        " in 1773 that left him lame,  a condition that was to have a significant effect on his life and writing.    To cure his lameness he was sent in 1773 to live in the rural ": null
    },
    {
        "Scottish Borders": "scottish borders"
    },
    {
        " at his paternal grandparents farm at Sandyknowe, adjacent to the ruin of ": null
    },
    {
        "Smailholm Tower": "smailholm tower"
    },
    {
        ", the earlier family home.  Here he was taught to read by his aunt Jenny, and learned from her the speech patterns and many of the tales and legends that characterised much of his work. In January 1775 he returned to Edinburgh, and that summer went with his aunt Jenny to take spa treatment at ": null
    },
    {
        "Bath": "bath, somerset"
    },
    {
        " in England, where they lived at 6 ": null
    },
    {
        "South Parade": "south parade, bath"
    },
    {
        ".  In the winter of 1776 he went back to Sandyknowe, with another attempt at a water cure at ": null
    },
    {
        "Prestonpans": "prestonpans"
    },
    {
        " during the following summer.          In 1778, Scott returned to Edinburgh for private education to prepare him for school, and joined his family in their new house built as one of the first in ": null
    },
    {
        "George Square": "george square, edinburgh"
    },
    {
        ". In October 1779 he began at the ": null
    },
    {
        "Royal High School of Edinburgh": "royal high school"
    },
    {
        " . He was now well able to walk and explore the city and the surrounding countryside. His reading included chivalric romances, poems, history and travel books. He was given private tuition by James Mitchell in arithmetic and writing, and learned from him the history of the ": null
    },
    {
        "Church of Scotland": "church of scotland"
    },
    {
        " with emphasis on the ": null
    },
    {
        "Covenanters": "covenanters"
    },
    {
        ". After finishing school he was sent to stay for six months with his aunt Jenny in ": null
    },
    {
        "Kelso": "kelso, scottish borders"
    },
    {
        ", attending ": null
    },
    {
        "the local grammar school": "kelso high school"
    },
    {
        " where he met ": null
    },
    {
        "James": "james ballantyne"
    },
    {
        " and ": null
    },
    {
        "John Ballantyne": "john ballantyne"
    },
    {
        ", who later became his business partners and printed his books.          Scott began studying classics at the ": null
    },
    {
        "University of Edinburgh": "university of edinburgh"
    },
    {
        " in November 1783, at the age of 12, a year or so younger than most of his fellow students. In March 1786 he began an apprenticeship in his fathers office to become a ": null
    },
    {
        "Writer to the Signet": "writer to the signet"
    },
    {
        ". Whilst at both high school and university, Scott had become a friend of ": null
    },
    {
        "Adam Ferguson": "adam ferguson"
    },
    {
        ", the son of Professor ": null
    },
    {
        "Adam Ferguson": "adam ferguson"
    },
    {
        " who hosted literary salons. J G Lockhart Memoirs of the life of Walter Scott p.378-379 Scott met the blind poet ": null
    },
    {
        "Thomas Blacklock": "thomas blacklock"
    },
    {
        ", who lent him books and introduced him to ": null
    },
    {
        "James Macphersons": "james macpherson"
    },
    {
        " Ossian": "ossian"
    },
    {
        " cycle of poems. During the winter of 1786–87 the 15-year-old Scott met ": null
    },
    {
        "Robert Burns": "robert burns"
    },
    {
        " at one of these salons, for what was to be their only meeting. When Burns noticed a print illustrating the poem The Justice of the Peace and asked who had written the poem, only Scott knew that it was by ": null
    },
    {
        "John Langhorne": "john langhorne"
    },
    {
        ", and was thanked by Burns. Scott describes this event in his memoirs where he whispers the answer to his friend ": null
    },
    {
        "Adam": "adam ferguson"
    },
    {
        " who tells Burns  Another version of the event is described in Literary Beginnings  When it was decided that he would become a lawyer, he returned to the university to study law, first taking classes in moral philosophy and universal history in 1789–90.     After completing his studies in law, he became a lawyer in Edinburgh. As a lawyers clerk he made his first visit to the Scottish Highlands directing an eviction. He was admitted to the ": null
    },
    {
        "Faculty of Advocates": "faculty of advocates"
    },
    {
        " in 1792. He had an unsuccessful love suit with Williamina Belsches of Fettercairn, who married Scotts friend ": null
    },
    {
        "Sir William Forbes, 7th Baronet": "william forbes, 7th baronet"
    },
    {
        ". In February 1797, with the threat of a French invasion, Scott along with many of his friends joined the Royal Edinburgh Volunteer Light Dragoons. He was appointed quartermaster and secretary. The daily drill practices that year, starting at 5am before the working day provide an indication of the determination with which this role was undertaken. He served with this volunteer force into the early 1800s. J.G Lockhart, The Life Of Scott 1872 ch2.            As a boy, youth, and young man, Scott was fascinated by the oral traditions of the Scottish Borders. He was an obsessive collector of stories, and developed an innovative method of recording what he heard at the feet of local story-tellers using carvings on twigs, to avoid the disapproval of those who believed that such stories were neither for writing down nor for printing.  At the age of 25 he began to write professionally, translating works from German,  his first publication being rhymed versions of ballads by ": null
    },
    {
        "Gottfried August Bürger": "gottfried august bürger"
    },
    {
        " in 1796. He then published an idiosyncratic three-volume set of collected ballads of his adopted home region,  Minstrelsy of the Scottish Border . This was the first sign from a literary standpoint of his interest in Scottish history.     As a result of his early polio infection, Scott had a pronounced limp. He was described in 1820 as tall, well formed , neither fat nor thin, with forehead very high, nose short, upper lip long and face rather fleshy, complexion fresh and clear, eyes very blue, shrewd and penetrating, with hair now silvery white. Leslie C. R. Letter to Miss C Leslie dated 26 June 1820 in Autobiographical recollections ed. Tom Taylor, Ticknor & Fields, Boston 1855 Although a determined walker, on horseback he experienced greater freedom of movement. Unable to consider a military career, Scott enlisted as a volunteer in the 1st Lothian and Border ": null
    },
    {
        "yeomanry": "yeomanry"
    },
    {
        ".      On a trip to the ": null
    },
    {
        "Lake District": "lake district"
    },
    {
        " with old college friends he met Charlotte Charpentier , daughter of Jean Charpentier of ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        " in France, and ward of Lord Downshire in ": null
    },
    {
        "Cumberland": "cumberland"
    },
    {
        ", an Episcopalian. After three weeks of courtship, Scott proposed and they were married on Christmas Eve 1797 in St Marys Church, Carlisle .  After renting a house in Edinburghs ": null
    },
    {
        "George Street": "george street, edinburgh"
    },
    {
        ", they moved to nearby South Castle Street. They had five children, of whom four survived by the time of Scotts death, most baptised by an Episcopalian clergyman. In 1799 he was appointed ": null
    },
    {
        "Sheriff-Depute": "sheriff court"
    },
    {
        " of the ": null
    },
    {
        "County of Selkirk": "county of selkirk"
    },
    {
        ", based in the ": null
    },
    {
        "Royal Burgh": "royal burgh"
    },
    {
        " of ": null
    },
    {
        "Selkirk": "selkirk, scottish borders"
    },
    {
        ". In his early married days Scott had a decent living from his earnings at the law, his salary as Sheriff-Depute, his wifes income, some revenue from his writing, and his share of his fathers rather meagre estate.        After their third son was born in 1801, they moved to a spacious three-storey house built for Scott at 39 North Castle Street. This remained Scotts base in Edinburgh until 1826, when he could no longer afford two homes. From 1798 Scott had spent the summers in a cottage at ": null
    },
    {
        "Lasswade": "lasswade"
    },
    {
        ", where he entertained guests including literary figures, and it was there that his career as an author began. There were nominal residency requirements for his position of Sheriff-Depute, and at first he stayed at a local inn during the circuit. In 1804 he ended his use of the Lasswade cottage and leased the substantial house of ": null
    },
    {
        "Ashestiel": "ashiestiel"
    },
    {
        ",  from Selkirk. It was sited on the south bank of the ": null
    },
    {
        "River Tweed": "river tweed"
    },
    {
        ", and the building incorporated an old ": null
    },
    {
        "tower house": "tower house"
    },
    {
        ".            In 1796, Scotts friend ": null
    },
    {
        "James Ballantyne": "james ballantyne"
    },
    {
        "  founded a printing press in Kelso, in the Scottish Borders. Through Ballantyne, Scott was able to publish his first work, including ": null
    },
    {
        "Glenfinlas": "glenfinlas"
    },
    {
        " and The Eve of St. John , and his poetry then began to bring him to public attention. In 1805,  The Lay of the Last Minstrel  captured wide public imagination, and his career as a writer was established in spectacular fashion.        He published many other poems over the next ten years, including the popular  The Lady of the Lake , printed in 1810 and set in the ": null
    },
    {
        "Trossachs": "trossachs"
    },
    {
        ". Portions of the German translation of this work were set to music by ": null
    },
    {
        "Franz Schubert": "franz schubert"
    },
    {
        ". One of these songs, ": null
    },
    {
        "Ellens dritter Gesang": "ellens dritter gesang"
    },
    {
        " , is popularly labelled as Schuberts Ave Maria .     Beethovens opus 108 ": null
    },
    {
        "Twenty-Five Scottish Songs": "twenty-five scottish songs"
    },
    {
        " includes 3 folk songs whose words are by Walter Scott.      Marmion , published in 1808, produced lines that have become proverbial. Canto VI. Stanza 17 reads:      In 1809 Scott persuaded James Ballantyne and his brother to move to Edinburgh and to establish their printing press there. He became a partner in their business. As a political conservative,  Scott helped to found the ": null
    },
    {
        "Tory": "tory"
    },
    {
        "  Quarterly Review , a review journal to which he made several anonymous contributions. Scott was also a contributor to the  Edinburgh Review , which espoused ": null
    },
    {
        "Whig": "whig"
    },
    {
        " views.     Scott was ordained as an ": null
    },
    {
        "elder": "ministers and elders of the church of scotland"
    },
    {
        " in the Presbyterian ": null
    },
    {
        "Duddingston Kirk": "duddingston kirk"
    },
    {
        " in 1806,  and sat in the ": null
    },
    {
        "General Assembly": "general assembly of the church of scotland"
    },
    {
        " for a time as representative elder of the burgh of Selkirk.     In 1813 Scott was offered the position of ": null
    },
    {
        "Poet Laureate": "poet laureate of the united kingdom"
    },
    {
        ". He declined, due to concerns that such an appointment would be a poisoned chalice , as the Laureateship had fallen into disrepute, due to the decline in quality of work suffered by previous title holders, as a succession of poetasters had churned out conventional and obsequious odes on royal occasions.  He sought advice from the ": null
    },
    {
        "4th Duke of Buccleuch": "charles montagu-scott, 4th duke of buccleuch"
    },
    {
        ", who counseled him to retain his literary independence, and the position went to Scotts friend, ": null
    },
    {
        "Robert Southey": "robert southey"
    },
    {
        ".             Although Scott had attained worldwide celebrity through his poetry, he soon tried his hand at documenting his researches into the oral tradition of the Scottish Borders in prose fiction—stories and novels—at the time still considered aesthetically inferior to poetry  as a ": null
    },
    {
        "mimetic": "mimesis"
    },
    {
        " vehicle for portraying historical events. In an innovative and astute action, he wrote and published his ": null
    },
    {
        "first novel": "debut novel"
    },
    {
        ",  Waverley , anonymously in 1814. It was a tale of the ": null
    },
    {
        "Jacobite rising of 1745": "jacobite rising of 1745"
    },
    {
        ". Its English protagonist, Edward Waverley, like ": null
    },
    {
        "Don Quixote": "don quixote"
    },
    {
        " a great reader of romances, has been brought up by his Tory uncle, who is sympathetic to ": null
    },
    {
        "Jacobitism": "jacobitism"
    },
    {
        ", although Edwards own father is a Whig. The youthful Waverley obtains a commission in the Whig army and is posted in ": null
    },
    {
        "Dundee": "dundee"
    },
    {
        ". On leave, he meets his uncles friend, the Jacobite Baron Bradwardine and is attracted to the Barons daughter Rose. On a visit to the Highlands, Edward overstays his leave and is arrested and charged with desertion but is rescued by the Highland chieftain Fergus MacIvor and his mesmerizing sister Flora, whose devotion to the Stuart cause, as it exceeded her brothers in fanaticism, excelled it also in purity . Through Flora, Waverley meets ": null
    },
    {
        "Bonnie Prince Charlie": "charles edward stuart"
    },
    {
        ", and under her influence goes over to the Jacobite side and takes part in the ": null
    },
    {
        "Battle of Prestonpans": "battle of prestonpans"
    },
    {
        ". He escapes retribution, however, after saving the life of a Whig colonel during the battle. Waverley eventually decides to lead a peaceful life of establishment respectability under the ": null
    },
    {
        "House of Hanover": "house of hanover"
    },
    {
        " rather than live as a proscribed rebel. He chooses to marry the beautiful Rose Bradwardine, rather than cast his lot with the ": null
    },
    {
        "sublime": "sublime"
    },
    {
        " Flora MacIvor, who, after the failure of the 45 rising, retires to a French convent.     There followed a succession of novels over the next five years, each with a Scottish historical setting. Mindful of his reputation as a poet, Scott maintained the anonymity he had begun with Waverley, publishing the novels under the name Author of Waverley or as Tales of... with no author. Among those familiar with his poetry, his identity became an open secret, but Scott persisted in maintaining the façade, perhaps because he thought his old-fashioned father would disapprove of his engaging in such a trivial pursuit as novel writing. During this time Scott became known by the nickname The Wizard of the North . In 1815 he was given the honour of dining with ": null
    },
    {
        "George, Prince Regent": "george iv of great britain"
    },
    {
        ", who wanted to meet the Author of Waverley .      Scotts 1819 series  Tales of my Landlord  is sometimes considered a subset of the Waverley novels and was intended to illustrate aspects of Scottish regional life. Among the best known is  The Bride of Lammermoor , a fictionalized version of an actual incident in the history of the ": null
    },
    {
        "Dalrymple": "james dalrymple, 1st viscount of stairbiography"
    },
    {
        " family that took place in the ": null
    },
    {
        "Lammermuir Hills": "lammermuir hills"
    },
    {
        " in 1669. In the novel, Lucie Ashton and the nobly born but now dispossessed and impoverished Edgar Ravenswood exchange vows. But the Ravenswoods and the wealthy Ashtons, who now own the former Ravenswood lands, are enemies, and Lucies mother forces her daughter to break her engagement to Edgar and marry the wealthy Sir Arthur Bucklaw. Lucie falls into a depression and on their wedding night stabs the bridegroom, succumbs to insanity, and dies. In 1821, French Romantic painter ": null
    },
    {
        "Eugène Delacroix": "eugène delacroix"
    },
    {
        " painted a portrait depicting himself as the melancholy, disinherited Edgar Ravenswood. The prolonged, climactic ": null
    },
    {
        "coloratura": "coloratura"
    },
    {
        " mad scene for Lucia in ": null
    },
    {
        "Donizettis": "gaetano donizetti"
    },
    {
        "1835 ": null
    },
    {
        "bel canto": "bel canto"
    },
    {
        " opera  Lucia di Lammermoor  is based on what in the novel were just a few bland sentences.     Tales of my Landlord includes the now highly regarded novel  Old Mortality , set in 1679–89 against the backdrop of the ferocious anti-Covenanting campaign of the Tory ": null
    },
    {
        "Graham of Claverhouse": "john graham, 1st viscount dundee"
    },
    {
        ", subsequently made Viscount Dundee . The Covenanters were ": null
    },
    {
        "presbyterians": "presbyterianism"
    },
    {
        " who had supported the ": null
    },
    {
        "Restoration of Charles II": "restoration"
    },
    {
        " on promises of a Presbyterian settlement, but he had instead reintroduced ": null
    },
    {
        "Episcopalian church government": "episcopal polity"
    },
    {
        " with draconian penalties for Presbyterian worship. This led to the destitution of around 270 ministers who had refused to take an oath of allegiance and submit themselves to bishops, and who continued to conduct worship among a remnant of their flock in caves and other remote country spots. The relentless persecution of these conventicles and attempts to break them up by military force had led to open revolt. The story is told from the point of view of Henry Morton, a moderate Presbyterian, who is unwittingly drawn into the conflict and barely escapes summary execution. In writing Old Mortality Scott drew upon the knowledge he had acquired from his researches into ballads on the subject for Minstrelsy of the Scottish Border.  Scotts background as a lawyer also informed his perspective, for at the time of the novel, which takes place before the ": null
    },
    {
        "Act of Union of 1707": "act of union of 1707"
    },
    {
        ", English law did not apply in Scotland, and afterwards Scotland has continued to have its own ": null
    },
    {
        "Scots law": "scots law"
    },
    {
        " as a hybrid legal system. A recent critic, who is a legal as well as a literary scholar, argues that Old Mortality not only reflects the dispute between Stuarts ": null
    },
    {
        "absolute monarchy": "absolute monarchy"
    },
    {
        " and the jurisdiction of the courts, but also invokes a foundational moment in British sovereignty, namely, the ": null
    },
    {
        "Habeas Corpus Act": "habeas corpus act 1679"
    },
    {
        " , passed by the ": null
    },
    {
        "English Parliament": "english parliament"
    },
    {
        " in 1679. See Amy Witherbee, in Habeas Corpus: British Imaginations of Power in Walter Scotts Old Mortality , New Literary History 39 : 355–67, writes: By the 1670s, conflicts between religious dissidents and the Stuart Crown had given way to a Crown policy of seizing and imprisoning opponents without recourse to the courts. In 1679, this policy of using extrajudicial imprisonments to quell rebellion finally provoked the English Parliament to pass the Act of Habeas Corpus in England. Usually translated as produce the body , habeas corpus could be invoked by any subject to require that the king or his agents produce the body of a prisoner for adjudication before the courts. In its barest terms the Great Writ protected a subject from indefinite terms of imprisonment, from imprisonment outside the kingdom, or from imprisonment without cause. It did so by asserting the jurisdiction of the courts as superior to the executive powers of the king. The Act was thus part of a long debate within the three kingdoms about the relationship of king to law and vice versa. Oblique reference to the origin of Habeas corpus underlies Scotts next novel,  Ivanhoe , set during the era of the creation of the ": null
    },
    {
        "Magna Carta": "magna carta"
    },
    {
        ", which political conservatives like Walter Scott and ": null
    },
    {
        "Edmund Burke": "edmund burke"
    },
    {
        " regarded as rooted in immemorial British custom and precedent.      Ivanhoe  , set in 12th-century England, marked a move away from Scotts focus on the local history of Scotland. Based partly on ": null
    },
    {
        "Humes": "david hume"
    },
    {
        "  History of England  and the ballad cycle of ": null
    },
    {
        "Robin Hood": "robin hood"
    },
    {
        ", Ivanhoe was quickly translated into many languages and inspired countless imitations and theatrical adaptations. Ivanhoe depicts the cruel tyranny of the Norman overlords  over the impoverished Saxon populace of England, with two of the main characters, Rowena and Locksley , representing the dispossessed Saxon aristocracy. When the protagonists are captured and imprisoned by a Norman baron, Scott interrupts the story to exclaim:   The institution of the ": null
    },
    {
        "Magna Carta": "magna carta"
    },
    {
        ", which happens outside the time frame of the story, is portrayed as a progressive reform, but also as a step towards the recovery of a lost golden age of liberty endemic to England and the English system. Scott puts a derisive prophecy in the mouth of the jester Wamba:      Although on the surface an entertaining escapist romance, alert contemporary readers would have quickly recognised the political subtext of Ivanhoe, which appeared immediately after the English Parliament, fearful of French-style revolution in the aftermath of ": null
    },
    {
        "Waterloo": "battle of waterloo"
    },
    {
        ", had passed the ": null
    },
    {
        "Habeas Corpus Suspension acts of 1817 and 1818": "habeas corpus suspension act 1817"
    },
    {
        " and other extremely repressive measures, and when traditional English Charter rights versus revolutionary human rights was a topic of discussion. Witherbee , pp. 363–64. Habeas corpus had been suspended in the mid-1790s at the time of the French Revolution by ": null
    },
    {
        "William Pitt": "william pitt the younger"
    },
    {
        ", who had called the French declaration of human rights monstrous . Widely publicised trials for sedition took place in Edinburgh and in London ": null
    },
    {
        "John Thelwall": "john thelwall"
    },
    {
        " and two others were charged with treason. The Scottish defendants received harsh sentences whereas the English ones were acquitted. According to historian Anne Stott : The difference between the English and Scottish trials reflects the different legal systems. Ironically, the acquittals made the loyalist case—that England was a country where a man could have a fair trial.   Ivanhoe was also remarkable in its sympathetic portrayal of Jewish characters: Rebecca, considered by many critics the books real heroine, does not in the end get to marry Ivanhoe, whom she loves, but Scott allows her to remain faithful to her own religion, rather than having her convert to Christianity. Likewise, her father, Isaac of York, a Jewish moneylender, is shown as a victim rather than a villain. In Ivanhoe, which is one of Scotts Waverley novels, religious and sectarian fanatics are the villains, while the ": null
    },
    {
        "eponym": "eponym"
    },
    {
        "ous hero is a bystander who must weigh the evidence and decide where to take a stand. Scotts positive portrayal of Judaism, which reflects his humanity and concern for religious toleration, also coincided with a contemporary movement for the ": null
    },
    {
        "Emancipation of the Jews in England": "emancipation of the jews in england"
    },
    {
        ".     Scott created Captain Clutterbuck, a fictional editor of some of his novels including The Monastery and The Fortunes of Nigel.  The Abbot  is dedicated by the author of Waverley to Captain Clutterbuck.          Scotts fame grew as his explorations and interpretations of Scottish history and society captured popular imagination. Impressed by this, the Prince Regent  gave Scott permission in a Royal Warrant dated 28 October 1817 Papers Relative to the Regalia of Scotland p.6 by William Bell 1829 to conduct a search for the Crown Jewels . During the years of the Protectorate under ": null
    },
    {
        "Cromwell": "oliver cromwell"
    },
    {
        " the Crown Jewels had been hidden away, but had subsequently been used to crown ": null
    },
    {
        "Charles II": "charles ii of england"
    },
    {
        ". They were not used to crown subsequent monarchs, but were regularly taken to sittings of Parliament, to represent the absent monarch, until the ": null
    },
    {
        "Act of Union 1707": "act of union 1707"
    },
    {
        ". Thereafter, the honours were stored in Edinburgh Castle, but the large locked box in which they were stored was not opened for more than 100 years, and stories circulated that they had been lost or removed. On 4 February 1818, Papers Relative to the Regalia of Scotland p.9 by William Bell 1829 Scott and a small team of military men opened the box, and unearthed the honours from the Crown Room of ": null
    },
    {
        "Edinburgh Castle": "edinburgh castle"
    },
    {
        ". On 19 August 1818 through Scotts effort, his friend ": null
    },
    {
        "Adam": "adam ferguson"
    },
    {
        " was appointed Deputy Keeper of the ": null
    },
    {
        "Scottish Regalia": "honours of scotland"
    },
    {
        " . The Edinburgh Annual Register for 1818 Vol 11 Appx IV p.227 A grateful Prince Regent granted Scott the title of ": null
    },
    {
        "baronet": "baronet"
    },
    {
        ",  and in March 1820 he received the baronetcy in London, becoming Sir Walter Scott, 1st Baronet.      After Georges accession to the throne, the ": null
    },
    {
        "city council of Edinburgh": "city council of edinburgh"
    },
    {
        " invited Scott, at the Kings behest, to stage-manage the 1822 ": null
    },
    {
        "visit of King George IV to Scotland": "visit of king george iv to scotland"
    },
    {
        ". With only three weeks for planning and execution, Scott created a spectacular and comprehensive pageant, designed not only to impress the King, but also in some way to heal the rifts that had destabilised Scots society. He used the event to contribute to the drawing of a line under an old world that pitched his homeland into regular bouts of bloody strife. He, along with his production team , mounted what in modern days could be termed a ": null
    },
    {
        "PR": "public relations"
    },
    {
        " event, in which the King was dressed in ": null
    },
    {
        "tartan": "tartan"
    },
    {
        ", and was greeted by his people, many of whom were also dressed in similar tartan ceremonial dress. This form of dress, proscribed after the 1745 rebellion against the English, became one of the seminal, potent and ubiquitous symbols of Scottish identity.      In his novel  Kenilworth , Elizabeth I is welcomed to the castle of that name by means of an elaborate pageant, the details of which Scott was well qualified to itemize.     Much of Scotts autograph work shows an almost stream-of-consciousness approach to writing. He included little in the way of punctuation in his drafts, leaving such details to the printers to supply. See: ; Quoted in:  He eventually acknowledged in 1827 that he was the author of the ": null
    },
    {
        "Waverley Novels": "waverley novels"
    },
    {
        ".       In 1825, a UK-wide ": null
    },
    {
        "banking crisis": "panic of 1825"
    },
    {
        " resulted in the collapse of the Ballantyne printing business, of which Scott was the only partner with a financial interest; the companys debts of ": null
    },
    {
        "£": "pound sterling"
    },
    {
        "130,000  caused his very public ruin.  Rather than declare himself ": null
    },
    {
        "bankrupt": "bankruptcy"
    },
    {
        ", or to accept any kind of financial support from his many supporters and admirers , he placed his house and income in a trust belonging to his creditors, and determined to write his way out of debt. To add to his burdens, his wife Charlotte, died in 1826.     Whether in spite of these events, or because of them, Scott kept up his prodigious output. Between 1826 and 1832 producing six novels, two short stories and two plays, eleven works or volumes of non-fiction, and a journal, in addition to several unfinished works. The nonfiction works included the Life of Napoleon Buonaparte in 1827, two volumes of the History of Scotland in 1829 and 1830, four installments of the series entitled Tales of a Grandfather – Being Stories Taken From Scottish History, written one per year over the period 1828–1831, and Essays on Ballad Poetry in 1830, among several others. Finally, Scott had recently been inspired by the diaries of ": null
    },
    {
        "Samuel Pepys": "samuel pepys"
    },
    {
        " and ": null
    },
    {
        "Lord Byron": "lord byron"
    },
    {
        ", and he began keeping a journal over the period, which, however, would not be published until 1890, as ": null
    },
    {
        "The Journal of Sir Walter Scott": "the journal of sir walter scott"
    },
    {
        ".        By then Scotts health was failing, but he nevertheless undertook a grand tour of Europe, and was welcomed and celebrated wherever he went. He returned to Scotland, but in an epidemic of typhus, became ill. At ": null
    },
    {
        "Abbotsford": "abbotsford house"
    },
    {
        ", the now grand home he had first built as a cottage, he died on 21 September 1832. London Medical and Surgical Journal, January 1833     Lady Scott had been buried as an Episcopalian; two Presbyterian ministers and one Episcopalian officiated at his funeral.  Scott was buried in ": null
    },
    {
        "Dryburgh Abbey": "dryburgh abbey"
    },
    {
        ", where his wife had earlier been interred. Nearby is a large statue of ": null
    },
    {
        "William Wallace": "william wallace"
    },
    {
        ", one of Scotlands many romanticised historical figures.      Although Scott died owing money, his novels continued to sell, and the debts encumbering his estate were discharged shortly after his death.            Scott married Charlotte Carpenter in St Marys Church, ": null
    },
    {
        "Carlisle Cathedral": "carlisle cathedral"
    },
    {
        " on Christmas Eve 1797.     Scotts eldest son, Lt Walter Scott, inherited his fathers estate and possessions. He married Jane Jobson, heiress of ": null
    },
    {
        "Lochore": "lochore"
    },
    {
        " and the niece of Lady Margaret Ferguson, The Centenary Memorial of Sir Walter Scott p62 by CSM Lockhart 1871 only daughter of William Jobson of ": null
    },
    {
        "Lochore": "lochore"
    },
    {
        " and his wife Rachel Stuart , on 3 February 1825. Monuments and monumental inscriptions in Scotland: The Grampian Society, 1871     Scott, Sr.s lawyer from at least 1814 was Hay Donaldson ": null
    },
    {
        "WS": "society of writers to her majestys signet"
    },
    {
        " , who was also agent to the Duke of Buccleuch. Scott was Donaldsons proposer when he was elected a Fellow of the ": null
    },
    {
        "Royal Society of Edinburgh": "royal society of edinburgh"
    },
    {
        ".      Scott was raised a ": null
    },
    {
        "Presbyterian": "presbyterian"
    },
    {
        ", but later also adhered to the ": null
    },
    {
        "Scottish Episcopal Church": "scottish episcopal church"
    },
    {
        ". Many have suggested this demonstrates both his nationalistic and unionistic tendencies.  He was ordained as an elder in the Presbyterian ": null
    },
    {
        "Duddingston Kirk": "duddingston kirk"
    },
    {
        " in 1806, and sat in the General Assembly for a time as representative elder of the burgh of Selkirk. However, he received an Episcopal funeral at his own insistence. His Christian beliefs were explained and developed upon in his Religious Discourses of 1828.      His distant cousin was the poet ": null
    },
    {
        "Randall Swingler": "randall swingler"
    },
    {
        ".       Scotts father, also Walter , was a Freemason, being a member of Lodge St David, No.36 , and Scott also became a Freemason in his fathers Lodge in 1801,  albeit only after the death of his father.                When Scott was a boy, he sometimes travelled with his father from Selkirk to Melrose, where some of his novels are set. At a certain spot, the old gentleman would stop the carriage and take his son to a stone on the site of the ": null
    },
    {
        "Battle of Melrose": "battle of melrose"
    },
    {
        " .      During the summers from 1804, Scott made his home at the large house of Ashestiel, on the south bank of the River Tweed,  north of Selkirk. When his lease on this property expired in 1811, Scott bought Cartley Hole Farm, downstream on the Tweed nearer Melrose. The farm had the nickname of ": null
    },
    {
        "Clarty": "wikt:clarty"
    },
    {
        " Hole , and when Scott built a family cottage there in 1812 he named it Abbotsford .  He continued to expand the estate, and built Abbotsford House in a series of extensions.   The farmhouse developed into a wonderful home that has been likened to a fairy palace. Scott was a pioneer of the Scottish Baronial style of architecture, therefore Abbotsford is festooned with turrets and stepped gabling. Through windows enriched with the insignia of heraldry the sun shone on suits of armour, trophies of the chase, a library of more than 9,000 volumes, fine furniture, and still finer pictures. Panelling of oak and cedar and carved ceilings relieved by coats of arms in their correct colours added to the beauty of the house.      It is estimated that the building cost Scott more than £25,000 . More land was purchased until Scott owned nearly . In 1817 as part of the land purchases Scott bought the nearby mansion-house of Toftfield for his friend Adam Ferguson to live in along with his brothers and sisters and on which, at the ladies request, he bestowed the name of Huntlyburn.  Ferguson commissioned ": null
    },
    {
        "Sir David Wilkie": "david wilkie"
    },
    {
        " to paint the Scott family McCunn Florence 1910 Walter Scotts Friends. p.329 retrieved 8 April 2019 resulting in the painting The Abbotsford Family  in which Scott is seated with his family represented as a group of peasants. ": null
    },
    {
        "Ferguson": "adam ferguson"
    },
    {
        " is standing to the right with the feather in his cap and Thomas Scott, Scotts Uncle,  is behind.  The painting was exhibited at the Royal Academy in 1818.      A Roman road with a ford near Melrose used in olden days by the abbots of Melrose suggested the name of Abbotsford. Abbotsford later gave its name to the ": null
    },
    {
        "Abbotsford Club": "abbotsford club"
    },
    {
        ", founded in 1834 in memory of Sir Walter Scott.                  Although he continued to be extremely popular and widely read, both at home and abroad, …it would be difficult to name, from among both modern and ancient works, many read more widely and with greater pleasure than the historical novels of … Walter Scott. – ": null
    },
    {
        "Alessandro Manzoni": "alessandro manzoni"
    },
    {
        ", On the Historical Novel. Scotts critical reputation declined in the last half of the 19th century as serious writers turned from romanticism to realism, and Scott began to be regarded as an author suitable for children. This trend accelerated in the 20th century. For example, in his classic study  Aspects of the Novel  , ": null
    },
    {
        "E. M. Forster": "e. m. forster"
    },
    {
        " harshly criticized Scotts clumsy and slapdash writing style, flat characters, and thin plots. In contrast, the novels of Scotts contemporary ": null
    },
    {
        "Jane Austen": "jane austen"
    },
    {
        ", once appreciated only by the discerning few rose steadily in critical esteem, though Austen, as a female writer, was still faulted for her narrow choice of subject matter, which, unlike Scott, avoided the grand historical themes traditionally viewed as masculine.     Nevertheless, Scotts importance as an innovator continued to be recognized. He was acclaimed as the inventor of the genre of the modern ": null
    },
    {
        "historical novel": "historical novel"
    },
    {
        "  and the inspiration for enormous numbers of imitators and genre writers both in Britain and on the European continent. In the cultural sphere, Scotts Waverley novels played a significant part in the movement  in rehabilitating the public perception of the ": null
    },
    {
        "Scottish Highlands": "scottish highlands"
    },
    {
        " and its culture, which had been formerly suppressed as barbaric, and viewed in the southern mind as a breeding ground of hill bandits, religious fanaticism, and ": null
    },
    {
        "Jacobite rebellions": "jacobitism"
    },
    {
        ". Scott served as chairman of the ": null
    },
    {
        "Royal Society of Edinburgh": "royal society of edinburgh"
    },
    {
        " and was also a member of the ": null
    },
    {
        "Royal Celtic Society": "royal celtic society"
    },
    {
        ". His own contribution to the reinvention of Scottish culture was enormous, even though his re-creations of the customs of the ": null
    },
    {
        "Highlands": "scottish highlands"
    },
    {
        " were fanciful at times, despite his extensive travels around his native country. It is a testament to Scotts contribution in creating a unified identity for Scotland that Edinburghs central railway station, opened in 1854 by the ": null
    },
    {
        "North British Railway": "north british railway"
    },
    {
        ", is called ": null
    },
    {
        "Waverley": "edinburgh waverley railway station"
    },
    {
        ". The fact that Scott was a ": null
    },
    {
        "Lowland": "scottish lowlands"
    },
    {
        " Presbyterian": "church of scotland"
    },
    {
        ", rather than a Gaelic-speaking Catholic Highlander, made him more acceptable to a conservative English reading public. Scotts novels were certainly influential in the making of the Victorian craze for all things Scottish among British royalty, who were anxious to claim legitimacy through their rather attenuated historical connection with the royal house of Stuart.     At the time Scott wrote, Scotland was poised to move away from an era of socially divisive clan warfare to a modern world of literacy and industrial capitalism. Through the medium of Scotts novels, the violent religious and political conflicts of the countrys recent past could be seen as belonging to history—which Scott defined, as the subtitle of Waverley indicates, as something that happened at least 60 years ago. Scotts advocacy of objectivity and moderation and his strong repudiation of political violence on either side also had a strong, though unspoken, contemporary resonance in an era when many conservative English speakers lived in mortal fear of a revolution in the French style on British soil. Scotts orchestration of ": null
    },
    {
        "King George IVs visit to Scotland": "visit of king george iv to scotland"
    },
    {
        ", in 1822, was a pivotal event intended to inspire a view of his home country that, in his view, accentuated the positive aspects of the past while allowing the age of quasi-medieval blood-letting to be put to rest, while envisioning a more useful, peaceful future.     After Scotts work had been essentially unstudied for many decades, a revival of critical interest began from the 1960s. ": null
    },
    {
        "Postmodern": "postmodern"
    },
    {
        " tastes favoured discontinuous narratives and the introduction of the first person , yet they were more favourable to Scotts work than Modernist tastes. While ": null
    },
    {
        "F. R. Leavis": "f. r. leavis"
    },
    {
        " had disdained Scott, seeing him as a thoroughly bad novelist and a thoroughly bad influence , ": null
    },
    {
        "György Lukács": "györgy lukács"
    },
    {
        "  and ": null
    },
    {
        "David Daiches": "david daiches"
    },
    {
        "  offered a Marxian political reading of Scotts fiction that generated a great deal of genuine interest in his work. Scott is now seen as an important innovator and a key figure in the development of Scottish and world literature, and particularly as the principal inventor of the historical novel.                      During his lifetime, Scotts portrait was painted by Sir ": null
    },
    {
        "Edwin Landseer": "edwin landseer"
    },
    {
        " and fellow Scots Sir ": null
    },
    {
        "Henry Raeburn": "henry raeburn"
    },
    {
        " and ": null
    },
    {
        "James Eckford Lauder": "james eckford lauder"
    },
    {
        ". In Edinburgh, the 61.1-metre-tall ": null
    },
    {
        "Victorian Gothic": "victorian gothic"
    },
    {
        " spire of the ": null
    },
    {
        "Scott Monument": "scott monument"
    },
    {
        " was designed by ": null
    },
    {
        "George Meikle Kemp": "george meikle kemp"
    },
    {
        ". It was completed in 1844, 12 years after Scotts death, and dominates the south side of ": null
    },
    {
        "Princes Street": "princes street"
    },
    {
        ". Scott is also commemorated on a stone slab in ": null
    },
    {
        "Makars Court": "makars court"
    },
    {
        ", outside The Writers Museum, ": null
    },
    {
        "Lawnmarket": "lawnmarket"
    },
    {
        ", Edinburgh, along with other prominent Scottish writers; quotes from his work are also visible on the ": null
    },
    {
        "Canongate": "canongate"
    },
    {
        " Wall of the ": null
    },
    {
        "Scottish Parliament building": "scottish parliament building"
    },
    {
        " in ": null
    },
    {
        "Holyrood": "holyrood, edinburgh"
    },
    {
        ". There is a tower dedicated to his memory on ": null
    },
    {
        "Corstorphine Hill": "corstorphine hill"
    },
    {
        " in the west of the city and, as mentioned, Edinburghs Waverley railway station takes its name from one of his novels.     In ": null
    },
    {
        "Glasgow": "glasgow"
    },
    {
        ", ": null
    },
    {
        "Walter Scotts Monument": "public statues in glasgowgeorge square"
    },
    {
        " dominates the centre of ": null
    },
    {
        "George Square": "george square"
    },
    {
        ", the main public square in the city. Designed by ": null
    },
    {
        "David Rhind": "david rhind"
    },
    {
        " in 1838, the monument features a large column topped by a statue of Scott.    There is a statue of Scott in New York Citys ": null
    },
    {
        "Central Park": "central park"
    },
    {
        ".      Numerous Masonic Lodges have been named after him and his novels. For example: Lodge Sir Walter Scott, No. 859  and Lodge Waverley, No. 597, . Grand Lodge of Scotland Year Book. 2014. pp 25 & 34.      The annual ": null
    },
    {
        "Walter Scott Prize for Historical Fiction": "walter scott prize for historical fiction"
    },
    {
        " was created in 2010 by the ": null
    },
    {
        "Duke and Duchess of Buccleuch": "duke of buccleuch"
    },
    {
        ", whose ancestors were closely linked to Sir Walter Scott. At £25,000, it is one of the largest prizes in British literature. The award has been presented at Scotts historic home, Abbotsford House.     Scott has been credited with rescuing the ": null
    },
    {
        "Scottish banknote": "banknotes of the pound sterling"
    },
    {
        ". In 1826, there was outrage in Scotland at the attempt of ": null
    },
    {
        "Parliament": "parliament of the united kingdom"
    },
    {
        " to prevent the production of banknotes of less than five pounds. Scott wrote a series of letters to the Edinburgh Weekly Journal under the pseudonym  Malachi Malagrowther  for retaining the right of Scottish banks to issue their own banknotes. This provoked such a response that the Government was forced to relent and allow the Scottish banks to continue printing pound notes. This campaign is commemorated by his continued appearance on the front of all notes issued by the ": null
    },
    {
        "Bank of Scotland": "bank of scotland"
    },
    {
        ". The image on the 2007 series of banknotes is based on the portrait by ": null
    },
    {
        "Henry Raeburn": "henry raeburn"
    },
    {
        ".      During and immediately after World War I there was a movement spearheaded by ": null
    },
    {
        "President Wilson": "woodrow wilson"
    },
    {
        " and other eminent people to ": null
    },
    {
        "inculcate patriotism in American school children": "effect of world war i on children in the united states"
    },
    {
        ", especially immigrants, and to stress the American connection with the literature and institutions of the mother country of Great Britain, using selected readings in middle school textbooks. For example, see:  Scotts Ivanhoe continued to be required reading for many American high school students until the end of the 1950s.     A bust of Scott is in the Hall of Heroes of the ": null
    },
    {
        "National Wallace Monument": "national wallace monument"
    },
    {
        " in ": null
    },
    {
        "Stirling": "stirling"
    },
    {
        ". Twelve streets in ": null
    },
    {
        "Vancouver, British Columbia": "vancouver, british columbia"
    },
    {
        " are named after Scotts books or characters.                ": null
    },
    {
        "Letitia Elizabeth Landon": "letitia elizabeth landon"
    },
    {
        " was a great admirer of Scott and, on his death, she wrote two tributes to him: On Walter Scott in the Literary Gazette, and Sir Walter Scott in Fishers Drawing Room Scrap Book, 1833. Towards the end of her life she began a series called The Female Picture Gallery with a series of character analyses based on the women in Scotts works.     In ": null
    },
    {
        "Charles Baudelaires": "charles baudelaire"
    },
    {
        "  La Fanfarlo  , poet Samuel Cramer says of Scott:          In the novella, however, Cramer proves as deluded a romantic as any hero in one of Scotts novels. See Francis S. Heck, Baudelaires La Fanfarlo: An Example of Romantic Irony , The French Review 49: 3 : 328–36.     In ": null
    },
    {
        "Anne Brontës": "anne brontë"
    },
    {
        "  The Tenant of Wildfell Hall  the narrator, Gilbert Markham, brings an elegantly bound copy of  Marmion  as a present to the independent tenant of Wildfell Hall whom he is courting, and is mortified when she insists on paying for it.     In a speech delivered at Salem, Massachusetts, on 6 January 1860, to raise money for the families of the executed abolitionist ": null
    },
    {
        "John Brown": "john brown"
    },
    {
        " and his followers, ": null
    },
    {
        "Ralph Waldo Emerson": "ralph waldo emerson"
    },
    {
        " calls Brown an example of true chivalry, which consists not in noble birth but in helping the weak and defenseless and declares that Walter Scott would have delighted to draw his picture and trace his adventurous career .      In his 1870 memoir, Army Life in a Black Regiment, New England abolitionist ": null
    },
    {
        "Thomas Wentworth Higginson": "thomas wentworth higginson"
    },
    {
        " , described how he wrote down and preserved Negro spirituals or shouts while serving as a colonel in the ": null
    },
    {
        "First South Carolina Volunteers": "first south carolina volunteers"
    },
    {
        ", the first authorized Union Army regiment recruited from freedmen during the Civil War. He wrote that he was a faithful student of the Scottish ballads, and had always envied Sir Walter the delight of tracing them out amid their own heather, and of writing them down piecemeal from the lips of aged crones .     According to his daughter ": null
    },
    {
        "Eleanor": "eleanor marx"
    },
    {
        ", Scott was an author to whom ": null
    },
    {
        "Karl Marx": "karl marx"
    },
    {
        " again and again returned, whom he admired and knew as well as he did Balzac and Fielding . S.S. Prawer, Karl Marx and World Literature, Oxford, 1976, p.386.     In his 1883  Life on the Mississippi , ": null
    },
    {
        "Mark Twain": "mark twain"
    },
    {
        " satirized the impact of Scotts writings, declaring that Scott had so large a hand in making Southern character, as it existed before the ": null
    },
    {
        " [American Civil] war": "american civil war"
    },
    {
        " , that he is in great measure responsible for the war .  He goes on to coin the term Sir Walter Scott disease , which he blames for the Souths lack of advancement. Twain also targeted Scott in  Adventures of Huckleberry Finn , where he names a sinking boat the Walter Scott ; and, in  A Connecticut Yankee in King Arthurs Court  , the main character repeatedly utters great Scott as an oath; by the end of the book, however, he has become absorbed in the world of knights in armor, reflecting Twains ambivalence on the topic.     The idyllic Cape Cod retreat of suffragists Verena Tarrant and Olive Chancellor in Henry James  The Bostonians  is called Marmion, evoking what James considered the Quixotic idealism of these social reformers.     In  To the Lighthouse  by ": null
    },
    {
        "Virginia Woolf": "virginia woolf"
    },
    {
        ", Mrs. Ramsey glances at her husband:        In 1951, science-fiction author ": null
    },
    {
        "Isaac Asimov": "isaac asimov"
    },
    {
        " wrote  Breeds There a Man...? , a short story with a title alluding vividly to Scotts  The Lay of the Last Minstrel  .     In  To Kill a Mockingbird  , the protagonists brother is made to read Walter Scotts book  Ivanhoe  to the ailing Mrs. Henry Lafayette Dubose.     In  Mother Night  by ": null
    },
    {
        "Kurt Vonnegut": "kurt vonnegut"
    },
    {
        " Jr., ": null
    },
    {
        "memoir": "memoir"
    },
    {
        "ist and playwright Howard W. Campbell Jr. prefaces his text with the six lines beginning Breathes there the man...     In Knights of the Sea by Canadian author ": null
    },
    {
        "Paul Marlowe": "paul marlowe"
    },
    {
        ", there are several quotes from and references to  Marmion , as well as an inn named after  Ivanhoe , and a fictitious Scott novel entitled The Beastmen of Glen Glammoch.                The ": null
    },
    {
        "Waverley Novels": "waverley novels"
    },
    {
        " is the title given to the long series of Scott novels released from 1814 to 1832 which takes its name from the first novel,  Waverley . The following is a chronological list of the entire series:     1814:  Waverley   Guy Mannering   The Antiquary   The Black Dwarf  and  The Tale of Old Mortality  – the 1st instalment from the subset series, ": null
    },
    {
        "Tales of My Landlord": "tales of my landlord"
    },
    {
        "  Rob Roy   The Heart of Midlothian  – the 2nd instalment from the subset series, ": null
    },
    {
        "Tales of My Landlord": "tales of my landlord"
    },
    {
        "  The Bride of Lammermoor  and  A Legend of Montrose  – the 3rd instalment from the subset series, ": null
    },
    {
        "Tales of My Landlord": "tales of my landlord"
    },
    {
        "  Ivanhoe   The Monastery  and  The Abbot  – from the subset series, ": null
    },
    {
        "Tales from Benedictine Sources": "tales from benedictine sources"
    },
    {
        "  Kenilworth   The Pirate   The Fortunes of Nigel   Peveril of the Peak   Quentin Durward   St. Ronans Well   Redgauntlet   The Betrothed  and  The Talisman  – from the subset series, ": null
    },
    {
        "Tales of the Crusaders": "tales of the crusaders"
    },
    {
        "  Woodstock   The Fair Maid of Perth  – the 2nd instalment from the subset series, ": null
    },
    {
        "Chronicles of the Canongate": "chronicles of the canongate"
    },
    {
        "    1829:  Anne of Geierstein   Count Robert of Paris  and  Castle Dangerous  – the 4th instalment from the subset series, ": null
    },
    {
        "Tales of My Landlord": "tales of my landlord"
    },
    {
        "     Other novels:     1831–1832:  The Siege of Malta  – a finished novel published posthumously in 2008   1832:  Bizarro  – an unfinished novel published posthumously in 2008       Many of the short poems or songs released by Scott were originally not separate pieces but parts of longer poems interspersed throughout his novels, tales, and dramas.     1796: The Chase – an ": null
    },
    {
        "English-language": "english"
    },
    {
        " translation of the ": null
    },
    {
        "German-language": "german"
    },
    {
        " poem by ": null
    },
    {
        "Gottfried August Bürger": "gottfried august bürger"
    },
    {
        " entitled Der Wilde Jäger , first of the ": null
    },
    {
        "translations and imitations from German ballads by Scott": "translations and imitations from german ballads by sir walter scott"
    },
    {
        "  Minstrelsy of the Scottish Border   The Lay of the Last Minstrel  Ballads and Lyrical Pieces ": null
    },
    {
        "Marmion": "marmion"
    },
    {
        " The Lady of the Lake": "the lady of the lake"
    },
    {
        "  The Vision of Don Roderick  ": null
    },
    {
        "The Bridal of Triermain": "the bridal of triermain by walter scott"
    },
    {
        " Rokeby": "rokeby"
    },
    {
        "  The Field of Waterloo   The Lord of the Isles   Harold the Dauntless   Chronicles of the Canongate   The Keepsake Stories   Goetz of Berlichingen, with the Iron Hand: A Tragedy  – an English-language translation of the 1773 German-language play by ": null
    },
    {
        "Johann Wolfgang von Goethe": "johann wolfgang von goethe"
    },
    {
        " entitled  Götz von Berlichingen  Halidon Hill  MacDuffs Cross  The Doom of Devorgoil Auchindrane Translations & imitations of German Ballads  The Border Antiquities of England and Scotland – a work co-authored by ": null
    },
    {
        "Luke Clennell": "luke clennell"
    },
    {
        " and ": null
    },
    {
        "John Greig": "john greig"
    },
    {
        " with Scotts contribution consisting of the substantial introductory essay, originally published in 2 volumes from 1814 to 1817   1815–1824: Essays on Chivalry, Romance, and Drama – a supplement to the 1815–1824 editions of the  Encyclopædia Britannica  Pauls Letters to his Kinsfolk Provincial Antiquities of Scotland Lives of the Novelists  The Journal of Sir Walter Scott  The Letters of Malachi Malagrowther The Life of Napoleon Buonaparte Religious Discourses Tales of a Grandfather; Being Stories Taken from Scottish History – the 1st instalment from the series, ": null
    },
    {
        "Tales of a Grandfather": "tales of a grandfather"
    },
    {
        " The History of Scotland: Volume I Tales of a Grandfather; Being Stories Taken from Scottish History – the 2nd instalment from the series, ": null
    },
    {
        "Tales of a Grandfather": "tales of a grandfather"
    },
    {
        " Essays on Ballad Poetry The History of Scotland: Volume II Tales of a Grandfather; Being Stories Taken from Scottish History – the 3rd instalment from the series, ": null
    },
    {
        "Tales of a Grandfather": "tales of a grandfather"
    },
    {
        " Letters on Demonology and Witchcraft Tales of a Grandfather; Being Stories Taken from the History of France – the 4th instalment from the series, ": null
    },
    {
        "Tales of a Grandfather": "tales of a grandfather"
    },
    {
        " Manners, customs and history of the Highlanders of Scotland ; Historical account of the clan MacGregor": null
    }
]