[
    {
        "           Walter Bower  was a ": null
    },
    {
        "Scottish": "scotland"
    },
    {
        " canon regular": "canon regular"
    },
    {
        " and ": null
    },
    {
        "abbot": "abbot"
    },
    {
        " of ": null
    },
    {
        "Inchcolm Abbey": "inchcolm abbey"
    },
    {
        " in the ": null
    },
    {
        "Firth of Forth": "firth of forth"
    },
    {
        ", who is noted as a ": null
    },
    {
        "chronicler": "chronicler"
    },
    {
        " of his era. He was born about 42 at ": null
    },
    {
        "Haddington": "haddington, east lothian"
    },
    {
        ", ": null
    },
    {
        "East Lothian": "east lothian"
    },
    {
        ", in the ": null
    },
    {
        "Kingdom of Scotland": "kingdom of scotland"
    },
    {
        ". In 42 ": null
    },
    {
        "Donald Watt": "d. e. r. watt"
    },
    {
        " said of Bowers  Scotichronicon  that We are more and more convinced that this book   is one of the national treasures of Scotland, which should be studied in depth for many different kinds of enquiry into Scotland’s past.        Some sources say that, at the age of eighteen, Bower assumed the religious habit; he was trained at the ": null
    },
    {
        "University of St Andrews": "university of st andrews"
    },
    {
        ". After finishing his philosophical and theological studies, he visited Paris in order to study law. Bower was unanimously the ": null
    },
    {
        "abbot": "abbot"
    },
    {
        " of the ": null
    },
    {
        "Augustinian community": "augustinians"
    },
    {
        " on ": null
    },
    {
        "Inchcolm": "inchcolm"
    },
    {
        " in 42 He also acted as one of the commissioners for the collection of the ": null
    },
    {
        "ransom": "ransom"
    },
    {
        " of King ": null
    },
    {
        "James I of Scotland": "james i of scotland"
    },
    {
        " in 42 and 42 Later, in 42 he took part in a diplomatic mission to ": null
    },
    {
        "Paris": "paris"
    },
    {
        " to discuss the possibility of marriage of the kings daughter to the ": null
    },
    {
        "Dauphin of France": "dauphin of france"
    },
    {
        ". He played an important part at the Council of Perth of 42 in the defence of Scottish rights.     During Bowers closing years he was engaged on his work, the  Scotichronicon , on which his reputation now chiefly rests. This work, undertaken in 42 by desire of a neighbour, Sir David Stewart of ": null
    },
    {
        "Rosyth Castle": "rosyth castle"
    },
    {
        ", was a continuation of the  Chronica Gentis Scotorum  of ": null
    },
    {
        "John of Fordun": "john of fordun"
    },
    {
        ". The completed work, in its original form, consisted of sixteen books, of which the first five and a portion of the sixth are Forduns—or mainly his, for Bower added to them at places. In the later books, down to the reign of ": null
    },
    {
        "Robert I": "robert i of scotland"
    },
    {
        " , he was aided by Forduns  Gesta Annalia , but from that point to the close the work is original and of contemporary importance, especially for James I, with whose death it ends. The task was finished in 42     In the two remaining years of Bowers life he was engaged on a reduction or abridgment of this work, which is known as the Book of Cupar, and is preserved in the ": null
    },
    {
        "Advocates library": "advocates library"
    },
    {
        ", ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        " . Other abridgments, not by Bower, were made about the same time, one about 42 , also preserved in the Advocates library and another in 42 by an unknown writer, preserved in the same collection . Copies of the full text of the Scotichronicon, by different scribes, still exist. There are two in the ": null
    },
    {
        "British Library": "british library"
    },
    {
        ", in  The Black Book of Paisley , and in ": null
    },
    {
        "Harl. MS.": "harleian library"
    },
    {
        " 42; one in the Advocates library, from which ": null
    },
    {
        "Walter Goodall": "walter goodall"
    },
    {
        " printed his edition , and one in the library of ": null
    },
    {
        "Corpus Christi College, Cambridge": "corpus christi college, cambridge"
    },
    {
        ".     See also ": null
    },
    {
        "W. F. Skene": "william forbes skene"
    },
    {
        "s edition of Fordun in the series of Historians of Scotland . Personal references are to be found in the Exchequer Rolls of Scotland, iii. and iv.     A revised and updated translation of Bowers work was produced under the leadership of Professor ": null
    },
    {
        "D. E. R. Watt": "d. e. r. watt"
    },
    {
        ", in nine volumes, published between 42 and 42 The critical edition of Bowers Latin text in Watt et al. has been amended and corrected by Chris Nighman in light of the discovery that Bower made extensive use of Thomas of Irelands collection of authoritative quotations, the  Manipulus florum  .       Scotichronicon , Edinburgh, 42   John of Fordun, ed. Skene, ap. Historians of Scotland, preface and introductions ": null
    }
]