[
    {
        "                     Walter Elias Disney  was an American entrepreneur, animator, voice actor and film producer. A pioneer of the ": null
    },
    {
        "American animation industry": "modern animation in the united states"
    },
    {
        ", he introduced several developments in the production of ": null
    },
    {
        "cartoon": "cartoon"
    },
    {
        "s. As a film producer, Disney holds the record for most ": null
    },
    {
        "Academy Awards": "academy awards"
    },
    {
        " earned by an individual, having won 42 Oscars from 42 nominations. He was presented with two ": null
    },
    {
        "Golden Globe": "golden globe awards"
    },
    {
        " Special Achievement Awards and an ": null
    },
    {
        "Emmy Award": "emmy award"
    },
    {
        ", among other honors. Several of his films are included in the ": null
    },
    {
        "National Film Registry": "national film registry"
    },
    {
        " by the ": null
    },
    {
        "Library of Congress": "library of congress"
    },
    {
        ".     Born in Chicago in 42 Disney developed an early interest in drawing. He took art classes as a boy and got a job as a commercial illustrator at the age of 42 He moved to California in the early 42s and set up the ": null
    },
    {
        "Disney Brothers Studio": "the walt disney company"
    },
    {
        " with his brother ": null
    },
    {
        "Roy": "roy o. disney"
    },
    {
        ". With ": null
    },
    {
        "Ub Iwerks": "ub iwerks"
    },
    {
        ", Walt developed the character ": null
    },
    {
        "Mickey Mouse": "mickey mouse"
    },
    {
        " in 42 his first highly popular success; he also provided the voice for his creation in the early years. As the studio grew, Disney became more adventurous, introducing synchronized sound, full-color three-strip ": null
    },
    {
        "Technicolor": "technicolor"
    },
    {
        ", ": null
    },
    {
        "feature-length": "feature-length"
    },
    {
        " cartoons and technical developments in cameras. The results, seen in features such as  Snow White and the Seven Dwarfs  ,  Pinocchio ,  Fantasia  ,  Dumbo  , and  Bambi  , furthered the development of animated film. New animated and ": null
    },
    {
        "live-action": "live-action"
    },
    {
        " films followed after World War II, including the critically successful  Cinderella  and  Mary Poppins  , the latter of which received five Academy Awards.     In the 42s, Disney expanded into the ": null
    },
    {
        "amusement park": "amusement park"
    },
    {
        " industry, and in 42 he opened ": null
    },
    {
        "Disneyland": "disneyland"
    },
    {
        ". To fund the project he diversified into television programs, such as  Walt Disneys Disneyland  and  The Mickey Mouse Club ; he was also involved in planning the ": null
    },
    {
        "42 Moscow Fair": "american national exhibition"
    },
    {
        ", the ": null
    },
    {
        "42 Winter Olympics": "1960 winter olympics"
    },
    {
        ", and the ": null
    },
    {
        "42 New York Worlds Fair": "1964 new york worlds fair"
    },
    {
        ". In 42 he began development of another theme park, ": null
    },
    {
        "Disney World": "walt disney world"
    },
    {
        ", the heart of which was to be a new type of city, the ": null
    },
    {
        "Experimental Prototype Community of Tomorrow": "epcot"
    },
    {
        " . Disney was a heavy smoker throughout his life, and died of lung cancer in December 42 before either the park or the EPCOT project were completed.     Disney was a shy, self-deprecating and insecure man in private but adopted a warm and outgoing public persona. He had high standards and high expectations of those with whom he worked. Although there have been accusations that he was ": null
    },
    {
        "racist": "racism"
    },
    {
        " or ": null
    },
    {
        "anti-Semitic": "antisemitism"
    },
    {
        ", they have been contradicted by many who knew him. His reputation changed in the years after his death, from a purveyor of homely patriotic values to a representative of ": null
    },
    {
        "American imperialism": "american imperialism"
    },
    {
        ". He nevertheless remains an important figure in the history of animation and in the cultural history of the United States, where he is considered a national ": null
    },
    {
        "cultural icon": "cultural icon"
    },
    {
        ". His film work continues to be shown and adapted; his namesake studio and company maintains high standards in its production of popular entertainment, and the Disney amusement parks have grown in size and number to attract visitors in several countries.         Walt Disney was born on December 42 42 at 42 Tripp Avenue, in Chicagos ": null
    },
    {
        "Hermosa": "hermosa, chicago"
    },
    {
        " neighborhood. He was the fourth son of ": null
    },
    {
        "Elias Disney": "elias disney"
    },
    {
        "born in the ": null
    },
    {
        "Province of Canada": "province of canada"
    },
    {
        ", to Irish parentsand ": null
    },
    {
        "Flora": "flora call disney"
    },
    {
        " , an American of German and English descent.  Aside from Disney, Elias and Floras sons were Herbert, Raymond and ": null
    },
    {
        "Roy": "roy o. disney"
    },
    {
        "; the couple had a fifth child, Ruth, in December 42 In 42 when Disney was four, the family moved to a farm in ": null
    },
    {
        "Marceline, Missouri": "marceline, missouri"
    },
    {
        ", where his uncle Robert had just purchased land. In Marceline, Disney developed his interest in drawing when he was paid to draw the horse of a retired neighborhood doctor. Elias was a subscriber to the  Appeal to Reason  newspaper, and Disney practiced drawing by copying the front-page cartoons of ": null
    },
    {
        "Ryan Walker": "ryan walker"
    },
    {
        ". Disney also began to develop an ability to work with watercolors and crayons. He lived near the ": null
    },
    {
        "Atchison, Topeka and Santa Fe Railway": "atchison, topeka and santa fe railway"
    },
    {
        " line and became enamored with trains. He and his younger sister Ruth started school at the same time at the Park School in Marceline in late 42     In 42 the Disneys moved to ": null
    },
    {
        "Kansas City, Missouri": "kansas city, missouri"
    },
    {
        ". There, Disney attended the Benton Grammar School, where he met fellow-student Walter Pfeiffer, who came from a family of theatre fans and introduced Disney to the world of ": null
    },
    {
        "vaudeville": "vaudeville"
    },
    {
        " and motion pictures. Before long, he was spending more time at the Pfeiffers house than at home. Elias had purchased a newspaper delivery route for  The Kansas City Star  and  Kansas City Times . Disney and his brother Roy woke up at 42:42 every morning to deliver the Times before school and repeated the round for the evening Star after school. The schedule was exhausting, and Disney often received poor grades after falling asleep in class, but he continued his paper route for more than six years. He attended Saturday courses at the ": null
    },
    {
        "Kansas City Art Institute": "kansas city art institute"
    },
    {
        " and also took a ": null
    },
    {
        "correspondence course": "correspondence course"
    },
    {
        " in cartooning.     In 42 Elias bought stock in a Chicago jelly producer, the O-Zell Company, and moved back to the city with his family. Disney enrolled at ": null
    },
    {
        "McKinley High School": "mckinley high school"
    },
    {
        " and became the cartoonist of the school newspaper, drawing patriotic pictures about World War I;  he also took night courses at the ": null
    },
    {
        "Chicago Academy of Fine Arts": "chicago academy of fine arts"
    },
    {
        ". In mid42 Disney attempted to join the ": null
    },
    {
        "United States Army": "united states army"
    },
    {
        " to fight ": null
    },
    {
        "against the Germans": "western front"
    },
    {
        ", but he was rejected for being too young. After ": null
    },
    {
        "forging the date of birth": "age fabrication"
    },
    {
        " on his birth certificate, he joined the ": null
    },
    {
        "Red Cross": "red cross"
    },
    {
        " in September 42 as an ambulance driver. He was shipped to France but arrived in November, after ": null
    },
    {
        "the armistice": "armistice of 11 november 1918"
    },
    {
        ". He drew cartoons on the side of his ambulance for decoration and had some of his work published in the army newspaper  Stars and Stripes . Disney returned to Kansas City in October 42 where he worked as an apprentice artist at the Pesmen-Rubin Commercial Art Studio. There, he drew commercial illustrations for advertising, theater programs and catalogs. He also befriended fellow artist ": null
    },
    {
        "Ub Iwerks": "ub iwerks"
    },
    {
        ".          In January 42 as Pesmen-Rubins revenue declined after Christmas, Disney and Iwerks were laid off. They started their own business, the short-lived Iwerks-Disney Commercial Artists. Failing to attract many customers, Disney and Iwerks agreed that Disney should leave temporarily to earn money at the Kansas City Film Ad Company, run by A.  V. Cauger; the following month Iwerks, who was not able to run their business alone, also joined. The company produced commercials using the ": null
    },
    {
        "cutout animation": "cutout animation"
    },
    {
        " technique. Disney became interested in animation, although he preferred drawn cartoons such as  Mutt and Jeff  and  Koko the Clown . With the assistance of a borrowed book on animation and a camera, he began experimenting at home. He came to the conclusion that ": null
    },
    {
        "cel animation": "cel animation"
    },
    {
        " was more promising than the cutout method. Unable to persuade Cauger to try ": null
    },
    {
        "cel": "cel"
    },
    {
        " animation at the company, Disney opened a new business with a co-worker from the Film Ad Co, ": null
    },
    {
        "Fred Harman": "fred harman"
    },
    {
        ". Their main client was the local Newman Theater, and the short cartoons they produced were sold as Newmans Laugh-O-Grams . Disney studied ": null
    },
    {
        "Paul Terrys": "paul terry"
    },
    {
        "  Aesops Fables  as a model, and the first six Laugh-O-Grams were modernized fairy tales.        In May 42 the success of the Laugh-O-Grams led to the establishment of ": null
    },
    {
        "Laugh-O-Gram Studio": "laugh-o-gram studio"
    },
    {
        ", for which he hired more animators, including Fred Harmans brother ": null
    },
    {
        "Hugh": "harman and ising"
    },
    {
        ", ": null
    },
    {
        "Rudolf Ising": "harman and ising"
    },
    {
        " and Iwerks. The Laugh-O-Grams cartoons did not provide enough income to keep the company solvent, so Disney started production of  Alices Wonderland based on  Alices Adventures in Wonderland which combined live action with animation; he cast ": null
    },
    {
        "Virginia Davis": "virginia davis"
    },
    {
        " in ": null
    },
    {
        "the title role": "alice"
    },
    {
        ". The result, a 42-and-a-half-minute, ": null
    },
    {
        "one-reel": "short film"
    },
    {
        " film, was completed too late to save Laugh-O-Gram Studio, which went into bankruptcy in 42     Disney moved to Hollywood in July 42 Although New York was the center of the cartoon industry, he was attracted to Los Angeles because his brother Roy was convalescing from ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        " there, and he hoped to become a live-action film director. Disneys efforts to sell Alices Wonderland were in vain until he heard from New York film distributor ": null
    },
    {
        "Margaret J. Winkler": "margaret j. winkler"
    },
    {
        ". She was losing the rights to both the  Out of the Inkwell  and  Felix the Cat  cartoons, and needed a new series. In October, they signed a contract for six ": null
    },
    {
        "Alice comedies": "alice comedies"
    },
    {
        ", with an option for two further series of six episodes each. Disney and his brother Roy formed the Disney Brothers Studiowhich later became ": null
    },
    {
        "The Walt Disney Company": "the walt disney company"
    },
    {
        "to produce the films; they persuaded Davis and her family to relocate to ": null
    },
    {
        "Hollywood": "cinema of the united states"
    },
    {
        " to continue production, with Davis on contract at $42 a month. In July 42 Disney also hired Iwerks, persuading him to relocate to Hollywood from Kansas City.     Early in 42 Disney hired an ink artist, ": null
    },
    {
        "Lillian Bounds": "lillian disney"
    },
    {
        ". They married in July of that year, at her brothers house in her hometown of ": null
    },
    {
        "Lewiston, Idaho": "lewiston, idaho"
    },
    {
        ".  The marriage was generally happy, according to Lillian, although according to Disneys biographer ": null
    },
    {
        "Neal Gabler": "neal gabler"
    },
    {
        " she did not accept Walts decisions meekly or his status unquestionably, and she admitted that he was always telling people how henpecked he is.  Lillian had little interest in films or the Hollywood social scene and she was, in the words of the historian Steven Watts, content with household management and providing support for her husband . Their marriage produced two daughters, ": null
    },
    {
        "Diane": "diane disney miller"
    },
    {
        " and Sharon . Within ": null
    },
    {
        "the family": "disney family"
    },
    {
        ", neither Disney nor his wife hid the fact Sharon had been adopted, although they became annoyed if people outside the family raised the point. The Disneys were careful to keep their daughters out of the public eye as much as possible, particularly in the light of the ": null
    },
    {
        "Lindbergh kidnapping": "lindbergh kidnapping"
    },
    {
        "; Disney took steps to ensure his daughters were not photographed by the press.        By 42 Winklers role in the distribution of the Alice series had been handed over to her husband, the film producer ": null
    },
    {
        "Charles Mintz": "charles mintz"
    },
    {
        ", although the relationship between him and Disney was sometimes strained. The series ran until July 42 by which time Disney had begun to tire of it and wanted to move away from the mixed format to all animation. After Mintz requested new material to distribute through ": null
    },
    {
        "Universal Pictures": "universal pictures"
    },
    {
        ", Disney and Iwerks created ": null
    },
    {
        "Oswald the Lucky Rabbit": "oswald the lucky rabbit"
    },
    {
        ", a character Disney wanted to be peppy, alert, saucy and venturesome, keeping him also neat and trim .      In February 42 Disney hoped to negotiate a larger fee for producing the Oswald series, but found Mintz wanting to reduce the payments. Mintz had also persuaded many of the artists involved to work directly for him, including Harman, Ising, ": null
    },
    {
        "Carman Maxwell": "carman maxwell"
    },
    {
        " and ": null
    },
    {
        "Friz Freleng": "friz freleng"
    },
    {
        ". Disney also found out that Universal owned the ": null
    },
    {
        "intellectual property rights": "intellectual property rights"
    },
    {
        " to Oswald. Mintz threatened to start his own studio and produce the series himself if Disney refused to accept the reductions. Disney declined Mintzs ultimatum and lost most of his animation staff, except Iwerks, who chose to remain with him.             To replace Oswald, Disney and Iwerks developed ": null
    },
    {
        "Mickey Mouse": "mickey mouse"
    },
    {
        ", possibly inspired by a pet mouse that Disney had adopted while working in his Laugh-O-Gram studio, although the origins of the character are unclear. Disneys original choice of name was Mortimer Mouse, but Lillian thought it too pompous, and suggested Mickey instead. Iwerks revised Disneys provisional sketches to make the character easier to animate. Disney, who had begun to distance himself from the animation process, provided Mickeys voice until 42 In the words of one Disney employee, Ub designed Mickeys physical appearance, but Walt gave him his soul.        Mickey Mouse first appeared in May 42 as a single test screening of the short  Plane Crazy , but it, and the second feature,  The Gallopin Gaucho , failed to find a distributor. Following the 42 sensation  The Jazz Singer , Disney used synchronized sound on the third short,  Steamboat Willie , to create the first post-produced ": null
    },
    {
        "sound cartoon": "sound film"
    },
    {
        ". After the animation was complete, Disney signed a contract with the former executive of Universal Pictures, ": null
    },
    {
        "Pat Powers": "pat powers"
    },
    {
        ", to use the Powers Cinephone recording system; Cinephone became the new distributor for Disneys early sound cartoons, which soon became popular.     To improve the quality of the music, Disney hired the professional composer and arranger ": null
    },
    {
        "Carl Stalling": "carl stalling"
    },
    {
        ", on whose suggestion the  Silly Symphony  series was developed, providing stories through the use of music; the first in the series,  The Skeleton Dance  , was drawn and animated entirely by Iwerks. Also hired at this time were several local artists, some of whom stayed with the company as core animators; the group later became known as the ": null
    },
    {
        "Nine Old Men": "disneys nine old men"
    },
    {
        ". Both the Mickey Mouse and Silly Symphonies series were successful, but Disney and his brother felt they were not receiving their rightful share of profits from Powers. In 42 Disney tried to trim costs from the process by urging Iwerks to abandon the practice of animating every separate cel in favor of the more efficient technique of drawing key poses and letting lower-paid assistants ": null
    },
    {
        "sketch the poses": "inbetweening"
    },
    {
        ". Disney asked Powers for an increase in payments for the cartoons. Powers refused and signed Iwerks to work for him; Stalling resigned shortly afterwards, thinking that without Iwerks, the Disney Studio would close. Disney had a nervous breakdown in October 42which he blamed on the machinations of Powers and his own overworkso he and Lillian took an extended holiday to Cuba and a cruise to Panama to recover.        With the loss of Powers as distributor, Disney studios signed a contract with ": null
    },
    {
        "Columbia Pictures": "columbia pictures"
    },
    {
        " to distribute the Mickey Mouse cartoons, which became increasingly popular, including internationally.  Disney, always keen to embrace new technology, filmed  Flowers and Trees  in full-color three-strip ": null
    },
    {
        "Technicolor": "technicolor"
    },
    {
        "; he was also able to negotiate a deal giving him the sole right to use the three-strip process until August 42 42 All subsequent Silly Symphony cartoons were in color. Flowers and Trees was popular with audiences and won the ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        " for best ": null
    },
    {
        "Short Subject ": "academy award for best animated short film"
    },
    {
        " at the ": null
    },
    {
        "42 ceremony": "5th academy awards"
    },
    {
        ". Disney had been nominated for another film in that category,  Mickeys Orphans , and received an ": null
    },
    {
        "Honorary Award": "academy honorary award"
    },
    {
        " for the creation of Mickey Mouse .     In 42 Disney produced  The Three Little Pigs , a film described by the media historian Adrian Danks as the most successful short animation of all time . The film won Disney another Academy Award in the Short Subject category. The films success led to a further increase in the studios staff, which numbered nearly 42 by the end of the year. Disney realized the importance of telling emotionally gripping stories that would interest the audience, and he invested in a story department separate from the animators, with ": null
    },
    {
        "storyboard artist": "storyboard artist"
    },
    {
        "s who would detail the plots of Disneys films.          By 42 Disney had become dissatisfied with producing formulaic cartoon shorts, and believed a feature-length cartoon would be more profitable. The studio began the four-year production of  Snow White and the Seven Dwarfs , based on ": null
    },
    {
        "the fairy tale": "snow white"
    },
    {
        ". When news leaked out about the project, many in the film industry predicted it would bankrupt the company; industry insiders nicknamed it Disneys Folly . The film, which was the first animated feature made in full color and sound, cost $42  million to producethree times over budget. To ensure the animation was as realistic as possible, Disney sent his animators on courses at the ": null
    },
    {
        "Chouinard Art Institute": "chouinard art institute"
    },
    {
        "; he brought animals into the studio and hired actors so that the animators could study realistic movement. To portray the changing perspective of the background as a camera moved through a scene, Disneys animators developed a ": null
    },
    {
        "multiplane camera": "multiplane camera"
    },
    {
        " which allowed drawings on pieces of glass to be set at various distances from the camera, creating an illusion of depth. The glass could be moved to create the impression of a camera passing through the scene. The first work created on the cameraa Silly Symphony called  The Old Mill  won the Academy Award for Animated Short Film because of its impressive visual power. Although Snow White had been largely finished by the time the multiplane camera had been completed, Disney ordered some scenes be re-drawn to use the new effects.     Snow White premiered in December 42 to high praise from critics and audiences. The film became the most successful motion picture of 42 and by May 42 its total gross of $42  million made it the most successful sound film made to that date. Disney won another Honorary Academy Award, which consisted of one full-sized and seven miniature Oscar statuettes.  The success of Snow White heralded one of the most productive eras for the studio; ": null
    },
    {
        "the Walt Disney Family Museum": "the walt disney family museum"
    },
    {
        " calls the following years the Golden Age of Animation .  With work on Snow White finished, the studio began producing  Pinocchio  in early 42 and  Fantasia  in November of the same year. Both films were released in 42 and neither performed well at the box officepartly because revenues from Europe had dropped following the start of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " in 42 The studio made a loss on both pictures and was deeply in debt by the end of February 42     In response to the financial crisis, Disney and his brother Roy started the companys ": null
    },
    {
        "first public stock offering": "initial public offering"
    },
    {
        " in 42 and implemented heavy salary cuts. The latter measure, and Disneys sometimes high-handed and insensitive manner of dealing with staff, led to ": null
    },
    {
        "a 42 animators strike": "disney animators strike"
    },
    {
        " which lasted five weeks. While a federal mediator from the ": null
    },
    {
        "National Labor Relations Board": "national labor relations board"
    },
    {
        " negotiated with the two sides, Disney accepted an offer from the ": null
    },
    {
        "Office of the Coordinator of Inter-American Affairs": "office of the coordinator of inter-american affairs"
    },
    {
        " to make a goodwill trip to South America, ensuring he was absent during a resolution he knew would be unfavorable to the studio. As a result of the strikeand the financial state of the companyseveral animators left the studio, and Disneys relationship with other members of staff was permanently strained as a result. The strike temporarily interrupted the studios next production,  Dumbo  , which Disney produced in a simple and inexpensive manner; the film received a positive reaction from audiences and critics alike.          Shortly after the release of Dumbo in October 42 the U.S. entered World War  II. Disney formed the Walt Disney Training Films Unit within the company to produce instruction films for the military such as Four Methods of Flush Riveting and Aircraft Production Methods. Disney also met with ": null
    },
    {
        "Henry Morgenthau, Jr.": "henry morgenthau, jr."
    },
    {
        ", the ": null
    },
    {
        "Secretary of the Treasury": "united states secretary of the treasury"
    },
    {
        ", and agreed to produce short ": null
    },
    {
        "Donald Duck": "donald duck"
    },
    {
        " cartoons to promote ": null
    },
    {
        "war bonds": "series e bond"
    },
    {
        ". Disney also produced several ": null
    },
    {
        "propaganda productions": "walt disneys world war ii propaganda production"
    },
    {
        ", including shorts such as  Der Fuehrers Face which won an Academy Awardand the 42 feature film  Victory Through Air Power .     The military films generated only enough revenue to cover costs, and the feature film  Bambi which had been in production since 42underperformed on its release in April 42 and lost $42 at the box office. On top of the low earnings from Pinocchio and Fantasia, the company had debts of $42  million with the ": null
    },
    {
        "Bank of America": "bank of america"
    },
    {
        " in 42  At a meeting with Bank of America executives to discuss the future of the company, the banks chairman and founder, ": null
    },
    {
        "Amadeo Giannini": "amadeo giannini"
    },
    {
        ", told his executives, Ive been watching the Disneys pictures quite closely because I knew we were lending them money far above the financial risk.  ... Theyre good this year, theyre good next year, and theyre good the year after.  ... You have to relax and give them time to market their product.  Disneys production of short films decreased in the late 42s, coinciding with increasing competition in the animation market from ": null
    },
    {
        "Warner Bros.": "warner bros. cartoons"
    },
    {
        " and ": null
    },
    {
        "Metro-Goldwyn-Mayer": "metro-goldwyn-mayer cartoon studio"
    },
    {
        ". Roy Disney, for financial reasons, suggested more combined animation and live-action productions. In 42 Disney initiated a series of popular live-action nature films, titled  True-Life Adventures , with  Seal Island  the first; the film won the Academy Award in the ": null
    },
    {
        "Best Short Subject ": "academy award for best live action short film"
    },
    {
        " category.     Disney grew more politically conservative as he got older. A ": null
    },
    {
        "Democratic Party": "democratic party"
    },
    {
        " supporter until the ": null
    },
    {
        "42 presidential election": "1940 united states presidential election"
    },
    {
        ", when he switched allegiance to the ": null
    },
    {
        "Republican Party": "republican party"
    },
    {
        ", he became a generous donor to ": null
    },
    {
        "Thomas  E.  Dewey": "thomas & nbsp;e. & nbsp;dewey"
    },
    {
        "s ": null
    },
    {
        "42 bid for the presidency": "1944 united states presidential election"
    },
    {
        ". In 42 he was a founding member of the ": null
    },
    {
        "Motion Picture Alliance for the Preservation of American Ideals": "motion picture alliance for the preservation of american ideals"
    },
    {
        ", an organization who stated they believ in, and like, the American Way of Life  ... we find ourselves in sharp revolt against a rising tide of Communism, Fascism and kindred beliefs, that seek by subversive means to undermine and change this way of life . In 42 during the ": null
    },
    {
        "Second Red Scare": "second red scare"
    },
    {
        ", Disney testified before the ": null
    },
    {
        "House Un-American Activities Committee": "house un-american activities committee"
    },
    {
        " , where he branded ": null
    },
    {
        "Herbert Sorrell": "herbert sorrell"
    },
    {
        ", ": null
    },
    {
        "David Hilberman": "david hilberman"
    },
    {
        " and ": null
    },
    {
        "William Pomerance": "william pomerance"
    },
    {
        ", former animators and ": null
    },
    {
        "labor union": "trade union"
    },
    {
        " organizers, as communist agitators; Disney stated that the 42 strike led by them was part of an organized communist effort to gain influence in Hollywood.  It was alleged by the New York Times in 42 that Disney had been passing secret information to the FBI from 42 until his death in 42 In return for this information, J. Edgar Hoover allowed Disney to film in FBI headquarters in Washington. Disney was made a full Special Agent in Charge Contact in 42         In 42 Disney and his family moved to a new home in the ": null
    },
    {
        "Holmby Hills": "holmby hills"
    },
    {
        " district of Los Angeles. With the help of his friends ": null
    },
    {
        "Ward and Betty Kimball": "ward kimball"
    },
    {
        ", who already had their own ": null
    },
    {
        "backyard railroad": "grizzly flats railroad"
    },
    {
        ", Disney developed blueprints and immediately set to work on creating a miniature ": null
    },
    {
        "live steam": "live steam"
    },
    {
        " railroad for his backyard. The name of the railroad, ": null
    },
    {
        "Carolwood Pacific Railroad": "carolwood pacific railroad"
    },
    {
        ", came from his homes location on Carolwood Drive. The miniature working steam locomotive was built by Disney Studios engineer ": null
    },
    {
        "Roger E. Broggie": "roger e. broggie"
    },
    {
        ", and Disney named it Lilly Belle after his wife; after three years Disney ordered it into storage due to a series of accidents involving his guests.       In early 42 Disney produced  Cinderella , his studios first animated feature in eight years. It was popular with critics and theater audiences. Costing $42  million to produce, it earned nearly $42  million in its first year. Disney was less involved than he had been with previous pictures because of his involvement in his first entirely live-action feature,  Treasure Island  , which was shot in Britain, as was  The Story of Robin Hood and His Merrie Men  . Other all-live-action features followed, many of which had patriotic themes. He continued to produce full-length animated features too, including  Alice in Wonderland  and  Peter Pan  . From the early to mid42s, Disney began to devote less attention to the animation department, entrusting most of its operations to his key animators, the Nine Old Men, although he was always present at story meetings. Instead, he started concentrating on other ventures.        For several years Disney had been considering building a theme park. When he visited ": null
    },
    {
        "Griffith Park": "griffith park"
    },
    {
        " in Los Angeles with his daughters, he wanted to be in a clean, unspoiled park, where both children and their parents could have fun. He visited the ": null
    },
    {
        "Tivoli Gardens": "tivoli gardens"
    },
    {
        " in Copenhagen, Denmark, and was heavily influenced by the cleanliness and layout of the park. In March 42 he received zoning permission to build a theme park in Burbank, near the Disney studios. This site proved too small, and a larger plot in ": null
    },
    {
        "Anaheim": "anaheim, california"
    },
    {
        ",  south of the studio, was purchased. To distance the project from the studiowhich might attract the criticism of shareholdersDisney formed WED Enterprises  and used his own money to fund a group of designers and animators to work on the plans; those involved became known as Imagineers . After obtaining bank funding he invited other stockholders, ": null
    },
    {
        "American Broadcasting-Paramount Theatres": "american broadcasting-paramount theatres"
    },
    {
        "part of ": null
    },
    {
        "American Broadcasting Company": "american broadcasting company"
    },
    {
        " and ": null
    },
    {
        "Western Printing and Lithographing Company": "western publishing"
    },
    {
        ". In mid42 Disney sent his Imagineers to every amusement park in the U.S. to analyze what worked and what pitfalls or problems there were in the various locations and incorporated their findings into his design. Construction work started in July 42 and ": null
    },
    {
        "Disneyland": "disneyland"
    },
    {
        " opened in July 42; the opening ceremony was broadcast on ABC, which reached 42  million viewers. The park was designed as a series of themed lands, linked by the central ": null
    },
    {
        "Main Street, U.S.A.": "main street, u.s.a."
    },
    {
        "a replica of the main street in his hometown of Marceline. The connected themed areas were ": null
    },
    {
        "Adventureland": "adventureland"
    },
    {
        ", ": null
    },
    {
        "Frontierland": "frontierland"
    },
    {
        ", ": null
    },
    {
        "Fantasyland": "fantasyland"
    },
    {
        " and ": null
    },
    {
        "Tomorrowland": "tomorrowland"
    },
    {
        ". The park also contained the ": null
    },
    {
        "narrow gauge": "narrow-gauge railway"
    },
    {
        " Disneyland Railroad": "disneyland railroad"
    },
    {
        " that linked the lands; around the outside of the park was a high ": null
    },
    {
        "berm": "berm"
    },
    {
        " to separate the park from the outside world. An editorial in  The New York Times  considered that Disney had tastefully combined some of the pleasant things of yesterday with fantasy and dreams of tomorrow . Although there were early minor problems with the park, it was a success, and after a months operation, Disneyland was receiving over 42 visitors a day; by the end of its first year, it attracted 42  million guests.     The money from ABC was contingent on Disney television programs. The studio had been involved in a successful television special on Christmas Day 42 about the making of Alice in Wonderland. Roy believed the program added millions to the box office takings. In a March 42 letter to shareholders, he wrote that television can be a most powerful selling aid for us, as well as a source of revenue. It will probably be on this premise that we enter television when we do . In 42 after the Disneyland funding had been agreed, ABC broadcast  Walt Disneys Disneyland , an anthology consisting of animated cartoons, live-action features and other material from the studios library. The show was successful in terms of ratings and profits, earning an audience share of over 42%. In April 42  Newsweek  called the series an American institution . ABC was pleased with the ratings, leading to Disneys first daily television program,  The Mickey Mouse Club , a variety show catering specifically to children. The program was accompanied by merchandising through various companies . One of the segments of Disneyland consisted of the five-part ": null
    },
    {
        "miniseries": "miniseries"
    },
    {
        "  Davy Crockett  which, according to Gabler, became an overnight sensation . The shows theme song, ": null
    },
    {
        "The Ballad of Davy Crockett": "the ballad of davy crockett"
    },
    {
        " , became internationally popular, and ten million records were sold. As a result, Disney formed his own record production and distribution entity, ": null
    },
    {
        "Disneyland Records": "walt disney records"
    },
    {
        ".     As well as the construction of Disneyland, Disney worked on other projects away from the studio. He was consultant to the 42 ": null
    },
    {
        "American National Exhibition": "american national exhibition"
    },
    {
        " in Moscow; Disney Studios contribution was  America the Beautiful , a 42-minute film in the 42-degree ": null
    },
    {
        "Circarama theater": "circle-vision 360°"
    },
    {
        " that was one of the most popular attractions. The following year he acted as the chairman of the Pageantry Committee for the ": null
    },
    {
        "42 Winter Olympics": "1960 winter olympics"
    },
    {
        " in ": null
    },
    {
        "Squaw Valley, California": "squaw valley, placer county, california"
    },
    {
        ", where he designed the ": null
    },
    {
        "opening, closing and medal ceremonies": "olympic games ceremony"
    },
    {
        ".        Despite the demands wrought by non-studio projects, Disney continued to work on film and television projects. In 42 he was involved in ": null
    },
    {
        "Man in Space": "man in space"
    },
    {
        " , an episode of the Disneyland series, which was made in collaboration with ": null
    },
    {
        "NASA": "nasa"
    },
    {
        " rocket designer ": null
    },
    {
        "Wernher von Braun": "wernher von braun"
    },
    {
        ". Disney also oversaw aspects of the full-length features  Lady and the Tramp   in 42  Sleeping Beauty   in 42  One Hundred and One Dalmatians   in 42 and  The Sword in the Stone  in 42     In 42 Disney produced  Mary Poppins , based on ": null
    },
    {
        "the book series": "mary poppins"
    },
    {
        " by ": null
    },
    {
        "P. L. Travers": "p. l. travers"
    },
    {
        "; he had been trying to acquire the rights to the story since the 42s. It became the most successful Disney film of the 42s, although Travers disliked the film intensely and regretted having sold the rights. The same year he also became involved in plans to expand the ": null
    },
    {
        "California Institute of the Arts": "california institute of the arts"
    },
    {
        " , and had an architect draw up blueprints for a new building.     Disney provided four exhibits for the ": null
    },
    {
        "42 New York Worlds Fair": "1964 new york worlds fair"
    },
    {
        ", for which he obtained funding from selected corporate sponsors. For ": null
    },
    {
        "PepsiCo": "pepsico"
    },
    {
        ", who planned a tribute to ": null
    },
    {
        "UNICEF": "unicef"
    },
    {
        ", Disney developed ": null
    },
    {
        "Its a Small World": "its a small world"
    },
    {
        ", a boat ride with audio-animatronic dolls depicting children of the world; ": null
    },
    {
        "Great Moments with Mr. Lincoln": "great moments with mr. lincoln"
    },
    {
        " contained an animatronic ": null
    },
    {
        "Abraham Lincoln": "abraham lincoln"
    },
    {
        " giving excerpts from his speeches; ": null
    },
    {
        "Carousel of Progress": "walt disneys carousel of progress"
    },
    {
        " promoted the importance of electricity; and Fords Magic Skyway portrayed the progress of mankind. Elements of all four exhibitsprincipally concepts and technologywere re-installed in Disneyland, although Its a Small World is the ride that most closely resembles the original.     During the early to mid42s, Disney developed plans for a ": null
    },
    {
        "ski resort": "ski resort"
    },
    {
        " in ": null
    },
    {
        "Mineral King": "mineral king"
    },
    {
        ", a glacial valley in Californias ": null
    },
    {
        "Sierra Nevada": "sierra nevada"
    },
    {
        ". He hired experts such as the renowned Olympic ski coach and ski-area designer ": null
    },
    {
        "Willy Schaeffler": "willy schaeffler"
    },
    {
        ".  With income from Disneyland accounting for an increasing proportion of the studios income, Disney continued to look for venues for other attractions. In late 42 he announced plans to develop another theme park to be called Disney World , a few miles southwest of ": null
    },
    {
        "Orlando, Florida": "orlando, florida"
    },
    {
        ". Disney World was to include the Magic Kingdom a larger and more elaborate version of Disneylandplus golf courses and resort hotels. The heart of Disney World was to be the Experimental Prototype Community of Tomorrow , which he described as:     an experimental prototype community of tomorrow that will take its cue from the new ideas and new technologies that are now emerging from the creative centers of American industry. It will be a community of tomorrow that will never be completed, but will always be introducing and testing and demonstrating new materials and systems. And EPCOT will always be a showcase to the world for the ingenuity and imagination of American free enterprise.     During 42 Disney cultivated businesses willing to sponsor EPCOT. He increased his involvement in the studios films, and was heavily involved in the story development of  The Jungle Book , the live-action musical feature  The Happiest Millionaire  and the animated short  Winnie the Pooh and the Blustery Day .          Disney had been a ": null
    },
    {
        "heavy smoker": "chain smoking"
    },
    {
        " since World War  I. He did not use cigarettes with ": null
    },
    {
        "filters": "cigarette filter"
    },
    {
        " and had smoked a pipe as a young man. In November 42 he was diagnosed with lung cancer and was treated with ": null
    },
    {
        "cobalt therapy": "cobalt therapy"
    },
    {
        ". On November 42 he felt unwell and was taken to ": null
    },
    {
        "St. Joseph Hospital": "providence saint joseph medical center"
    },
    {
        " where, on December 42 ten days after his 42th birthday, he died of ": null
    },
    {
        "circulatory collapse": "circulatory collapse"
    },
    {
        " caused by lung cancer. Disneys remains were cremated two days later, and his ashes interred at the ": null
    },
    {
        "Forest Lawn Memorial Park": "forest lawn memorial park"
    },
    {
        " in ": null
    },
    {
        "Glendale, California": "glendale, california"
    },
    {
        ".     The release of The Jungle Book and The Happiest Millionaire in 42 raised the total number of feature films that Disney had been involved in to 42 When Winnie the Pooh and the Blustery Day was released in 42 it earned Disney an Academy Award in the Short Subject category, awarded posthumously. After Disneys death, his studios continued to produce live-action films prolifically but largely abandoned animation until the late 42s, after which there was what  The New York Times  describes as the ": null
    },
    {
        "Disney Renaissance": "disney renaissance"
    },
    {
        " that began with  The Little Mermaid  . Disneys companies continue to produce successful film, television and stage entertainment.        Disneys plans for the futuristic city of EPCOT did not come to fruition. After Disneys death, his brother Roy deferred his retirement to take full control of the Disney companies. He changed the focus of the project from a town to an attraction. At the inauguration in 42 Roy dedicated Walt Disney World to his brother.  Walt Disney World expanded with the opening of ": null
    },
    {
        "Epcot Center": "epcot center"
    },
    {
        " in 42; Walt Disneys vision of a functional city was replaced by a park more akin to a permanent ": null
    },
    {
        "worlds fair": "worlds fair"
    },
    {
        ". In 42 the Walt Disney Family Museum, designed by Disneys daughter Diane and her son Walter E. D. Miller, opened in the ": null
    },
    {
        "Presidio of San Francisco": "presidio of san francisco"
    },
    {
        ". Thousands of artifacts from Disneys life and career are on display, including numerous awards that he received. In 42 the Disney theme parks around the world hosted approximately 42 million visitors.     Disney has been portrayed numerous times in fictional works. ": null
    },
    {
        "H. G. Wells": "h. g. wells"
    },
    {
        " references Disney in his 42 novel  The Holy Terror , in which World Dictator Rud fears that Donald Duck is meant to lampoon the dictator. Disney was portrayed by ": null
    },
    {
        "Len Cariou": "len cariou"
    },
    {
        " in the 42 made-for-TV film A Dream Is a Wish Your Heart Makes: The Annette Funicello Story, and by ": null
    },
    {
        "Tom Hanks": "tom hanks"
    },
    {
        " in the 42 film  Saving Mr. Banks . In 42 the German author ": null
    },
    {
        "Peter Stephan Jungk": "peter stephan jungk"
    },
    {
        " published  , a fictional work of Disneys later years that re-imagines him as a power-hungry racist. The composer ": null
    },
    {
        "Philip Glass": "philip glass"
    },
    {
        " later adapted the book into the opera  The Perfect American  .             Disney received 42 Academy Award nominations, including 42 awards: both totals are records. He was nominated for three ": null
    },
    {
        "Golden Globe Award": "golden globe award"
    },
    {
        "s, but did not win, but he was presented with two Special Achievement Awardsfor Bambi and  The Living Desert  and the ": null
    },
    {
        "Cecil B. DeMille Award": "golden globe cecil b. demille award"
    },
    {
        ". He also received four ": null
    },
    {
        "Emmy Award": "emmy award"
    },
    {
        " nominations, winning once, for Best Producer for the Disneyland television series. Several of his films are included in the United States ": null
    },
    {
        "National Film Registry": "national film registry"
    },
    {
        " by the ": null
    },
    {
        "Library of Congress": "library of congress"
    },
    {
        " as culturally, historically, or aesthetically significant : Steamboat Willie, The Three Little Pigs, Snow White and the Seven Dwarfs, Fantasia, Pinocchio, Bambi and Mary Poppins. In 42 the ": null
    },
    {
        "American Film Institute": "american film institute"
    },
    {
        " published a list of the 42 greatest American films, according to industry experts; the list included Snow White and the Seven Dwarfs , and Fantasia .     In February 42 Disney was inducted to the ": null
    },
    {
        "Hollywood Walk of Fame": "hollywood walk of fame"
    },
    {
        " with two stars, one for motion pictures and the other for his television work; Mickey Mouse was given his own star for motion pictures in 42 Disney was also inducted into the ": null
    },
    {
        "Television Hall of Fame": "television hall of fame"
    },
    {
        " in 42 the ": null
    },
    {
        "California Hall of Fame": "california hall of fame"
    },
    {
        " in December 42 and was the inaugural recipient of a star on the ": null
    },
    {
        "Anaheim walk of stars": "anaheim/orange county walk of stars"
    },
    {
        " in 42     The Walt Disney Family Museum records that he along with members of his staff, received more than 42 honors and citations from throughout the world . He was made a  in the French  in 42 and in 42 he was awarded the countrys highest artistic decoration, the . Other national awards include Thailands Order of the Crown; Brazils Order of the Southern Cross and Mexicos Order of the Aztec Eagle. In the United States, he received the ": null
    },
    {
        "Presidential Medal of Freedom": "presidential medal of freedom"
    },
    {
        " on September 42 42 and in 42 he was posthumously awarded the ": null
    },
    {
        "Congressional Gold Medal": "congressional gold medal"
    },
    {
        ". He received the Showman of the World Award from the National Association of Theatre Owners, and in 42 the ": null
    },
    {
        "National Audubon Society": "national audubon society"
    },
    {
        " awarded Disney its highest honor, the Audubon Medal, for promoting the appreciation and understanding of nature through his True-Life Adventures nature films. A ": null
    },
    {
        "minor planet": "minor planet"
    },
    {
        " discovered in 42 by astronomer ": null
    },
    {
        "Lyudmila Karachkina": "lyudmila karachkina"
    },
    {
        ", was named ": null
    },
    {
        "42 Disneya": "4017 disneya"
    },
    {
        ", and he was also awarded honorary degrees from ": null
    },
    {
        "Harvard": "harvard university"
    },
    {
        ", ": null
    },
    {
        "Yale": "yale"
    },
    {
        ", the ": null
    },
    {
        "University of Southern California": "university of southern california"
    },
    {
        " and the ": null
    },
    {
        "University of California, Los Angeles": "university of california, los angeles"
    },
    {
        ".          Disneys public persona was very different from his actual personality. Playwright ": null
    },
    {
        "Robert E. Sherwood": "robert e. sherwood"
    },
    {
        " described him as almost painfully shy  ... diffident and self-deprecating. According to his biographer ": null
    },
    {
        "Richard Schickel": "richard schickel"
    },
    {
        ", Disney hid his shy and insecure personality behind his public identity. Kimball argues that Disney played the role of a bashful tycoon who was embarrassed in public and knew that he was doing so. Disney acknowledged the façade, and told a friend that Im not Walt Disney. I do a lot of things Walt Disney would not do. Walt Disney does not smoke. I smoke. Walt Disney does not drink. I drink. Critic ": null
    },
    {
        "Otis Ferguson": "otis ferguson"
    },
    {
        ", in  The New Republic , called the private Disney: common and everyday, not inaccessible, not in a foreign language, not suppressed or sponsored or anything. Just Disney.  Many of those with whom Disney worked commented that he gave his staff little encouragement due to his exceptionally high expectations. Norman recalls that when Disney said Thatll work , it was an indication of high praise. Instead of direct approval, Disney gave high-performing staff financial bonuses, or recommended certain individuals to others, expecting that his praise would be passed on.     Views of Disney and his work have changed over the decades, and there have been polarized opinions. Mark Langer, in the American Dictionary of National Biography, writes that Earlier evaluations of Disney hailed him as a patriot, folk artist, and popularizer of culture. More recently, Disney has been regarded as a paradigm of American imperialism and intolerance, as well as a debaser of culture.  Steven Watts wrote that some denounce Disney as a cynical manipulator of cultural and commercial formulas , while ": null
    },
    {
        "PBS": "pbs"
    },
    {
        " records that critics have censured his work because of its smooth façade of sentimentality and stubborn optimism, its feel-good re-write of American history . Although Disneys films have been highly praised, very popular and commercially successful over time, there were criticisms by reviewers. ": null
    },
    {
        "Caroline Lejeune": "c. a. lejeune"
    },
    {
        " comments in  The Observer  that Snow White has more faults than any earlier Disney cartoon. It is vulnerable again and again to the barbed criticisms of the experts. Sometimes it is, frankly, badly drawn. Robin Allen, writing for The Times, notes that Fantasia was condemned for its vulgarity and lurches into ": null
    },
    {
        "bathos": "bathos"
    },
    {
        " , while Lejeune, reviewing Alice in Wonderland , feels the film may drive lovers of Lewis Carroll to frenzy . Peter Pan was criticized in The Times as a childrens classic vulgarized with Tinker Bell  ... a peroxided American cutie . The reviewer opined that Disney has slaughtered good Barrie and has only second-rate Disney to put in its place .     Disney has been accused of ": null
    },
    {
        "anti-Semitism": "antisemitism"
    },
    {
        ",  although none of his employees—including the animator ": null
    },
    {
        "Art Babbitt": "art babbitt"
    },
    {
        ", who disliked Disney intensely—ever accused him of making anti-Semitic slurs or taunts. The Walt Disney Family Museum acknowledges that ethnic stereotypes common to films of the 42s were included in some early cartoons. Disney donated regularly to Jewish charities, he was named 42 Man of the Year by the ": null
    },
    {
        "Bnai Brith": "bnai brith"
    },
    {
        " chapter in Beverly Hills, and his studio employed a number of Jews, some of whom were in influential positions. Gabler, the first writer to gain unrestricted access to the Disney archives, concludes that the available evidence does not support accusations of anti-Semitism and that Disney was not in the conventional sense that we think of someone as being an anti-Semite . Gabler concludes that though Walt himself, in my estimation, was not anti-Semitic, nevertheless, he willingly allied himself with people who were anti-Semitic meaning some members of the ": null
    },
    {
        "MPAPAI": "motion picture alliance for the preservation of american ideals"
    },
    {
        ", and that reputation stuck. He was never really able to expunge it throughout his life . Disney distanced himself from the Motion Picture Alliance in the 42s.     Disney has also been accused of other forms of racism because some of his productions released between the 42s and 42s contain racially insensitive material. The feature film  Song of the South  was criticized by contemporary film critics, the ": null
    },
    {
        "National Association for the Advancement of Colored People": "national association for the advancement of colored people"
    },
    {
        ", and others for its perpetuation of ": null
    },
    {
        "black stereotypes": "stereotypes of african americans"
    },
    {
        ", but Disney later campaigned successfully for an Honorary Academy Award for its star, ": null
    },
    {
        "James Baskett": "james baskett"
    },
    {
        ", the first black actor so honored. Gabler argues that Walt Disney was no racist. He never, either publicly or privately, made disparaging remarks about blacks or asserted white superiority. Like most white Americans of his generation, however, he was racially insensitive.  ": null
    },
    {
        "Floyd Norman": "floyd norman"
    },
    {
        ", the studios first black animator who worked closely with Disney during the 42s and 42s, said, Not once did I observe a hint of the racist behavior Walt Disney was often accused of after his death. His treatment of peopleand by this I mean all peoplecan only be called exemplary.      Watts argues that many of Disneys post World War II films legislated a kind of cultural ": null
    },
    {
        "Marshall Plan": "marshall plan"
    },
    {
        ". They nourished a genial cultural imperialism that magically overran the rest of the globe with the values, expectations, and goods of a prosperous middle-class United States.  Film historian Jay P. Telotte acknowledges that many see Disneys studio as an agent of manipulation and repression , although he observes that it has labored throughout its history to link its name with notions of fun, family, and fantasy . John Tomlinson, in his study Cultural Imperialism, examines the work of ": null
    },
    {
        "Ariel Dorfman": "ariel dorfman"
    },
    {
        " and ": null
    },
    {
        "Armand Mattelart": "armand mattelart"
    },
    {
        ", whose 42 book   identifies that there are imperialist  ... values concealed behind the innocent, wholesome façade of the world of Walt Disney ; this, they argue, is a powerful tool as it presents itself as harmless fun for consumption by children.  Tomlinson views their argument as flawed, as they simply assume that reading American comics, seeing adverts, watching pictures of the affluent  ... ": null
    },
    {
        "Yankee": "yankee"
    },
    {
        " lifestyle has a direct pedagogic effect .     Several commentators have described Disney as a ": null
    },
    {
        "cultural icon": "cultural icon"
    },
    {
        ". On Disneys death, journalism professor Ralph S. Izard comments that the values in Disneys films are those considered valuable in American Christian society , which include individualism, decency,  ... love for our fellow man, fair play and toleration . Disneys obituary in  The Times  calls the films wholesome, warm-hearted and entertaining  ... of incomparable artistry and of touching beauty . Journalist ": null
    },
    {
        "Bosley Crowther": "bosley crowther"
    },
    {
        " argues that Disneys achievement as a creator of entertainment for an almost unlimited public and as a highly ingenious merchandiser of his wares can rightly be compared to the most successful industrialists in history. Correspondent ": null
    },
    {
        "Alistair Cooke": "alistair cooke"
    },
    {
        " calls Disney a folk-hero  ... the Pied Piper of Hollywood , while Gabler considers Disney reshaped the culture and the American consciousness . In the American Dictionary of National Biography, Langer writes:     Disney remains the central figure in the history of animation. Through technological innovations and alliances with governments and corporations, he transformed a minor studio in a marginal form of communication into a multinational leisure industry giant. Despite his critics, his vision of a modern, corporate utopia as an extension of traditional American values has possibly gained greater currency in the years after his death.           ": null
    }
]