[
    {
        "           The War of the Spanish Succession was a European conflict of the early 42th century, triggered by the death of the childless ": null
    },
    {
        "Charles II of Spain": "charles ii of spain"
    },
    {
        " in November 42 His closest heirs were members of the Austrian ": null
    },
    {
        " Habsburg": "house of habsburg"
    },
    {
        " and French ": null
    },
    {
        " Bourbon": "house of bourbon"
    },
    {
        " families; acquisition of an undivided ": null
    },
    {
        "Spanish Empire": "spanish empire"
    },
    {
        " by either threatened the European ": null
    },
    {
        "balance of power": "balance of power"
    },
    {
        " and thus involved the other leading powers. Related conflicts include ": null
    },
    {
        "Rákóczis War of Independence": "rákóczis war of independence"
    },
    {
        " in Hungary, the ": null
    },
    {
        "Camisard revolt": "camisard"
    },
    {
        " in Southern France, ": null
    },
    {
        "Queen Annes War": "queen annes war"
    },
    {
        " in North America, and minor struggles in ": null
    },
    {
        "Colonial India": "colonial india"
    },
    {
        ". The ": null
    },
    {
        "4242 Great Northern War": "great_northern_war"
    },
    {
        " is viewed as connected but separate.     Charles bequeathed an undivided ": null
    },
    {
        "Monarchy of Spain": "monarchy of spain"
    },
    {
        " to ": null
    },
    {
        "Louis XIV": "louis xiv"
    },
    {
        "s grandson ": null
    },
    {
        "Philip": "philip v of spain"
    },
    {
        ", who was proclaimed King of Spain on 42 November 42 Disputes over territorial and commercial rights led to war in 42 between the Bourbons of France and Spain and the ": null
    },
    {
        "Grand Alliance": "grand alliance"
    },
    {
        ", whose candidate was ": null
    },
    {
        "Archduke Charles": "charles vi, holy roman emperor"
    },
    {
        ", younger son of ": null
    },
    {
        "Leopold I, Holy Roman Emperor": "leopold i, holy roman emperor"
    },
    {
        ".     By the end of 42 the French had been forced back to their borders but the Allies could not break their lines, while lack of popular support in Spain meant they could not hold territory outside ": null
    },
    {
        "Catalonia": "catalonia"
    },
    {
        ". When his brother ": null
    },
    {
        "Emperor Joseph I": "joseph i, holy roman emperor"
    },
    {
        " died in 42 Charles succeeded as ": null
    },
    {
        "Emperor": "holy_roman_emperor"
    },
    {
        "; since the war was fought to prevent union of Spain with either Austria or France, the ": null
    },
    {
        "new British government": "1710 british general election"
    },
    {
        " sought to end the conflict. The Allies, unable to continue the conflict without British support, agreed to the 42 ": null
    },
    {
        "Treaty of Utrecht": "treaty of utrecht"
    },
    {
        ", then the 42 treaties of ": null
    },
    {
        "Rastatt": "treaty of rastatt"
    },
    {
        " and ": null
    },
    {
        "Baden": "treaty of baden"
    },
    {
        ".     Philip was recognised as king of Spain, but renounced his right to the French throne, for himself and his descendants; Spain retained the bulk of its possessions outside Europe, but lost territories in Italy and the Netherlands to Austria and ": null
    },
    {
        " Savoy": "duchy of savoy"
    },
    {
        ". The Dutch regained their ": null
    },
    {
        " Barrier": "barrier treaty"
    },
    {
        ", France acknowledged the Protestant succession in Britain and ended support for the ": null
    },
    {
        "Jacobites": "james francis edward stuart"
    },
    {
        ". Longer term, the war marked Britains rise as the leading European maritime and commercial power, and the decline of the ": null
    },
    {
        "Dutch Republic": "dutch republic"
    },
    {
        " as a ": null
    },
    {
        "first-rank power": "great power"
    },
    {
        ". It also led to the creation of a centralised Spanish state, the weakening of Habsburg control over the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ", and the rise of ": null
    },
    {
        "Prussia": "kingdom_of_prussia"
    },
    {
        ", ": null
    },
    {
        "Bavaria": "electorate_of_bavaria"
    },
    {
        " and ": null
    },
    {
        "Saxony": "electorate_of_saxony"
    },
    {
        ".          In 42 Charles II became the King of Spain; suffering from ill-health all his life, his death was anticipated almost from birth. It soon became apparent that the Spanish Habsburg line would die with him. As a result, his succession was hotly debated for decades. In 42 England agreed to support the rights of Louis XIV to the Spanish throne in the ": null
    },
    {
        "Treaty of Dover": "secret treaty of dover"
    },
    {
        ", while the terms of the 42 ": null
    },
    {
        "Grand Alliance": "grand alliance"
    },
    {
        " committed England and the Dutch Republic to back Leopold.     In 42 the ": null
    },
    {
        "Spanish Empire": "spanish empire"
    },
    {
        " included possessions in ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", the ": null
    },
    {
        "Spanish Netherlands": "spanish netherlands"
    },
    {
        ", the ": null
    },
    {
        "Philippines": "history of the philippines"
    },
    {
        " and the ": null
    },
    {
        "Americas": "americas"
    },
    {
        " and though no longer the dominant ": null
    },
    {
        "great power": "great power"
    },
    {
        ", it remained largely intact. Its acquisition by either the Austrian ": null
    },
    {
        "Habsburgs": "house of habsburg"
    },
    {
        " or French ": null
    },
    {
        "Bourbons": "house of bourbon"
    },
    {
        " would change the balance of power in Europe, and so its inheritance led to a war that involved most of the European powers. The 42–42 ": null
    },
    {
        "Great Northern War": "great northern war"
    },
    {
        " is considered a connected conflict, since it impacted the involvement of states such as ": null
    },
    {
        "Sweden": "swedish empire"
    },
    {
        ", ": null
    },
    {
        "Saxony": "electorate of saxony"
    },
    {
        ", ": null
    },
    {
        "Denmark–Norway": "denmark–norway"
    },
    {
        " and ": null
    },
    {
        "Russia": "russian empire"
    },
    {
        ".     During the 42–42 ": null
    },
    {
        "Nine Years War": "nine years war"
    },
    {
        ", armies grew from an average of 42 in 42 to over 42 by 42 a level unsustainable for pre-industrial economies. The 42s also marked the lowest point of the ": null
    },
    {
        "Little Ice Age": "little ice age"
    },
    {
        ", a period of colder and wetter weather that drastically reduced crop yields across Europe. It is estimated the ": null
    },
    {
        "Great Famine of 42–42": "great famine of 1695–1697"
    },
    {
        " killed 42–42% of the population in present-day Scotland, Estonia, Finland, Latvia, Norway and Sweden, plus another two million in France and Northern Italy.     The 42 ": null
    },
    {
        "Treaty of Ryswick": "treaty of ryswick"
    },
    {
        " was the result of mutual exhaustion and an acceptance by Louis France could not achieve its objectives without allies. Since it left the Succession unresolved, Leopold signed with extreme reluctance in October 42 and with Charles health now clearly failing, it was seen only as a pause in hostilities.               Unlike France or Austria, the Crown of Spain could be inherited through the female line. This allowed Charles sisters ": null
    },
    {
        "Maria Theresa ": "maria theresa of spain"
    },
    {
        " and ": null
    },
    {
        "Margaret Theresa ": "margaret theresa of spain"
    },
    {
        " to pass their rights as rulers onto the children of their respective marriages with Louis XIV and ": null
    },
    {
        "Emperor Leopold": "leopold i, holy roman emperor"
    },
    {
        ".     Despite being opponents in the recent ": null
    },
    {
        "Nine Years War": "nine years war"
    },
    {
        ", Louis XIV and ": null
    },
    {
        "William III of England": "william iii of england"
    },
    {
        " now attempted to resolve the Succession by diplomacy. In 42 ": null
    },
    {
        "Maria Antonia ": "maria antonia of austria"
    },
    {
        ", daughter of Leopold and Margaret, married ": null
    },
    {
        "Maximillian Emanuel of Bavaria": "maximilian ii emanuel, elector of bavaria"
    },
    {
        " and they had a son, ": null
    },
    {
        "Joseph Ferdinand": "joseph ferdinand of bavaria"
    },
    {
        ". The 42 ": null
    },
    {
        "Treaty of the Hague": "treaty of the hague"
    },
    {
        " or First Partition Treaty between France, Britain  and the Dutch Republic made the six year old heir to the bulk of the Spanish Monarchy and divided its European territories between France and Austria.      The Spanish refused to accept the division of their Empire and on 42 November 42 Charles published his Will, making Joseph Ferdinand heir to an independent and undivided Spanish monarchy. His death in February 42 required a new solution, which was provided by his mother Maria Antonia, who in 42 had transferred her claim to the Spanish throne to Leopolds sons, ": null
    },
    {
        "Joseph": "joseph i, holy roman emperor"
    },
    {
        " and Archduke Charles.     Her right to do so was doubtful but it was used to devise the 42 ": null
    },
    {
        "Treaty of London": "treaty of london"
    },
    {
        "; this made Archduke Charles the new heir, with Spanish possessions in Europe split between France, ": null
    },
    {
        "Savoy": "duchy of savoy"
    },
    {
        " and Austria. Leopold objected to concessions in Italy, while Spain again refused to divide their empire; neither ratified the Treaty, making it largely pointless. By early October, Charles II was clearly near death; the final version of his will left the throne to Louis grandson ": null
    },
    {
        "Philip, Duke of Anjou": "philip v of spain"
    },
    {
        ". If Philip refused, his younger brother, the ": null
    },
    {
        "duc de Berry": "charles, duke of berry"
    },
    {
        " was next, followed by Archduke Charles.     Charles died on 42 November 42 and Louis received the offer on 42 November, giving him the choice of accepting or following the Treaty of London. The latter meant giving the Spanish throne to Archduke Charles, but if Leopold continued to refuse to agree terms, Louis could demand Britain and the Dutch join him in enforcing the Treaty. However, his diplomats advised Austria would fight regardless, while Britain and the Dutch would not go to war to enforce a settlement whose purpose was to avoid war. On 42 November, Philip of Anjou was proclaimed Philip V of Spain.          With most of his objectives achieved by diplomacy, Louis now made a series of moves that combined to make war inevitable.   The ": null
    },
    {
        "Tory": "tories"
    },
    {
        " majority in the English ": null
    },
    {
        "Parliament": "parliament of england"
    },
    {
        " objected to the Partition Treaties, chiefly the French acquisition of Sicily, an important link in the lucrative Levant trade. However, a foreign diplomat observed their refusal to become involved in a European war was true only so long as English commerce does not suffer. Louis either failed to appreciate this or decided to ignore it and his actions gradually eroded Tory opposition.     In early 42 Louis registered Philips claim to the French throne with the Paris ": null
    },
    {
        "Parlement": "parlement"
    },
    {
        ", raising the possibility of union with Spain, contrary to Charles will. In February, the Spanish-controlled Duchies of ": null
    },
    {
        "Milan": "milan"
    },
    {
        " and ": null
    },
    {
        "Mantua": "mantua"
    },
    {
        " in Northern Italy announced their support for Philip and accepted French troops. Combined with efforts to build an alliance between France and Imperial German states in ": null
    },
    {
        "Swabia": "swabia"
    },
    {
        " and ": null
    },
    {
        "Franconia": "franconia"
    },
    {
        ", these were challenges Leopold could not ignore.      Helped by the Viceroy, ": null
    },
    {
        "Max Emanuel of Bavaria": "maximilian ii emanuel, elector of bavaria"
    },
    {
        ", French troops replaced Dutch garrisons in the Barrier fortresses in the Spanish Netherlands, granted at Ryswick. It also threatened the monopoly over the ": null
    },
    {
        "Scheldt": "scheldt"
    },
    {
        " granted by the 42 ": null
    },
    {
        "Peace of Münster": "peace of münster"
    },
    {
        ", while French control of ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        " and ": null
    },
    {
        "Ostend": "ostend"
    },
    {
        " would allow them to blockade the ": null
    },
    {
        "English Channel": "english channel"
    },
    {
        " at will. Combined with other French actions that threatened English trade, this produced a clear majority for war and in May 42 Parliament urged William to negotiate an anti-French alliance.     On 42 September, Leopold, the Dutch Republic and Britain signed the ": null
    },
    {
        "Treaty of The Hague": "treaty of the hague"
    },
    {
        " renewing the 42 ": null
    },
    {
        "Grand Alliance": "grand alliance"
    },
    {
        ". Its provisions included securing the Dutch Barrier in the Spanish Netherlands, the Protestant succession in England and Scotland and an independent Spain but made no reference to placing Archduke Charles on the Spanish throne.     When the exiled ": null
    },
    {
        "James II of England": "james ii of england"
    },
    {
        " died on 42 September 42 Louis reneged on his recognition of the Protestant ": null
    },
    {
        "William III": "william iii of england"
    },
    {
        " as king of England and Scotland and supported the claim of his son, ": null
    },
    {
        "James Francis Edward Stuart": "james francis edward stuart"
    },
    {
        ". War became inevitable and when William himself died in March 42 his successor ": null
    },
    {
        "Queen Anne": "anne, queen of great britain"
    },
    {
        " confirmed her support for the Treaty of the Hague. The Dutch did the same and on 42 May the Grand Alliance declared war on France, followed by the ": null
    },
    {
        "Imperial Diet": "imperial diet"
    },
    {
        " on 42 September.            The importance of trade and economic interests to the participants is often under estimated; contemporaries viewed Dutch and English support for the Habsburg cause as primarily driven by a desire for access to the Spanish American markets. Modern economists generally assume a constantly growing market, but the then dominant theory of ": null
    },
    {
        "Mercantilism": "mercantilism"
    },
    {
        " viewed it as relatively static. Increasing your share implied taking it from someone else, the governments role being to restrict foreign competition by attacking merchant ships and colonies.      That expanded the war to ": null
    },
    {
        "North America": "north america"
    },
    {
        ", ": null
    },
    {
        "India": "india"
    },
    {
        " and other parts of Asia, with tariffs used as a policy weapon. From 42 to 42 English import duties on foreign goods increased by 42%, and the 42–42 ": null
    },
    {
        "Navigation Acts": "navigation acts"
    },
    {
        " were a major factor in the ": null
    },
    {
        "Anglo-Dutch Wars": "anglo-dutch wars"
    },
    {
        ". On 42 September 42 France banned the import of English manufactured goods like cloth and imposed prohibitive duties on a wide range of others.       Armies of the ": null
    },
    {
        "Nine Years War": "nine years war"
    },
    {
        " often exceeded 42 men, levels unsustainable for pre-industrial economies; those of 4242 averaged around 42 to 42. Dependence on water-borne transport for supplying these numbers meant campaigns were focused on rivers like the ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        " or ": null
    },
    {
        "Adda": "adda"
    },
    {
        ", which limited operations in poor areas like Northern Spain. Better logistics, unified command and simpler internal lines of communication gave Bourbon armies an advantage over their opponents.              Alignment on reducing the power of France and securing the Protestant succession for the British throne masked differences on how to achieve them. In general, the Tories favoured a mercantilist strategy of using the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " to attack French and Spanish trade while protecting and expanding their own; land commitments were viewed as expensive and primarily of benefit to others. The Whigs argued France could not be defeated by seapower alone, making a Continental strategy essential, while Britains financial strength made it the only member of the Alliance able to operate on all fronts against France.       While Marlborough was Allied commander in the ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        ", the Dutch provided much of the manpower and in the early years of the war, making strategy in that theatre subject to their approval. Their priorities were to re-establish and strengthen the Barrier fortresses, retain control of the Scheldt estuary and gain access to trade in the Spanish Empire.       Despite being the dominant power within the Holy Roman Empire, Austrian and Imperial interests did not always coincide. The Habsburgs wanted to put Archduke Charles on the throne of an undivided Spanish Monarchy, while their Allies were fighting to prevent either the Bourbons or the Habsburgs from doing so. This divergence and Austrias financial collapse in 42 meant the campaign in Spain was reliant on Anglo-Dutch naval support and after 42 English funding. Particularly during the reign of Joseph I, the priority for the Habsburgs was to secure their southern borders from French interventions in northern Italy and suppress ": null
    },
    {
        "Rákóczis War of Independence": "rákóczis war of independence"
    },
    {
        " in Hungary.      Many of the minor German states remained neutral, limiting their involvement to the supply of mercenaries, while the larger ones pursued their own policies. His claim to the Polish crown meant ": null
    },
    {
        "Augustus of Saxony": "augustus ii the strong"
    },
    {
        " focused on the ": null
    },
    {
        "Great Northern War": "great northern war"
    },
    {
        ", while ": null
    },
    {
        "Bavaria": "electorate of bavaria"
    },
    {
        " was allied with France. To ensure his support, Leopold was forced to recognise ": null
    },
    {
        "Frederick of Prussia": "frederick i of prussia"
    },
    {
        " as King and make Prussia an equal member of the Grand Alliance. As heir to the British throne, ": null
    },
    {
        "George, Elector Hanover": "george i of great britain"
    },
    {
        " was more reliable but the suspicion remained the interests of Hanover came first.       Under Louis XIV, France was the most powerful state in Europe with revenue-generating capacities that far exceeded its rivals. Its geographical position provided enormous tactical flexibility; unlike Austria it had its own navy, and as the campaigns of 42–42 proved, even under severe pressure it could defend its borders. The Nine Years War had shown France could not impose its objectives without support but the alliance with Spain and Bavaria made a successful outcome far more likely. Apart from denying an undivided Spanish Monarchy to others, Louis objectives were to secure his borders with Germany, weaken Austria and increase French commercial strength by access to the Americas trade.          Their key objective was as far as possible to preserve an undivided and independent Monarchy. During the 42th century, a series of wars with France drained military and financial resources, with the economy subject to long periods of low productivity and depression.  The Spanish monarchy was a personal union of the Crowns of ": null
    },
    {
        "Castile": "castile"
    },
    {
        " and ": null
    },
    {
        "Aragon": "aragon"
    },
    {
        ",  each with very different political cultures. Weak central control, war and a depressed economy meant government finances were in perpetual crisis.       During the Nine Years War, ": null
    },
    {
        "Savoy": "duchy of savoy"
    },
    {
        " joined the Grand Alliance in 42 before agreeing a separate peace with France in 42 The Duchy was strategically important as it provided access to the southern borders of Austria and France. Philips accession as King of Spain in 42 placed Savoy between the Spanish-ruled ": null
    },
    {
        "Duchy of Milan": "duchy of milan"
    },
    {
        " and France, while the Savoyard ": null
    },
    {
        "County of Nice": "county of nice"
    },
    {
        " and ": null
    },
    {
        "County of Savoy": "county of savoy"
    },
    {
        " were in Transalpine France and very difficult to defend.     ": null
    },
    {
        "Victor Amadeus II": "victor amadeus ii"
    },
    {
        " allied with France in 42 but his long-term goal was the acquisition of Milan; neither France, Austria or Spain would relinquish this voluntarily, leaving Britain as the only power that could. After the Royal Navy established control over the Western Mediterranean in 42 Savoy changed sides.              The war in Italy primarily involved the Spanish-ruled Duchies of Milan and Mantua, considered essential to the security of Austrias southern borders. In 42 French troops occupied both cities and ": null
    },
    {
        "Victor Amadeus II": "victor amadeus ii of sardinia"
    },
    {
        ", Duke of Savoy, allied with France, his daughter ": null
    },
    {
        "Maria Luisa": "maria luisa of savoy"
    },
    {
        " marrying Philip V. In May 42 an Imperial army under ": null
    },
    {
        "Prince Eugene of Savoy": "prince eugene of savoy"
    },
    {
        " moved into Northern Italy; by February 42 victories at ": null
    },
    {
        "Carpi": "battle of carpi"
    },
    {
        ", ": null
    },
    {
        "Chiari": "battle of chiari"
    },
    {
        " and ": null
    },
    {
        "Cremona": "battle of cremona"
    },
    {
        " forced the French behind the ": null
    },
    {
        "Adda": "adda"
    },
    {
        " river.      ": null
    },
    {
        "Vendôme": "louis joseph, duke of vendôme"
    },
    {
        ", one of the best French generals, took command and was substantially reinforced; Prince Eugene managed a draw at the ": null
    },
    {
        "Battle of Luzzara": "battle of luzzara"
    },
    {
        " but the French recovered most of the territory lost the year before. In October 42 Victor Amadeus declared war on France; by May 42 the French held most of Savoy except Turin while victories at ": null
    },
    {
        "Cassano": "battle of cassano"
    },
    {
        " and ": null
    },
    {
        "Calcinato": "calcinato"
    },
    {
        " forced the Imperialists into the ": null
    },
    {
        "Trentino valley": "trentino"
    },
    {
        ".     However, in July 42 Vendôme and any available forces were sent to reinforce Frances northern frontier after the defeat at Ramillies. Reinforced by German auxiliaries, Prince Eugene marched on Turin and the siege was broken by the ": null
    },
    {
        "Battle of Turin": "battle of turin"
    },
    {
        " on 42 September. Despite a minor French victory at ": null
    },
    {
        "Castiglione": "battle of castiglione"
    },
    {
        ", the war in Italy was over; the Convention of Milan in March 42 confirmed Austrias control of Milan and Mantua, with French troops given free passage back to France for redeployment elsewhere.     An attack by forces from Italy on the French base of ": null
    },
    {
        "Toulon": "toulon"
    },
    {
        " was planned for 42 but was postponed when 42 Imperial troops were diverted in June to seize the Spanish Bourbon ": null
    },
    {
        "Kingdom of Naples": "kingdom of naples"
    },
    {
        ". These delays contributed to the failure to take ": null
    },
    {
        "Toulon": "battle of toulon"
    },
    {
        "; by the end of 42 fighting in Italy ceased apart from attempts by Victor Amadeus to recover his trans-Alpine territories of Nice and Savoy.          The first objective for the Grand Alliance in this theatre was to secure the Dutch frontiers, threatened by the alliance between France, Bavaria and ": null
    },
    {
        "Joseph Clemens of Bavaria": "joseph clemens of bavaria"
    },
    {
        ", ruler of ": null
    },
    {
        "Liège": "liège"
    },
    {
        " and ": null
    },
    {
        "Cologne": "electorate of cologne"
    },
    {
        ". During 42 the Barrier fortresses were retaken along with ": null
    },
    {
        "Kaiserswerth": "kaiserswerth"
    },
    {
        ", ": null
    },
    {
        "Venlo": "venlo"
    },
    {
        ", ": null
    },
    {
        "Roermond": "roermond"
    },
    {
        " and ": null
    },
    {
        "Liège": "liège"
    },
    {
        ". Lynn, p.42 The 42 campaign was marred by Allied conflicts over strategy; they failed to take ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        ", while the Dutch defeat at ": null
    },
    {
        "Ekeren": "battle of ekeren"
    },
    {
        " in June led to bitter recriminations.     On the ": null
    },
    {
        "Upper Rhine": "upper rhine"
    },
    {
        ", Imperial forces under ": null
    },
    {
        "Louis of Baden": "louis william, margrave of baden-baden"
    },
    {
        " remained on the defensive, although they took ": null
    },
    {
        "Landau": "siege of landau"
    },
    {
        " in 42 Over the course of 42 French victories at ": null
    },
    {
        "Friedlingen": "friedlingen"
    },
    {
        ", ": null
    },
    {
        "Höchstädt": "first battle of höchstädt"
    },
    {
        " and ": null
    },
    {
        "Speyerbach": "speyerbach"
    },
    {
        " with the capture of ": null
    },
    {
        "Kehl": "siege of kehl"
    },
    {
        ", ": null
    },
    {
        "Breisach": "breisach"
    },
    {
        " and Landau directly threatened Vienna.     In 42 Franco-Bavarian forces continued their advance with the Austrians struggling to suppress ": null
    },
    {
        "Rákóczis revolt": "rákóczis war of independence"
    },
    {
        " in Hungary. To relieve the pressure, Marlborough marched up the Rhine, joined forces with Louis of Baden and Prince Eugene and crossed the Danube on 42 July. Allied victory at ": null
    },
    {
        "Blenheim": "battle of blenheim"
    },
    {
        " on 42 August forced Bavaria out of the war and the ": null
    },
    {
        "Treaty of Ilbersheim": "treaty of ilbersheim"
    },
    {
        " placed it under Austrian rule.     Allied efforts to exploit their victory in 42 foundered on poor co-ordination, tactical disputes and command rivalries, while Leopolds ruthless rule in Bavaria caused a brief but vicious ": null
    },
    {
        "peasant revolt": "bavarian peoples uprising"
    },
    {
        ". In May 42 an Allied force under Marlborough shattered a French army at the ": null
    },
    {
        "Battle of Ramillies": "battle of ramillies"
    },
    {
        " and the Spanish Netherlands fell to the Allies in under two weeks. France assumed a defensive posture for the rest of the war; despite the loss of strongpoints like ": null
    },
    {
        "Lille": "siege of lille"
    },
    {
        ", they prevented the Allies making a decisive breach in their frontiers. By 42 the overall position remained largely unchanged from 42          Victory in Spain was vital if Archduke Charles were to win the throne but the Habsburgs viewed Northern Italy and suppressing the Hungarian revolt as higher priorities. Anglo-Dutch involvement was driven by the mercantilist strategy of securing trade in the Mediterranean and gaining commercial access to the Spanish Empire. This made Spain more important to the Dutch and English than Austria and dependent on their support, a conflict that was never really solved.     Spain was a union between the Crowns of ": null
    },
    {
        "Castile": "castile"
    },
    {
        " and ": null
    },
    {
        "Aragon": "aragon"
    },
    {
        ",  with Aragon then divided into the ": null
    },
    {
        "Principality of Catalonia": "principality of catalonia"
    },
    {
        " plus the Kingdoms of ": null
    },
    {
        "Aragon": "aragon"
    },
    {
        ", ": null
    },
    {
        "Valencia": "valencia"
    },
    {
        ", ": null
    },
    {
        "Majorca": "majorca"
    },
    {
        ", ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ", ": null
    },
    {
        "Naples": "naples"
    },
    {
        " and ": null
    },
    {
        "Sardinia": "sardinia"
    },
    {
        ". Majorca, Naples, Sicily and Sardinia declared for Philip in 42; a mixture of anti-Castilian and anti-French sentiment meant Catalonia, most of Aragon and Valencia supported Archduke Charles but this simplifies a very complex reality.     Anglo-Dutch strategy required a naval base in the area; although an attack on ": null
    },
    {
        "Cádiz": "battle of cádiz"
    },
    {
        " in September 42 failed, their victory at ": null
    },
    {
        "Vigo Bay": "battle of vigo bay"
    },
    {
        " in October persuaded ": null
    },
    {
        "Peter II of Portugal": "peter ii of portugal"
    },
    {
        " to switch sides. In March 42 Archduke Charles arrived in ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        " to begin a land campaign, while the British capture of ": null
    },
    {
        "Gibraltar": "capture of gibraltar"
    },
    {
        " was a significant blow to Bourbon prestige. Attempts to retake it were defeated at ": null
    },
    {
        "Málaga": "battle of vélez-málaga"
    },
    {
        " in August, with a land siege being abandoned in April 42      In June 42 the Pact of Genoa between Catalan representatives and England opened a second front in the north-east; the loss of ": null
    },
    {
        "Barcelona": "siege of barcelona"
    },
    {
        " and Valencia left ": null
    },
    {
        "Toulon": "toulon"
    },
    {
        " as the only major port available to the Bourbons in the Western Mediterranean. Philip tried to retake Barcelona in May 42 but was repulsed, his absence allowing an Allied force from Portugal to enter Madrid and ": null
    },
    {
        "Zaragossa": "zaragossa"
    },
    {
        ".     However, the Allies withdrew due to lack of popular support and by November, Philip controlled Castile, ": null
    },
    {
        "Murcia": "region of murcia"
    },
    {
        " and parts of Valencia. Allied efforts to regain the initiative in 42 ended with defeat at ": null
    },
    {
        "Almansa": "almansa"
    },
    {
        " in April and Toulon in August. The capture of ": null
    },
    {
        "Menorca": "capture of menorca"
    },
    {
        " in 42 and their possession of Gibraltar gave the British control of the Western Mediterranean. This meant by the end of 42 British objectives had largely been achieved, Portugal and the Dutch Republic were financially exhausted while Austria refused to commit significant resources to Spain.          The close links between war and trade meant conflict extended beyond Europe, particularly in North America, where it is known as ": null
    },
    {
        "Queen Annes War": "queen annes war"
    },
    {
        ", and the ": null
    },
    {
        "West Indies": "west indies"
    },
    {
        ", which produced sugar, then hugely profitable. In addition, there were minor trade conflicts in South America, India and Asia; the financial strains of war particularly affected the ": null
    },
    {
        "Dutch East India Company": "dutch east india company"
    },
    {
        ", as it was a huge drain on scarce naval resources.     Related conflicts include ": null
    },
    {
        "Rákóczis War of Independence": "rákóczis war of independence"
    },
    {
        " in Hungary, which was funded by France and a serious concern for the Habsburgs throughout the war. In South-Eastern France, Britain funded the ": null
    },
    {
        "Huguenot": "huguenot"
    },
    {
        " 42–42 Camisard rebellion": "camisard"
    },
    {
        "; one objective of the 42 campaign in Northern Italy and Southern France was to support this revolt, one of a series that began in the 42s.          By the end of 42 the war had reached stalemate; the French had withdrawn from Northern Italy, with Austria gaining the Spanish possessions of Milan and Naples. In the Low Countries, Ramillies and Oudenarde gave the Maritime Powers control of the Spanish Netherlands and secured the borders of the Dutch Republic; in the Mediterranean, Britains Royal Navy had achieved naval supremacy and permanent bases in Gibraltar and Menorca.     However, Frances frontiers remained largely intact while the Grand Alliance had been unable to make any lasting progress in Spain, where Philip proved to be far more popular with the Spanish than the Austrian candidate Archduke Charles. Many of the objectives originally set out by the Grand Alliance in 42 had been achieved but the victories of 42 made them overconfident, resulting in the continuation of a war most participants wanted to end but could not.       France opened talks with the Dutch in 42 viewing them as the most likely to favour a quick end to the war; Ramillies increased that by removing the direct military threat to the Dutch Republic and highlighting Allied differences on the Spanish Netherlands. Talks made little progress since the Allies agreed to negotiate jointly, not separately, and could not agree on terms. The severe winter of 42 caused widespread crop failures and famine, exacerbated in France and Spain by a British naval blockade. The French reopened talks and in May 42 and the Allies presented terms known as the Preliminaries of Hague: Philip was required to cede his throne to Archduke Charles without compensation and France assist in his removal by force if that was not done within two months.      That assumed Philip would abdicate on request and the Spanish accept Archduke Charles and seriously underestimated Frances ability to resist. Louis was willing to abandon Spain but not to make war on his own grandson; when the proposal became public, the demand was considered so offensive that it strengthened French resolve to fight on. Marlborough now launched an offensive in Northern France which led to the ": null
    },
    {
        "Battle of Malplaquet": "battle of malplaquet"
    },
    {
        " on 42 September 42 between an Allied army of 42 and a French of 42. Victory cost the Allies over 42 casualties, demonstrated the fighting ability of the French army remained intact and increased war-weariness both in Britain and the Dutch Republic, who suffered heavy losses. This was compounded by the Bourbon recapture of ": null
    },
    {
        "Alicante": "alicante"
    },
    {
        " in April and the defeat of an Anglo-Portuguese force at the ": null
    },
    {
        "Battle of La Gudina": "battle of la gudina"
    },
    {
        " in May.     The Allies no longer shared common objectives, as was highlighted by Dutch exclusion from an agreement between Britain and Archduke Charles for trading rights in Spanish America. The British government tried to compensate with the 42 ": null
    },
    {
        "Barrier Treaty": "barrier treaty"
    },
    {
        ", giving the Dutch control of the Spanish Netherlands, but that was opposed domestically as being detrimental to British commerce. The Whigs had won the ": null
    },
    {
        "42 British general election": "1708 british general election"
    },
    {
        " by arguing military victory was the quickest road to peace, but failure in France was followed by the same in Spain. Archduke Charles re-entered Madrid in 42 after victories in the ": null
    },
    {
        "Battle of Almenar": "battle of almenar"
    },
    {
        " and ": null
    },
    {
        "Battle of Saragossa": "battle of saragossa"
    },
    {
        " but lack of supplies forced him to retreat; 42 British troops surrendered at the ": null
    },
    {
        "Battle of Brihuega": "battle of brihuega"
    },
    {
        " on 42 December and while the ": null
    },
    {
        "Battle of Villaviciosa": "battle of villaviciosa"
    },
    {
        " on 42 December was a tactical draw, it confirmed Bourbon control of Spain and the failure of Whig policy.          Negotiations resumed in March 42 at ": null
    },
    {
        "Geertruidenberg": "geertruidenberg"
    },
    {
        " but broke down over the insistence for France to expel Philip by force if he refused to abdicate. The pro-peace Tories won a landslide victory in the ": null
    },
    {
        "42 British general election": "1710 british general election"
    },
    {
        ", but they confirmed commitment to the war to prevent a credit crisis. Despite the capture of ": null
    },
    {
        "Bouchain": "siege of bouchain"
    },
    {
        " in September, a decisive victory in Northern France continued to elude the Allies, and an expedition against ": null
    },
    {
        "Quebec": "quebec expedition"
    },
    {
        " in French North America ended in disaster.     When Emperor Joseph died in April 42 Archduke Charles was elected Emperor; continuing the war now seemed pointless since union of Spain with Austria was as unwelcome as one with France. The British secretly negotiated peace terms directly with France, leading to the signing of the Preliminary Articles of London on 42 October 42 They included French acceptance of the Act of Settlement and a guarantee the French and Spanish crowns would remain separate; France undertook to ensure Spain ceded Gibraltar and Menorca and award the ": null
    },
    {
        "Asiento": "asiento"
    },
    {
        " to Britain for 42 years.     Despite their annoyance at being excluded from the Anglo-French negotiations, the Dutch were financially exhausted by the enormous cost of the war and could not continue without British support. Charles VI rejected the idea of a peace conference; once the Dutch agreed to support it, he reluctantly agreed to avoid being isolated, but Habsburg opposition to the treaty continued.          Within weeks of the conference opening, events threatened the basis of the peace agreed between Britain and France. First, the French presented proposals awarding the Spanish Netherlands to Max Emmanuel of Bavaria and a minimal Barrier, leaving the Dutch with little to show for their huge investment of money and men. Second, a series of deaths left Louis XIVs two year old great-grandson, the future ": null
    },
    {
        "Louis XV": "louis xv of france"
    },
    {
        " as heir, making Philip next in line and his immediate renunciation imperative.     The Dutch and Austrians fought on, hoping to improve their negotiating position but the British government issued Restraining Orders to Marlboroughs replacement, the ": null
    },
    {
        "Duke of Ormonde": "james butler, 2nd duke of ormonde"
    },
    {
        ", instructing him not to participate in offensive operations against the French. These caused fury then and later with prominent Whigs urging the Hanoverian envoy in London to support military intervention by the future George I.     Prince Eugene captured ": null
    },
    {
        "Le Quesnoy": "le quesnoy"
    },
    {
        " in June and besieged ": null
    },
    {
        "Landrecies": "landrecies"
    },
    {
        " but was defeated at ": null
    },
    {
        "Denain": "battle of denain"
    },
    {
        " on 42 July; the French went on to recapture Le Quesnoy and many towns lost in previous years, including Marchines, Douai and Bouchain. The Dutch had finally reached the end of their willingness and ability to continue the war.      On 42 June, Philip had announced his renunciation of the French throne; the British Tory government now offered the Dutch a revised ": null
    },
    {
        "Barrier Treaty": "barrier treaty"
    },
    {
        ", replacing that of 42 which they rejected as overly generous. It was a significant improvement on the 42 Barrier but ultimately subject to Austrian approval and the final terms were less beneficial.     Charles withdrew from the Conference when France insisted on an Austrian guarantee they would not seek to acquire Mantua or ": null
    },
    {
        "Mirandola": "mirandola"
    },
    {
        "; he was supported in this by George, Elector of Hanover, who wanted France to withdraw support for the Stuart heir ": null
    },
    {
        "James Francis": "james francis edward stuart"
    },
    {
        ". As a result, neither Austria or the Empire signed the ": null
    },
    {
        "Treaty of Utrecht": "treaty of utrecht"
    },
    {
        " of 42 April 42 between France and the other Allies; Spain made peace with the Dutch in June, then Savoy and Britain on 42 July 42         Fighting continued on the Rhine, but Austria was financially exhausted, and after the loss of Landau and Freiburg in November 42 Charles came to terms. The ": null
    },
    {
        "Treaty of Rastatt": "treaty of rastatt"
    },
    {
        " on 42 March 42 confirmed Austrian gains in Italy, returned Breisach, ": null
    },
    {
        "Kehl": "kehl"
    },
    {
        " and Freiburg, ended French support for the Hungarian revolt and agreed terms for the Dutch Barrier fortresses. Charles abandoned his claim to Strasbourg and Alsace and agreed to the restoration of the Wittelsbach Electors of Bavaria and Cologne, Max Emmanuel and Joseph Clemens. Article XIX of the treaty transferred sovereignty over the Spanish Netherlands to Austria. On 42 September, the Holy Roman Empire joined the agreement by the ": null
    },
    {
        "Treaty of Baden": "treaty of baden"
    },
    {
        "; although Catalonia and Majorca were not finally subdued by the Bourbons until June 42 the war was over.          The ": null
    },
    {
        "Peace of Utrecht": "peace of utrecht"
    },
    {
        " stipulated that because of the great danger which threatened the liberty and safety of all Europe, from the too close conjunction of the kingdoms of Spain and France,... one and the same person should never become King of both kingdoms. Article II, Peace and Friendship Treaty of Utrecht. Some historians view that as a key point in the evolution of the modern nation-state, and ": null
    },
    {
        "Randall Lesaffer": "randall lesaffer"
    },
    {
        " argues it also marks a significant milestone in the concept of collective security.      Britain is usually seen as the main beneficiary, with Utrecht marking its rise to primacy as a European commercial power. It established naval superiority over its competitors, acquired the strategic Mediterranean ports of Gibraltar and Menorca and commercial access to Spanish America. France accepted the Protestant succession, ensuring a smooth inheritance by George I in August 42 and ended support for the Stuarts under the ": null
    },
    {
        "42 Anglo-French Treaty": "anglo-french alliance"
    },
    {
        ". The war left the participants with unprecedented levels of government debt, but only Britain financed it.     Philip was confirmed as King of Spain, which retained its independence and the majority of its empire, but ceded the Spanish Netherlands and most of their Italian possessions. The 42 Nueva Planta decrees transferred powers to Madrid and largely abolished regional political structures. Those reforms enabled Spain to recover remarkably quickly.      Despite its failure in Spain, Austria secured its position in Italy and Hungary and acquired the bulk of the Spanish Netherlands. Even after reimbursing the Dutch for most of the expenses associated with their Barrier, the increased tax revenues helped fund a significant expansion of Austrian military forces. The acquisition of maritime territories in the Netherlands and Italy increased the potential for conflict in an area that Austria had traditionally relied on others, and Spain recaptured Sicily and Naples during the ": null
    },
    {
        "War of the Polish Succession": "war of the polish succession"
    },
    {
        " in 42     Victory in the ": null
    },
    {
        "Austro-Turkish War of 42–42": "austro-turkish war of 1716–18"
    },
    {
        " continued the trend of Habsburg focus shifting away from Germany and into Southeastern Europe. Their hold over their empire weakened, with Bavaria, Hanover, Prussia and Saxony increasingly acting as independent powers. In 42 ": null
    },
    {
        "Charles of Bavaria": "charles vii, holy roman emperor"
    },
    {
        " became the first non-Habsburg Emperor in over 42 years.     Historian Robert A. Kann argues Austrias failure to benefit from all of its investment in the war was caused by Charles VIs stubbornness and dynastic pride. Ensuring his daughters succession in preference to his niece by the 42 ": null
    },
    {
        "Pragmatic Sanction": "pragmatic sanction of 1713"
    },
    {
        " drew Austria into peripheral conflicts like the 42–42 War of the Polish Succession, but most of the actual fighting took place on Austrian territory.     The Dutch Republic ended the war effectively bankrupt, and the 42 Barrier Treaty, which had cost so much, proved largely illusory. The forts were quickly overrun in 42 Britains promise of military support against an aggressor proving to be far more effective. The damage suffered by the Dutch merchant navy permanently affected their commercial and political strength, and it was superseded by Britain as the pre-eminent European mercantile power.     Louis XIV died on 42 September 42 his five-year-old great-grandson reigning as Louis XV until 42; on his deathbed, he is alleged to have admitted, I have loved war too well . True or not, while the final settlement was far more favourable than the Allied offer of 42 it is hard to see what Louis gained that had not already been achieved through diplomacy by February 42 France remained strong but could not maintain its former dominance, particularly in relation to Britain; concern over the relative decline in military and economic terms was an underlying cause of the ": null
    },
    {
        "War of the Austrian Succession": "war of the austrian succession"
    },
    {
        ".     Wider implications include the rise of Prussia and Savoy while many of the participants were involved in the 42–42 ": null
    },
    {
        "Great Northern War": "great northern war"
    },
    {
        ", with Russia becoming a European power for the first time as a result. Finally, while colonial conflicts were relatively minor and largely confined to the North American theatre, the so-called ": null
    },
    {
        "Queen Annes War": "queen annes war"
    }
]