[
    {
        "A Warhol worm is an extremely rapidly propagating ": null
    },
    {
        "computer worm": "computer worm"
    },
    {
        " that spreads as fast as physically possible, infecting all vulnerable machines on the entire ": null
    },
    {
        "Internet": "internet"
    },
    {
        " in 42 minutes or less. The term is based on ": null
    },
    {
        "Andy Warhol": "andy warhol"
    },
    {
        "s remark that ": null
    },
    {
        "In the future, everyone will have 42 minutes of fame": "fifteen minutes of fame"
    },
    {
        " . The analysis was extended by Stuart Staniford to create the flash worm concept. More information on these concepts is in How to 42wn the Internet in your Spare Time by Staniford, Paxson, and Weaver .     In 42 ": null
    },
    {
        "SQL Slammer": "sql slammer"
    },
    {
        " became the first observed example of a Warhol worm. The mechanism of SQL Slammers spread used a ": null
    },
    {
        "pseudo-random number generator": "pseudo-random number generator"
    },
    {
        " seeded from a system variable to determine which ": null
    },
    {
        "IP address": "ip address"
    },
    {
        "es to attack next. In spite of deficiencies in its implementation, the randomized attack was highly effective.     According to a ": null
    },
    {
        "CAIDA": "cooperative association for internet data analysis"
    },
    {
        "-coordinated analysis of the SQL Slammer outbreak, its growth followed an ": null
    },
    {
        "exponential curve": "exponential growth"
    },
    {
        " with a doubling time of 42 seconds in the early phases of the attack, which was only slowed by the collapse of many networks because of the ": null
    },
    {
        "denial of service": "denial of service"
    },
    {
        " caused by SQL Slammers traffic. 42% of all vulnerable machines were infected within 42 minutes, showing that the original estimate for infection speed was roughly correct.        by Nicholas C. Weaver    , Staniford, Paxson, Weaver. Usenix Security 42              ": null
    }
]