[
    {
        "      Warm-blooded ": null
    },
    {
        "animal": "animal"
    },
    {
        " species": "species"
    },
    {
        " can maintain a body temperature higher than their environment. In particular, ": null
    },
    {
        "homeothermic": "homeothermy"
    },
    {
        " species maintain a stable body temperature by regulating metabolic processes. The only known living homeotherms are ": null
    },
    {
        "birds": "birds"
    },
    {
        " and ": null
    },
    {
        "mammals": "mammals"
    },
    {
        ", though ": null
    },
    {
        "ichthyosaur": "ichthyosaur"
    },
    {
        "s, ": null
    },
    {
        "plesiosaurs": "plesiosaurs"
    },
    {
        " and non-avian ": null
    },
    {
        "dinosaurs": "dinosaur"
    },
    {
        "are believed to have been homeotherms. Other species have various degrees of ": null
    },
    {
        "thermoregulation": "thermoregulation"
    },
    {
        ".     Animal body temperature control varies by species, so the terms warm-blooded and ": null
    },
    {
        "cold-blooded": "ectotherm"
    },
    {
        " suggest a false idea of there being only two categories of body temperature control, and are no longer used scientifically.       In general, warm-bloodedness refers to three separate categories of ": null
    },
    {
        "thermoregulation": "thermoregulation"
    },
    {
        ".   ": null
    },
    {
        "Endotherm": "endotherm"
    },
    {
        "y is the ability of some creatures to control their body temperatures through internal means such as muscle shivering or increasing their ": null
    },
    {
        "metabolism": "metabolism"
    },
    {
        " . Some writers restrict the meaning of endothermy to mechanisms that directly raise the animals metabolic rate to produce heat. The opposite of endothermy is ": null
    },
    {
        "ectothermy": "ectothermy"
    },
    {
        ".   ": null
    },
    {
        "Homeotherm": "homeotherm"
    },
    {
        "y maintains a stable internal body temperature regardless of external influence and temperatures. The stable internal temperature is often higher than the immediate environment . The opposite is ": null
    },
    {
        "poikilothermy": "poikilothermy"
    },
    {
        ". Mammals and birds are homeothermic.   Tachymetabolism maintains a high resting metabolism . In essence, tachymetabolic creatures are on all the time. Though their resting metabolism is still many times slower than their active metabolism, the difference is often not as large as that seen in ": null
    },
    {
        "bradymetabolic": "bradymetabolism"
    },
    {
        " creatures. Tachymetabolic creatures have greater difficulty dealing with a scarcity of food.       A large proportion of the creatures traditionally called warm-blooded , like birds and mammals, fit all three of these categories . However, over the past 30 years, studies in the field of animal thermophysiology have revealed many species belonging to these two groups that do not fit all these criteria. For example, many ": null
    },
    {
        "bats": "bat"
    },
    {
        "and small birds are ": null
    },
    {
        "poikilothermic": "poikilothermic"
    },
    {
        " and ": null
    },
    {
        "bradymetabolic": "bradymetabolism"
    },
    {
        " when they sleep for the night . For these creatures, the term ": null
    },
    {
        "heterothermy": "heterothermy"
    },
    {
        " was coined.     Further studies on animals that were traditionally assumed to be ": null
    },
    {
        "cold-blooded": "ectotherm"
    },
    {
        " have shown that most creatures incorporate different variations of the three terms defined above, along with their counterparts , thus creating a broad spectrum of body temperature types. Some ": null
    },
    {
        "fish": "fish"
    },
    {
        " have warm-blooded characteristics, such as the ": null
    },
    {
        "opah": "opah"
    },
    {
        ". ": null
    },
    {
        "Swordfish": "swordfish"
    },
    {
        " and some ": null
    },
    {
        "sharks": "shark"
    },
    {
        "have ": null
    },
    {
        "circulatory": "circulatory system"
    },
    {
        " mechanisms that keep their ": null
    },
    {
        "brains": "brain"
    },
    {
        "and ": null
    },
    {
        "eyes": "eye"
    },
    {
        "above ambient temperatures and thus increase their ability to detect and react to ": null
    },
    {
        "prey": "predation"
    },
    {
        ".    Tunas and some sharks have similar mechanisms in their muscles, improving their stamina when swimming at high speed.        Body heat is ": null
    },
    {
        "generated": "thermogenesis"
    },
    {
        " by ": null
    },
    {
        "metabolism": "metabolism"
    },
    {
        ". This refers to the chemical reactions ": null
    },
    {
        "cells": "cell"
    },
    {
        "use to break down ": null
    },
    {
        "glucose": "glucose"
    },
    {
        " into water and ": null
    },
    {
        "carbon dioxide": "carbon dioxide"
    },
    {
        " and, in so doing, generate ATP , a high-energy compound used to power other cellular processes. Muscle contraction is a type of metabolic process that generates heat energy, and heat is also generated through friction when blood flows through the circulatory system.     All organisms metabolize food and other inputs, but some make better use of the output than others. Like all energy conversions, metabolism is rather inefficient, and around 60% of the available energy is converted to heat rather than to ATP. In most organisms, this heat is simply lost to the environment. However, endothermic homeotherms both produce more heat and have better ways to retain and regulate it than other animals. They have a higher basal metabolic rate, and also a greater capacity to increase their metabolic rate when engaged in strenuous activity. They usually have well-developed insulation in order to retain body heat, fur and ": null
    },
    {
        "blubber": "blubber"
    },
    {
        " in the case of mammals and ": null
    },
    {
        "feathers": "feather"
    },
    {
        "in birds. When this insulation is insufficient to maintain body temperature, they may resort to ": null
    },
    {
        "shivering": "shivering"
    },
    {
        "—rapid muscle contractions that quickly use up ATP, thus stimulating cellular metabolism to replace it and consequently produce more heat. In general, in hot environments, they use evaporative cooling to shed excess heat, either by ": null
    },
    {
        "sweating": "perspiration"
    },
    {
        " or by panting —in general, mechanisms not present in ": null
    },
    {
        "poikilotherm": "poikilotherm"
    },
    {
        "s.       It has been hypothesized that warm-bloodedness evolved in mammals and birds because it provided defense against fungal infections. Very few fungi can survive the body temperatures of warm-blooded animals. By comparison, insects, reptiles, and amphibians are plagued by fungal infections.  Aviv Bergman, Arturo Casadevall. 2010. . mBio Nov 2010, 1 e00212-10.  Vincent A. Robert, Arturo Casadevall. 2009. . The Journal of Infectious Diseases, Volume 200, Issue 10, 15 November 2009, Pages 1623–1626.  Casadevall A . PLoS Pathog 8: e1002808. ": null
    }
]