[
    {
        "                 The Warring States period  was an era in ": null
    },
    {
        "ancient Chinese history": "history of chinaancient china"
    },
    {
        " characterized by warfare, as well as bureaucratic and military reforms and consolidation. It followed the ": null
    },
    {
        "Spring and Autumn period": "spring and autumn period"
    },
    {
        " and concluded with the ": null
    },
    {
        "Qin wars of conquest": "qins wars of unification"
    },
    {
        " that saw the annexation of all other contender states, which ultimately led to the ": null
    },
    {
        "Qin state": "qin"
    },
    {
        "s victory in 42 BC as the first unified ": null
    },
    {
        "Chinese empire": "history of chinaimperial china"
    },
    {
        ", known as the ": null
    },
    {
        "Qin dynasty": "qin dynasty"
    },
    {
        ".     Although different scholars point toward different dates ranging from 42 BC to 42 BC as the true beginning of the Warring States, ": null
    },
    {
        "Sima Qian": "sima qian"
    },
    {
        "s choice of 42 BC is the most often cited. The Warring States era also overlaps with the second half of the ": null
    },
    {
        "Eastern Zhou dynasty": "eastern zhou period"
    },
    {
        ", though the ": null
    },
    {
        "Chinese sovereign": "chinese sovereign"
    },
    {
        ", known as the king of Zhou, ruled merely as a ": null
    },
    {
        "figurehead": "figurehead"
    },
    {
        " and served as a backdrop against the machinations of the warring states.     The Warring States Period derives its name from the  Record of the Warring States , a work compiled early in the ": null
    },
    {
        "Han dynasty": "han dynasty"
    },
    {
        ".       The political geography of the era was dominated by the ": null
    },
    {
        "Seven Warring States": "seven warring states"
    },
    {
        ", namely:    Qin  located in the far west, with its core in the ": null
    },
    {
        "Wei River Valley": "wei river valley"
    },
    {
        " and ": null
    },
    {
        "Guanzhong": "guanzhong"
    },
    {
        ". This geographical position offered protection from the other states but limited its initial influence.   The Three Jins Located in the center on the ": null
    },
    {
        "Shanxi": "shanxi"
    },
    {
        " plateau were the three successor states of ": null
    },
    {
        "Jin": "jin"
    },
    {
        ". These were:    Han  south, along the ": null
    },
    {
        "Yellow River": "yellow river"
    },
    {
        ", controlling the approaches to Qin.    Wei  located in the middle, roughly todays eastern ": null
    },
    {
        "Henan Province": "henan province"
    },
    {
        ".    Zhao  the northernmost of the three, roughly todays southern ": null
    },
    {
        "Hebei Province": "hebei province"
    },
    {
        " as well as northern ": null
    },
    {
        "Shanxi Province": "shanxi province"
    },
    {
        ".    Qi  east, centred on the ": null
    },
    {
        "Shandong Peninsula": "shandong peninsula"
    },
    {
        "  Chu  south, with its core territory around the valleys of the ": null
    },
    {
        "Han River": "han river"
    },
    {
        " and, later, the ": null
    },
    {
        "Yangtze River": "yangtze river"
    },
    {
        ".    Yan  northeast, centred on modern-day ": null
    },
    {
        "Beijing": "beijing"
    },
    {
        ". Late in the period it pushed northeast and began to occupy the ": null
    },
    {
        "Liaodong Peninsula": "liaodong peninsula"
    },
    {
        "     Besides these seven major states other smaller states survived into the period. They include:   Royal territory of the Zhou king was near ": null
    },
    {
        "Luoyi": "luoyang"
    },
    {
        " in the Han area on the Yellow River.    Yue  On the southeast coast near ": null
    },
    {
        "Shanghai": "shanghai"
    },
    {
        " was the State of Yue, which was highly active in the late Spring and Autumn era but was later annexed by Chu.    Zhongshan  Between the states of Zhao and Yan was the state of Zhongshan, which was eventually annexed by Zhao in 42 BC.    Sichuan  states: In the far southwest were the non-Zhou states of ": null
    },
    {
        "Ba": "ba"
    },
    {
        " and ": null
    },
    {
        "Shu": "shu"
    },
    {
        " . These ancient kingdoms were conquered by Qin later in the period.   Other minor states: There were many minor states which were satellites of the larger ones until they were absorbed. Many were in the ": null
    },
    {
        "Central Plains": "central plain"
    },
    {
        " between the three Jins and Qi and Chu to the south. Some of the more important ones were ": null
    },
    {
        "Song": "song"
    },
    {
        ", ": null
    },
    {
        "Lu": "lu"
    },
    {
        ", ": null
    },
    {
        "Zheng": "zheng"
    },
    {
        ", ": null
    },
    {
        "Wey": "wey"
    },
    {
        ", ": null
    },
    {
        "Teng": "teng"
    },
    {
        " and ": null
    },
    {
        "Zou": "zou"
    },
    {
        ".            The eastward flight of the ": null
    },
    {
        "Zhou": "western zhou"
    },
    {
        " court in 42 BC marks the start of the ": null
    },
    {
        "Spring and Autumn period": "spring and autumn period"
    },
    {
        ". No one single incident or starting point inaugurated the Warring States era. The political situation of the period represented a culmination of historical trends of conquest and annexation which also characterised the Spring and Autumn period; as a result there is some controversy as to the beginning of the era. Proposed starting points include:     42 BC Proposed by ": null
    },
    {
        "Song": "song dynasty"
    },
    {
        "-era historian ": null
    },
    {
        "Lü Zuqian": "lü zuqian"
    },
    {
        ", also known as Lü Bogong, since this year marks the end of the  Spring and Autumn Annals .   42–42 BC The author, ": null
    },
    {
        "Sima Qian": "sima qian"
    },
    {
        ", of  Records of the Grand Historian , chose this date as the inaugural year of ": null
    },
    {
        "King Yuan of Zhou": "king yuan of zhou"
    },
    {
        ".   42 BC The ": null
    },
    {
        "Partition of Jin": "partition of jin"
    },
    {
        " saw the dissolution/destruction of that key state of the earlier period and the formation of three of the seven warring states: Han, Zhao, and Wei.   42 BC The inaugural year of Zhou Kings starting with ": null
    },
    {
        "King Ai of Zhou": "king ai of zhou"
    },
    {
        ".   42 BC The year when the Zhou court officially recognised Han, Zhao and Wei as states. Author ": null
    },
    {
        "Sima Guang": "sima guang"
    },
    {
        " of  Zizhi Tongjian  advocates this symbol of eroded Zhou authority as the start of the Warring States era.            The Eastern Zhou Dynasty began to fall around 42th century BC. They had to rely on other armies in other allied states because their military rule no longer followed. Over 42 smaller states were made into seven major states which included: Chu, Han, Qin, Wei, Yan, Qi and Zhao. However, there eventually was a shift in alliances because each states ruler wanted to be independent in power. This caused hundreds of wars between the periods of 4242 BCE. The victorious state would have overall rule and control in China.      The system of feudal states created by the ": null
    },
    {
        "Western Zhou dynasty": "western zhou dynasty"
    },
    {
        " underwent enormous changes after 42 BC with the flight of the Zhou court to modern-day ": null
    },
    {
        "Luoyang": "luoyang"
    },
    {
        " and the diminution of its relevance and power. The Spring and Autumn period led to a few states gaining power at the expense of many others, the latter no longer able to depend on central authority for legitimacy or protection.   During the Warring States period, many rulers claimed the ": null
    },
    {
        "Mandate of Heaven": "mandate of heaven"
    },
    {
        " to justify their conquest of other states and spread their influence.      The struggle for hegemony eventually created a state system dominated by several large states, such as ": null
    },
    {
        "Jin": "jin"
    },
    {
        ", Chu, Qin, Yan and Qi, while the smaller states of the ": null
    },
    {
        "Central Plains": "central plain"
    },
    {
        " tended to be their satellites and tributaries. Other major states also existed, such as Wu and Yue in the southeast. The last decades of the Spring and Autumn era were marked by increased stability, as the result of peace negotiations between Jin and Chu which established their respective spheres of influence. This situation ended with the partition of Jin, whereby the state was divided between the houses of Han, Zhao and Wei, and thus enabled the creation of the seven major warring states.          The rulers of Jin had steadily lost political powers since the middle of the 42th century BC to their nominally subordinate nobles and military commanders, a situation arising from the traditions of the Jin which forbade the ": null
    },
    {
        "enfeoffment": "enfeoffment"
    },
    {
        " of relatives of the ducal house. This allowed other clans to gain fiefs and military authority, and decades of internecine struggle led to the establishment of four major families, the Han, Zhao, Wei and Zhi.     The ": null
    },
    {
        "Battle of Jinyang": "battle of jinyang"
    },
    {
        " saw the allied Han, Zhao and Wei destroy the Zhi family and their lands were distributed among them. With this, they became the de facto rulers of most of Jins territory, though this situation would not be officially recognised until half a century later. The Jin division created a political vacuum that enabled during the first 42 years expansion of Chu and Yue northward and Qi southward. Qin increased its control of the local tribes and began its expansion southwest to ": null
    },
    {
        "Sichuan": "sichuan"
    },
    {
        ".                  In 42 BC, the Zhou court under ": null
    },
    {
        "King Weilie": "king weilie of zhou"
    },
    {
        " officially recognized Zhao, Wei and Han as immediate vassals, thereby raising them to the same rank as the other warring states.     From before 42 until 42 the three Jins were united under the leadership of Wei and expanded in all directions. The most important figure was ": null
    },
    {
        "Marquess Wen of Wei": "marquess wen of wei"
    },
    {
        " . In 42–42 he conquered the State of ": null
    },
    {
        "Zhongshan": "zhongshan"
    },
    {
        " to the northeast on the other side of Zhao. At the same time he pushed west across the Yellow River to the ": null
    },
    {
        "Luo River": "luo river"
    },
    {
        " taking the area of Xihe .     The growing power of Wei caused Zhao to back away from the alliance. In 42 it moved its capital to ": null
    },
    {
        "Handan": "handan"
    },
    {
        " and attacked the small state of ": null
    },
    {
        "Wey": "wei"
    },
    {
        ". Wey appealed to Wei which attacked Zhao on the western side. Being in danger, Zhao called in Chu. As usual, Chu used this as a pretext to annex territory to its north, but the diversion allowed Zhao to occupy a part of Wei. This conflict marked the end of the power of the united Jins and the beginning a period of shifting alliances and wars on several fronts.     In 42 BC, the states of Han, Wei and Zhao deposed ": null
    },
    {
        "Duke Jing of Jin": "duke jing of jin"
    },
    {
        " and divided the last remaining Jin territory between themselves, which marked the final end of the Jin state.     In 42 BC, ": null
    },
    {
        "Marquess Wu of Wei": "marquess wu of wei"
    },
    {
        " died without naming a successor, which led to a war of succession. After three years of civil war, ": null
    },
    {
        "Zhao": "zhao"
    },
    {
        " from the north and ": null
    },
    {
        "Han": "han"
    },
    {
        " from the south invaded Wei. On the verge of conquering Wei, the leaders of Zhao and Han fell into disagreement about what to do with Wei, and both armies abruptly retreated. As a result, ": null
    },
    {
        "King Hui of Wei": "king hui of wei"
    },
    {
        " was able to ascend the throne of Wei.     By the end of the period Zhao extended from the Shanxi plateau across the plain to the borders of Qi. Wei reached east to Qi, ": null
    },
    {
        "Lu": "lu"
    },
    {
        " and ": null
    },
    {
        "Song": "song"
    },
    {
        ". To the south, the weaker state of Han held the east-west part of the Yellow River valley, surrounded the Zhou royal domain at ": null
    },
    {
        "Luoyang": "luoyang"
    },
    {
        " and held an area north of Luoyang called ": null
    },
    {
        "Shangdang": "shangdang"
    },
    {
        ".              ": null
    },
    {
        "Duke Kang of Qi": "duke kang of qi"
    },
    {
        " died in 42 BC with no heir from the house of Jiang, which had ruled Qi since the states founding. The throne instead passed to the future ": null
    },
    {
        "King Wei": "king wei of qi"
    },
    {
        ", from the house of Tian. The Tian had been very influential at court towards the end of Jiang rule, and now openly assumed power. Shi Ji, chapter 42     The new ruler set about reclaiming territories that had been lost to other states. He launched a successful campaign against Zhao, Wey and Wei, once again extending Qi territory to the Great Wall. ": null
    },
    {
        "Sima Qian": "sima qian"
    },
    {
        " writes that the other states were so awestruck that nobody dared attack Qi for more than 42 years. The demonstrated military prowess also had a calming effect on Qis own population, which experienced great domestic tranquility during Weis reign. Shi Ji, chapter 42     By the end of King Weis reign, Qi had become the strongest of the states and proclaimed itself king ; establishing independence from the Zhou dynasty .              ": null
    },
    {
        "King Hui of Wei": "king hui of wei"
    },
    {
        " set about restoring the state. In 42–42 BC he exchanged territories with Han and Zhao in order to make the boundaries of the three states more rational.     In 42 BC Wei was defeated by Qin at the Battle of Shimen and was only saved by the intervention of Zhao. Qin won another victory in 42 BC. In 42 BC the Wei capital was moved east to ": null
    },
    {
        "Daliang": "kaifeng"
    },
    {
        " to be out of the reach of Qin.     In 42 BC, King Hui of Wei started a large-scale attack on Zhao. By 42 BC, Zhao was losing badly and its capital, ": null
    },
    {
        "Handan": "handan"
    },
    {
        ", was under siege. ": null
    },
    {
        "The State of Qi": "qi"
    },
    {
        " intervened. The famous Qi strategist, ": null
    },
    {
        "Sun Bin": "sun bin"
    },
    {
        " the great-great-great-grandson of ": null
    },
    {
        "Sun Tzu": "sun tzu"
    },
    {
        " , proposed to attack the Wei capital while the Wei army was tied up besieging Zhao. The strategy was a success; the Wei army hastily moved south to protect its capital, was caught on the road and decisively defeated at the ": null
    },
    {
        "Battle of Guiling": "battle of guiling"
    },
    {
        ". The battle is remembered in the second of the ": null
    },
    {
        "Thirty-Six Stratagems": "thirty-six stratagems"
    },
    {
        ", besiege Wei, save Zhao meaning to attack a vulnerable spot to relieve pressure at another point.     Domestically, King Hui patronized philosophy and the arts, and is perhaps best remembered for hosting the Confucian philosopher ": null
    },
    {
        "Meng Zi": "meng zi"
    },
    {
        " at his court; their conversations form the first two chapters of ": null
    },
    {
        "the book which bears Meng Zis name": "mencius"
    },
    {
        ".              The title of king  was held by figurehead rulers of the Zhou dynasty, while the rulers of most states held the title of duke  or marquess . A major exception was ": null
    },
    {
        "Chu": "chu"
    },
    {
        ", whose rulers were called kings since ": null
    },
    {
        "King Wu of Chu": "king wu of chu"
    },
    {
        " started using the title c. 42 BC.     In 42 BC the rulers of Qi and Wei mutually recognized each other as kings : ": null
    },
    {
        "King Wei of Qi": "king wei of qi"
    },
    {
        " and ": null
    },
    {
        "King Hui of Wei": "king hui of wei"
    },
    {
        ", in effect declaring their independence from the Zhou court. This marked a major turning point: unlike those in the ": null
    },
    {
        "Spring and Autumn period": "spring and autumn period"
    },
    {
        ", the new generation of rulers ascending the thrones in the Warring States period would not entertain even the pretence of being vassals of the Zhou dynasty, instead proclaiming themselves fully independent kingdoms.          During the early Warring States period Qin generally avoided conflicts with the other states. This changed during the reign of ": null
    },
    {
        "Duke Xiao": "duke xiao of qin"
    },
    {
        ", when prime minister ": null
    },
    {
        "Shang Yang": "shang yang"
    },
    {
        " made centralizing and authoritarian reforms in accordance with his ": null
    },
    {
        "Legalist": "legalism"
    },
    {
        " philosophy between the years 42 and 42 BC.     Shang introduced land reforms, privatized land, rewarded farmers who exceeded harvest quotas, enslaved farmers who failed to meet quotas, and used enslaved subjects as rewards for those who met government policies. As manpower was short in Qin relative to the other states at the time, Shang enacted policies to increase its manpower. As Qin peasants were recruited into the military, he encouraged active immigration of peasants from other states into Qin as a replacement workforce; this policy simultaneously increased the manpower of Qin and weakened the manpower of Qins rivals.     Shang made laws forcing citizens to marry at a young age and passed tax laws to encourage raising multiple children. He also enacted policies to free convicts who worked in opening wastelands for agriculture. Shang abolished ": null
    },
    {
        "primogeniture": "primogeniture"
    },
    {
        " and created a double tax on households that had more than one son living in the household, to break up large clans into nuclear families. Shang also moved the capital to reduce the influence of nobles on the administration.     The rise of Qin was recognized by the royal court, and in 42 BC the king conferred the title of hegemon on Duke Xiao. As was customary for the designated hegemon, the duke hosted a conference of all the feudal lords, although it did not lead to any lasting peace.     After the reforms Qin became much more aggressive. In 42 Qin took land from Wèi after it had been defeated by Qi. In 42 Qin conquered ": null
    },
    {
        "Shu": "shu"
    },
    {
        " and ": null
    },
    {
        "Ba": "ba"
    },
    {
        " in ": null
    },
    {
        "Sichuan": "sichuan"
    },
    {
        " to the southwest. Development of this area took a long time but slowly added greatly to Qins wealth and power.       In 42 BC, Wei attacked Han. Qi allowed Han to be nearly defeated and then intervened. The generals from the Battle of Guiling met again , using the same tactic, attacking Weis capital. Sun Bin feigned a retreat and then turned on the overconfident Wei troops and decisively defeated them at the ": null
    },
    {
        "Battle of Maling": "battle of maling"
    },
    {
        ". After the battle all three of the Jin successor states appeared before ": null
    },
    {
        "King Xuan of Qi": "king xuan of qi"
    },
    {
        ", pledging their loyalty. Shi Ji, chapter 42     In the following year ": null
    },
    {
        "Qin": "qin"
    },
    {
        " attacked the weakened Wei. Wei was devastatingly defeated and ceded a large part of its territory in return for truce. With Wei severely weakened, Qi and Qin became the dominant states in China.     Wei came to rely on Qi for protection, with ": null
    },
    {
        "King Hui of Wei": "king hui of wei"
    },
    {
        " meeting ": null
    },
    {
        "King Xuan of Qi": "king xuan of qi"
    },
    {
        " on two occasions. After Huis death, his successor ": null
    },
    {
        "King Xiang": "king xiang of wei"
    },
    {
        " also established a good relationship with his Qi counterpart, with both promising to recognize the other as king .                  Early in the Warring States period, ": null
    },
    {
        "Chu": "chu"
    },
    {
        " was one of the strongest states in China. The state rose to a new level of power around 42 BC when ": null
    },
    {
        "King Dao of Chu": "king dao of chu"
    },
    {
        "  named the famous reformer ": null
    },
    {
        "Wu Qi": "wu qi"
    },
    {
        " as his chancellor.     Chu rose to its peak in 42 BC, when it conquered ": null
    },
    {
        "Yue": "yue"
    },
    {
        " to its east on the Pacific coast. The series of events leading up to this began when Yue prepared to attack ": null
    },
    {
        "Qi": "qi"
    },
    {
        " to its north. The King of Qi sent an emissary who persuaded the King of Yue to attack Chu instead. Yue initiated a large-scale attack at Chu but was defeated by Chus counter-attack. Chu then proceeded to conquer Yue.       ": null
    },
    {
        "King Xian of Zhou": "king xian of zhou"
    },
    {
        " had attempted to use what little royal prerogrative he had left by appointing the dukes ": null
    },
    {
        "Xian": "duke xian of qin"
    },
    {
        " , ": null
    },
    {
        "Xiao": "duke xiao of qin"
    },
    {
        " and ": null
    },
    {
        "Hui": "king hui of qin"
    },
    {
        " of Qin as hegemons, thereby in theory making Qin the chief ally of the court. Shi Ji, chapter 42     However, in 42 the confidence of Duke Hui grew so great that he proclaimed himself king of Qin; adopting the same title as the king of Zhou and thereby effectively proclaiming independence from the Zhou dynasty. King Hui of Qin was guided by his prime minister ": null
    },
    {
        "Zhang Yi": "zhang yi"
    },
    {
        ", a prominent representative of the ": null
    },
    {
        "School of Diplomacy": "school of diplomacy"
    },
    {
        ". Shi Ji, chapter 42     He was followed in 42 BC by ": null
    },
    {
        "King Xuanhui of Han": "king xuanhui of han"
    },
    {
        " and ": null
    },
    {
        "King Yi of Yan": "king yi of yan"
    },
    {
        ", as well as ": null
    },
    {
        "King Cuo": "king cuo of zhongshan"
    },
    {
        " of the minor state Zhongshan. In 42 BC, even the ruler of ": null
    },
    {
        "Song": "song"
    },
    {
        ", a relatively minor state, declared himself king. Uniquely, while ": null
    },
    {
        "King Wuling of Zhao": "king wuling of zhao"
    },
    {
        " had joined the other kings in declaring himself king, he retracted this order in 42 BC, after Zhao suffered a great defeat at the hands of Qin.         ": null
    },
    {
        "King Kao of Zhou": "king kao of zhou"
    },
    {
        " had enfeoffed his younger brother as Duke Huan of Henan. Three generations later, this cadet branch of the royal house began calling themselves Dukes of East Zhou .     Upon the ascension of ": null
    },
    {
        "King Nan": "king nan of zhou"
    },
    {
        " in 42 BC, East Zhou became an independent state. The king came to reside in what became known as West Zhou.                 Towards the end of the Warring States period, the ": null
    },
    {
        "Qin state": "qin"
    },
    {
        " became disproportionately powerful compared with the other six states. As a result, the policies of the six states became overwhelmingly oriented towards dealing with the Qin threat, with two opposing schools of thought. One school advocated a vertical or north-south alliance called hezong in which the states would ally with each other to repel Qin. The other advocated a horizontal or east-west alliance called lianheng in which a state would ally with Qin to participate in its ascendancy.     There were some initial successes in hezong, though mutual suspicions between allied states led to the breakdown of such alliances. Qin repeatedly exploited the horizontal alliance strategy to defeat the states one by one. During this period, many philosophers and tacticians travelled around the states, recommending that the rulers put their respective ideas into use. These lobbyists, such as ": null
    },
    {
        "Su Qin": "su qin"
    },
    {
        " and ": null
    },
    {
        "Zhang Yi": "zhang yi"
    },
    {
        " , were famous for their tact and intellect, and were collectively known as the ": null
    },
    {
        "School of Diplomacy": "school of diplomacy"
    },
    {
        ", whose Chinese name was derived from the two opposing ideas.         Beginning in 42 BC, the diplomat ": null
    },
    {
        "Su Qin": "su qin"
    },
    {
        " spent years visiting the courts of Yan, Zhao, Han, Wei, Qi and Chu and persuaded them to form a united front against Qin. In 42 BC all states except Qi launched a joint attack on Qin, which however was not successful.     ": null
    },
    {
        "King Hui of Qin": "king hui of qin"
    },
    {
        " died in 42 BC, followed by prime minister Zhang Yi one year later. The new monarch, ": null
    },
    {
        "King Wu": "king wu of qin"
    },
    {
        ", reigned only four years before dying without legitimate heirs. Some damaging turbulence ensued throughout 42 BC before a son of King Hui by a concubine could be established as ": null
    },
    {
        "King Zhao": "king zhao of qin"
    },
    {
        ", who in stark contrast to his predecessor went on to rule for an unprecedented 42 years.     After the failure of the first vertical alliance, Su Qin eventually came to live in Qi, where he was favored by King Xuan and drew the envy of the ministers. An assassination attempt in 42 BC left Su mortally wounded but not dead. Sensing death approaching, he advised the newly crowned ": null
    },
    {
        "King Min": "king min of qi"
    },
    {
        " have him publicly executed to draw out the assassins. King Min complied with Sus request and killed him, putting an end to the first generation of Vertical alliance thinkers. Shi Ji, chapter 42          ": null
    },
    {
        "King Min of Qi": "king min of qi"
    },
    {
        " came to be highly influenced by ": null
    },
    {
        "Lord Mengchang": "lord mengchang of qi"
    },
    {
        ", a grandson of the former ": null
    },
    {
        "King Wei of Qi": "king wei of qi"
    },
    {
        ". Lord Mengchang made a westward alliance with the States of ": null
    },
    {
        "Wei": "wei"
    },
    {
        " and ": null
    },
    {
        "Han": "han"
    },
    {
        ". In the far west, Qin, which had been weakened by a succession struggle in 42 yielded to the new coalition and appointed Lord Mengchang its chief minister. The alliance between Qin and Qi was sealed by a Qin princess marrying King Min. This horizontal or east-west alliance might have secured peace except that it excluded the ": null
    },
    {
        "State of Zhao": "zhao"
    },
    {
        ".     Around 42 BC, ": null
    },
    {
        "the ruler": "king huiwen of zhao"
    },
    {
        " of ": null
    },
    {
        "Zhao": "zhao"
    },
    {
        " became the last of the seven major states to proclaim himself king .     In 42 BC Zhao offered Qin an alliance and Lord Mengchang was driven out of Qin. The remaining three allies, Qi, Wei and Han, attacked Qin, driving up the ": null
    },
    {
        "Yellow River": "yellow river"
    },
    {
        " below Shanxi to the ": null
    },
    {
        "Hangu Pass": "hangu pass"
    },
    {
        ". After 42 years of fighting they took the pass and forced Qin to return territory to Han and Wei. They next inflicted major defeats on ": null
    },
    {
        "Yan": "yan"
    },
    {
        " and ": null
    },
    {
        "Chu": "chu"
    },
    {
        ". During the 42-year administration of Lord Mengchang, Qi was the major power in China.     In 42 BC Lord Mengchang was implicated in a coup detat and fled to Wei. His alliance system collapsed.   Qi and Qin made a truce and pursued their own interests. Qi moved south against the ": null
    },
    {
        "State of Song": "song"
    },
    {
        " whilst the Qin General ": null
    },
    {
        "Bai Qi": "bai qi"
    },
    {
        " pushed back eastward against a Han/Wei alliance, gaining victory at the ": null
    },
    {
        "Battle of Yique": "battle of yique"
    },
    {
        ".     In 42 BC ": null
    },
    {
        "King Zhao of Qin": "king zhao of qin"
    },
    {
        " and ": null
    },
    {
        "King Min of Qi": "king min of qi"
    },
    {
        " took the title Di , , of the west and east respectively. They swore a covenant and started planning an attack on Zhao.         In 42 BC Su Dai, the younger brother of Su Qin and possibly an agent of Yan, persuaded King Min that the Zhao war would only benefit Qin. King Min agreed and formed a vertical alliance with the other states against Qin. Qin backed off, abandoned the presumptuous title of Di , and restored territory to Wei and Zhao. In 42 Qi annexed the state of Song.         In 42 BC the success of Qi had frightened the other states. Under the leadership of Lord Mengchang, who was exiled in Wei, Qin, Zhao, Wei and Yan formed an alliance. Yan had normally been a relatively weak ally of Qi and Qi feared little from this quarter. Yans onslaught under general ": null
    },
    {
        "Yue Yi": "yue yi"
    },
    {
        " came as a devastating surprise. Simultaneously, the other allies attacked from the west. Chu declared itself an ally of Qi but contented itself with annexing some territory to its north. Qis armies were destroyed while the territory of Qi was reduced to the two cities of Ju and ": null
    },
    {
        "Jimo": "jimo, shandong"
    },
    {
        ". King Min himself was later captured and executed by his own followers.     King Min was succeeded by ": null
    },
    {
        "King Xiang": "king xiang of qi"
    },
    {
        " in 42 BC. His general ": null
    },
    {
        "Tian Dan": "tian dan"
    },
    {
        " was eventually able to restore much of Qis territory, but it never regained the influence it had under King Min.          General ": null
    },
    {
        "Bai Qi": "bai qi"
    },
    {
        " of ": null
    },
    {
        "Qin": "qin"
    },
    {
        " attacked from Qins new territory in ": null
    },
    {
        "Sichuan": "sichuan"
    },
    {
        " to the west of Chu. The capital of ": null
    },
    {
        "Ying": "ying"
    },
    {
        " was captured and Chus western lands on the ": null
    },
    {
        "Han River": "han river"
    },
    {
        " were lost. The effect was to shift Chu significantly to the east.     After Chu was defeated in 42 the remaining great powers were Qin in the west and Zhao in the north-center. There was little room for diplomatic maneuver and matters were decided by war in 42–42 Zhao had been much strengthened by ": null
    },
    {
        "King Wuling of Zhao": "king wuling of zhao"
    },
    {
        " . In 42 he enlarged his cavalry by copying the northern nomads. In 42 he took more land in the northern Shanxi plateau. In 42 he defeated the north-eastern border state of ": null
    },
    {
        "Zhongshan": "zhongshan"
    },
    {
        ". In 42 he pushed far to the north-west and occupied the east-west section of the Yellow River in the north of the ": null
    },
    {
        "Ordos Loop": "ordos loop"
    },
    {
        ". King Huiwen of Zhao chose able servants and expanded against the weakened Qi and Wei. In 42 his general ": null
    },
    {
        "Lian Po": "lian po"
    },
    {
        " defeated two Qin armies.     In 42 BC Fan Sui became chief advisor to Qin. He advocated authoritarian reforms, irrevocable expansion and an alliance with distant states to attack nearby states . His maxim attack not only the territory, but also the people enunciated a policy of mass slaughter that became increasingly frequent.     In 42 ": null
    },
    {
        "King Zhaoxiang of Qin": "king zhaoxiang of qin"
    },
    {
        " made the first move by attacking the weak state of Han which held the Yellow River gateway into Qin. He moved north-east across Wei territory to cut off the Han exclave of ": null
    },
    {
        "Shangdang": "shangdang"
    },
    {
        " north of Luoyang and south of Zhao. The Han king agreed to surrender Shangdang, but the local governor refused and presented it to King Xiaocheng of Zhao. Zhao sent out ": null
    },
    {
        "Lian Po": "lian po"
    },
    {
        " who based his armies at ": null
    },
    {
        "Changping": "battle of changping"
    },
    {
        " and Qin sent out general Wang He. Lian Po was too wise to risk a decisive battle with the Qin army and remained inside his fortifications. Qin could not break through and the armies were locked in stalemate for three years. The Zhao king decided that Lian Po was not aggressive enough and sent out ": null
    },
    {
        "Zhao Kuo": "zhao kuo"
    },
    {
        " who promised a decisive battle. At the same time Qin secretly replaced Wang He with the notoriously violent ": null
    },
    {
        "Bai Qi": "bai qi"
    },
    {
        ". When Zhao Kuo left his fortifications, Bai Qi used a ": null
    },
    {
        "Cannae": "battle of cannae"
    },
    {
        " maneuver, falling back in the center and surrounding the Zhao army from the sides. After being surrounded for 42 days, the starving Zhao troops surrendered in September 42 BC. It is said that Bai Qi had all the prisoners killed and that Zhao lost 42 men.     Qin was too exhausted to follow up its victory. Some time later it sent an army to besiege the Zhao capital but the army was destroyed when it was attacked from the rear. Zhao survived, but there was no longer a state that could resist Qin on its own. The other states could have survived if they remained united against Qin, but they did not.       The forces of ": null
    },
    {
        "King Zhao of Qin": "king zhao of qin"
    },
    {
        " defeated ": null
    },
    {
        "King Nan of Zhou": "king nan of zhou"
    },
    {
        " and conquered West Zhou in 42 BC, claiming the ": null
    },
    {
        "Nine Cauldrons": "nine tripod cauldrons"
    },
    {
        " and thereby symbolically becoming The Son of Heaven.     King Zhaos exceptionally long reign ended in 42 BC. His son ": null
    },
    {
        "King Xiaowen": "king xiaowen of qin"
    },
    {
        ", already an old man, died just three days after his coronation and was succeeded by his son ": null
    },
    {
        "King Zhuangxiang of Qin": "king zhuangxiang of qin"
    },
    {
        ". The new Qin king proceeded to conquer East Zhou, seven years after the fall of West Zhou. Thus the 42-year Zhou dynasty, nominally Chinas longest-ruling regime, finally came to an end.     ": null
    },
    {
        "Sima Qian": "sima qian"
    },
    {
        " contradicts himself regarding the ultimate fate of the East Zhou court. Chapter 42 concludes with the sentence thus the sacrifices of Zhou ended , but in the following chapter 42 we learn that Qin did not prohibit their sacrifices; the Lord of Zhou was allotted a patch of land in Yangren where he could continue his ancestral sacrifices .                    ": null
    },
    {
        "King Zhuangxiang of Qin": "king zhuangxiang of qin"
    },
    {
        " ruled for only three years. He was succeeded by his son Zheng, who unlike the two elderly kings that preceded him was only 42 years old at his coronation. As an adult Zheng would turn out to be a brilliant commander who, in the span of just nine years, unified China.       In 42 BC, ": null
    },
    {
        "Qin": "qin"
    },
    {
        " conquered ": null
    },
    {
        "Han": "han"
    },
    {
        ".   Han, the weakest of the ": null
    },
    {
        "Seven Warring States": "seven warring states"
    },
    {
        ", was adjacent to the much stronger Qin, and had suffered continuous assaults by Qin in earlier years of the Warring States period. This went on until Emperor ": null
    },
    {
        "Qin Shi Huang": "qin shi huang"
    },
    {
        " sent general ": null
    },
    {
        "Wang Jian": "wang jian"
    },
    {
        " to attack Zhao. ": null
    },
    {
        "King An of Han": "king an of han"
    },
    {
        ", frightened by the thought that Han would be the next target of the Qin state, immediately sent diplomats to surrender the entire kingdom without a fight, saving the Han populace from the terrible potential consequences of an unsuccessful resistance.       In 42 BC, Qin conquered ": null
    },
    {
        "Wei": "wei"
    },
    {
        ".   The Qin army led a direct invasion into Wei by besieging its capital ": null
    },
    {
        "Daliang": "kaifeng"
    },
    {
        " but soon realized that the city walls were too tough to break into. They devised a new strategy in which they utilized the power of a local river that was linked to the ": null
    },
    {
        "Yellow River": "yellow river"
    },
    {
        ". The river was used to flood the citys walls, causing massive devastation to the city. Upon realizing the situation, King Jia of Wei hurriedly came out of the capital and surrendered it to the Qin army in order to avoid further bloodshed of his people.          In 42 BC, Qin conquered ": null
    },
    {
        "Chu": "chu"
    },
    {
        ".   The first invasion was however an utter disaster when 42 Qin troops, led by the general, Li Xin, were defeated by 42 Chu troops in the unfamiliar territory of Huaiyang, modern-day northern ": null
    },
    {
        "Jiangsu": "jiangsu"
    },
    {
        " and ": null
    },
    {
        "Anhui": "anhui"
    },
    {
        " provinces. Xiang Yan, the Chu commander, had lured Qin by allowing a few initial victories, but then counterattacked and burnt two large Qin camps.     In 42 BC, Wang Jian was recalled to lead a second military invasion with 42 men against the Chu state. High in morale after their victory in the previous year, the Chu forces were content to sit back and defend against what they expected to be a ": null
    },
    {
        "siege": "siege"
    },
    {
        " of Chu. However, Wang Jian decided to weaken Chus resolve and tricked the Chu army by appearing to be idle in his fortifications whilst secretly training his troops to fight in Chu territory. After a year, the Chu defenders decided to disband due to apparent lack of action from the Qin. Wang Jian invaded at that point, with full force, and overran Huaiyang and the remaining Chu forces. Chu lost the initiative and could only sustain local guerrilla-style resistance until it too was fully conquered with the destruction of ": null
    },
    {
        "Shouchun": "shou county"
    },
    {
        " and the death of its last leader, ": null
    },
    {
        "Lord Changping": "lord changping"
    },
    {
        ", in 42 BC. At their peak, the combined armies of Chu and Qin are estimated to have ranged from hundreds of thousands to a million soldiers, more than those involved in the campaign of Changping between Qin and Zhao 42 years earlier.       In 42 BC, Qin conquered ": null
    },
    {
        "Zhao": "zhao"
    },
    {
        " and ": null
    },
    {
        "Yan": "yan"
    },
    {
        ".   After the conquest of Zhao, the Qin army turned its attention towards Yan. Realizing the danger and gravity of this situation, ": null
    },
    {
        "Crown Prince Dan": "crown prince dan"
    },
    {
        " of Yan had sent ": null
    },
    {
        "Jing Ke": "jing ke"
    },
    {
        " to assassinate ": null
    },
    {
        "King Zheng of Qin": "king zheng of qin"
    },
    {
        ", but this failure only helped to fuel the rage and determination of the Qin king, and he increased the number of troops to conquer the Yan state.       In 42 BC, Qin conquered ": null
    },
    {
        "Qi": "qi"
    },
    {
        ".   Qi was the final unconquered warring state. It had not previously contributed or helped other states when Qin was conquering them. As soon as Qins intention to invade it became clear, Qi swiftly surrendered all its cities, completing the ": null
    },
    {
        "unification of China": "qins wars of unification"
    },
    {
        " and ushering in the ": null
    },
    {
        "Qin dynasty": "qin dynasty"
    },
    {
        ". The last Qi king lived out his days in exile in Gong and was not given a posthumous name after death, therefore he is known to posterity by his personal name Jian.     The Qin king Zheng declared himself Qin Shi Huangdi, “The first Sovereign Emperor of Qin .     In the rule of the Qin state, the union was based solely on military power. The feudal holdings were abolished, and noble families were forced to live in the capital of China, Xianyang, in order to be supervised. A national road as well as greater use of canals was used in order for deployment and supply of the army to be done with ease and speed. The peasants were given a wider range of rights in regards of land, although they were subject to taxation, creating a large amount of revenue to the state.                             The ": null
    },
    {
        "chariot": "chariot"
    },
    {
        " remained a major factor in Chinese warfare long after it went out of fashion in the Middle East. Near the beginning of the Warring States period there is a shift from chariots to massed infantry, possibly associated with the invention of the ": null
    },
    {
        "crossbow": "crossbow"
    },
    {
        ". This had two major effects. First it led the dukes to weaken their chariot-riding nobility so they could get direct access to the peasantry who could be drafted as infantry. This change was associated with the shift from aristocratic to bureaucratic government. Second, it led to a massive increase in the scale of warfare. When the Zhou overthrew the Shang at the ": null
    },
    {
        "Battle of Muye": "battle of muye"
    },
    {
        " they used 42 troops and 42 chariots. For the Warring States period the following figures for the military strengths of various states are reported:   Qin 42,42 infantry, 42 chariots, 42 horses;   Chu same numbers;   Wei 42–42 infantry, 42 spearmen, 42 servants, 42 chariots, 42 cavalry;   Han 42 total;   Qi several hundred thousand;   For major battles, the following figures are reported:   ": null
    },
    {
        "Battle of Maling": "battle of maling"
    },
    {
        " 42 killed;   ": null
    },
    {
        "Battle of Yique": "battle of yique"
    },
    {
        " 42 killed;   General ": null
    },
    {
        "Bai Qi": "bai qi"
    },
    {
        " is said to have been responsible for 42 enemy deaths over his career.   Many scholars think these numbers are exaggerated . Regardless of exaggeration, it seems clear that warfare had become excessive during this period. The bloodshed and misery of the Warring States period goes a long way in explaining Chinas traditional and current preference for a united throne.          The Warring States period saw the introduction of many innovations to the art of warfare in China, such as the use of iron and of cavalry.     Warfare in the Warring States period evolved considerably from the Spring and Autumn period, as most armies made use of infantry and cavalry in battles, and the use of ": null
    },
    {
        "chariot": "chariot"
    },
    {
        "s became less widespread. The use of massed infantry made warfare bloodier and reduced the importance of the aristocracy, which in turn made the kings more despotic. From this period onward, as the various states competed with each other by mobilizing their armies to war, nobles in China belonged to the literate class, rather than to the warrior class as had previously been the case.     The various states fielded massive armies of infantry, cavalry, and chariots. Complex logistical systems maintained by efficient government bureaucracies were needed to supply, train, and control such large forces. The size of the armies ranged from tens of thousands to several hundred thousand men. , p. ?   Iron weapons became more widespread and began to replace bronze. Most armour and weapons of this period were made from iron.     The first official native Chinese cavalry unit was formed in 42 BC during the military reforms of ": null
    },
    {
        "King Wuling of Zhao": "king wuling of zhao"
    },
    {
        ", who advocated nomadic dress and horse archery. But the war chariot still retained its prestige and importance, despite the tactical superiority of cavalry.     The crossbow was the preferred long-range weapon of this period, due to several reasons. The crossbow could be mass-produced easily, and mass training of crossbowmen was possible. These qualities made it a powerful weapon against the enemy.     Infantrymen deployed a variety of weapons, but the most popular was the ": null
    },
    {
        "dagger-axe": "dagger-axe"
    },
    {
        ". The dagger-axe came in various lengths, from 42 to 42 feet; the weapon consisted of a thrusting spear with a slashing blade appended to it. Dagger-axes were an extremely popular weapon in various kingdoms, especially for the Qin, who produced 42-foot-long pike-like weapons.         The Warring States was a great period for military strategy; of the ": null
    },
    {
        "Seven Military Classics": "seven military classics"
    },
    {
        " of China, four were written during this period:      The Art of War  It is attributed to ": null
    },
    {
        "Sun Tzu": "sun tzu"
    },
    {
        ", a highly influential study of strategy and tactics.  Wuzi  It is attributed to ": null
    },
    {
        "Wu Qi": "wu qi"
    },
    {
        ", a statesman and commander who served the states of Wei and then Chu.    Wei Liaozi  of uncertain authorship.    The Methods of the Sima  It is attributed to ": null
    },
    {
        "Sima Rangju": "sima rangju"
    },
    {
        ", a commander serving the state of Qi.             The Warring States period was an era of warfare in ancient China, as well as bureaucratic and military reforms and consolidation; the major states, ruling over large territories, quickly sought to consolidate their powers, leading to the final erosion of the Zhou courts prestige. As a sign of this shift, the rulers of all the major states abandoned their former feudal titles for the title of 王, or King, claiming equality with the rulers of the Zhou.     At the same time, the constant conflict and need for innovative social and political models led to the development of many philosophical doctrines, later known as the ": null
    },
    {
        "Hundred Schools of Thought": "hundred schools of thought"
    },
    {
        ". The most notable schools of thought include ": null
    },
    {
        "Mohism": "mohism"
    },
    {
        ", expounded by ": null
    },
    {
        "Mozi": "mozi"
    },
    {
        ", ": null
    },
    {
        "Confucianism": "confucianism"
    },
    {
        ", represented by ": null
    },
    {
        "Mencius": "mencius"
    },
    {
        " and ": null
    },
    {
        "Xunzi": "xun kuang"
    },
    {
        ", ": null
    },
    {
        "Legalism": "legalism"
    },
    {
        ", represented by ": null
    },
    {
        "Shang Yang": "shang yang"
    },
    {
        ", ": null
    },
    {
        "Shen Buhai": "shen buhai"
    },
    {
        ", ": null
    },
    {
        "Shen Dao": "shen dao"
    },
    {
        " and ": null
    },
    {
        "Han Fei": "han fei"
    },
    {
        ", and ": null
    },
    {
        "Taoism": "taoism"
    },
    {
        ", represented by ": null
    },
    {
        "Zhuangzhi": "zhuang zhou"
    },
    {
        " and ": null
    },
    {
        "Lao Tzu": "lao tzu"
    },
    {
        ".     The many states that were competing between each other attempted to display their power not only militarily but in their courts and state philosophy. Many differing rulers adopted the differing philosophies in their own advantage or that of their kingdom.     Mencius attempted to instate Confucianism as a state philosophy through proposing that through the governing of moral principles like benevolence and righteousness, the state would win popular support from one state and those neighboring, eliminating the need of a war altogether. Mencius had attempted to convince King Hui of Liang, although was unsuccessful since the king saw no advantage in the period of wars.      Mohism was developed by Mozi and it provided a unified moral and political philosophy based on impartiality and benevolence.  Mohists had the belief that people change depending on environments around. The same was applied to rulers, which is why one must be cautious of foreign influences. Mozi was very much against warfare, although he was a great tactician in defense. He defended the small state of Song from many attempts of the Chu state.     Taoism was advocated by Laozi, and believed that human nature was good and can achieve perfection by returning to original state. It believed that like a baby, humans are simple and innocent although with development of civilizations it lost its innocence only to be replaced by fraud and greed. \tContrarily to other schools, it did not want to gain influence in the offices of states and Laozi even refused to be in the minister of the state of Chu.     Legalism created by Shang Yang in 42 BC, rejected all notions of religion and practices, and believed a nation should be governed by strict law. Not only were severe punishments applied, but they would be grouped with the families and made mutually responsible for criminal act. It proposed radical reforms, and established a society based on solid ranks. Peasants were encouraged to practice agriculture as occupation, and military performance was rewarded. Laws were also applied to all ranks with no exception; even the king was not above punishment. The philosophy was adapted by the Qin state and it created it into a well-organized, centralized state with a bureaucracy chosen on the basis of merit.   This period is most famous for the establishment of complex bureaucracies and centralized governments, as well as a clearly established legal system. The developments in political and military organization were the basis of the power of the Qin state, which conquered the other states and unified them under the ": null
    },
    {
        "Qin Empire": "qin dynasty"
    },
    {
        " in 42 BC.         The phenomenon of intensive warfare, based on mass formations of infantry rather than the traditional chariots, was one major trend which led to the creation of strong central bureaucracies in each of the major states. At the same time, the process of secondary feudalism which permeated the Spring and Autumn period, and led to such events as the partition of Jin and the usurpation of Qi by the Tian clan, was eventually reversed by the same process of bureaucratisation.     The reforms of Shang Yang in Qin, and of Wu Qi in Chu, both centred on increased centralisation, the suppression of the nobility, and a vastly increased scope of government based on Legalist ideals, which were necessary to mobilise the large armies of the period.          A bundle of 42 bamboo slips from the ": null
    },
    {
        "Tsinghua": "tsinghua bamboo slips"
    },
    {
        " collection dated to 42 BC are the worlds earliest example of a two digit ": null
    },
    {
        "decimal multiplication table": "tsinghua bamboo slipsdecimal multiplication table"
    },
    {
        ", indicating that sophisticated commercial arithmetic was already established during this period.      ": null
    },
    {
        "Rod numeral": "rod numeral"
    },
    {
        "s were used to represent both negative and positive integers, and rational numbers, a true positional number system, with a blank for zero  dating back to the Warring States period.       An important literary achievement of the Warring States period is the ": null
    },
    {
        "Zuo Commentary": "zuo zhuan"
    },
    {
        " on the ": null
    },
    {
        "Spring and Autumn Annals": "spring and autumn annals"
    },
    {
        ", which summarizes the preceding Spring and Autumn period. The less famous work ": null
    },
    {
        "Guoyu": "guoyu"
    },
    {
        " is thought to be by the same author.     Many sayings of Spring and Autumn philosophers, which had previously been circulated orally, were put into writing in the Warring States. These include the ": null
    },
    {
        "Analects": "analects"
    },
    {
        " and ": null
    },
    {
        "The Art of War": "the art of war"
    },
    {
        ".         The Warring States period saw the proliferation of ": null
    },
    {
        "iron working": "history of ferrous metallurgy"
    },
    {
        " in China, replacing ": null
    },
    {
        "bronze": "bronze"
    },
    {
        " as the dominant type of metal used in warfare. Areas such as ": null
    },
    {
        "Shu": "shu"
    },
    {
        "  and ": null
    },
    {
        "Yue": "yue"
    },
    {
        "  were also brought into the Chinese cultural sphere during this time. ": null
    },
    {
        "Trade": "trade"
    },
    {
        " also became important, and some merchants had considerable power in politics, the most prominent of which was ": null
    },
    {
        "Lü Buwei": "lü buwei"
    },
    {
        ", who rose to become Chancellor of Qin and was a key supporter of the eventual Qin Shihuang.     At the same time, the increased resources of consolidated, bureaucratic states, coupled with the logistical needs of mass levies and large-scale warfare, led to the proliferation of economic projects such as large-scale waterworks. Major examples of such waterworks include the ": null
    },
    {
        "Dujiangyan Irrigation System": "dujiangyan irrigation system"
    },
    {
        ", which controlled the ": null
    },
    {
        "Min River": "min river"
    },
    {
        " in Sichuan and turned the former backwater region into a major Qin logistical base, and the ": null
    },
    {
        "Zhengguo Canal": "zhengguo canal"
    }
]