[
    {
        "     The Warsaw Ghetto  was the largest of all the ": null
    },
    {
        "Jewish": "jews"
    },
    {
        " ghettos in German-occupied Europe": "nazi ghettos"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". It was established by the ": null
    },
    {
        "German": "nazi germany"
    },
    {
        " authorities in November 42; within the new ": null
    },
    {
        "General Government": "general government"
    },
    {
        " territory of ": null
    },
    {
        "German-occupied Poland": "occupation of poland"
    },
    {
        ". Over 42 Jews were imprisoned there, in an area of , with an average of 42 persons per room, barely subsisting on meager food rations. From the Warsaw Ghetto, Jews were deported to ": null
    },
    {
        "Nazi concentration camps": "nazi concentration camps"
    },
    {
        " and mass-killing centers. In the summer of 42 at least 42 Ghetto residents were sent to the ": null
    },
    {
        "Treblinka extermination camp": "treblinka extermination camp"
    },
    {
        " during  under the guise of ": null
    },
    {
        "resettlement": "world war ii evacuation and expulsion"
    },
    {
        " in the East over the course of the summer. The ghetto was demolished by the Germans in May 42 after the ": null
    },
    {
        "Warsaw Ghetto Uprising": "warsaw ghetto uprising"
    },
    {
        "s which had temporarily halted the deportations. The total death toll among the Jewish inhabitants of the Ghetto is estimated to be at least 42 killed by bullet or gas, combined with 42 victims of rampant hunger and hunger-related diseases, the Warsaw Ghetto Uprising, and the casualties of the final destruction of the Ghetto.       Before ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", the majority of ": null
    },
    {
        "Polish Jews": "polish jews"
    },
    {
        " lived in the merchant districts of ": null
    },
    {
        "Muranów": "muranów"
    },
    {
        ", ": null
    },
    {
        "Powązki": "wola"
    },
    {
        ", and ": null
    },
    {
        "Stara Praga": "praga"
    },
    {
        ", while most ethnic ": null
    },
    {
        "Germans": "germans"
    },
    {
        " lived in ": null
    },
    {
        "Śródmieście": "śródmieście, warsaw"
    },
    {
        ". Over 42% of ": null
    },
    {
        "Catholics": "catholic church in poland"
    },
    {
        " lived further away from the commercial center. The Jewish community was the most prominent there, constituting over 42% of the inhabitants of Muranów; with the total of about 42% of the population of the left-bank and 42% of the right-bank Warsaw, or 42 people in total ": null
    },
    {
        "according to 42 census": "polish census of 1931"
    },
    {
        ". Many Jews left the city during ": null
    },
    {
        "the depression": "great depression"
    },
    {
        ". Antisemitic legislation, boycotts of Jewish businesses, and the post-Piłsudski Polish government plans put pressure on Jews in the city. In 42 the Jewish population of the Polish capital was estimated at 42 people.     The ": null
    },
    {
        "Siege of Warsaw": "siege of warsaw"
    },
    {
        " continued until September 42 42 On September 42 alone, the ": null
    },
    {
        "Luftwaffe": "luftwaffe"
    },
    {
        " conducted 42 ": null
    },
    {
        "bombing raids on the city": "bombing of warsaw in world war ii"
    },
    {
        "; three days later, 42 German planes attacked the city centre, targeting specifically ": null
    },
    {
        "Wola": "wola"
    },
    {
        " and ": null
    },
    {
        "Żoliborz": "żoliborz"
    },
    {
        ". In total, some 42 people were killed, and 42 percent of the city was destroyed. Along with the advancing ": null
    },
    {
        "Wehrmacht": "wehrmacht"
    },
    {
        ", the  Einsatzgruppe  EG IV and the ": null
    },
    {
        "Einsatzkommando": "einsatzkommando"
    },
    {
        "s rolled into town. On November 42 42 the  Reichsführer-SS  reorganized them into local ": null
    },
    {
        "security service": "sicherheitsdienst"
    },
    {
        " . Meanwhile, the German ": null
    },
    {
        "fifth column": "fifth column"
    },
    {
        " members of ": null
    },
    {
        "Selbstschutz": "selbstschutzworld war ii"
    },
    {
        " were released immediately. The commander of EG IV,  SS-Standartenführer  ": null
    },
    {
        "Josef Meisinger": "josef meisinger"
    },
    {
        " , was appointed chief of police for the newly formed  Distrikt Warschau . After the takeover of Warsaw, the German authorities began the registration of the ethnic Germans who were issued the  Kennkarte  separate from the rest of the locals. By June 42 there were 42  Reichsdeutsche  and 42  Volksdeutsche  registered in Warsaw. In the next two years their number more than doubled, on top of over 42 German military personnel.                   By the end of the ": null
    },
    {
        "September campaign": "september campaign"
    },
    {
        " the number of Jews in and around the capital increased dramatically with thousands of refugees escaping ": null
    },
    {
        "the Polish-German front": "battle of the border"
    },
    {
        ", often on foot. In less than a year, the number of refugees in Warsaw exceeded 42. On October 42 42 the ": null
    },
    {
        "General Government": "general government"
    },
    {
        " was established by Adolf Hitler in the occupied area of central Poland. The Nazi-appointed Jewish Council  in Warsaw, a committee of 42 people headed by ": null
    },
    {
        "Adam Czerniaków": "adam czerniaków"
    },
    {
        ", was responsible for carrying out German orders. On October 42 the Jews were mobilized as forced laborers to clear bomb damage and perform other hard labor. One month later, on November 42 the bank accounts of Polish Jews and any deposits exceeding 42 ": null
    },
    {
        "zł": "polish złoty"
    },
    {
        " were blocked. On November 42 all Jewish establishments were ordered to display a ": null
    },
    {
        "Jewish star": "jewish star"
    },
    {
        " on doors and windows. Beginning December 42 all Jews older than ten were compelled to wear ": null
    },
    {
        "a white armband": "yellow badge"
    },
    {
        ", and on December 42 they were forbidden from using public transit. On January 42 42 the Jews were banned from holding ": null
    },
    {
        "communal prayers": "jewish prayer"
    },
    {
        " due to the risk of spreading epidemics. Food stamps were introduced by the German authorities, and measures were stepped up to liquidate all Jewish communities in the vicinity of Warsaw intensified. The Jewish population of the capital reached 42 before the end of the year.        On the orders of Warsaw District Governor, ": null
    },
    {
        "Ludwig Fischer": "ludwig fischer"
    },
    {
        ", the Ghetto wall construction started on April 42 42 circling the area of Warsaw inhabited predominantly by Jews. The work was supervised by the Warsaw Judenrat. The Nazi authorities expelled 42 ethnic Poles from the neighbourhood, and ordered the relocation of 42 Warsaw Jews from the suburbs into the city centre. On October 42 42 the creation of the ghetto covering the area of  was announced by the German ": null
    },
    {
        "Governor-General": "general government"
    },
    {
        ", ": null
    },
    {
        "Hans Frank": "hans frank"
    },
    {
        ". The population of the ghetto was 42 initially. Before ": null
    },
    {
        "the Holocaust": "the holocaust"
    },
    {
        " began the number of Jews imprisoned there was between 42 and 42 . The area of the ghetto constituted only about 42% of the overall metropolitan area.         The Germans closed the Warsaw Ghetto to the outside world on November 42 42 The wall around it was  high and topped with ": null
    },
    {
        "barbed wire": "barbed wire"
    },
    {
        ". Escapees were shot on sight. German policemen from ": null
    },
    {
        "Battalion 42": "order police battalions"
    },
    {
        " used to hold victory parties on the days when a large number of prisoners were shot at the ghetto fence. Browning 42 p. 42 The borders of the ghetto changed and its overall area was gradually reduced, as the captive population was decreased by outbreaks of infectious diseases, mass hunger, and regular executions.     The ghetto was divided in two along Chłodna Street  , which was excluded from it, due to its local importance at that time .  The area south-east of Chłodna was known as the Small Ghetto , while the area north of it became known as the Large Ghetto . The two zones were connected at an intersection of Chłodna with Żelazna Street, where a special gate was built. In January 42 the gate was removed and a wooden footbridge was built over it, which became one of the postwar symbols of ": null
    },
    {
        "the Holocaust in occupied Poland": "the holocaust in occupied poland"
    },
    {
        ". John D Clare ,  Modern World History Topics.             The first commissioner of the Warsaw Ghetto, appointed by Fischer, was SA-Standartenführer ": null
    },
    {
        "Waldemar Schön": "waldemar schön"
    },
    {
        ", who also supervised the initial Jewish relocations in 42 He was an attritionist best known for orchestrating an artificial famine  in January 42 Schön had eliminated virtually all food supplies to the ghetto causing an uproar among the SS upper echelon. He was relieved of his duties by Frank himself in March 42 and replaced by Kommissar ": null
    },
    {
        "Heinz Auerswald": "heinz auerswald"
    },
    {
        ", a productionist who served until November 42 Like in all ": null
    },
    {
        "Nazi ghetto": "nazi ghetto"
    },
    {
        "s across ": null
    },
    {
        "occupied Poland": "occupied poland"
    },
    {
        ", the Germans ascribed the internal administration to a ": null
    },
    {
        "Judenrat": "judenrat"
    },
    {
        " Council of the Jews, led by an  . In Warsaw, this role was relegated to ": null
    },
    {
        "Adam Czerniaków": "adam czerniaków"
    },
    {
        ", who chose a policy of collaboration with the Nazis in the hope of saving lives. Adam Czerniaków confided his harrowing experience in nine diaries. In July 42 when the Germans ordered him to increase the contingent of people to be deported, he committed ": null
    },
    {
        "suicide": "suicide"
    },
    {
        ".      Czerniakóws collaboration with the German occupation policies was a paradigm for attitude of the majority of European Jews vis à vis Nazism. Although his personality as president of the Warsaw Judenrat may not become as infamous as ": null
    },
    {
        "Chaim Rumkowski": "chaim rumkowski"
    },
    {
        ", Ältester of the ": null
    },
    {
        "Łódź Ghetto": "łódź ghetto"
    },
    {
        "; the SS policies he had followed were systematically anti-Jewish.          The Council of Elders was supported internally by the ": null
    },
    {
        "Jewish Ghetto Police": "jewish ghetto police"
    },
    {
        " , formed at the end of September 42 with 42 men, instrumental in enforcing law and order as well as carrying out German ad-hoc regulations, especially after 42 when the number of refugees and expellees in Warsaw reached 42 or nearly one third of the entire Jewish population of the capital.       In January 42 there were 42 Catholics and 42 individuals of other Christian faith imprisoned in the Ghetto, including Jewish converts. It is estimated that at the time of closure of the ghetto there were around 42 Christians, and number possibly rose eventually to over 42. Many of these people considered themselves Polish, but due to Nazi racial criteria they were classified by German authorities as Jewish. Karol Madaj – Duszpasterstwo Żydów-katolików w getcie warszawskim Biuletyn IPN nr 42 / 42 page 4242 Christians in the Warsaw ghetto: an epitaph for the unremembered   Peter Florian Dembowski - 42 Within the ghetto there were three Christian churches, the ": null
    },
    {
        "All Saints Church": "all saints church, warsaw"
    },
    {
        ", ": null
    },
    {
        "St. Augustines Church": "st. augustines church in warsaw"
    },
    {
        " and the ": null
    },
    {
        "Church of the Nativity of the Blessed Virgin Mary": "church of the nativity of the blessed virgin mary, warsaw"
    },
    {
        ". All Saints Church served Jewish Christians who were detained in the ghetto. At that time, the parish priest, Marceli Godlewski, known for his antisemitism before the war, became involved in helping them. At the rectory of the parish, the priest sheltered and helped many escape, including ": null
    },
    {
        "Ludwik Hirszfeld": "ludwik hirszfeld"
    },
    {
        ", ": null
    },
    {
        "Louis-Christophe Zaleski-Zamenhof": "louis-christophe zaleski-zamenhof"
    },
    {
        " and Wanda Zamenhof-Zaleska. For his actions in 42 he was posthumously awarded the ": null
    },
    {
        "Righteous Among the Nations": "righteous among the nations"
    },
    {
        " medal. , Cornell University Press, edited by Robert Blobaum, chapter by Dariusz Libionka, 42 page 42       German authorities officially sanctioned an organized religious life, however, repressions toward the Jewish community differed significantly from that of other religious denominations. From the beginning of the war violence against Jews was prevalent and had all the signs of religious persecution. A great number of Jews were imprisoned in the Warsaw Ghetto and various ": null
    },
    {
        "anti-semitic": "anti-semitic stereotypes"
    },
    {
        " threats were imposed on them. Numerous regulations and orders were enacted by German authorities. These included a ban on ritual slaughter, destruction of synagogues, and the profanation of the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " and sacred objects. Accounts like these have made religious activities for Jews difficult to continue because it attacked the very basis of their religious observances. Ritual slaughter is an integral part of ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        " and with German decrees, it made ": null
    },
    {
        "kosher": "kosher foods"
    },
    {
        " type foods very difficult to obtain. In addition, in the early 42s bans on communal meetings in synagogues were introduced –– causing schooling, prayers, ritual baths and study of the Torah to be held in small, secretive forums numerous times throughout the week, out of fear and the threats of Nazi jurisdictions. Additionally, during religious holidays that Jews observed, constant accounts of torture and humiliation would reach its peak where public executions of quorums would occasionally occur.                  Nazi officials, intent on eradicating the ghetto by hunger and disease, limited food and medical supplies.  An average daily food ration in 42 for Jews in Warsaw was limited to 42 calories, compared to 42 calories allowed for ": null
    },
    {
        "gentile": "gentile"
    },
    {
        " Poles and 42 calories for the Germans.  In August, the rations fell to 42 calories per person. This meager food supply by the German authorities usually consisted of dry bread, flour and potatoes of the lowest quality, groats, turnips, and a small monthly supplement of margarine, sugar, and meat. As a result, ": null
    },
    {
        "black market": "black market"
    },
    {
        " economy thrived, supplying as much as 42% of the ghettos food. In addition, the ": null
    },
    {
        "Joint": "american jewish joint distribution committee"
    },
    {
        " had opened over 42 ": null
    },
    {
        "soup kitchen": "soup kitchen"
    },
    {
        "s,  which served at one time as many as 42 meals per day.     Men, women and children all took part in smuggling and illegal trade, and private workshops were created to manufacture goods to be sold secretly on the Aryan side of the city. Foodstuffs were often smuggled by children alone, who crossed the Ghetto wall by the hundreds in any way possible, sometimes several times a day, returning with goods that could weigh as much as they did. Unemployment leading to extreme poverty was a major problem in the ghetto, and smuggling was often the only source of subsistence for the Ghetto inhabitants, who would have otherwise died of starvation. Professional smugglers, in contrast, often became relatively wealthy.     During the first year and a half, thousands of ": null
    },
    {
        "Polish Jews": "polish jews"
    },
    {
        " as well as some ": null
    },
    {
        "Romani people": "romani people"
    },
    {
        " from smaller towns and the countryside were brought into the Ghetto, but as many died from ": null
    },
    {
        "typhus": "typhus"
    },
    {
        " and starvation the overall number of inhabitants stayed about the same. Facing an out-of-control famine and meager medical supplies, a group of Jewish doctors imprisoned in the ghetto decided to use the opportunity to study the physiological and psychological effects of hunger.   The ": null
    },
    {
        "Warsaw Ghetto Hunger Study": "warsaw ghetto hunger study"
    },
    {
        ",  as it is now known, remains one of the most thorough investigations of semi-starvation done to date.       Despite grave hardships, life in the Warsaw Ghetto had educational and cultural activities, both legal and those conducted by its underground organizations. Hospitals, public soup kitchens, orphanages, refugee centers and recreation facilities were formed, as well as a school system. Some schools were illegal and operated under the guise of soup kitchens. There were secret libraries, classes for the children and even a symphony orchestra. Rabbi ": null
    },
    {
        "Alexander Friedman": "alexander zusia friedman"
    },
    {
        ", secretary-general of ": null
    },
    {
        "Agudath Israel": "world agudath israel"
    },
    {
        " of Poland, was one of the Torah leaders in the Warsaw Ghetto; he organized an underground network of religious schools, including a Yesodei HaTorah school for boys, a ": null
    },
    {
        "Bais Yaakov": "bais yaakov"
    },
    {
        " school for girls, a school for elementary Jewish instruction, and three institutions for advanced Jewish studies . These schools, operating under the guise of kindergartens, medical centers and soup kitchens, were a place of refuge for thousands of children and teens, and hundreds of teachers. In 42 when the Germans gave official permission to the local ": null
    },
    {
        "Judenrat": "judenrat"
    },
    {
        " to open schools, these schools came out of hiding and began receiving financial support from the official Jewish community. Seidman, Hillel. Alexander Zusia Friedman , in Wellsprings of Torah: An Anthology of Biblical Commentaries, Vol. 42 Nison L. Alpert, ed. The Judaica Press, Inc., 42 pp. xii–xxiii. Former cinema Femina became a theater in this period.  The Jewish Symphonic Orchestra performed in several venues, including Femina.      ": null
    },
    {
        "Israel Gutman": "israel gutman"
    },
    {
        " estimates that around 42 prisoners remained at the top of Ghetto society, either because they were wealthy before the war, or because they were able to amass wealth during it . Those families and individuals frequented restaurants, clubs and cafes, showing in stark contrast the economic inequalities of ghetto life.  ": null
    },
    {
        "Tilar Mazzeo": "tilar mazzeo"
    },
    {
        " estimates that group at around 42 people - rich industrialists, many Judenrat council leaders, Jewish police officers, profiteering smugglers, nightclub owners high-end prostitutes who were spending their time at over sixty cafes and nightclubs, dancing among the corpses.           Not long after the Ghetto was closed off from the outside world, a number of German ": null
    },
    {
        "war profiteers": "war profiteering"
    },
    {
        " such as ": null
    },
    {
        "Többens and Schultz": "többens and schultz"
    },
    {
        " appeared in the capital. At first, they acted as middlemen between the high command and the Jewish-run workshops. By spring 42 the Stickerei Abteilung Division with headquarters at Nowolipie 42 Street had already employed 42 workers making shoes, leather products, sweaters and socks for the ": null
    },
    {
        "Wehrmacht": "wehrmacht"
    },
    {
        ". Other divisions were making furs and wool sweaters also, guarded by the Werkschutz police. Some 42 Jews were working in the Ghetto for Walter C. Többens from Hamburg, a convicted war criminal, including at his factories on Prosta and Leszno Streets among other locations. His Jewish labour exploitation was a source of envy for other Ghetto inmates living in fear of deportations. In early 42 Többens gained for himself the appointment of a Jewish deportation commissar of Warsaw in order to keep his own workforce secure, and maximize profits. In May 42 Többens transferred his businesses, including 42 ": null
    },
    {
        "Jewish slave workers": "forced labour under german rule during world war ii"
    },
    {
        " to the ": null
    },
    {
        "Poniatowa concentration camp": "poniatowa concentration camp"
    },
    {
        " barracks. Fritz Schultz took his manufacture along with 42 Jews to the nearby ": null
    },
    {
        "Trawniki concentration camp": "trawniki concentration camp"
    },
    {
        ".                  Approximately 42 Ghetto inmates had already died of hunger-related diseases and starvation before the mass deportations started in the summer of 42 Earlier that year, during the ": null
    },
    {
        "Wannsee Conference": "wannsee conference"
    },
    {
        " near Berlin, the ": null
    },
    {
        "Final Solution": "final solution"
    },
    {
        " was set in motion. It was a secretive plan to mass-murder Jewish inhabitants of the General Government. The techniques used to deceive victims were based upon experience gained at the ": null
    },
    {
        "Chełmno extermination camp": "chełmno extermination camp"
    },
    {
        " . The ": null
    },
    {
        "ghettoised Jews": "jewish ghettos in german-occupied poland"
    },
    {
        " were rounded up, street by street, under the guise of ": null
    },
    {
        "resettlement": "world war ii evacuation and expulsion"
    },
    {
        " , and marched to the  Umschlagplatz  holding area. From there, they were sent aboard ": null
    },
    {
        "Holocaust train": "holocaust train"
    },
    {
        "s to the ": null
    },
    {
        "Treblinka death camp": "treblinka death camp"
    },
    {
        ", built in a forest  northeast of Warsaw. The operation was headed by the German Resettlement Commissioner,  SS - Sturmbannführer  ": null
    },
    {
        "Hermann Höfle": "hermann höfle"
    },
    {
        ", on behalf of ": null
    },
    {
        "Sammern-Frankenegg": "ferdinand von sammern-frankenegg"
    },
    {
        ". Upon learning of this plan, ": null
    },
    {
        "Adam Czerniaków": "adam czerniaków"
    },
    {
        ", leader of the Judenrat Council committed suicide. He was replaced by Marc Lichtenbaum, tasked with managing roundups with the aid of Jewish Ghetto Police. No-one was informed about the real state of affairs.     The extermination of Jews by means of poisonous gases was carried out at ": null
    },
    {
        "Treblinka II": "treblinka ii"
    },
    {
        " under the auspices of ": null
    },
    {
        "Operation Reinhard": "operation reinhard"
    },
    {
        ", which also included ": null
    },
    {
        "Bełżec": "bełżec extermination camp"
    },
    {
        ", ": null
    },
    {
        "Majdanek": "majdanek concentration camp"
    },
    {
        ", and ": null
    },
    {
        "Sobibór": "sobibór extermination camp"
    },
    {
        " death camps. About 42 Warsaw Ghetto inmates were sent to Treblinka during the  Grossaktion Warschau , and murdered there between  Tisha BAv  and  Yom Kippur  of 42 The ratio between Jews killed on the spot by ": null
    },
    {
        "Orpo": "orpo battalions"
    },
    {
        " and ": null
    },
    {
        "Sipo": "sicherheitspolizei"
    },
    {
        " during roundups, and those deported was approximately 42 percent.     For eight weeks, the deportations of Jews from Warsaw to Treblinka continued on a daily basis via two shuttle trains: each transport carrying about 42 to 42 people crying for water; 42 people to a cattle truck. The first daily trains rolled into the camp early in the morning often after an overnight wait at a layover yard; and the second, in mid-afternoon. Dr ": null
    },
    {
        "Janusz Korczak": "janusz korczak"
    },
    {
        ", a famed educator, went to Treblinka with his orphanage children in August 42 He was offered a chance to escape by Polish friends and admirers, but he chose instead to share the fate of his lifes work. All new arrivals were sent immediately to the undressing area by the  Sonderkommando  squad that managed the arrival platform, and from there to the gas chambers. The stripped victims were suffocated to death in batches of 42 with the use of monoxide gas. In September 42 new gas chambers were built, which could kill as many as 42 people in just 42 hours. Civilians were forbidden to approach the camp area. In the last two weeks of  Großaktion Warschau  ending on September 42 42 some 42 Warsaw Jews are deported to their deaths. The last transport with 42 victims from the Polish capital included the Jewish police involved with deportations, and their families. In October 42 the ": null
    },
    {
        "Jewish Combat Organization": "jewish combat organization"
    },
    {
        " was formed and tasked with opposing further deportations. It was led by 42 year–old ": null
    },
    {
        "Mordechai Anielewicz": "mordechai anielewicz"
    },
    {
        ". Meanwhile, between October 42 and March 42 Treblinka received transports of almost 42 foreign Jews from the German ": null
    },
    {
        "Protectorate of Bohemia and Moravia": "protectorate of bohemia and moravia"
    },
    {
        " via ": null
    },
    {
        "Theresienstadt": "theresienstadt"
    },
    {
        ", and from Bulgarian-occupied ": null
    },
    {
        "Thrace": "thrace"
    },
    {
        ", Macedonia, and ": null
    },
    {
        "Pirot": "pirot"
    },
    {
        " following an agreement with the Nazi-allied Bulgarian government.     By the end of 42 it was clear that the deportations were to their deaths. The underground activity of Ghetto resistors in the group  Oyneg Shabbos  increased after learning that the transports for resettlement led to the mass killings. Also in 42 ": null
    },
    {
        "Polish resistance": "polish resistance movement in world war ii"
    },
    {
        " officer ": null
    },
    {
        "Jan Karski": "jan karski"
    },
    {
        " reported to the Western governments on the situation in the Ghetto and on the extermination camps. Many of the remaining Jews decided to resist further deportations, and began to smuggle in weapons, ammunition and supplies.             On January 42 42 after almost four months without deportations, the Germans suddenly entered the Warsaw Ghetto intent upon further roundups. Within hours, some 42 Jews were shot and 42 others removed from their residences. The Germans expected no resistance, but the action was brought to a halt by hundreds of insurgents armed with handguns and Molotov cocktails.     Preparations to resist had been going on since the previous autumn. The first instance of Jewish armed struggle in Warsaw had begun. The underground fighters from ": null
    },
    {
        "ŻOB": "żydowska organizacja bojowa"
    },
    {
        "  and ": null
    },
    {
        "ŻZW": "żydowski związek wojskowy"
    },
    {
        "  achieved considerable success initially, taking control of the Ghetto. They then barricaded themselves in the bunkers and built dozens of fighting posts, stopping the expulsions. Taking further steps, a number of Jewish collaborators from ": null
    },
    {
        "Żagiew": "żagiew"
    },
    {
        " were also executed. An offensive against the Ghetto underground launched by Von Sammern-Frankenegg was unsuccessful. He was relieved of duty by Heinrich Himmler on April 42 42 and court-martialed. Jewish Virtual Library,  Source: Danny Dor , Brave and Desperate. Israel Ghetto Fighters, 42 p. 42              The final battle started on the eve of ": null
    },
    {
        "Passover": "passover"
    },
    {
        " of April 42 42 when a Nazi force consisting of several thousand troops entered the ghetto. After initial setbacks, 42 ": null
    },
    {
        "Waffen-SS": "waffen-ss"
    },
    {
        " soldiers under the field command of ": null
    },
    {
        "Jürgen Stroop": "jürgen stroop"
    },
    {
        " systematically burned and blew up the ghetto buildings, block by block, rounding up or murdering anybody they could capture. Significant resistance ended on April 42 and the Nazi operation officially ended in mid-May, symbolically culminating with the demolition of the ": null
    },
    {
        "Great Synagogue of Warsaw": "great synagogue"
    },
    {
        " on May 42 According to the official report, at least 42 people were killed on the spot or deported to German Nazi concentration and death camps .  The site of the Ghetto became the ": null
    },
    {
        "Warsaw concentration camp": "warsaw concentration camp"
    },
    {
        ".       The ghetto was almost entirely leveled during the Uprising; however, a number of buildings and streets survived, mostly in the small ghetto area, which had been included into the Aryan part of the city in August 42 and was not involved in the fighting. In 42 and 42 ": null
    },
    {
        "Warsaw Ghetto boundary markers": "warsaw ghetto boundary markers"
    },
    {
        " were built along the borders of the former Jewish quarter, where from 42–42 stood the gates to the ghetto, wooden footbridges over Aryan streets, and the buildings important to the ghetto inmates. The four buildings at 42 42 42 and 42 ": null
    },
    {
        "Próżna Street": "próżna street"
    },
    {
        " are among the best known original residential buildings that in 42–42 housed Jewish families in the Warsaw Ghetto. They have largely remained empty since the war. The street is a focus of the annual Warsaw Jewish Festival. In 42–42 buildings at number 42 and 42 underwent extensive renovations and have become office space.       The ": null
    },
    {
        "Nożyk Synagogue": "nożyk synagogue"
    },
    {
        " also survived the war. It was used as a horse stable by the German Wehrmacht. The synagogue has today been restored and is once again used as an active synagogue. The best preserved ": null
    },
    {
        "fragments of the ghetto wall": "fragments of the ghetto walls in warsaw"
    },
    {
        " are located 42 Sienna Street, 42 Złota Street, and 42 Waliców Street . There are two ": null
    },
    {
        "Warsaw Ghetto Heroes monuments": "monument to the ghetto heroes"
    },
    {
        ", unveiled in 42 and 42 near the place where the German troops entered the ghetto on 42 April 42 In 42 a stone monument was built to mark the Umschlagplatz.     There is also a small memorial at ": null
    },
    {
        "ul. Mila 42": "miła 18"
    },
    {
        " to commemorate the site of the Socialist ŻOB underground headquarters during the Ghetto Uprising. In December 42 a controversial statue of a kneeling and praying ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " was installed in a courtyard of the Ghetto. The artwork by Italian artist, ": null
    },
    {
        "Maurizio Cattelan": "maurizio cattelan"
    },
    {
        ", entitled HIM , has received mixed reactions worldwide. Many feel that it is unnecessarily offensive, while others, such as Polands chief rabbi, ": null
    },
    {
        "Michael Schudrich": "michael schudrich"
    },
    {
        ", feel that is thought-provoking, even educational .  ": null
    },
    {
        "Ludwig Fischer": "ludwig fischer"
    },
    {
        " Heinz Auerswald": "heinz auerswald"
    },
    {
        " Świętokrzyska": "świętokrzyska street, warsaw"
    },
    {
        " seen from ": null
    },
    {
        "Marszałkowska Street": "marszałkowska street, warsaw"
    },
    {
        " Ghetto is burning": "warsaw ghetto uprising"
    },
    {
        ": the Germans march the Jews along Nowolipie Street, ": null
    },
    {
        "Stroop Report": "stroop report"
    },
    {
        " Warsaw Insurgents Cemetery": "warsaw insurgents cemetery"
    },
    {
        " of 42 Jews executed at ": null
    },
    {
        "RKS Skra Stadium": "rks skra stadium"
    },
    {
        " Warsaw Ghetto Heroes monument": "monument to the ghetto heroes"
    },
    {
        " Miła 42": "miła 18"
    },
    {
        " Warsaw Ghetto boundary markers": "warsaw ghetto boundary markers"
    },
    {
        "            Tosia Altman": "tosia altman"
    },
    {
        " – ghetto resistance fighter, escaped the Ghetto in 42 uprising through the sewers. Died after she was caught by the ": null
    },
    {
        "Gestapo": "gestapo"
    },
    {
        " when the celluloid factory where she hid caught fire.   ": null
    },
    {
        "Mordechai Anielewicz": "mordechai anielewicz"
    },
    {
        " – ghetto resistance leader in the ŻOB . Died with many of his comrades at ": null
    },
    {
        "their surrounded command post": "miła 18"
    },
    {
        ".   ": null
    },
    {
        "Dawid Moryc Apfelbaum": "dawid moryc apfelbaum"
    },
    {
        " – ghetto resistance leader and commander of the ŻZW. Killed in action during the ghetto uprising.   ": null
    },
    {
        "Maria Ajzensztadt": "maria ajzensztadt"
    },
    {
        " – singer known as the Nightingale of the Ghetto ": null
    },
    {
        "Adam Czerniaków": "adam czerniaków"
    },
    {
        " – engineer and senator, head of the Warsaw  Judenrat  . Committed suicide in 42   ": null
    },
    {
        "Paweł Finder": "paweł finder"
    },
    {
        "- First Secretary of the Polish Workers Party from 42 to 42; killed by Germans in Warsaw Ruins 42   ": null
    },
    {
        "Mira Fuchrer": "mira fuchrer"
    },
    {
        " – ghetto resistance fighter in the ZOB. Died with many of her comrades at ": null
    },
    {
        "their surrounded command post": "miła 18"
    },
    {
        ".   ": null
    },
    {
        "Yitzhak Gitterman": "yitzhak gitterman"
    },
    {
        " – director of the ": null
    },
    {
        "American Jewish Joint Distribution Committee": "american jewish joint distribution committee"
    },
    {
        " in Poland, resistance fighter. Killed in action during the ghetto uprising.   ": null
    },
    {
        "Itzhak Katzenelson": "itzhak katzenelson"
    },
    {
        " – teacher, poet, dramatist and resistance fighter. Executed at Auschwitz-Birkenau in 42   ": null
    },
    {
        "Janusz Korczak": "janusz korczak"
    },
    {
        " – childrens author, pediatrician, child pedagogist and orphanage owner. Executed along with his orphans at Treblinka in August, 42 after refusing an offer to leave his orphans and escape.   ": null
    },
    {
        "Simon Pullman": "simon pullman"
    },
    {
        " – conductor of the Warsaw Ghetto symphony orchestra. Executed at Treblinka in 42   ": null
    },
    {
        "Emanuel Ringelblum": "emanuel ringelblum"
    },
    {
        " – historian, politician and social worker, leader of the ": null
    },
    {
        "Ghetto chroniclers": "ringelblum archive"
    },
    {
        ". Discovered in Warsaw and executed together with his family in 42   ": null
    },
    {
        "Kalonymus Kalman Shapira": "kalonymus kalman shapira"
    },
    {
        " – grand rabbi of ": null
    },
    {
        "Piaseczno": "piaseczno"
    },
    {
        ". Executed at ": null
    },
    {
        "Trawniki": "trawniki"
    },
    {
        " during ": null
    },
    {
        "Aktion Erntefest": "aktion erntefest"
    },
    {
        " in 42   ": null
    },
    {
        "Władysław Szlengel": "władysław szlengel"
    },
    {
        " – poet of the Warsaw ghetto; killed in 42 uprising.   ": null
    },
    {
        "Lidia Zamenhof": "lidia zamenhof"
    },
    {
        " – ": null
    },
    {
        "Baháí": "baháí faith"
    },
    {
        "-": null
    },
    {
        "Esperantist": "esperanto"
    },
    {
        " daughter of Dr. ": null
    },
    {
        "L. L. Zamenhof": "l. l. zamenhof"
    },
    {
        ". Executed at Treblinka in 42   ": null
    },
    {
        "Nathalie Zand": "nathalie zand"
    },
    {
        " – Neurologist and research scientist. Practiced as a doctor within the ghetto. Thought to have been executed at ": null
    },
    {
        "Pawiak": "pawiak"
    },
    {
        " prison, September 42       ": null
    },
    {
        "Rokhl Auerbakh": "rokhl auerbakh"
    },
    {
        " – Polish Jewish writer and essayist; member of the Ghetto chroniclers group led by ": null
    },
    {
        "Emanuel Ringelblum": "emanuel ringelblum"
    },
    {
        ". Died in 42   ": null
    },
    {
        "Mary Berg": "mary berg"
    },
    {
        " – 42-year-old diarist born to American mother in ": null
    },
    {
        "Łódź": "łódź"
    },
    {
        "; ": null
    },
    {
        "Pawiak": "pawiak"
    },
    {
        " internee exchanged for German POWs in March 42 Died in 42   ": null
    },
    {
        "Adolf Berman": "adolf berman"
    },
    {
        " – leader in Jewish Underground in Warsaw; member of ": null
    },
    {
        "Zegota": "zegota"
    },
    {
        " and Centos – died in 42    ": null
    },
    {
        "Yitzhak Zuckerman": "yitzhak zuckerman"
    },
    {
        " – ghetto resistance leader , founder of the ": null
    },
    {
        "Lohamei HaGetaot": "lohamei hagetaot"
    },
    {
        " kibbutz in Israel. Died in 42   ": null
    },
    {
        "Marek Edelman": "marek edelman"
    },
    {
        " – Polish political and social activist, cardiologist. He was the last surviving leader of the ŻOB. Died in 42   Jack P. Eisner – author of The Survivor of the Holocaust . The young boy who hung the Jewish flag atop the burning building in the Warsaw Ghetto Uprising. ZZW fighter. Commemorator of the Holocaust. Died in 42   Ruben Feldschu – Zionist author and political activist Laurence Weinbaum, ,  Vol. 42 No. 4242 .   ": null
    },
    {
        "Joseph Friedenson": "joseph friedenson"
    },
    {
        " – editor of Dos Yiddishe Vort. Died in 42   ": null
    },
    {
        "Bronisław Geremek": "bronisław geremek"
    },
    {
        " – Polish social historian and politician. Died in 42   ": null
    },
    {
        "Martin Gray": "martin gray"
    },
    {
        " – ": null
    },
    {
        "Soviet secret police": "nkvd"
    },
    {
        " officer and American and French writer. Died in 42   ": null
    },
    {
        "Mietek Grocher": "mietek grocher"
    },
    {
        " – Swedish author and the Holocaust remembrance activist.   Alexander J. Groth – Professor of Political Science at the University of California, Davis. Author of Lincoln: Authoritarian Savior and Democracies Against Hitler: Myth, Reality and Prologue, Holocaust Voices, Accomplices: Roosevelt, Churchill and the Holocaust.   ": null
    },
    {
        "Ludwik Hirszfeld": "ludwik hirszfeld"
    },
    {
        " – Polish microbiologist and serologist, died in 42   ": null
    },
    {
        "Morton Kamien": "morton kamien"
    },
    {
        " – Polish-American economist, died in 42   ": null
    },
    {
        "Zivia Lubetkin": "zivia lubetkin"
    },
    {
        " – ghetto resistance leader, ": null
    },
    {
        "Aliyah Bet": "aliyah bet"
    },
    {
        " activist, later married Cukierman. Died in 42   ": null
    },
    {
        "Vladka Meed": "vladka meed"
    },
    {
        " – ghetto resistance member; author. Died in 42   ": null
    },
    {
        "Uri Orlev": "uri orlev"
    },
    {
        " – Israeli author of the semi-autobiographical novel  The Island on Bird Street  recounting his experiences in the Warsaw Ghetto.   ": null
    },
    {
        "Marcel Reich-Ranicki": "marcel reich-ranicki"
    },
    {
        " – German literary critic. Died in 42   ": null
    },
    {
        "Sol Rosenberg": "sol rosenberg"
    },
    {
        " – American steel industrialist and philanthropist. Died in 42   ": null
    },
    {
        "Simcha Rotem": "simcha rotem"
    },
    {
        " – ghetto resistance fighter , ": null
    },
    {
        "Berihah": "berihah"
    },
    {
        " activist, post-war Nazi hunter. Died in 42   ": null
    },
    {
        "Uri Shulevitz": "uri shulevitz"
    },
    {
        " – book illustrator   ": null
    },
    {
        "Władysław Szpilman": "władysław szpilman"
    },
    {
        " – Polish pianist, composer and writer, subject of the film ": null
    },
    {
        "The Pianist": "the pianist"
    },
    {
        " by ": null
    },
    {
        "Roman Polanski": "roman polanski"
    },
    {
        "  based on ": null
    },
    {
        "his memoir": "the pianist"
    },
    {
        ". Died in 42   ": null
    },
    {
        "Menachem Mendel Taub": "menachem mendel taub"
    },
    {
        " – ": null
    },
    {
        "Kaliv": "kaliv"
    },
    {
        "er rabbi in Israel.   ": null
    },
    {
        "Dawid Wdowiński": "dawid wdowiński"
    },
    {
        " – psychiatrist, political leader of the ": null
    },
    {
        "Irgun": "irgun"
    },
    {
        " in Poland, resistance leader of the ŻZW, American memoirist. Died in 42       ": null
    },
    {
        "Władysław Bartoszewski": "władysław bartoszewski"
    },
    {
        " – Polish resistance activist of the ": null
    },
    {
        "Żegota": "żegota"
    },
    {
        " organization in Warsaw.   ": null
    },
    {
        "Henryk Iwański": "henryk iwański"
    },
    {
        " – Polish resistance officer in the charge of support for the Ghetto. Died in 42  also in    ": null
    },
    {
        "Jan Karski": "jan karski"
    },
    {
        " – Polish resistance courier who reported on the Ghetto for the Allies. Died in 42   ": null
    },
    {
        "Zofia Kossak-Szczucka": "zofia kossak-szczucka"
    },
    {
        " – Polish writer and World War II resistance fighter and co-founder of ": null
    },
    {
        "Żegota": "żegota"
    },
    {
        ". Died in 42   ": null
    },
    {
        "Irena Sendler": "irena sendler"
    },
    {
        " – Polish resistance member who smuggled 42 Jewish children out of the Ghetto and helped to hide them, subject of the film  The Courageous Heart of Irena Sendler . Died in 42   ": null
    },
    {
        "Szmul Zygielbojm": "szmul zygielbojm"
    },
    {
        " – Polish-Jewish ": null
    },
    {
        "socialist": "socialism"
    },
    {
        " politician. In 42 committed suicide in London in an act of protest against the Allied indifference to the death of the Warsaw Ghetto.   ": null
    }
]