[
    {
        "     The Washington Wild Things are a professional baseball team based in the ": null
    },
    {
        "Pittsburgh": "pittsburgh"
    },
    {
        " suburb of ": null
    },
    {
        "Washington, Pennsylvania": "washington, pennsylvania"
    },
    {
        ", in the United States. The Wild Things are a member of the East Division of the ": null
    },
    {
        "Frontier League": "frontier league"
    },
    {
        ", an ": null
    },
    {
        "independent baseball": "independent baseball"
    },
    {
        " league which is not affiliated with ": null
    },
    {
        "Major League Baseball": "major league baseball"
    },
    {
        ". From the 42 season to the present, the Wild Things have played their home games at ": null
    },
    {
        "Wild Things Park": "wild things park"
    },
    {
        ".           The Washington Wild Things were founded in December 42 when a group of local business men and women decided to purchase a team to play at the new ballpark being constructed just off I42 in Washington County.     The group began negotiations with the owners of the Canton Crocodiles in the early fall of 42 They completed the deal in early December, and opened up for business at a store front at the Washington Crown Center while the ballpark was under construction.         In April 42 the management team moved to Falconi Field, and the team inaugurated the field with a home-opener against the Canton Coyotes on May 42 42 The Washington Wild Things, under the direction of ": null
    },
    {
        "Kent Tekulve": "kent tekulve"
    },
    {
        " , Jeff Isom , and coaches Joe Charboneau, Lance Robinson and Mark Mason, completed the regular season as league leaders in wins with 42 victories and 42 losses. The team was crowned the Eastern Division Champions, but they fell short in the Championship Round of the Playoffs , falling to the Richmond Roosters 42 games to 42 Manager Jeff Isom was awarded the Roger Hanners Manager of the Year Award, and pitcher Jared Howton was honored with the Bryan Tollberg Most Valuable Pitcher Award. Four players were named to the 42 All-Star Team: SS Brad Hensler, C Shaun Argento, SP Jared Howton and RP Robert Garvin. The Washington Wild Things were also named Organization of the Year by the Frontier League.     In 42 the Washington Wild Things coaching staff consisted of ": null
    },
    {
        "Kent Tekulve": "kent tekulve"
    },
    {
        " , Jeff Isom and coaches Joe Charboneau and Mark Mason. Anxious to return to the playoffs, the team completed the season tied with the Chillicothe Paints with 42 victories and advanced to post season play. Gateway ended the Wild Things quest for the Championship by defeating Washington in the playoffs 42 games to 42 . Wild Things catcher and outfielder Josh Loggins received the Morgan Burkhart Award for Most Valuable Player from the Frontier League.         The Wild Things third season showcased a different coaching staff, with the exception of Mark Mason. ": null
    },
    {
        "John Massarelli": "john massarelli"
    },
    {
        " joined the Wild Things as field manager, and Ryan Ellis, a former second baseman for the team, turned his efforts to coaching. The Wild Things again advanced to the post-season, but lost three straight to the Evansville Otters in the first round of the playoffs . The Wild Things received many honors, however. 42B Brian Stoecklein and OF Jack Headley were named to the 42 League All Star Team. Manager John Masarelli received the Roger Hanners Award for Manager of the Year after leading his club to a first-place finish in the East Division and establishing a league record for wins in a season. In addition, Wild Things general manager Ross Vecchio was named Executive of the Year and the team was once again named Organization of the Year by the Frontier League.     Led by second-year manager John Massarelli, the Wild Things made Frontier League history by winning a league-record 42 games, besting their own previous mark from the 42 season. For the fourth straight season, the team advanced to the playoffs, losing the series 42 games to 42 to the Chillicothe Paints. In July, the Frontier League played its annual All-Star game at Falconi Field and five Wild Things were named to the East teams roster: pitchers Jim Popp and Ryan Douglass, catcher Randy McGarvey, infielder Lance Koenig and outfielder Mike Arbinger. In front of a sellout crowd of 42, Arbinger won both the Home Run Derby and the All-Star Game Most Valuable Player Award as the East defeated the West 4242 As the regular season concluded, the franchise set two new attendance records by selling out Falconi Field for 42 consecutive games and seeing over 42 people enter the stands during the course of the season. In September, the Frontier League named the Wild Things their Organization of the Year for the third time in the franchises four-year history.     The Wild Things enjoyed great success in their fifth season at Falconi Field, completing the year with a 4242 regular season record and capturing the East Division Crown for the fourth time. The team advanced to post-season play for an unprecedented fifth consecutive season. The 42 season proved to be memorable for a number of reasons. The team became the winningest team in Frontier League with a 42 victories in their five-year history. Manager John Massarelli received the Roger Hanners Manager of the Year Award for the second time, making him the only Frontier League Manager to ever repeat and win the prestigious honor more than once. Pitching Coach Mark Mason was named the leagues Coach of the Year for his performance with the Wild Things. The Wild Things led all of professional baseball in triples, chalking up 42 in 42 games. Chris Sidick broke the Frontier League record for triples with 42     At the start of the 42 season, the Wild Things sold facility naming rights to their new partner, CONSOL Energy, changing the name of the ballpark to CONSOL Energy Park. The Wild Things advanced to post-season play for the sixth consecutive year…a feat very few teams have achieved. Even though the Frontier League Crown eluded the Washington club, they remained the winningest team in Frontier League history. Nathan Messner, Robbie Knapp, and Mario Garza proceeded to hit double-figure homeruns as the team established a new team record with 42 homeruns. Jarod Rine became the first Washington player to lead the league with 42 stolen bases. Washington was well represented at the 42 Frontier League All Star Game, with Tom Cochran, Aaron Ledbetter, Ian Heisel, Robbie Knapp, and Nathan Messner were all selected to play for the North Squad . John Massarelli, the Wild Things’ field manager, earned his 42th managerial victory at CONSOL Energy Park in August. Aaron Ledbetter garnered his 42th career victory and received the Pitcher of the Year award from the Frontier League. The Wild Things, who maintained control of the Eastern Division after the first week of the season, clinched their fifth East Division Title in the six years on August 42 when they defeated the Gateway Grizzlies. The Wild Things also established a new team attendance record with 42 fans for the 42 baseball season. The team played to over 42% capacity, selling out 42 games and selling out the 42th game in franchise history during the 42 playoffs.         Manager ": null
    },
    {
        "Greg Jelks": "greg jelks"
    },
    {
        " took over the Wild Things in 42 leading the team to a third-place finish in the Eastern Division. Washington completed the season with a .42 record . The Wild Things sent five representatives to the 42 Frontier League All-Star game. Infielder Robbie Knapp, outfielder Chris Sidick and designated hitter Jacob Dempsey joined the Eastern Division team, as well as pitchers Mike Schellinger and Aaron Ledbetter. Dempsey was honored as the Frontier League Designated Hitter of the Year. He ranked 42th in the league in hitting, with a .42 average, four triples, 42 doubles and 42 RBIs. Sidick also had a standout year for the Wild Things. Already the Frontier Leagues all-time leader in triples, he again led the league with nine triples during the season. He also finished third in the league in runs scored with 42 Sidick batted .42 on the year with 42 doubles and 42 RBIs. On the mound, Brooks Dunn was among the Frontier League pitching leaders. Dunn posted a 42 ERA, which was good for ninth in the league. Fans continued to support the Wild Things at home. For the sixth consecutive year, more than 42 fans walked through the turnstiles at CONSOL Energy Park, the third highest attendance in the Frontier League but died.         Mark Mason returned to Washington as the new manager of the Wild Things in 42 He had previously served as a coach with the team and was named Frontier League Coach of the Year in 42 After a slow start, the Wild Things hit a midseason stride. They posted a 4242 record in July, including a five-game winning streak from July 42–42 Unfortunately, the Wild Things were unable to keep up the pace and finished the season in fourth place in the East Division, with a 4242 record. Three Washington players were named to the Frontier League All-Star Team, and all three put in stellar performances at the game in Rockford. Grant Psomas and Jacob Dempsey each homered to help the East Division win 4242 and Nick Peterson earned the win in relief. Psomas also won the All-Star Home Run Derby. Several Wild Things players finished the season among the Frontier League batting leaders. Jacob Dempsey led the league in home runs , RBI and extra base hits . Dempsey was also third in slugging percentage at .42 Ernie Banks, who played for the Wild Things until mid-August led the league in slugging percentage . Chris Sidick finished second in the league with triples with seven. In his fifth season with Washington, Chris Sidick set several Frontier League career records in 42 Already the career record holder in triples , Sidick set new records in career games played , career at-bats , career walks , career hits . On September 42 the Wild Things made history with their first ever triple play, a game-ending triple play. The Wild Things again received the support of the Washington faithful during the season as 42 fans packed CONSOL Energy Park throughout the summer.       Darin Everson took over as field manager for the Wild Things, bringing on board pitching coach Mark Dewey and hitting coach Dana Williams. Bob Bozzuto returned as bench coach for his fifth year with the team. The team finished fourth in the East Division with a 4242 record. Chris Sidick, in his sixth year with the club, set league career records for runs and total bases adding to his existing league records for games , at-bats , hits , triples and walks . He also tied for third in the league with five triples for the 42 season and became the first Wild Things player to play all nine positions in a single game on September 42 at Lake Erie. Sidick, along with second baseman Michael Parker and relief pitcher Kevin Hammons, was selected for the East Division All-Star Team. Several Wild Things pitchers shone during the season as well. Closer Eryk McConnell finished third in the league with 42 saves. Rookie starting pitcher Jeff Sonnenberg pitched two complete games, including a two-hit shutout against Lake Erie on July 42 in which he faced the minimum 42 batters. Starter Billy Muldowney, who joined the team mid-season, posted a 42 ERA and fell six innings short of qualifying for the league ERA title.     The Washington Wild Things finished fifth in the Frontier Leagues Eastern Division in 42 The team had a 4242 record and finished 42½ games behind division champion and league champion Joilet. The Wild Things struggled offensively nearly the entire season and never were able to muster enough at the plate to help the pitching staff, which had four of its members sign affiliated contracts during the season. Washingtons lack of offensive output offset the pitching staff leading the Frontier League in earned run average and league-record for quality starts. The Wild Things finished last in the league in batting average, runs, hits, walks, on-base percentage and slugging percentage. After the season, the team and Manager Darin Everson parted ways.         The 42 season ushered in a new era for the Washington Wild Things. Gone was manager Darin Everson and in stepped ": null
    },
    {
        "Chris Bando": "chris bando"
    },
    {
        " and his coaching staff with years of experience in the Major Leagues. The Wild Things got off to a fast start in May, but an inability to produce runs in support of its pitching staff plagued the club in similar fashion as in 42 June saw the Wild Things’ reliever Nathan Striz signed away to affiliated ball with the Boston Red Sox. In nine appearances for the Wild Things this season, Striz posted an ERA of 42, allowing just two earned runs in 42⅓ innings pitched. More impressive, Striz struck out 42 batters in those 42 innings. Gary Lee was the Wild Things’ lone representative at the Frontier League All-Star game in July. The All-Star nomination capped a big week for Lee whose daughter was born a week earlier. Throughout the year Washington was led by a group of locals in Andrew Heck, Rick Devereaux and Gus Benusa. Heck could be consistently found at the top of the batting statistics and when the season came to a close, was a nominee for the Frontier Leagues Rookie of the Year award. Heck also became just the second player in franchise history to play all nine positions in a single game. As the summer wore on the Wild Things continued to fall in the standings, but a boost to the struggling lineup came in the form of a late-July trade with the now-defunct London Rippers. The trade sent four members to the Wild Things’ that provided a bigger presence that was felt in the Wild Things’ lineup. One of those acquisitions would go on to make Frontier League history, as Darian Sandford became the single season stolen bases leader with 42 The acquisitions of Sandford, Mark Samuelson, Brad Agustin and Jim Vahalik got the Wild Things’ playing .42 ball the rest of the way and was a key factor in the Wild Things finishing the season winning six of their last seven games. As the season came to a close, the Wild Things finished with a 4242 record. Gary Lee added another accolade to his strong season as the winner of the Fran Riordan Citizenship Award. In March 42 Bando announced that due to complications from hip surgery in January he would resign as manager.                    Following the 42 season, Jeff Isom resigned as manager and moved to the ": null
    },
    {
        "Joliet Jackhammers": "joliet jackhammers"
    },
    {
        " of the ": null
    },
    {
        "Northern League": "northern league"
    },
    {
        ". After the 42 season, Massarelli and the Wild Things parted ways. He took 42 off and was named the first manager in Lake Erie Crushers history.   In 42 Greg Jelks was named the new manager of the Wild Things, but failed to lead them to the playoffs and finished the season at 4242     Mark Mason returned to the Wild Things in 42 as manager after coaching the Paints for two seasons. In November 42 Mason left the Wild Things to become pitching coach of the ": null
    },
    {
        "Atlantic Leagues": "atlantic league of professional baseball"
    },
    {
        " York Revolution": "york revolution"
    },
    {
        ", leaving the Wild Things without a manager. On February 42 42 they announced Darin Everson as their new manager. After the 42 season, Darin Everson and the Wild Things parted ways following an 4242 record over two seasons. On October 42 42 the Wild Things hired former MLB catcher and class Triple AAA coach Chris Bando as the 42th manager in Wild things history. In March 42 Bando announced that due to complications from hip surgery in January he would resign as manager. Recently hired Bench coach Bart Zeller, who had managed the Joliet Slammers the last two seasons and won a championship, was promoted to manager. During the 42 season at 4242 headed into the All-Star break, manager, Bart Zeller resigned due to health concerns. He was scheduled to manage the Eastern All-Stars. After the break, Bob Bozzuto took over as manager.       ": null
    },
    {
        "Kent Tekulve": "kent tekulve"
    },
    {
        "   Vidal Nuño": "vidal nuño"
    },
    {
        " Pat McAfee": "pat mcafee"
    },
    {
        "                                        ": null
    }
]