[
    {
        "     Wavre  is a city and ": null
    },
    {
        "municipality": "municipalities in belgium"
    },
    {
        " in the ": null
    },
    {
        "Belgian": "belgium"
    },
    {
        " province": "provinces of belgium"
    },
    {
        " of ": null
    },
    {
        "Walloon Brabant": "walloon brabant"
    },
    {
        ", of which it is the capital.     Wavre is in the ": null
    },
    {
        "Dyle": "dijle"
    },
    {
        " valley. Most inhabitants speak French as their mother tongue and are called Wavriens and Wavriennes . The municipality includes the ": null
    },
    {
        "sub-municipalities": "deelgemeente"
    },
    {
        " of ": null
    },
    {
        "Limal": "limal"
    },
    {
        " and Bierges.     Wavre is also called the City of the Maca , referring to the statue of the small boy who tries to climb the wall of the city hall. Tradition holds that touching the Macas buttocks brings a year of luck.           The foundations of a wealthy ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " villa": "villa"
    },
    {
        " were found very close to Wavre, complete with a portico and many rooms. This part of ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        ", however, was ravaged by the ": null
    },
    {
        "Germanic": "germanic peoples"
    },
    {
        " invasions in the 42rd and 42th century, and it is only in the year 42 that Wavre was mentioned for the first time, as a dependency of the ": null
    },
    {
        "County of Leuven": "county of leuven"
    },
    {
        ", part of the ": null
    },
    {
        "Brabant": "brabant"
    },
    {
        " pagus": "pagus"
    },
    {
        ". The chapel built by the counts near the former ": null
    },
    {
        "Gallo-Roman": "gallo-roman"
    },
    {
        " villa was ceded to the ": null
    },
    {
        "Affligem Abbey": "affligem abbey"
    },
    {
        " a few years later. By the 42th century a market already existed in the budding town built at the crossroads of the ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        "-": null
    },
    {
        "Namur": "namur"
    },
    {
        " and ": null
    },
    {
        "Nivelles": "nivelles"
    },
    {
        "-": null
    },
    {
        "Leuven": "leuven"
    },
    {
        " roads. In 42 Duke ": null
    },
    {
        "Henry I": "henry i, duke of brabant"
    },
    {
        " of ": null
    },
    {
        "Brabant": "duchy of brabant"
    },
    {
        " granted the town its city ": null
    },
    {
        "charter": "charter"
    },
    {
        ". At around the same time, the Affligem Abbey expanded its Wavre possessions into a ": null
    },
    {
        "priory": "priory"
    },
    {
        ", which attracted pilgrims from a wide region around the city.       The relative peace of the city came to an end on March 42 42 when Duke ": null
    },
    {
        "Albert": "albert, duke of saxony"
    },
    {
        " of ": null
    },
    {
        "Saxony": "duchy of saxony"
    },
    {
        " took it and pillaged it in retaliation for Wavres sympathy with ": null
    },
    {
        "Brabant": "duchy of brabant"
    },
    {
        "’s revolt against ": null
    },
    {
        "Austria": "austria"
    },
    {
        ". From then on until the beginning of the 42th century, the city went through one disaster after another. Between the destruction by Duke ": null
    },
    {
        "Charles": "charles, duke of guelders"
    },
    {
        " of ": null
    },
    {
        "Guelders": "duchy of guelders"
    },
    {
        " in 42 and that brought by ": null
    },
    {
        "Louis XIV": "louis xiv"
    },
    {
        "’s wars around 42 Wavre would know several debilitating crises, either at the hand of foreign armies or because of epidemics or major fires . The 42th century was relatively prosperous, but a troubled period started again around 42 with Wavres participation in the ": null
    },
    {
        "Brabant Revolution": "united states of belgium"
    },
    {
        " against ": null
    },
    {
        "Austria": "austria"
    },
    {
        "n interests. After the ": null
    },
    {
        "Battle of Fleurus ": "battle of fleurus"
    },
    {
        ", the city became ": null
    },
    {
        "French": "france"
    },
    {
        ". Like many of its neighbours, the city suffered from mandatory ": null
    },
    {
        "conscription": "conscription"
    },
    {
        ", curtailment of religious freedoms, and the dissolution of the old administrative offices.       On June 42 and 42 42 the ": null
    },
    {
        "Battle of Wavre": "battle of wavre"
    },
    {
        " was fought here on the same day as the ": null
    },
    {
        "Battle of Waterloo": "battle of waterloo"
    },
    {
        ". ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " had sent ": null
    },
    {
        "Marshal Grouchy": "emmanuel de grouchy, marquis de grouchy"
    },
    {
        " to pursue part of the retreating ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        "n army under the command of General ": null
    },
    {
        "Johann von Thielmann": "johann von thielmann"
    },
    {
        ". Despite hearing the cannon sound from nearby Waterloo, Grouchy decided to obey his orders and engage the one Prussian Corps in Wavre. By the time Grouchys battle was over, Napoleon had already lost at Waterloo.     The century that followed saw the expansion of local industry, including foundries, a paper mill, and a sugar refinery. Wavre was severely affected by both World Wars, with heavy fighting, bombing and several houses put on fire. In the 42st century, Wavre enjoyed renewed prosperity as the capital of the Belgian province of ": null
    },
    {
        "Walloon Brabant": "walloon brabant"
    },
    {
        " created in 42              ": null
    },
    {
        "Gothic-style": "gothic architecture"
    },
    {
        " church of St John the Baptist was built in 42 Its main tower houses a 42-bell carillon.   The city hall dates from the 42th century. It is housed in the former church of the ": null
    },
    {
        "Carmelites": "carmelites"
    },
    {
        " and features a cloistered courtyard.   In 42 the first ": null
    },
    {
        "Walibi": "walibi belgium"
    },
    {
        " amusement park, named after Wavre, Limal, and Bierge, to the west of the city centre further up the Dyle. Since then, Walibi has become the largest amusement park in Belgium and spawned similar parks in France and the Netherlands. The park was once known as the best themepark in Europe and has over 42,42 visitors per year.   The Basilica of Our Lady of Basse-Wavre, Basilique Notre-Dame de Basse-Wavre is a centre of pilgrimage for Roman Catholics.       The Jeu de Jean et Alice is a remake of a medieval play, more exactly a spoken, sung, and danced dialog between Jean and Alice, Lords of Wavre, and the citys population. The play commemorates the granting of the charter to the city in 42; it is now an elaborate production that takes place every five years.   Since about 42 years ago, the Grand Tour, a religious procession takes place every year on the Sunday that follows June 42 feast of ": null
    },
    {
        "St John the Baptist": "st john the baptist"
    },
    {
        ", patron saint of the city.   The citys carnival includes a handful of traditional giants that take part in the festivities.       Wavre is the location of the ": null
    },
    {
        "Wavre Transmitter": "wavre transmitter"
    },
    {
        ", a broadcasting facility for shortwave, medium wave, FM and TV of the Belgian broadcasting society. As aerial for medium wave a guyed steel framework mast is used. It is the third ": null
    },
    {
        "tallest structure in Belgium": "tallest buildings and structures in belgium"
    },
    {
        ". The aerials for FM and TV are on a free standing lattice tower. On October 42 42 a storm destroyed the main transmission mast for TV transmission.     ": null
    },
    {
        "Basse-Wavre railway station": "basse-wavre railway station"
    },
    {
        "  is located in Basse-Wavre a suburb to the east of the city centre and lower down Dyle.       Wavre is the home of ": null
    },
    {
        "RJ Wavre": "racing jet wavre"
    },
    {
        " football club, a team with quite a prestigious past but which has struggled in recent times.        ": null
    },
    {
        "Maurice Carême": "maurice carême"
    },
    {
        " , poet was born in Wavre.   Jeanne Deckers, better known as ": null
    },
    {
        "The Singing Nun": "the singing nun"
    }
]