[
    {
        "         Waylon Arnold Jennings was an American singer, songwriter, and musician.     Jennings began playing guitar at age eight and began performing at age twelve on ": null
    },
    {
        "KVOW": "kvow"
    },
    {
        " radio, after which he formed his first band, The Texas Longhorns. Jennings left high school at age sixteen, determined to become a musician, and bounced around as a performer and DJ on KVOW, ": null
    },
    {
        "KDAV": "kdav"
    },
    {
        ", ": null
    },
    {
        "KYTI": "kyti"
    },
    {
        ", ": null
    },
    {
        "KLLL": "kbzo"
    },
    {
        ", in ": null
    },
    {
        "Coolidge, Arizona": "coolidge, arizona"
    },
    {
        ", and ": null
    },
    {
        "Phoenix": "phoenix, arizona"
    },
    {
        ".     In 42 ": null
    },
    {
        "Buddy Holly": "buddy holly"
    },
    {
        " arranged Jenningss first recording session, and hired him to play ": null
    },
    {
        "bass": "bass guitar"
    },
    {
        ". Jennings gave up his seat on the ": null
    },
    {
        "ill-fated flight": "the day the music died"
    },
    {
        " in 42 that crashed and killed Holly, ": null
    },
    {
        "J. P. The Big Bopper Richardson": "the big bopper"
    },
    {
        " and ": null
    },
    {
        "Ritchie Valens": "ritchie valens"
    },
    {
        ".     Jennings formed a ": null
    },
    {
        "rockabilly": "rockabilly"
    },
    {
        " club band, ": null
    },
    {
        "The Waylors": "the waylors"
    },
    {
        ", which became the house band at JDs , a club in Scottsdale, Arizona. He recorded for independent label Trend Records and ": null
    },
    {
        "A & M Records": "a & m records"
    },
    {
        ", but did not achieve success until moving to ": null
    },
    {
        "RCA Victor": "rca victor"
    },
    {
        ", taking on Neil Reshen as a manager, who negotiated significantly better touring and recording contracts for him.     After finally wresting creative control from RCA Victor, his career turning point became the critically acclaimed albums  Lonesome, Onry and Mean  and  Honky Tonk Heroes , followed by hit LPs  Dreaming My Dreams  and  Are You Ready for the Country . During the 42s, Jennings was instrumental in the inception of ": null
    },
    {
        "outlaw country": "outlaw country"
    },
    {
        " and with ": null
    },
    {
        "Willie Nelson": "willie nelson"
    },
    {
        ", ": null
    },
    {
        "Tompall Glaser": "tompall glaser"
    },
    {
        ", and ": null
    },
    {
        "Jessi Colter": "jessi colter"
    },
    {
        " recorded country musics first platinum album,  Wanted! The Outlaws . It was followed by  Ol Waylon  and the hit song ": null
    },
    {
        "Luckenbach, Texas": "luckenbach, texas"
    },
    {
        " .     Jennings was featured in the 42 album  White Mansions , performed by various artists documenting the lives of people in the Confederacy during the Civil War. Jennings also appeared in films and television series, including ": null
    },
    {
        "Sesame Street": "sesame street"
    },
    {
        ", and a stint as the ": null
    },
    {
        "balladeer": "wikt:balladeer"
    },
    {
        " for  The Dukes of Hazzard , composing and singing ": null
    },
    {
        "the shows theme song": "theme from the dukes of hazzard"
    },
    {
        " and providing narration for the show.     By the early 42s, Jennings struggled with a ": null
    },
    {
        "cocaine": "cocaine"
    },
    {
        " addiction, which he overcame in 42 Later, he joined the country ": null
    },
    {
        "supergroup": "supergroup"
    },
    {
        " The Highwaymen": "the highwaymen"
    },
    {
        " with ": null
    },
    {
        "Willie Nelson": "willie nelson"
    },
    {
        ", ": null
    },
    {
        "Kris Kristofferson": "kris kristofferson"
    },
    {
        ", and ": null
    },
    {
        "Johnny Cash": "johnny cash"
    },
    {
        ", which released three albums between 42 and 42 During that period, Jennings released the successful album  Will the Wolf Survive .     He toured less after 42 to spend more time with his family. Between 42 and 42 his appearances were limited by health problems. In 42 he was inducted into the ": null
    },
    {
        "Country Music Hall of Fame": "country music hall of fame"
    },
    {
        ". In 42 he was posthumously awarded the Cliffie Stone Pioneer Award by the ": null
    },
    {
        "Academy of Country Music": "academy of country music"
    },
    {
        ".       Waylon Jennings was born on June 42 42 on the G.W. Bitner farm, near ": null
    },
    {
        "Littlefield, Texas": "littlefield, texas"
    },
    {
        ". The Jennings family line descended from ": null
    },
    {
        "Irish": "irish american"
    },
    {
        " and ": null
    },
    {
        "Black-Dutch": "black-dutch"
    },
    {
        ". Meanwhile, the Shipley family moved from Tennessee and settled in Texas. The Shipley line descended from ": null
    },
    {
        "Cherokee": "cherokee"
    },
    {
        " and ": null
    },
    {
        "Comanche": "comanche"
    },
    {
        " families.     The name on Jennings birth certificate was Wayland, It was changed after a Baptist preacher visited his parents and congratulated his mother for naming him after the ": null
    },
    {
        "Wayland Baptist University": "wayland baptist university"
    },
    {
        " in ": null
    },
    {
        "Plainview, Texas": "plainview, texas"
    },
    {
        ". Lorene Jennings, who had been unaware of the college, changed the spelling to Waylon. Jennings later expressed in his autobiography, I didnt like Waylon. It sounded corny and hillbilly, but its been good to me, and Im pretty well at peace with it right now.      After working as a laborer on the Bitner farm, Jenningss father moved the family to Littlefield and established a ": null
    },
    {
        "retail creamery": "creamery"
    },
    {
        ".           When Jennings was eight, his mother taught him to play guitar with the tune Thirty Pieces of Silver . Jennings used to practice with his relatives instruments until his mother bought him a used ": null
    },
    {
        "Stella": "stella"
    },
    {
        " guitar, and later ordered a ": null
    },
    {
        "Harmony Patrician": "harmony company modelspatrician"
    },
    {
        ". Early influences were ": null
    },
    {
        "Bob Wills": "bob wills"
    },
    {
        ", ": null
    },
    {
        "Floyd Tillman": "floyd tillman"
    },
    {
        ", ": null
    },
    {
        "Ernest Tubb": "ernest tubb"
    },
    {
        ", ": null
    },
    {
        "Hank Williams": "hank williams"
    },
    {
        ", ": null
    },
    {
        "Carl Smith": "carl smith"
    },
    {
        ", and ": null
    },
    {
        "Elvis Presley": "elvis presley"
    },
    {
        ".       Beginning with performing at family gatherings, Jennings played his first public concert at the Youth Center with Anthony Bonanno, followed by appearances at the local ": null
    },
    {
        "Jaycees": "united states junior chamber"
    },
    {
        " and ": null
    },
    {
        "Lions Clubs": "lions clubs international"
    },
    {
        ". He won a talent show at ": null
    },
    {
        "Channel 42": "klbk-tv"
    },
    {
        ", in Lubbock, singing ": null
    },
    {
        "Hey Joe": "hey joe"
    },
    {
        " . He later made frequent performances at the Palace Theater in Littlefield, during local talent night.     At 42 years, Blackett, Matt. Waylon Jennings: Requiem for an Outlaw . Guitar Player, vol. 42 no. 42 42, pp.  42–42  Jennings auditioned for a spot on KVOW in Littlefield, Texas. Owner J.B. McShan, along with Emil Macha, recorded Jenningss performance. McShan liked his style and hired him for a weekly 42-minute program. Following this successful introduction, Jennings formed his own band. He asked Macha to play bass for him and gathered other friends and acquaintances to form The Texas Longhorns. The style of the band, a mixture of ": null
    },
    {
        "Country and Western": "country and western"
    },
    {
        " and ": null
    },
    {
        "Bluegrass music": "bluegrass music"
    },
    {
        ", was often not well received.     After several disciplinary infractions 42 year-old tenth-grader Jennings was convinced to drop out of high school by the superintendent. Upon leaving school, he worked for his father in the family store, also taking temporary jobs. Jennings felt that music, his favorite activity, would turn into his career. The next year, Jennings and The Texas Longhorns recorded a demo of the songs Stranger in My Home and Therell Be a New Day at ": null
    },
    {
        "KFYO": "kfyo"
    },
    {
        " radio in Lubbock. Meanwhile, he drove a truck for the Thomas Land Lumber Company, and a ": null
    },
    {
        "cement truck": "cement truck"
    },
    {
        " for the Roberts Lumber Company. Tired of the owner, Jennings quit after a minor driving accident. Jennings, and other local musicians, often performed at country radio station ": null
    },
    {
        "KDAV": "kbzo"
    },
    {
        ". During this time he met ": null
    },
    {
        "Buddy Holly": "buddy holly"
    },
    {
        " at a Lubbock restaurant. The two often met during local shows, and Jennings began to attend Hollys performances on KDAVs Sunday Party.     In addition to performing on air for KVOW, Jennings started to work as a DJ in 42 and moved to Lubbock. His program ran from 42:42 in the afternoon to 42:42 in the evening, filled with two hours of country classics, two of current country, and two of mixed recordings. The latter included early rock-and-roll stars such as ": null
    },
    {
        "Chuck Berry": "chuck berry"
    },
    {
        " and ": null
    },
    {
        "Little Richard": "little richard"
    },
    {
        ". The owner reprimanded him each time he aired such recordings, and after playing two Richard records in a row Jennings was fired.          During his time at KVOW Jennings was visited by DJ Sky Corbin of ": null
    },
    {
        "KLVT": "klvt"
    },
    {
        " in Levelland. Corbin was impressed with his voice, and decided to visit Jennings at the station after hearing him sing a jingle to the tune of Hank Snows ": null
    },
    {
        "Im Moving On": "im moving on"
    },
    {
        " . Jennings expressed his struggle to live on a US$42-a-week salary. Corbin invited Jennings to visit KLVT, where he eventually took Corbins position when it opened.  The Corbin family later purchased ": null
    },
    {
        "KLLL": "klll"
    },
    {
        ", in Lubbock. They changed the format of the station to country, becoming the main competition of KDAV. The Corbins hired Jennings as the stations first DJ.     Jennings produced commercials and created jingles with the rest of the DJs. As their popularity increased, the DJs made public appearances. Jenningss events included live performances. During one performance, Buddys father, L.O. Holley, approached them with his sons latest record and requested them to play it at the station. L.O. mentioned his sons intention to start producing artists himself, and Corbin recommended Jennings. After returning from his tour of England Buddy Holly visited KLLL.           Holly took Jennings as his first artist. He outfitted him with new clothes, and worked with him to improve his image.  He arranged a session for Jennings at ": null
    },
    {
        "Norman Petty": "norman petty"
    },
    {
        "s recording studios in ": null
    },
    {
        "Clovis, New Mexico": "clovis, new mexico"
    },
    {
        ". On September 42 Jennings recorded the songs ": null
    },
    {
        "Jole Blon": "jole blon"
    },
    {
        " and When Sin Stops with Holly and ": null
    },
    {
        "Tommy Allsup": "tommy allsup"
    },
    {
        " on guitars and saxophonist ": null
    },
    {
        "King Curtis": "king curtis"
    },
    {
        ". Holly then hired Jennings to play bass for him during his Winter Dance Party Tour .       Before the tour, Holly vacationed with his wife in Lubbock and visited Jenningss radio station in December 42 Jennings and Sky Corbin performed the hand claps to Hollys tune Youre the One . Jennings and Holly soon left for New York City,  arriving on January 42 42 Jennings stayed at Hollys apartment by ": null
    },
    {
        "Washington Square Park": "washington square park"
    },
    {
        " prior to a meeting scheduled at the headquarters of the ": null
    },
    {
        "General Artists Corporation": "general amusement corporation"
    },
    {
        ", that organized the tour. They later took a train to Chicago to join the band.     The ": null
    },
    {
        "Winter Dance Party": "winter dance party"
    },
    {
        " tour began in ": null
    },
    {
        "Milwaukee, Wisconsin": "milwaukee, wisconsin"
    },
    {
        ", on January 42 42 The amount of travel created logistical problems, as the distance between venues had not been considered when scheduling each performance. Adding to the problem, the unheated tour buses twice broke down in freezing weather, leading to drummer Carl Bunch being hospitalized for frostbite on his toes. Holly made the decision to find another means of transportation.     Before their performance at the ": null
    },
    {
        "Surf Ballroom": "surf ballroom"
    },
    {
        " in ": null
    },
    {
        "Clear Lake, Iowa": "clear lake, iowa"
    },
    {
        ", Holly chartered a four-seat ": null
    },
    {
        "Beechcraft Bonanza": "beechcraft bonanza"
    },
    {
        " airplane from Dwyer Flying Service in ": null
    },
    {
        "Mason City, Iowa": "mason city, iowa"
    },
    {
        ", for himself, Jennings, and Tommy Allsup, to avoid the long bus trip to their next venue in ": null
    },
    {
        "Moorhead, Minnesota": "moorhead, minnesota"
    },
    {
        ". Following the Clear Lake show , Allsup lost a coin toss and gave up his seat on the charter plane to ": null
    },
    {
        "Ritchie Valens": "ritchie valens"
    },
    {
        ", while Jennings voluntarily gave up his seat to J. P. Richardson, known as ": null
    },
    {
        "The Big Bopper": "the big bopper"
    },
    {
        ", who was suffering from the flu and complaining about how cold and uncomfortable the tour bus was for a man of his size. Texas Monthly, January 42;       When Holly learned that his bandmates had given up their seats on the plane and had chosen to take the bus rather than fly, a friendly banter between Holly and Jennings ensued, and it would come back to haunt Jennings for decades to follow: Holly jokingly told Jennings, Well, I hope your ol bus freezes up! Jennings jokingly replied, Well, I hope your ol plane crashes!  Less than an hour and a half later, shortly after 42:42  am on February 42 42 ": null
    },
    {
        "Hollys charter plane crashed": "the day the music died"
    },
    {
        " at full throttle into a cornfield outside Mason City, instantly killing all on board.     Later that morning, Jenningss family heard on the radio that Buddy Holly and his band had been killed. After calling his family, Jennings called Sky Corbin at KLLL from Fargo to say that he hadnt been aboard the plane.  The General Artists Corporation promised to pay for first-class tickets for Jennings and the band to attend Hollys funeral in Lubbock in exchange for them playing that night in Moorhead. After the first show, they were initially denied their payment by the venue, but after Jenningss persistence, they were paid. The flights were never paid, and Jennings and Allsup continued the tour for two more weeks, featuring Jennings as the lead singer. They were paid less than half of the original agreed salary, and upon returning to New York, Jennings put Hollys guitar and amplifier in a locker in ": null
    },
    {
        "Grand Central Terminal": "grand central terminal"
    },
    {
        " and mailed the keys to ": null
    },
    {
        "Maria Elena Holly": "maria elena holly"
    },
    {
        ". Then, he returned to Lubbock.     In the early 42s, Jennings wrote and recorded The Stage , a tribute to Valens, the Big Bopper and Holly, as well as ": null
    },
    {
        "Eddie Cochran": "eddie cochran"
    },
    {
        ", a young musician who died in a road accident a year after the plane crash.     For decades afterward, Jennings repeatedly admitted that he felt responsible for the crash that killed Holly. This sense of guilt precipitated bouts of substance abuse through much of Jenningss career.     Jole Blon was released on Brunswick in March 42 with limited success. Now unemployed, Jennings returned to KLLL. Deeply affected by the death of Holly, Jenningss performance at the station worsened. He left the station after he was denied a raise, and later worked briefly for the competition, KDAV.       Due to his wife Maxines fathers illness, Jennings had to shuttle between Arizona and Texas. While his family lived back in Littlefield, Jennings found a job briefly at ": null
    },
    {
        "KOYL": "kodm"
    },
    {
        " in ": null
    },
    {
        "Odessa, Texas": "odessa, texas"
    },
    {
        ". He moved with his family to ": null
    },
    {
        "Coolidge, Arizona": "coolidge, arizona"
    },
    {
        ", where Maxines sister lived. He found a job performing at the Galloping Goose bar, where he was heard by Earl Perrin, who offered him a spot on ": null
    },
    {
        "KCKY": "kcky"
    },
    {
        ". Jennings also played during the intermission at ": null
    },
    {
        "drive-in theater": "drive-in theater"
    },
    {
        "s and in bars. After a successful performance at the Cross Keys Club in ": null
    },
    {
        "Phoenix": "phoenix, arizona"
    },
    {
        ", he was approached by two contractors who were building a club in ": null
    },
    {
        "Scottsdale": "scottsdale, arizona"
    },
    {
        " for James D. Musiel, called JDs. Musiel engaged Jennings as his main artist and designed the club around his act.     Jennings formed his backing band, ": null
    },
    {
        "The Waylors": "the waylors"
    },
    {
        ", with bassist Paul Foster, guitarist Jerry Gropp, and drummer Richie Albright. The band soon earned a strong local fanbase at JDs, where Jennings developed his rock-influenced style of country music that defined him on his later career.     In 42 Jennings signed a recording contract with ": null
    },
    {
        "Trend Records": "trend records"
    },
    {
        ", and experienced moderate success with his single, Another Blue Day . His friend, ": null
    },
    {
        "Don Bowman": "don bowman"
    },
    {
        ", took demos of Jennings to ": null
    },
    {
        "Jerry Moss": "jerry moss"
    },
    {
        ", who at the time was starting ": null
    },
    {
        "A & M Records": "a & m records"
    },
    {
        " with associate ": null
    },
    {
        "Herb Alpert": "herb alpert"
    },
    {
        ". In July 42 Jennings signed a contract with A & M that granted him 42% of record sales. At A & M, he recorded Love Denied backed with ": null
    },
    {
        "Rave On": "rave on!"
    },
    {
        " , and ": null
    },
    {
        "Four Strong Winds": "four strong winds"
    },
    {
        " backed with ": null
    },
    {
        "Just to Satisfy You": "just to satisfy you"
    },
    {
        " . He followed up by recording demos of ": null
    },
    {
        "The Twelfth of Never": "the twelfth of never"
    },
    {
        " , ": null
    },
    {
        "Kisses Sweeter than Wine": "kisses sweeter than wine"
    },
    {
        " , and ": null
    },
    {
        "Dont Think Twice, Its All Right": "dont think twice, its all right"
    },
    {
        " , and also produced the single Sing the Girls a Song, Bill , backed with ": null
    },
    {
        "The Race Is On": "the race is on"
    },
    {
        " . The singles were released between April and October 42     Jennings records found little success at A & M, because the label was releasing mostly ": null
    },
    {
        "folk music": "folk music"
    },
    {
        " rather than country at the time. He had a few regional hits around Phoenix, due to local radio airplay with ": null
    },
    {
        "Ian Tyson": "ian tyson"
    },
    {
        "s Four Strong Winds and Just To Satisfy You , which was co-written with Bowman. Meanwhile, he recorded an album on BAT records, called  Waylon at JDs . After 42 copies were sold at the club another 42 were pressed by the Sounds label. Country Music Foundation; p.42 He also played lead guitar for ": null
    },
    {
        "Patsy Montana": "patsy montana"
    },
    {
        " on a 42 album. Bluegrass Unlimited; p.42          Singer ": null
    },
    {
        "Bobby Bare": "bobby bare"
    },
    {
        " heard Jenningss Just to Satisfy You on his car radio while passing through Phoenix, and recorded it and Four Strong Winds .  After stopping in Phoenix to attend a Jennings performance at JDs, Bare called ": null
    },
    {
        "Chet Atkins": "chet atkins"
    },
    {
        ", head of the ": null
    },
    {
        "RCA Victor": "rca victor"
    },
    {
        " studios in Nashville, and suggested he sign Jennings.     Unsure after being offered a deal with RCA if he should quit his gig at JDs and relocate to Nashville, he sought the advice of RCA artist and friend ": null
    },
    {
        "Willie Nelson": "willie nelson"
    },
    {
        ", who had attended one of Jennings shows. Upon hearing how well financially Jennings was doing at JDs Nelson suggested he stay in Phoenix.     Jennings then and asked Herb Alpert to release him from his contract with A & M, which Alpert did. . Atkins formally signed Jennings to ": null
    },
    {
        "RCA Victor": "rca victor"
    },
    {
        " in 42 In August Jennings made his first appearance on the Billboards ": null
    },
    {
        "Hot Country Songs": "hot country songs"
    },
    {
        " chart with Thats the Chance Ill Have to Take .            In 42 Jennings released his debut RCA Victor album  Folk-Country , followed by  Leavin Town  and  Nashville Rebel . Leavin Town resulted in significant chart success as the first two singles Anita, Youre Dreaming and Time to Burn Again both peaked at no. 42 on the Billboard ": null
    },
    {
        "Hot Country Songs": "hot country songs"
    },
    {
        " chart. The albums third single, a cover of ": null
    },
    {
        "Gordon Lightfoot": "gordon lightfoot"
    },
    {
        "s ": null
    },
    {
        " For Lovin Me": "for lovin me"
    },
    {
        " , peaked at no. 42 Jenningss first top 42 single. Nashville Rebel was the soundtrack to an independent film, The Nashville Rebel , starring Jennings. The Southern Quarterly; p.42 The single Green River charted on Billboard country singles at 42 In 42 Jennings released a hit single, ": null
    },
    {
        "Just to Satisfy You": "just to satisfy you"
    },
    {
        " . During an interview, Jennings remarked that the song was a pretty good example of the influence of his work with Buddy Holly and rockabilly music. Jennings produced mid-chart albums that sold well, including 42s  Just to Satisfy You , that included the hit single. Jenningss singles enjoyed success. ": null
    },
    {
        "The Chokin Kind": "the chokin kind"
    },
    {
        " peaked at number eight on Billboards Hot Country Singles in 42 while ": null
    },
    {
        "Only Daddy Thatll Walk the Line": "only daddy thatll walk the line"
    },
    {
        " hit number two the following year. In 42 his collaboration with The Kimberlys on the single ": null
    },
    {
        "MacArthur Park": "macarthur park"
    },
    {
        " earned a ": null
    },
    {
        "Grammy Award for Best Country Performance by a Duo or Group": "grammy award for best country performance by a duo or group with vocal"
    },
    {
        ". His single ": null
    },
    {
        "Brown Eyed Handsome Man": "brown eyed handsome man"
    },
    {
        " reached number three at the Hot Country Singles chart by the end of the year.     During this time, Jennings rented an apartment in Nashville with singer ": null
    },
    {
        "Johnny Cash": "johnny cash"
    },
    {
        ". Jennings and Cash were both managed by Lucky Moellers booking agency Moeller Talent, Inc. The tours organized by the agency were unproductive, with the artists being booked to venues located far from each other in close dates. After paying for the accommodation and travel expenditures, Jenningss was frequently forced to request advances from the agency or RCA Victor to make the next venue. While playing 42 days on the road, Jenningss debt increased, and along with it his consumption of ": null
    },
    {
        "amphetamine": "amphetamine"
    },
    {
        ". He believed himself to be trapped on the circuit.     In 42 Jennings released  Ladies Love Outlaws . The single that headlined the album became a hit for Jennings, and was his first approach to ": null
    },
    {
        "outlaw country": "outlaw country"
    },
    {
        ". Jennings was accustomed to performing and recording with his own band, The Waylors, a practice that was not encouraged by powerful Nashville producers, who favored the ": null
    },
    {
        "Nashville sound": "nashville sound"
    },
    {
        " produced by a roster of experienced local studio musicians. The music style publicized as ": null
    },
    {
        "Countrypolitan": "countrypolitan"
    },
    {
        " was characterized by orchestral arrangements and the absence of most traditional country music instruments. The producers did not let Jennings play his own guitar or select material to record. Over time, however, Jennings felt limited by Nashvilles lack of artistic freedom. He began to prepare for a change in direction with his career.       In an interview Jennings recalled the restrictions of the Nashville establishment: They wouldnt let you do anything. You had to dress a certain way: you had to do everything a certain way.... They kept trying to destroy me.... I just went about my business and did things my way.... You start messing with my music, I get mean.  By 42 after the release of Ladies Love Outlaws, his recording contract was nearing an end. Upon contracting ": null
    },
    {
        "hepatitis": "hepatitis"
    },
    {
        " Jennings was hospitalized. Sick and frustrated with the Nashville music industry he was considering retirement. Albright visited him and convinced him to continue, suggesting he hire Neil Reshen his new manager. Meanwhile, Jennings requested a US$42 royalty advance from RCA Records to cover his living expenses during his recovery. The same day he met Reshen, RCA sent Jerry Bradley to offer Jennings US$42 as a bonus for signing a new 42% royalty deal with RCA, the same terms he had accepted in 42 After reviewing the offer with Reshen, he rejected it and hired Reshen.     Reshen started to renegotiate Jenningss recording and touring contracts. At a meeting in a Nashville airport Jennings introduced Reshen to Willie Nelson. By the end of the meeting Reshen had become Nelsons manager, as well. Jenningss new deal included a $42 advance and artistic control. Reshen advised Jennings to keep the beard that he had grown in the hospital, to match the image of Outlaw Country.          By 42 Nelson found success with ": null
    },
    {
        "Atlantic Records": "atlantic records"
    },
    {
        ". Now based in ": null
    },
    {
        "Austin, Texas": "austin, texas"
    },
    {
        ", he began to attract rock and roll fans to his shows, which gained him notice in its press. Atlantic Records made a bid to sign Jennings, but Nelsons rise to popularity persuaded RCA to renegotiate with him before losing another potential star.     In 42 Jennings released  Lonesome, Onry and Mean  and  Honky Tonk Heroes , the first albums recorded and released under his creative control. This heralded a major turning point for Jennings, kicking off his most critically and commercially successful years. More hit albums followed with  This Time  and  The Ramblin Man , both released in 42 The title tracks of both albums topped the Billboard Country singles chart, with the self-penned This Time becoming Jenningss first no. 42 single.  Dreaming My Dreams , released in 42 included the no. 42 single ": null
    },
    {
        "Are You Sure Hank Done It This Way": "are you sure hank done it this way"
    },
    {
        " , and became his first album to be certified gold by the ": null
    },
    {
        "RIAA": "recording industry association of america"
    },
    {
        "; it was also the first of six consecutive, solo studio albums to be certified gold or higher.  In 42 Jennings released  Are You Ready for the Country . Jennings wanted Los Angeles producer ": null
    },
    {
        "Ken Mansfield": "ken mansfield"
    },
    {
        " to produce the record, but RCA initially balked. Jennings and The Waylors traveled to Los Angeles and recorded with Mansfield at Jennings own expense. A month later, Jennings returned to Nashville and presented the master tape to ": null
    },
    {
        "Chet Atkins": "chet atkins"
    },
    {
        ", who, after listening to it, decided to release it. The album hit number one on Billboards country albums three times the same year, topping the charts for 42 weeks. It was named Country album of the year in 42 by  Record World  magazine and was certified gold by the ": null
    },
    {
        "RIAA": "riaa"
    },
    {
        ". Mansfield, Ken; p.,           In 42 RCA released the compilation album  Wanted! The Outlaws , with Jennings, Willie Nelson, Tompall Glaser, and Jennings wife, Jessi Colter. The album was the first Country music album certified ": null
    },
    {
        "platinum": "riaa certification"
    },
    {
        ". The following year, RCA issued  Ol Waylon , an album that produced a hit duet with Nelson, ": null
    },
    {
        "Luckenbach, Texas": "luckenbach, texas"
    },
    {
        " . The album  Waylon and Willie  followed in 42 producing the hit single ": null
    },
    {
        "Mammas Dont Let Your Babies Grow Up to Be Cowboys": "mammas dont let your babies grow up to be cowboys"
    },
    {
        " . Jennings released  Ive Always Been Crazy , also in 42 The same year, at the peak of his success, Jennings began to feel limited by the outlaw movement.  Jennings referred to the overexploitation of the image in the song ": null
    },
    {
        "Dont You Think This Outlaw Bits Done Got Out of Hand": "dont you think this outlaw bits done got out of hand"
    },
    {
        "? , claiming that the movement had become a self-fulfilling prophecy . In 42 RCA released Jennings first  Greatest Hits  compilation, which was certified gold the same year, and quintuple platinum in 42      Also in 42 Jennings joined the cast of the ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " series  The Dukes of Hazzard  as the Balladeer, the narrator. The only episode to feature him as an actor was ": null
    },
    {
        "Welcome, Waylon Jennings": "list of the dukes of hazzard episodesseason 7  - 17 episodes"
    },
    {
        " , during the seventh season. Jennings played himself, presented as an old friend of the Duke family. For the show he also wrote and sang the theme song ": null
    },
    {
        "Good Ol Boys": "theme from the dukes of hazzard"
    },
    {
        " , which became the biggest hit of his career. Released as a single in promotion with the show it became Jenningss 42th single to reach number one on the Billboard Country Singles chart. It was also a crossover hit, peaking at no. 42 on the Billboard Hot 42            In the mid42s, Johnny Cash, Kris Kristofferson, Nelson, and Jennings formed a successful group called ": null
    },
    {
        "The Highwaymen": "the highwaymen"
    },
    {
        ".   Aside from his work with The Highwaymen, Jennings released a gold album  WWII  with Willie Nelson.          In 42 Jennings joined with ": null
    },
    {
        "USA for Africa": "usa for africa"
    },
    {
        " to record ": null
    },
    {
        "We Are the World": "we are the world"
    },
    {
        " , but he left the studio because of a dispute over the songs lyrics that were to be sung in ": null
    },
    {
        "Swahili": "swahili language"
    },
    {
        ". Ironically, after Jennings left the session, the idea was dropped at the prompting of ": null
    },
    {
        "Stevie Wonder": "stevie wonder"
    },
    {
        ", who pointed out that Ethiopians did not speak Swahili.  By this time, his sales had decreased. After the release of  Sweet Mother Texas , Jennings signed with ": null
    },
    {
        "MCA Records": "music corporation of america"
    },
    {
        ".  His debut release with the label,  Will the Wolf Survive  , peaked at number one in Billboards Country albums in 42  Jenningss initial success tailed off, and in 42 he signed with ": null
    },
    {
        "Epic Records": "epic records"
    },
    {
        ". His first release,  The Eagle , became his final top 42 album.      Also in 42 he made a cameo appearance in the live-action childrens film  Sesame Street Presents: Follow That Bird . In the movie, he plays a turkey farm truck driver who gives ": null
    },
    {
        "Big Bird": "big bird"
    },
    {
        " a lift. He also sings one of the films songs, entitled Aint No Road Too Long .     In 42 in collaboration with Rincom Childrens Entertainment, Jennings recorded an album of childrens songs,  Cowboys, Sisters, Rascals & Dirt , which included Shooters Theme , a tribute to his 42-year-old with the theme of a friend of mine .     Although his record sales and radio play took a downturn during the 42s, Jennings continued to draw large crowds at his live performances. In 42 Jennings released his album,  Right for the Time , featuring some of his newer songs, including The Most Sensible Thing . In 42 after the  Lollapalooza  tour, he decreased his tour schedule and became centered on his family.     In 42 Jennings teamed up with Bare, ": null
    },
    {
        "Jerry Reed": "jerry reed"
    },
    {
        ", and ": null
    },
    {
        "Mel Tillis": "mel tillis"
    },
    {
        " to form the ": null
    },
    {
        "Old Dogs": "old dogs"
    },
    {
        ". The group recorded a double album of songs by ": null
    },
    {
        "Shel Silverstein": "shel silverstein"
    },
    {
        ".      In mid42 Jennings assembled what he referred to as his hand-picked dream team and formed Waylon & The Waymore Blues Band. Consisting primarily of former Waylors, the 42-member group performed concerts from 42 to 42 In January 42 Jennings recorded what became his final album at Nashvilles historic ": null
    },
    {
        "Ryman Auditorium": "ryman auditorium"
    },
    {
        ",  Never Say Die: Live .          Jenningss music was characterized by his powerful rough-edged singing voice, phrasing and texture.   He was also recognized for his spanky-twang guitar style. To create his sound, he used a pronounced phaser effect plus a mixture of thumb and fingers during the rhythmic parts, while using picks for the lead runs. He combined ": null
    },
    {
        "hammer-on": "hammer-on"
    },
    {
        " and ": null
    },
    {
        "pull-off": "pull-off"
    },
    {
        " riffs, with eventual upper-fret ": null
    },
    {
        "double stop": "double stop"
    },
    {
        "s and ": null
    },
    {
        "modulation effects": "modulation"
    },
    {
        ". Jennings played a 42 ": null
    },
    {
        "Fender Telecaster": "fender telecaster"
    },
    {
        ", a used guitar that was a gift from The Waylors. Jenningss bandmates adorned his guitar with a distinctive leather cover that featured a black background with a white floral work. Jennings further customized it by filing down the ": null
    },
    {
        "fret": "fret"
    },
    {
        "s to lower the strings on the neck to obtain the slapping sound.   Among his other guitars, Jennings used a 42 Fender Broadcaster from the mid42s, until he gave it to guitarist ": null
    },
    {
        "Reggie Young": "reggie young"
    },
    {
        " in 42  The leather covers of his guitars were carved by leather artist Terry Lankford.      Jennings signature image was characterized by his long hair and beard, and black hat and black leather vest he wore during his appearances.           Jennings was married four times and had six children. He married Maxine Caroll Lawrence in 42 at age 42 with whom he had four children: Terry Vance , Julie Rae , Buddy Dean , and Deana. Jennings married Lynne Jones on December 42 42 adopting a child, Tomi Lynne. They divorced in 42 He married Barbara Elizabeth Rood in 42 He composed the song This Time about the trials and tribulations of his marriages and divorces. He married country singer ": null
    },
    {
        "Jessi Colter": "jessi colter"
    },
    {
        " in Phoenix, Arizona, on October 42 42 Colter had a daughter, Jennifer, from her previous marriage to ": null
    },
    {
        "Duane Eddy": "duane eddy"
    },
    {
        ". The couple had a son, Waylon Albright, known as ": null
    },
    {
        "Shooter Jennings": "shooter jennings"
    },
    {
        ". In the early 42s Colter and Jennings nearly divorced due to his abuse of drugs and alcohol, but remained together until Jenningss death in 42     In 42 he gave up touring to be closer to his family. To set an example about the importance of education to his son Shooter, Jennings earned a ": null
    },
    {
        "GED": "ged"
    },
    {
        " at age 42       Jennings started to consume ": null
    },
    {
        "amphetamines": "amphetamines"
    },
    {
        " while he lived with ": null
    },
    {
        "Johnny Cash": "johnny cash"
    },
    {
        " during the mid42s. Jennings later stated, Pills were the artificial energy on which Nashville ran around the clock. In 42 Jennings was arrested by federal agents for conspiracy and possession of ": null
    },
    {
        "cocaine": "cocaine"
    },
    {
        " with intent to distribute. A private courier warned the ": null
    },
    {
        "Drug Enforcement Administration": "drug enforcement administration"
    },
    {
        " about the package sent to Jennings by a New York colleague that contained 42 grams of cocaine. The DEA and the police searched Jenningss recording studio but found no evidence because while they were waiting for a ": null
    },
    {
        "search warrant": "search warrant"
    },
    {
        " Jennings disposed of the drug. The charges were later dropped and Jennings was released. The episode was recounted in Jenningss song Dont You Think This Outlaw Bits Done Got Outta Hand?      During the early 42s, his cocaine addiction intensified. Jennings claimed to have spent $42 a day on his habit, draining his personal finances and leaving him bankrupt with debt up to $42  million. Though he insisted on repaying the debt and did additional tours to do so, his work became less focused and his tours deteriorated. Jennings leased a home in the Phoenix area and spent a month detoxing himself, intending to start using cocaine again in a more controlled fashion afterward. In 42 he quit cocaine. Jennings claimed that his son Shooter was his main inspiration to finally do so.          Decades of excessive smoking, drinking and drug use took a large toll on Jenningss health. Four years after quitting cocaine he ended his six pack a day ": null
    },
    {
        "smoking": "smoking"
    },
    {
        " habit.  The same year he underwent ": null
    },
    {
        "heart bypass surgery": "heart bypass surgery"
    },
    {
        ".  By 42 his ": null
    },
    {
        "diabetes": "diabetes"
    },
    {
        " worsened, and the pain so reduced his mobility he was forced to end most touring. Later the same year he underwent surgery to improve his leg circulation. In December 42 his left foot was amputated at a hospital in Phoenix. On February 42 42 Jennings died in his sleep of diabetic complications at the age of 42 in ": null
    },
    {
        "Chandler, Arizona": "chandler, arizona"
    },
    {
        ". He was buried in the ": null
    },
    {
        "City of Mesa Cemetery": "city of mesa cemetery"
    },
    {
        ", in ": null
    },
    {
        "Mesa": "mesa, arizona"
    },
    {
        ". At his memorial service on February 42 Jessi Colter sang Storms Never Last .              Between 42 and 42 42 Jennings singles charted, with 42 reaching Number 42 Between 42 and 42 42 albums charted, with 42 reaching Number 42 Billboard, February 42 42;      In October 42 Jennings was inducted into the ": null
    },
    {
        "Country Music Hall of Fame": "country music hall of fame"
    },
    {
        ". In an act of defiance he sent son Buddy Dean Jennings in his place.     On July 42 42 Jennings was inducted to Guitar Centers RockWalk in Hollywood, California.  On June 42 42 Jennings was posthumously awarded the Cliffie Stone Pioneer Award by the ": null
    },
    {
        "Academy of Country Music": "academy of country music"
    },
    {
        ".        Jenningss music had an influence on numerous artists, including ": null
    },
    {
        "Hank Williams Jr.": "hank williams jr."
    },
    {
        ", ": null
    },
    {
        "The Marshall Tucker Band": "the marshall tucker band"
    },
    {
        ", ": null
    },
    {
        "Travis Tritt": "travis tritt"
    },
    {
        ", ": null
    },
    {
        "Steve Earle": "steve earle"
    },
    {
        ", ": null
    },
    {
        "Eric Church": "eric church"
    },
    {
        ", ": null
    },
    {
        "Jamey Johnson": "jamey johnson"
    },
    {
        ", ": null
    },
    {
        "John Anderson": "john anderson"
    },
    {
        ", his son, Shooter Jennings, ": null
    },
    {
        "Sturgill Simpson": "sturgill simpson"
    },
    {
        ", and ": null
    },
    {
        "Hank Williams III": "hank williams iii"
    },
    {
        ". His impact included neotraditionalist and ": null
    },
    {
        "alternative country": "alternative country"
    },
    {
        " musicians.     In 42 the posthumous album  Waylon Forever  was released, which consisted of songs recorded with his then sixteen-year-old son Shooter.     In 42 the three-volume  Waylon: The Music Inside  was released, featuring covers of Jenningss songs by different artists. Also released the same year was  Goin Down Rockin: The Last Recordings , a set of 42 songs recorded by Jennings and bassist ": null
    },
    {
        "Robby Turner": "robby turner"
    },
    {
        " before Jennings death in 42 The songs initially featured only Jennings guitar and vocals, with Turner on bass; further accompaniment was to be added later. Turner completed the recordings in 42 with the help of former Waylors. The Jennings family approved the release. Meanwhile, it launched a new business focused on his estate. Shooter Jennings arranged deals for a clothing line, launched a renewed website, and started talks with different producers on a biographical film.               ": null
    }
]