[
    {
        "The weakfish, Cynoscion regalis, is a marine ": null
    },
    {
        "fish": "fish"
    },
    {
        " of the drum family ": null
    },
    {
        "Sciaenidae": "sciaenidae"
    },
    {
        ".     A medium-large, slender, marine fish, it is found along the east coast of North America. The head and back of this fish are dark brown in color with a greenish tinge. The sides have a faint silvery hue with dusky specks, and the belly is white. The origin of its name is based on the weakness of the mouth muscles, which often cause a hook to tear free, allowing the fish to escape. The weakfish grows to  in length and  in weight. It is found along the eastern coast of North America from ": null
    },
    {
        "Nova Scotia": "nova scotia"
    },
    {
        ", Canada to northern ": null
    },
    {
        "Florida": "florida"
    },
    {
        ", where it is fished both commercially and recreationally.     Weakfish are also known by the American Indian name Squeteague. In the mid-Atlantic states, the fish is sometimes referred to by the name sea trout, though it is not related to the fishes properly called trout, which are in the family Salmonidae.     The weakfish is the ": null
    },
    {
        "state fish": "list of u.s. state fish"
    },
    {
        " of ": null
    },
    {
        "Delaware": "delaware"
    },
    {
        ".       Weakfish stocks have been generally low in recent years due to fishing and natural mortality increasing. Management of the species includes gear regulations, seasonal fishing, ": null
    },
    {
        "bycatch": "bycatch"
    },
    {
        " limitations, minimum size limits, commercial creel limits, and bycatch reduction gear. It is hoped that these regulations incorporated with others will help weakfish populations come back to a sustainable point.       The weakfish  is a salt-water fish native to the mid Atlantic region of the east coast of the United States. Ranging from 4242 inches once fully matured, with some adults reaching well above this range at up to 42 feet and 42 lbs. The weakfish can live up to 42 years but have an average lifespan of 42 to 42 years .       The weakfish prey on a wide variety of species, including, small schooling fish like anchovies and Atlantic Menhaden, assorted crabs, shrimp, mollusks, and even large zooplankton. Weakfish move toward their prey slowly and once upon them they attack aggressively with an open jaw .   Although being a predatory fish and on a higher trophic level the weakfish are also a food source for other larger fish. Some examples of fish that prey on the weakfish include the bluefish, the ": null
    },
    {
        "striped bass": "striped bass"
    },
    {
        ", and the ": null
    },
    {
        "dusky shark": "dusky shark"
    },
    {
        " .       These fish mainly spawn from April to August. This spawning takes place in the shallow waters of estuaries. Their young are in the form of zooplankton, floating freely with the tidal current. They flow with these currents until reaching their nursery area of low salinity rivers. Once these fish grow large enough in these areas, they begin to migrate back to the saltier waters to which they were spawned. They stay in these intertidal bay zone until winter, then join the schooling fish towards deeper offshore waters. The males have the ability to perform a deep croaking sound as shown by the Chesapeake Bay field guide . The reason why these fish have the capability to do this is because they are a part of the drum family. This trait is very common in species that belong to the drum family and is commonly used for mating purposes. It is believed that weakfish also use this to attract other females as stated in a study done at the ": null
    },
    {
        "University of Michigan": "university of michigan"
    }
]