[
    {
        "In ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", weak topology is an alternative term for certain ": null
    },
    {
        "initial topologies": "initial topology"
    },
    {
        ", often on topological vector spaces or spaces of linear operators, for instance on a Hilbert space. The term is most commonly used for the initial topology of a ": null
    },
    {
        "topological vector space": "topological vector space"
    },
    {
        "  with respect to its ": null
    },
    {
        "continuous dual": "continuous dual space"
    },
    {
        ". The remainder of this article will deal with this case, which is one of the concepts of ": null
    },
    {
        "functional analysis": "functional analysis"
    },
    {
        ".     One may call subsets of a topological vector space weakly closed  if they are ": null
    },
    {
        "closed": "closed set"
    },
    {
        "  with respect to the weak topology. Likewise, functions are sometimes called weakly continuous  if they are ": null
    },
    {
        "continuous": "continuous function"
    },
    {
        "  with respect to the weak topology.       Let K be a ": null
    },
    {
        "topological field": "topological field"
    },
    {
        ", namely a ": null
    },
    {
        "field": "field"
    },
    {
        " with a ": null
    },
    {
        "topology": "topological space"
    },
    {
        " such that addition, multiplication, and division are ": null
    },
    {
        "continuous": "continuity"
    },
    {
        ". In most applications K will be either the field of ": null
    },
    {
        "complex numbers": "complex numbers"
    },
    {
        " or the field of ": null
    },
    {
        "real number": "real number"
    },
    {
        "s with the familiar topologies. Let X be a ": null
    },
    {
        "topological vector space": "topological vector space"
    },
    {
        " over K. Namely, X is a K ": null
    },
    {
        "vector space": "vector space"
    },
    {
        " equipped with a ": null
    },
    {
        "topology": "topological space"
    },
    {
        " so that vector addition and ": null
    },
    {
        "scalar multiplication": "scalar multiplication"
    },
    {
        " are continuous.     We may define a possibly different topology on X using the continuous  ": null
    },
    {
        "dual space": "dual space"
    },
    {
        " X . The topological dual space consists of all ": null
    },
    {
        "linear functions": "linear operator"
    },
    {
        " from X into the base field K that are ": null
    },
    {
        "continuous": "continuous function"
    },
    {
        " with respect to the given topology. The weak topology on X is the ": null
    },
    {
        "initial topology": "initial topology"
    },
    {
        "   with respect to the family X . In other words, it is the ": null
    },
    {
        "coarsest": "comparison of topologies"
    },
    {
        " topology on X such that each element of X  remains a ": null
    },
    {
        "continuous function": "continuous function"
    },
    {
        ". In order to distinguish the weak topology from the original topology on X, the original topology is often called the strong topology.     A ": null
    },
    {
        "subbase": "subbase"
    },
    {
        " for the weak topology is the collection of sets of the form & phi; −42  where & phi; & isin; X and U is an open subset of the base field K. In other words, a subset of X is open in the weak topology if and only if it can be written as a union of sets, each of which is an intersection of finitely many sets of the form & phi; −42 .     More generally, if F is a subset of the ": null
    },
    {
        "algebraic dual space": "algebraic dual space"
    },
    {
        ", then the ": null
    },
    {
        "initial topology": "initial topology"
    },
    {
        " of X with respect to F, denoted by & sigma;, is the weak topology with respect to F . If one takes F to be the whole continuous dual space of X, then the weak topology with respect to F coincides with the weak topology defined above.     If the field K has an ": null
    },
    {
        "absolute value": "absolute value"
    },
    {
        "  is induced by the family of   ": null
    },
    {
        "seminorm": "seminorm"
    },
    {
        "s,     : \\|x\\|_f \\overset |f|     for all f & isin;F and x & isin;X. In particular, weak topologies are ": null
    },
    {
        "locally convex": "locally convex space"
    },
    {
        ".   From this point of view, the weak topology is the coarsest ": null
    },
    {
        "polar topology": "polar topology"
    },
    {
        "; see ": null
    },
    {
        "weak topology ": "weak topology"
    },
    {
        " for details. Specifically, if F is a vector space of linear functionals on X which separates points of X, then the continuous dual of X with respect to the topology & sigma; is precisely equal to F .            The weak topology is characterized by the following condition: a ": null
    },
    {
        "net": "net"
    },
    {
        "  in X converges in the weak topology to the element x of X if and only if & phi; converges to & phi; in R or C for all & phi; in X .     In particular, if x n is a ": null
    },
    {
        "sequence": "sequence"
    },
    {
        " in X, then x n converges weakly to x if     : \\varphi \\to \\varphi     as n \\to \\infty for all \\varphi \\in X^\\ast . In this case, it is customary to write     : x_n \\overset x     or, sometimes,     : x_n \\rightharpoonup x.         If X is equipped with the weak topology, then addition and scalar multiplication remain continuous operations, and X is a ": null
    },
    {
        "locally convex topological vector space": "locally convex topological vector space"
    },
    {
        ".     If X is a normed space, then the dual space X is itself a normed vector space by using the norm ǁ & phi;ǁ sup ǁxǁ & le;42 | & phi; strong topology, on X. This is the topology of ": null
    },
    {
        "uniform convergence": "uniform convergence"
    },
    {
        ". The uniform and strong topologies are generally different for other spaces of linear maps; see below.           A space X can be embedded into its ": null
    },
    {
        "double dual": "double dual"
    },
    {
        " X by     : x \\mapsto T_x     where     : T_x \\phi.     Thus T : X & rarr; X is an ": null
    },
    {
        "injective": "injective"
    },
    {
        " linear mapping, though not necessarily ": null
    },
    {
        "surjective": "surjective"
    },
    {
        " . The weak- topology on X is the weak topology induced by the image of T: T & sub; X. In other words, it is the coarsest topology such that the maps T x , defined by T x & phi; from X to the base field R or C remain continuous.       A ": null
    },
    {
        "net": "net"
    },
    {
        " \\phi_ in X is convergent to \\phi in the weak- topology if it converges pointwise:     : \\phi_ \\rightarrow \\phi     for all x in X. In particular, a ": null
    },
    {
        "sequence": "sequence"
    },
    {
        " of \\phi_n & isin; X converges to \\phi provided that     : \\phi_n\\to\\phi     for all x in X. In this case, one writes     : \\phi_n \\overset \\phi     as n & rarr; ∞.     Weak- convergence is sometimes called the simple convergence or the pointwise convergence. Indeed, it coincides with the ": null
    },
    {
        "pointwise convergence": "pointwise convergence"
    },
    {
        " of linear functionals.         By definition, the weak topology is weaker than the weak topology on X. An important fact about the weak topology is the ": null
    },
    {
        "Banach–Alaoglu theorem": "banach–alaoglu theorem"
    },
    {
        ": if X is normed, then the closed unit ball in X is weak-": null
    },
    {
        "compact": "compact space"
    },
    {
        " . Moreover, the closed unit ball in a normed space X is compact in the weak topology if and only if X is ": null
    },
    {
        "reflexive": "reflexive space"
    },
    {
        ".     In more generality, let F be locally compact valued field . Let X be a normed topological vector space over F, compatible with the absolute value in F. Then in X X of continuous F-valued linear functionals on X, all norm-closed balls are compact in the weak- topology.     If a normed space X is separable, then the weak- topology is metrizable on the norm-bounded subsets of X. If X is a ": null
    },
    {
        "Banach space": "banach space"
    },
    {
        ", the weak- topology is not metrizable on all of X X is finite-dimensional. Proposition 42.42 p.  42 in .           Consider, for example, the difference between strong and weak convergence of functions in the ": null
    },
    {
        "Hilbert space": "hilbert space"
    },
    {
        " L 42 ": "lp space"
    },
    {
        ". Strong convergence of a sequence & psi; k & isin;L 42  to an element & psi; means that     : \\int_ |\\psi_k-\\psi |^42\\,\\mu\\, \\to 42     as k & rarr;∞. Here the notion of convergence corresponds to the norm on L 42 .     In contrast weak convergence only demands that     : \\int_ \\bar_k f\\,\\mathrm d\\mu \\to \\int_ \\barf\\, \\mathrm d\\mu     for all functions f & isin;L 42 . For given test functions, the relevant notion of convergence only corresponds to the topology used in C.     For example, in the Hilbert space L 42 , the sequence of functions     : \\psi_k \\sqrt\\sin     form an ": null
    },
    {
        "orthonormal basis": "orthonormal basis"
    },
    {
        ". In particular, the limit of & psi; k as k & rarr;∞ does not exist. On the other hand, by the ": null
    },
    {
        "Riemann–Lebesgue lemma": "riemann–lebesgue lemma"
    },
    {
        ", the weak limit exists and is zero.       One normally obtains spaces of ": null
    },
    {
        "distributions": "distribution"
    },
    {
        " by forming the strong dual of a space of test functions . In an alternative construction of such spaces, one can take the weak dual of a space of test functions inside a Hilbert space such as L 42 . Thus one is led to consider the idea of a ": null
    },
    {
        "rigged Hilbert space": "rigged hilbert space"
    },
    {
        ".       If X and Y are topological vector spaces, the space L of ": null
    },
    {
        "continuous linear operator": "continuous linear operator"
    },
    {
        "s f:X   & rarr;  Y may carry a variety of different possible topologies. The naming of such topologies depends on the kind of topology one is using on the target space Y to define operator convergence . There are, in general, a vast array of possible ": null
    },
    {
        "operator topologies": "operator topology"
    },
    {
        " on L, whose naming is not entirely intuitive.     For example, the  strong operator topology  on L is the topology of pointwise convergence. For instance, if Y is a normed space, then this topology is defined by the seminorms indexed by x & isin;X:     : f\\mapsto \\|f\\|_Y.     More generally, if a family of seminorms Q defines the topology on Y, then the seminorms p q,x on L defining the strong topology are given by     : p_ : f \\mapsto q,     indexed by q & isin;Q and x & isin;X.     In particular, see the ": null
    },
    {
        "weak operator topology": "weak operator topology"
    },
    {
        " and ": null
    },
    {
        "weak operator topology": "weak operator topology"
    }
]