[
    {
        "The ": null
    },
    {
        "mathematical": "mathematics"
    },
    {
        " term well-posed problem stems from a definition given by ": null
    },
    {
        "Jacques Hadamard": "jacques hadamard"
    },
    {
        ". He believed that mathematical models of physical phenomena should have the properties that:   a solution exists,   the solution is unique,   the solutions behavior changes continuously with the initial conditions.     Examples of ": null
    },
    {
        "archetypal": "archetypal"
    },
    {
        " well-posed problems include the ": null
    },
    {
        "Dirichlet problem for Laplaces equation": "laplaces_equationboundary_conditions"
    },
    {
        ", and the ": null
    },
    {
        "heat equation": "heat equation"
    },
    {
        " with specified initial conditions. These might be regarded as natural problems in that there are physical processes modelled by these problems.     Problems that are not well-posed in the sense of Hadamard are termed ill-posed. ": null
    },
    {
        "Inverse problem": "inverse problem"
    },
    {
        "s are often ill-posed. For example, the inverse heat equation, deducing a previous distribution of temperature from final data, is not well-posed in that the solution is highly sensitive to changes in the final data.     Continuum models must often be ": null
    },
    {
        "discretized": "discretization"
    },
    {
        " in order to obtain a numerical solution. While solutions may be continuous with respect to the initial conditions, they may suffer from ": null
    },
    {
        "numerical instability": "numerical instability"
    },
    {
        " when solved with finite precision, or with errors in the data. Even if a problem is well-posed, it may still be ill-conditioned, meaning that a small error in the initial data can result in much larger errors in the answers. Problems in nonlinear ": null
    },
    {
        "complex systems": "complex systems"
    },
    {
        " provide well-known examples of instability. An ill-conditioned problem is indicated by a large ": null
    },
    {
        "condition number": "condition number"
    },
    {
        ".     If the problem is well-posed, then it stands a good chance of solution on a computer using a ": null
    },
    {
        "stable algorithm": "numerical stability"
    },
    {
        ". If it is not well-posed, it needs to be re-formulated for numerical treatment. Typically this involves including additional assumptions, such as smoothness of solution. This process is known as  regularization . ": null
    },
    {
        "Tikhonov regularization": "tikhonov regularization"
    }
]