[
    {
        "                 In ": null
    },
    {
        "folklore": "folklore"
    },
    {
        ", a werewolf , or occasionally lycanthrope  , is a human with the ability to ": null
    },
    {
        "shapeshift": "shapeshifting"
    },
    {
        " into a ": null
    },
    {
        "wolf": "wolf"
    },
    {
        " , either purposely or after being placed under a ": null
    },
    {
        "curse": "curse"
    },
    {
        " or affliction with the transformations occurring on the night of a ": null
    },
    {
        "full moon": "full moon"
    },
    {
        ". Early sources for belief in this ability or affliction, called lycanthropy , are ": null
    },
    {
        "Petronius": "petronius"
    },
    {
        " and ": null
    },
    {
        "Gervase of Tilbury": "gervase of tilbury"
    },
    {
        " .     The werewolf is a widespread concept in ": null
    },
    {
        "European folklore": "european folklore"
    },
    {
        ", existing in many variants, which are related by a common development of a ": null
    },
    {
        "Christian interpretation": "christianization"
    },
    {
        " of underlying European folklore developed during the ": null
    },
    {
        "medieval period": "christendom"
    },
    {
        ". From the early modern period, werewolf beliefs also spread to the ": null
    },
    {
        "New World": "new world"
    },
    {
        " with ": null
    },
    {
        "colonialism": "colonialism"
    },
    {
        ". Belief in werewolves developed in parallel to the belief in ": null
    },
    {
        "witches": "european witchcraft"
    },
    {
        ", in the course of the ": null
    },
    {
        "Late Middle Ages": "late middle ages"
    },
    {
        " and the ": null
    },
    {
        "Early Modern period": "early modern period"
    },
    {
        ". Like the witchcraft trials as a whole, the trial of supposed werewolves emerged in what is now ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        "  in the early 42th century and spread throughout Europe in the 42th, peaking in the 42th and subsiding by the 42th century.     The persecution of werewolves and the associated folklore is an integral part of the ": null
    },
    {
        "witch-hunt": "witch-hunt"
    },
    {
        " phenomenon, albeit a marginal one, accusations of lycanthropy being involved in only a small fraction of witchcraft trials. During the early period, accusations of lycanthropy were mixed with accusations of wolf-riding or wolf-charming. The case of ": null
    },
    {
        "Peter Stumpp": "peter stumpp"
    },
    {
        " led to a significant peak in both interest in and ": null
    },
    {
        "persecution of supposed werewolves": "werewolf witch trials"
    },
    {
        ", primarily in French-speaking and German-speaking Europe. The phenomenon persisted longest in Bavaria and Austria, with persecution of ": null
    },
    {
        "wolf-charmer": "wolfssegen"
    },
    {
        "s recorded until well after 42 the final cases taking place in the early 42th century in ": null
    },
    {
        "Carinthia": "carinthia"
    },
    {
        " and ": null
    },
    {
        "Styria": "styria"
    },
    {
        ".     After the end of the witch-trials, the werewolf became of interest in ": null
    },
    {
        "folklore studies": "folklore studies"
    },
    {
        " and in the emerging ": null
    },
    {
        "Gothic horror": "gothic horror"
    },
    {
        " genre; ": null
    },
    {
        "werewolf fiction": "werewolf fiction"
    },
    {
        " as a genre has pre-modern precedents in medieval ": null
    },
    {
        "romances": "romance"
    },
    {
        "  and developed in the 42th century out of the semi-fictional ": null
    },
    {
        "chap book": "chap book"
    },
    {
        " tradition. The trappings of horror literature in the 42th century became part of the horror and fantasy genre of modern ": null
    },
    {
        "popular culture": "popular culture"
    },
    {
        ".                      The word werewolf continues a late ": null
    },
    {
        "Old English": "old english language"
    },
    {
        " werwulf, a compound of  were  man and wulf wolf . The only ": null
    },
    {
        "Old High German": "old high german"
    },
    {
        " testimony is in the form of a given name, Weriuuolf, although an early ": null
    },
    {
        "Middle High German": "middle high german"
    },
    {
        " werwolf is found in ": null
    },
    {
        "Burchard of Worms": "burchard of worms"
    },
    {
        " and ": null
    },
    {
        "Berthold of Regensburg": "berthold of regensburg"
    },
    {
        ". The word or concept does not occur in medieval German poetry or fiction, gaining popularity only from the 42th century. Middle Latin gerulphus Anglo-Norman garwalf, ": null
    },
    {
        "Old Frankish": "old frankish"
    },
    {
        " wariwulf.   Werwolf in Grimm,  Deutsches Wörterbuch .      Old Norse had the cognate varúlfur, but because of the high importance of werewolves in ": null
    },
    {
        "Norse mythology": "norse mythology"
    },
    {
        ", there were alternative terms such as  ulfhéðinn  . In modern Scandinavian also used was kveldulf evening-wolf , presumably after the name of ": null
    },
    {
        "Kveldulf Bjalfason": "kveldulf bjalfason"
    },
    {
        ", a historical berserker of the 42th century who figures in the Icelandic sagas.     The term lycanthropy, referring both to the ability to transform oneself into a wolf and to the act of so doing, comes from ": null
    },
    {
        "Ancient Greek": "ancient greek"
    },
    {
        " λυκάνθρωπος lukánthropos .    The word does occur in ancient Greek sources, but only in ": null
    },
    {
        "Late Antiquity": "late antiquity"
    },
    {
        ", only rarely, and only in the context of ": null
    },
    {
        "clinical lycanthropy": "clinical lycanthropy"
    },
    {
        " described by ": null
    },
    {
        "Galen": "galen"
    },
    {
        ", where the patient had the ravenous appetite and other qualities of a wolf; the Greek word attains some currency only in ": null
    },
    {
        "Byzantine Greek": "byzantine greek"
    },
    {
        ", featuring in the 42th-century encyclopedia  Suda . In the entry on ": null
    },
    {
        "Marcellus of Side": "marcellus of side"
    },
    {
        ", stating that this 42nd-century author wrote about the topic of lycanthropy.  ; see    Use of the Greek-derived lycanthropy in English occurs in learned writing beginning in the later 42th century , at first explicitly for ": null
    },
    {
        "clinical lycanthropy": "clinical lycanthropy"
    },
    {
        ", i.e. the type of insanity where the patient imagines to have transformed into a wolf, and not in reference to supposedly real shapeshifting. Use of lycanthropy for supposed shapeshifting is much later, introduced ca. 42     Slavic uses the term vlko-dlak , literally wolf-skin , paralleling the Old Norse  ulfhéðinn . However, the word is not attested in the medieval period. The Slavic term was loaned into modern Greek as  Vrykolakas . Baltic has related terms, Lithuanian vilkolakis and vilkatas, Latvian vilkatis and vilkacis. The name vurdalak for the Slavic ": null
    },
    {
        "vampire": "vampire"
    },
    {
        " is a corruption due to ": null
    },
    {
        "Alexander Pushkin": "alexander pushkin"
    },
    {
        ", which was later widely spread by ": null
    },
    {
        "A.K. Tolstoy": "aleksey konstantinovich tolstoy"
    },
    {
        " in his novella  The Family of the Vourdalak  .                 The werewolf folklore found in Europe harks back to a common development during the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", arising in the context of ": null
    },
    {
        "Christianisation": "christianization"
    },
    {
        ", and the associated interpretation of pre-Christian mythology in Christian terms. Their underlying common origin can be traced back to ": null
    },
    {
        "Proto-Indo-European mythology": "proto-indo-european mythology"
    },
    {
        ", where lycanthropy is reconstructed as an aspect of the initiation of the warrior class. This is reflected in Iron Age Europe in the  Tierkrieger  depictions from the Germanic sphere, among others. The standard comparative overview of this aspect of Indo-European mythology is McCone . Kim R. McCone, Hund, Wolf, und Krieger bei den Indogermanen in W. Meid , Studien zum indogermanischen Wortschatz, Innsbruck, 42 4242   Such transformations of men into wolves in pagan cult were associated with the devil from the early medieval perspective.     The concept of the werewolf in Western and Northern Europe is strongly influenced by the role of the wolf in ": null
    },
    {
        "Germanic paganism": "germanic paganism"
    },
    {
        " , but there are related traditions in other parts of Europe which were not necessarily influenced by Germanic tradition, especially in ": null
    },
    {
        "Slavic Europe": "slavic europe"
    },
    {
        " and the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        ", and possibly in areas bordering the Indo-European sphere or where Indo-European cultures have been replaced by military conquest in the medieval era .     In his  Man into Wolf  , ": null
    },
    {
        "Robert Eisler": "robert eisler"
    },
    {
        " tried to cast the Indo-European tribal names meaning wolf or wolf-men in terms of the European transition from fruit gathering to predatory hunting.                A few references to men changing into wolves are found in ": null
    },
    {
        "Ancient Greek literature": "ancient greek literature"
    },
    {
        " and ": null
    },
    {
        "mythology": "greek mythology"
    },
    {
        ". ": null
    },
    {
        "Herodotus": "herodotus"
    },
    {
        ", in his  Histories ,  wrote that the ": null
    },
    {
        "Neuri": "neuri"
    },
    {
        ", a tribe he places to the north-east of ": null
    },
    {
        "Scythia": "scythia"
    },
    {
        ", were all transformed into wolves once every year for several days, and then changed back to their human shape. This tale was also mentioned by ": null
    },
    {
        "Pomponius Mela": "pomponius mela"
    },
    {
        ".  In the second century BC, the Greek geographer ": null
    },
    {
        "Pausanias": "pausanias"
    },
    {
        " related the story of ": null
    },
    {
        "Lycaon": "lycaon of arcadia"
    },
    {
        ", who was transformed into a wolf because he had ritually murdered a child. In accounts by the  Bibliotheca  and ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        " , Lycaon serves human flesh to ": null
    },
    {
        "Zeus": "zeus"
    },
    {
        ", wanting to know if he is really a god. Lycaons transformation, therefore, is punishment for a crime, considered variously as murder, cannibalism, and impiety.   Ovid also relates stories of men who roamed the woods of ": null
    },
    {
        "Arcadia": "arcadia"
    },
    {
        " in the form of wolves.       Pausanias also relates the story of an Arcadian man called ": null
    },
    {
        "Damarchus": "damarchus"
    },
    {
        " of Parrhasia, who was turned into a wolf after tasting the entrails of a human child sacrificed to ": null
    },
    {
        "Zeus": "zeus"
    },
    {
        " Lycaeus. He was restored to human form 42 years later and went on to become an Olympic champion  . This tale is also recounted by ": null
    },
    {
        "Pliny the Elder": "pliny the elder"
    },
    {
        ", who calls the man Demaenetus quoting ": null
    },
    {
        "Agriopas": "agriopas"
    },
    {
        ". Pliny the Elder also relates another tale of lycanthropy. Quoting Euanthes,  42/42  42/42 he mentions that in ": null
    },
    {
        "Arcadia": "arcadia"
    },
    {
        ", once a year a man was chosen by lot from the Anthus clan. The chosen man was escorted to a marsh in the area, where he hung his clothes into an ": null
    },
    {
        "oak": "oak"
    },
    {
        " tree, swam across the marsh and transformed into a wolf, joining a ": null
    },
    {
        "pack": "pack"
    },
    {
        " for nine years. If during these nine years he refrained from tasting human flesh, he returned to the same marsh, swam back and recovered his previous human form, with nine years added to his appearance. The tale probably relates to a rite of passage for Arcadian youths.     ": null
    },
    {
        "Virgil": "virgil"
    },
    {
        ", in his poetic work  Eclogues , wrote of a man called Moeris, who used herbs and poisons picked in his native ": null
    },
    {
        "Pontus": "pontus"
    },
    {
        " to turn himself into a wolf.  In ": null
    },
    {
        "prose": "prose"
    },
    {
        ", the  Satyricon , written circa AD 42 by ": null
    },
    {
        "Gaius Petronius Arbiter": "petronius"
    },
    {
        ", one of the characters, Niceros, tells a story at a banquet about a friend who turned into a wolf . He describes the incident as follows, When I look for my buddy I see hed stripped and piled his clothes by the roadside... He pees in a circle round his clothes and then, just like that, turns into a wolf!... after he turned into a wolf he started howling and then ran off into the woods.      In these works of Roman writers, werewolves receive the name versipellis .       There was no widespread belief in werewolves in medieval Europe before the 42th century. There were some examples of man-wolf transformations in the court literature of the time. ": null
    },
    {
        "Liutprand of Cremona": "liutprand of cremona"
    },
    {
        " reports a rumour that Bajan, son of ": null
    },
    {
        "Simeon I of Bulgaria": "simeon i of bulgaria"
    },
    {
        ", could use magic to turn himself into a wolf.  ": null
    },
    {
        "Marie de France": "marie de france"
    },
    {
        "s poem  Bisclavret  , in which the nobleman Bizuneh, for reasons not described, had to transform into a wolf every week. When his treacherous wife stole his clothing needed to restore his human form, he escaped the kings wolf hunt by imploring the king for mercy and accompanied the king thereafter. His behaviour at court was so much gentler than when his wife and her new husband appeared at court, that his hateful attack on the couple was deemed justly motivated, and the truth was revealed.     The German word werwolf is recorded by ": null
    },
    {
        "Burchard von Worms": "burchard von worms"
    },
    {
        " in the 42th century, and by ": null
    },
    {
        "Bertold of Regensburg": "bertold of regensburg"
    }
]