[
    {
        "   Wervik is a ": null
    },
    {
        "municipality": "municipality"
    },
    {
        " located in the ": null
    },
    {
        "Belgian": "belgium"
    },
    {
        " province of ": null
    },
    {
        "West Flanders": "west flanders"
    },
    {
        ". The municipality comprises the city of Wervik and the town of ": null
    },
    {
        "Geluwe": "geluwe"
    },
    {
        ". On January 42 42 Wervik had a total population of 42. The total area is 42  km² which gives a ": null
    },
    {
        "population density": "population density"
    },
    {
        " of 42 inhabitants per km². The area is famous for its excellent tobacco and has a tobacco museum. The town is separated from its ": null
    },
    {
        "French": "france"
    },
    {
        " counterpart ": null
    },
    {
        "Wervicq-Sud": "wervicq-sud"
    },
    {
        " by the river ": null
    },
    {
        "Leie": "leie"
    },
    {
        ".       Wervik is one of the oldest towns in Belgium.         Stone Age artefacts, flint axes and spearheads, were found in the district of Bas-Flanders and the site Oosthove. The archeological excavations at de Pioneer in 42 yielded traces of inhabitation from the Iron Age to the Roman Period.         Wervik was probably a settlement of the Menapians led by the chief Virovos, at a small height along the banks of the Lys . This is still unproven. At the time of the conquest of Gaul by Caesar, a Roman stopping place was built next to the Celtic village. The Roman settlement was registered on Roman road maps from the 42rd to 42th century under the name Viroviacum or Virovino . Vioviacum was located on the Roman road between ": null
    },
    {
        "Cassel": "cassel, nord"
    },
    {
        " and ": null
    },
    {
        "Bavay": "bavay"
    },
    {
        ". Remains from that period are still being found regularly in Wervik. Excavations at Saint Martins Square in the centre exposed the foundations of the old Saint Martins church, which was partly built with Roman waste materials. According to some historians this was formerly a temple dedicated to ": null
    },
    {
        "Mars": "mars"
    },
    {
        " or ": null
    },
    {
        "Priapus": "priapus"
    },
    {
        ". This is still unproven.         In the 42th century the population of Belgium rose sharply, thanks to the great heyday of the textile trade which penetrated international markets up to the Far East. In 42 the city was taken by ": null
    },
    {
        "Philip of Valois": "philip of valois, duke of orléans"
    },
    {
        " and partially destroyed.     During the Ghent uprising of 42 Wervik was an outpost of the army of ": null
    },
    {
        "Philip van Artevelde": "philip van artevelde"
    },
    {
        " during the ": null
    },
    {
        "Battle of Westrozebeke": "battle of roosebeke"
    },
    {
        ". The rebellion failed, and the city was plundered by the ": null
    },
    {
        "Bretons": "bretons"
    },
    {
        " and reduced to ashes. The Saint Medardus church had to be rebuilt completely. Wervik had not yet fully recovered when a major fire in 42 destroyed the whole town again. Of the 42 dwellings there only 42 remained. ": null
    },
    {
        "Jan Zonder Vrees": "john the fearless"
    },
    {
        " gave Wervik a market hall in 42 as an incentive for recovery and revival. In 42 part of the garrison of Calais invaded Wervik and again burnt the town to ashes, in 42 the town was burnt again. The many successive fires were mainly because most houses were built of wood and straw, and that the town had no protection against attacks as it was never walled. After the succession of fires the town was attacked by the plague. In the years 42 and 42 the population was decimated by the epidemic.          In the middle of the 42th century finally a quieter period began for Wervik. Prosperity had vanished and the population had dropped to about 42 inhabitants. During the religious quarrels, the Saint Medardus church was badly damaged and today still bears the traces of the iconoclastic. The ": null
    },
    {
        "Geuzen": "geuzen"
    },
    {
        " burnt the church in 42     In the 42th century the entire region was affected by the ongoing annexation attempts of the French king ": null
    },
    {
        "Louis XIV": "louis xiv"
    },
    {
        ". Wervik was taken by the French in 42 and was later annexed to the ": null
    },
    {
        "Spanish crown": "spanish empire"
    },
    {
        " in 42 After the ": null
    },
    {
        "Peace of Nijmegen treaty": "treaties of nijmegen"
    },
    {
        " in that year, Wervik became French territory again. The continuous impoverishment of the town left it with only 42 inhabitants.     In 42 the town was divided in half by the ": null
    },
    {
        "Treaty of Utrecht": "treaty of utrecht"
    },
    {
        ". The river ": null
    },
    {
        "Lys": "leie"
    },
    {
        " was the state border and separated the town into ": null
    },
    {
        "French": "france"
    },
    {
        " Zuid-Wervik": "wervicq-sud"
    },
    {
        " and ": null
    },
    {
        "Austria": "austria"
    },
    {
        "n Wervik. But for the population the town remained whole, and the Saint Medardus church remained the parish church for both town parts.         After the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " and the ": null
    },
    {
        "French invasion of 42": "flanders campaign"
    },
    {
        ", the Saint Medardus church was again turned into ashes. During the ": null
    },
    {
        "War of the First Coalition": "war of the first coalition"
    },
    {
        " the ": null
    },
    {
        "battle of Wervik and Menin": "battle of menin"
    },
    {
        " partly took place here between the ": null
    },
    {
        "Dutch": "dutch republic"
    },
    {
        " and ": null
    },
    {
        "French revolutionary": "dutch republic"
    },
    {
        " armies, during which the young ": null
    },
    {
        "Prince Frederick of Orange-Nassau": "prince frederick of orange-nassau"
    },
    {
        " was wounded. Wervik became part of the French département of Lys, and entered a period of terror, coercion and persecution.         After the ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        " in 42 the town became part of the ": null
    },
    {
        "United Kingdom of the Netherlands": "united kingdom of the netherlands"
    },
    {
        " until the ": null
    },
    {
        "Belgian Revolution": "belgian revolution"
    },
    {
        " in 42 After the Belgian Revolution locals of the towns ": null
    },
    {
        "Zuid-Wervik": "wervicq-sud"
    },
    {
        ", ": null
    },
    {
        "Busbeke": "bousbecque"
    },
    {
        ", ": null
    },
    {
        "Comines": "comines, nord"
    },
    {
        " and ": null
    },
    {
        "Waasten": "warneton"
    },
    {
        " protested and demanded a reunification with their ": null
    },
    {
        "Belgian": "belgium"
    },
    {
        " counterparts on the other side of the Lys. This small uprising was put down after a few days by French ": null
    },
    {
        "Gendarmes": "gendarmerie nationale"
    },
    {
        ".        During ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " German troops": "german army"
    },
    {
        " entered the town on October 42 42 A ": null
    },
    {
        "customs": "customs"
    },
    {
        " officer had noticed German ": null
    },
    {
        "Uhlan": "uhlan"
    },
    {
        "s in Zuid-Wervik on October 42 and turned the swing bridge between Wervik and Zuid-Wervik open so that no one could cross it, throwing the key in the Lys. The next day more Germans had arrived and fished out the key. After a short fight with the ": null
    },
    {
        "Gendarmerie": "gendarmerie"
    },
    {
        " , the town was conquered by the Germans. Because Wervik was the first major town under German control just outside the ": null
    },
    {
        "Western Front": "western front"
    },
    {
        ", it got a military government and German soldiers were billeted there, and wounded soldiers cared for . Werviks population was forced to work in German operated factories serving the trench warfare. In 42 the population had to evacuate the town because British guns were aimed at Wervik and ruined the town.     Wervik was largely rebuilt after the war. The Bruges architect Huib Hoste carried out several projects, including several rows of houses, commercial buildings and the town sewers.     During the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        " Wervik was again occupied by German troops, until the inhabitants were freed in 42 by Canadian soldiers.        ": null
    },
    {
        "Yves Leterme": "yves leterme"
    },
    {
        ", Prime Minister of Belgium   ": null
    },
    {
        "Wim Delvoye": "wim delvoye"
    },
    {
        ", artist   ": null
    },
    {
        "Ronny Coutteure": "ronny coutteure"
    },
    {
        ", actor   ": null
    },
    {
        "Joseph Demuysere": "joseph demuysere"
    },
    {
        ", cyclist, winner of ": null
    },
    {
        "Milan–San Remo": "milan–san remo"
    },
    {
        " Sam Bennett": "sam bennett"
    }
]