[
    {
        "In relativistic ": null
    },
    {
        "cosmology": "physical cosmology"
    },
    {
        ", Weyls postulate stipulates that in a ": null
    },
    {
        "fluid": "fluid solution"
    },
    {
        " cosmological model, the ": null
    },
    {
        "world line": "world line"
    },
    {
        "s of the fluid particles, which act as the source of the gravitational field and which are often taken to model ": null
    },
    {
        "galaxies": "galaxies"
    },
    {
        ", should be hypersurface orthogonal. That is, the world lines should be everywhere ": null
    },
    {
        "orthogonal": "orthogonal"
    },
    {
        " to a family of spatial ": null
    },
    {
        "hyperslice": "hyperslice"
    },
    {
        "s.     Sometimes, the additional hypothesis is added that the world lines form timelike ": null
    },
    {
        "geodesic": "geodesic"
    },
    {
        "s.         In the ": null
    },
    {
        "ADM formalism": "adm formalism"
    },
    {
        " we introduce a family of spatial hyperslices. This allows us to think of the geometry of space as evolving over time . This is an attractive viewpoint, but in general no such family of hyperslices will be physically preferred. The Weyl hypothesis can be understood as the assumption that we should consider only cosmological models in which there is such a preferred slicing, namely the one given by taking the unique hyperslices orthogonal to the world lines of the fluid particles.     One consequence of this hypothesis is that if it holds true, we can introduce a ": null
    },
    {
        "comoving chart": "comoving coordinates"
    },
    {
        " such that the ": null
    },
    {
        "metric tensor": "metric tensor"
    },
    {
        " contains no terms of form dt dx, dt dy, or dt dz.     The additional hypothesis that the world lines of the fluid particles be geodesics is equivalent to assuming that no body forces act within the fluid. In other words, the fluid has zero pressure, so that we are considering a ": null
    },
    {
        "dust solution": "dust solution"
    },
    {
        ".         The condition that the ": null
    },
    {
        "congruence": "congruence"
    },
    {
        " corresponding to the fluid particles should be hypersurface orthogonal is by no means assured. A generic congruence does not possess this property, which is in fact mathematically equivalent to stipulating that the congruence of world lines should be vorticity-free. That is, they should not be twisting about one another, or in other words, the fluid elements should not be swirling about their neighbors in the manner of the fluid particles in a stirred cup of coffee. ": null
    }
]