[
    {
        "     A Weyr  is a collection of ": null
    },
    {
        "dragons": "dragons"
    },
    {
        ", their riders and support staff in ": null
    },
    {
        "Anne McCaffrey": "anne mccaffrey"
    },
    {
        "s fictional world of ": null
    },
    {
        "Pern": "pern"
    },
    {
        ".     The function of a Weyr is to fight ": null
    },
    {
        "Thread": "thread"
    },
    {
        ", a spore that originates in the ": null
    },
    {
        "Oort cloud": "oort cloud"
    },
    {
        " of the Rukbat solar system, carried by a planetoid referred to as the Red Star with a loose elliptical orbit. The time during which Thread falls is called a Pass. These Passes last about 42  years, usually with a break of 42  years between, although extended periods have been known to occur due to orbital mechanics.       Weyrs are also the physical spaces in which dragons, their riders and support staff reside. Weyrs are usually built into the cliff faces of ancient volcanic ": null
    },
    {
        "caldera": "caldera"
    },
    {
        "s. Many of the living spaces are in natural cave systems within the cliff walls, but in early Passes when the colonists still had technology, plasma cutters were used to create extended systems and additional caves to meet the needs of the growing numbers of dragons. There are six ancient Weyrs as of beginning of the 42th Pass.     Two additional Weyrs were built during the 42th Pass in the Southern Continent, on ground level with sand wallows instead of caves for dragons and built-structures for the use of human residents of the Weyr. A third new Weyr is planned as of the last book.     Each Weyr has a Weyrbowl which includes a holding area for fodder for the dragons, i.e. fattened herdbeasts , a lake or cove , Starstones to predict a coming Pass as well as many large grassy areas and ledges for dragons to sun themselves.     An individual dragons weyr consists of a ledge for landing and sunning, a cavern with a couch , or raised stone bed for the dragon and sleeping and storage areas for the rider. Some weyrs include a separate alcove for a riders living area, but smaller weyrs have only enough space for a rider to hang a hammock near his dragon and store his gear on hooks. Most weyrs do not have access by foot, the only access being by dragonwing.     Weyrs for goldriders are located near ground level with stairs or tunnel access to the ground or Lower Caverns so that goldriders can still access their weyrs while their dragons are on the Hatching Grounds with their eggs. The Weyrwomans chambers in particular are extensive, connecting to her office, a large meeting room and the records room. A few have large, private baths heated by a ": null
    },
    {
        "hypocaust": "hypocaust"
    },
    {
        " system.     The Lower Caverns are an extensive series of caverns with easy entrance by foot. They contain common use areas such as lounging and recreation areas for riders, kitchens and dining areas, bathing pools, storage areas for supplies, living quarters for support staff, children , crafters and more. They also contain special quarters for riders who are involved in mating flights, as their private weyrs are often inaccessible from the ground.       The plural Weyrleaders typically refers to the Weyrwoman as well as the Weyrleader, though in some contexts it may refer to a council of Weyrleaders, a conference among the military leaders of the Weyrs. Until the 42th Pass the Weyrwomen were usually not invited or welcome at such meetings or conferences.       The domestic head of the Weyr is the Weyrwoman, the rider of the ranking gold in the Weyr. If the Weyrwoman dies, or if her dragon ceases to mate due to old age or serious injury, the rider of the next gold to rise to mate will take the position. Though she and her gold are called senior pair they are senior in rank, not necessarily in age or in experience.     The Weyrwoman is in charge of all matters that pertain to housing, food, the raising of children living in the Weyr, training, organization and discipline of the support staff of the Weyr, as well as the day-to-day living requirements of the dragons and their riders. The Weyrwoman is also a diplomatic ambassador, responsible for relations to other Weyrs, Holds and the Crafthalls. Most of her duties are administrative, delegating responsibilities to her Headwoman or junior goldriders.     The Headwoman is the Weyrwomans primary assistant. The Headwoman is responsible for implementing the Weyrwomans orders regarding management of the Lower Caverns, where the bulk of the support staff live and work. She is in charge of the cook staff, the cleaning staff, maintenance staff and the Fostering staff. She wields a great deal of power inside of the Weyr.     Retired goldriders often remain in the Weyr as an assistant or advisor to the Weyrwoman. They are sometimes designated to represent the Weyrwoman in the Weyrwomans absence.     Junior goldriders are also assistants to the Weyrwoman. All dragons will obey the orders of a queen, unless they contradict the orders of the senior gold. Because of this, all goldriders must act as leaders. The junior goldriders are typically assigned to record keeping, lower level diplomatic duties, training gold weyrling pairs and fostering teenage girls who are likely to rise to a leadership position within the Weyr. This provides them with important experience for future leadership positions, as each junior pair has the chance to become Weyrwoman on very short notice.       The military side of the Weyr is headed by the Weyrleader. Weyrleadership is determined by the mating flights of the senior queen. The rider of whichever bronze catches her becomes the Weyrleader. The Weyrleader is in charge of making sure that the fighting wings are up to strength and well-trained. he also determines the strategy for threadfighting. The turnover of Weyrleadership varies greatly.     Wingleaders each lead a wing of 4242 dragons. Each Wingleader has two Wingseconds who may be brownriders or young bronzeriders in training to be a Wingleader. The Wingleaders are technically equal in rank, but as seen in ": null
    },
    {
        "Dragonflight": "dragonflight"
    },
    {
        " some Wingleaders have more power within a Weyr than others, based on their relationship with the Weyrleader.     One of the most important ranks in the Weyr, below the Weyrleaders and Wingleaders, is that of the Weyrlingmaster. He is in charge of the training and discipline of the young dragonpairs known as weyrlings. While under his care, weyrlings learn everything from basic dragon husbandry to advanced threadfighting techniques. The Weyrlingmaster must be appointed by the Weyrleaders. The Weyrlingmaster must have a good deal of experience, and thick skin, because as many as 42% of all Weyrlings can die before the end of their training. Weyrlingmasters are usually bronzeriders, though highly respected and very senior brown or blueriders are sometimes assigned to the position.       Leadership is determined through chance. The first gold dragon to rise for the mate flight after the previous Weyrwomans gold dragon has died or ceased to mate becomes Weyrwoman; the rider of the bronze dragon that catches that dragon becomes Weyrleader. This system was established by the first Weyrleader, Sean Connell, in the short story ": null
    },
    {
        "The Second Weyr": "the second weyr"
    },
    {
        ". This system can produce inept or otherwise unsatisfactory leadership. There is no way to remove a bad Weyrwoman and the only way to replace a Weyrleader is for a different bronze to fly the Weyrwomans gold dragon. During an Interval, it may be as long as a decade between mating flights.     When a new Weyr is opened the first among the newly assigned gold dragons to rise to mate becomes the first Senior gold at that Weyr and the rider of the bronze that catches her is the new Weyrleader. Often when the golds are assigned to the Weyr they assign only a single gold at first, to insure the chosen leadership, or they wait until the chosen goldriders dragon is about to rise to mate to assign golds to the new Weyr.     A retiring Weyrwoman may choose her successor by timing her retirement to occur just before her chosen successors dragon is about to rise to mate. However, this may not be possible if her choice of successor is not going to rise to mate in a reasonable amount of time. A Weyrwoman who fails to retire in a reasonable amount of time after her gold has failed to rise to mate may be forced to step down by force of the junior goldriders, the bronzeriders and/or the weyrfolk. This method of choosing a successor is also no guarantee of a quality replacement, as the Weyrwoman herself may choose her successor based on ": null
    },
    {
        "cronyism": "cronyism"
    },
    {
        ", personal bias against an otherwise capable goldrider or on poorly thought-out criteria.     If a Weyrleader dies in office the Wingleaders rule by committee until the Weyrwomans gold rises to mate. However, in the book ": null
    },
    {
        "Dragonquest": "dragonquest"
    },
    {
        " when a Weyrleader is incapacitated the Weyrwoman Mardra takes his place in the Wings, an action met with shock and outrage by other Weyrs.     Wingleaders and Wingseconds are chosen though merit, though in canon stories only bronzeriders are considered for Wingleader and only bronze and brownriders for Wingsecond.   New Wingleaders are selected by The Weyrleader, advised by existing Wingleaders.   Wingseconds are chosen by the Wingleader from among his wingriders, though with permission he might be able to recruit a promising rider from another Wing.       The fighting units of dragons are organized in groups known as Wings. A collection of three Wings is known as a Flight, and is the largest permanent organizational structure within a Weyr.     A Wing is led by a Wingleader. The Wingleader is responsible for ensuring that his Wing is capable of safely fighting thread. He also appoints Wingseconds and recruits newly graduated weyrlings. Ideally a Wing has two Wingseconds, which are also typically bronze or brown dragons. They fill the Wingleader’s position in the case of an emergency, and help to convey the Wingleader’s orders to the rest of the Wingriders. A healthy Wing contains thirty Wingriders and their dragons, of which more than 42/42 are blue or green. The smaller blue and green dragons do not have the stamina to safely fly an entire threadfall and must be rotated out in two or three shifts. If a Wing falls to fewer than 42 healthy dragon/rider pairs, the Wing is disbanded and absorbed by other Wings.       The capacity of a Weyr varies from 42 to 42 dragons. However, during a Pass the dragonriders duties leave little time for any other activity, so each Weyr has a large support staff that can number into the thousands.     Residents of a Weyr include:   ; Dragonriders   : Living in weyrs , usually in the cliff faces in Northern Weyrs.   ; Weyrlings   : Young, immature dragons and their riders. Young dragons generally fly for the first time at about one Turn and train with the Weyrling Wing until mature enough to join a Fighting Wing, usually between 42½ and 42 Turns. Weyrling dragonriders may not join a Wing until age 42 no matter how mature their dragon. Weyrling riders who have completed training but are not yet Turned 42 are often assigned messenger or sentry duties until they come of age. They do not have adult level rank/status until they have been accepted into a Fighting Wing.   ; Lower Caverns staff   : Often, but not always, the Candidates who failed to Impress a dragon, or those who have run away from home to live in the more liberal, accepting atmosphere of the Weyr. Lower Cavern staff are often the grown children of dragonriders. This includes cooks, servers, cleaning staff for common areas, those who care for the beasts that will feed the dragons, and many others. Lower Caverns workers often satisfy the sexual needs of riders who have lost a mating flight. They are led and organized by a headwoman, who is usually ranked just under the weyrleaders in authority.   ; Weyrbrats   : The children who are born in the Weyr are called Weyrbrats. Weyrbrats may be the children of Dragonriders, Lower Cavern staff or Crafters. It is the tradition in the Weyr that children are not raised by their natural parents, as dragonrider parents do not have time to raise a child while caring for a dragon. This community model also serves to reduce parental favoritism. Children are Fostered as soon as they are weaned from their mothers milk, and initially sent to the Weyrs creche. Once the child has grown to show distinct personality and talents, they are matched with a Fosterer who suits the childs temperament. Every male Weyrbrat has the right to become a Candidate and stand for Impression at age 42 Female Weyrbrats may become Candidates if there is a gold egg in the Hatching Grounds. By the end of the Ninth Pass, female Greenriders have become more common, so female Weyrbrats may be allowed to join the ranks of Candidates even if there is no gold egg in more progressive Weyrs.   ; Candidates   : Young people who are given the opportunity to become a dragonrider. They are chosen through Search, where a sensitive dragon, usually a blue or green, seeks mentally sensitive boys and girls who are of the correct temperament to match minds with a dragon hatchling. Usually those searched are young males, aged 42–42 although older girls are sometimes searched if there is a gold egg available. With the addition of any Weyrbrat aged 42–42 the Searched are familiarized with the eggs and are present when the eggs hatch. The Hatchlings choose, or ": null
    },
    {
        "Impress": "impression"
    },
    {
        " a Candidate who suits his or her temperamental and/or other needs. The minimum age of the Candidates is decided by the Weyrleaders and may be changed according to the Weyrs needs. If there is a greater need for older more responsible riders, the age may be pushed back, if there is a lack of Candidates, the age may be lowered. The minimum age may also be changed depending on whether Pern is experiencing Fall or Pass. The youngest anyone has Impressed a dragon is aged 42 , the oldest seems to be in their early twenties. There have been periods of time in Perns history where females have been able to Impress and ride Green dragons. Whether or not female Candidates are allowed on the Hatching Grounds if there is no gold egg is unknown.   ; Craftsmen   : assigned to the Weyr by their Craft, Craftsmen serve the dragonriders and support staff as they would serve any Hold. The position is usually a high prestige assignment, and they are autonomous from Weyr structure. However some craftmen gain their position at a Weyr by being Searched and proficient in their craft discipline, at which point they are appointed by their Mastercrafter as the official representative.       There is no marriage in the Weyr, as dragonriders are so involved in their dragons needs that it would be unfair to a romantic partner to commit to a permanent relationship. Instead, Weyrs have weyrmates. In rare cases, weyrmating is as deep and permanent as a marriage. However, a weyrmate would usually be the equivalent to a long-term boyfriend or girlfriend : a form of ": null
    },
    {
        "serial monogamy": "serial monogamy"
    },
    {
        ". A weyrmate might be another rider, a crafter or a lower caverns worker. The term indicates that the pair usually share living quarters, for the time being. Such relationships can be severed at any time by either partner for any reason.     Parental ties are loose, and children are considered to be the property of the Weyr, not of the parent. Usually a child knows who his or her parents are, but many have no more contact with them than any other Weyr resident. There is often some fondness between parent and child; a parent might give a birthing day or Turns End gift to their child and keep tabs on the childs development. Other parents completely ignore their childs existence. Severing a childs emotional ties with their natural parents is also considered to be a balancing factor, as expectations for Weyrbrats are not tied to the rank or qualities of their parents. Children are seen as individuals who must succeed or fail on their own, not on parental merit. During a Pass, when a dragonrider parent risks life and limb fighting Thread, this also limits the childs trauma should a parent die.     Sexual relations in a Weyr are typically very liberal. Sex is a form of tension release, and can be triggered through telepathic cues that are produced by the dragons in mating flights. A goldrider can be expected to be open to sexual relations with multiple males and greenriders are expected to not mind having many sexual partners as well. Sexual contact during mating flights is not considered to be any indication of a dragonriders preference in either individual or gender preference. In addition, sex with a person other than a weyrmate during a mating flight is not considered to be cheating. This behavior is considered anathema to the Holders and, to a lesser degree, the Crafters.     ": null
    },
    {
        "Homosexuality": "homosexuality"
    },
    {
        " is accepted in the Weyr as a necessity for the dragons well-being. Green dragons prefer to impress a female or gay male rider while blue and some brown dragons may choose gay or ": null
    },
    {
        "bisexual": "bisexual"
    },
    {
        " male riders. However, homosexuality is not well accepted outside of the Weyr, so the Weyr often becomes a sanctuary for homosexual men and women.     ": null
    },
    {
        "Suicide": "suicide"
    },
    {
        " is considered to be a normal response to the loss of a dragon. A dragonrider whose dragon has died is usually given the option of accompanying another pair  between  and releasing from the pair before emerging, effectively killing him or herself. Few riders would ever deny a dragonless rider due to the strength of the bond between dragon and rider, losing ones dragon almost always results in insanity in all but the strongest of character such as Lytol, though these people remain emotionally vulnerable to any mention of Dragons.     ": null
    },
    {
        "Abortion": "abortion"
    },
    {
        " is also accepted in the Weyr, while Holders and Crafters believe abortion to be evil . Going into the absolute cold of between during the first trimester of pregnancy usually causes a miscarriage; therefore any female dragonrider risks aborting before she even knows she is with child. As such, there can be no stigma against abortion within a Weyr. Any woman in the Weyr who finds herself with an unwanted pregnancy has the option of asking assistance from a dragonrider. A short ride between is a common euphemism for ending an unwanted pregnancy.     For dragonriders, social and Wing status are completely dependent on the colour of their dragon. This is due to the natural/instinctual social structure of the dragons themselves, a legacy of their ": null
    },
    {
        "firelizard": "firelizard"
    },
    {
        " ancestors. Gold and bronze dragons and their riders are at the top of the social/military structure. Brown dragons and their riders have the most flexibility and can achieve rank nearly equal to bronze dragons or fall to lower ranks, according to ability and personal preferences of the Riders. Blue and green dragons and their riders are at the bottom of the social and military hierarchy, the dragons because they will obey gold and bronze dragons generally without question, their riders tend to have matching follower personalities and are usually content to do so.     While the Weyrwoman and the Weyrleader hold the same rank as a Lord or Lady Holder or Mastercraftsmen, even the lowest ranked adult dragonrider is equivalent to a senior journeyman in a craft, and are given the respect due any dragonrider as the protectors of Pern.        was the first of the Weyrs. As described in  Dragonsdawn , it was founded by Sean Connell and his wife Sorka Hanrahan-Connell during the First Pass when the population was forced to desert the Southern Continent after volcanic activity. It is located in the mountains of the Southwestern peninsula of the Northern Continent. It housed the original seventeen dragonriders and their dragons. As time passes the Weyr becomes too small to sustain all of Perns dragons so other Weyrs are also founded. Fort Weyr was built primarily using high tech sonic/plasma stone cutters to form the perfectly smooth walls absent in later Weyrs. Fort protects Fort Hold, Southern Boll and Ruatha Hold.      was the second Weyr built, also during the First Pass and using plasma/sonic cutters to enlarge naturally occurring caverns. It is named after Admiral Paul Benden, one of the original colonys founders, and is located in the mountains of the northeast coast of the Northern Continent. As  Dragonflight  opens it is the only occupied Weyr.     High Reaches Weyr was the third Weyr built, the last during the First Pass. It was also the last to use the sonic/plasma stonecutters. High Reaches is the highest in elevation, located in the northwestern mountains of the Northern Continent. It is unique, being in a younger ancient caldera, with seven tall stone spires called the seven spindles. High Reaches has a capacity of about 42 dragons.     Telgar Weyr was the last of the Ancient Weyrs to be built, settled in the Interval after the First Pass. It is located in the central northern mountains of the Northern Continent. It has a capacity of about 42 dragons and was initially a mining Hold; its caverns are primarily cut by miners.     Ista Weyr is located on the Big Island in a caldera that opens to a tropical bay. While physically the smallest of the Weyrs, Ista makes up for it by locating dragons in weyr caverns on the outer face of the caldera. Using this unusual technique the Weyr has a capacity of about 42 dragons.     Igen Weyr is the smallest Weyr with a capacity of only 42 dragons. It is a desert Weyr located in the south central region of the Northern Continent.     Southern Weyr was not founded until the end of the 42th Interval when Flar asked Fnor to go back in time about ten turns and start it, just before the 42th Pass. It is located on the far northern tip of the Southern Continent, on approximately the same longitude as Ista, Igen and Telgar Weyrs. It is partly built on cliffs facing the ocean, but most weyrs are located inland, in non-traditional dwellings consisting of a sheltered sand wallow for the dragons and huts for the riders. It has no set capacity for dragons, as new huts and shelters could be built at any time. This Weyr was moved to an undisclosed location far inland in the 42st Turn of the 42th Pass in  The Skies of Pern .     Monaco Bay Weyr was built on open areas in the northeastern coast of the Southern Continent as the need for dragons expanded in that portion of the Southern Continent. Like Southern Weyr, there are no caves; dragons sleep in sheltered sand wallows and riders live in huts near their dragons. Also like Southern, there is no set capacity, with room for expansion as needed.       After the disaster of the Long interval and years leading to the start of the 42th Pass, the Weyrs, under the leadership of Benden Weyrleaders Flar and Lessa, determined that the Weyrs would no longer be dependent on the Holds and Crafthalls during Intervals. The discovery of the unpopulated Southern Continent provided the Weyrs with an alternative. At the end of Threadfall the Weyrs would be mostly abandoned, riders and Weyrfolk would become self-sufficient in the bountiful lands in the Southern Continent. Dragonriders and their dragons would spread across much of the Southern Continent in small groups to be known as WeyrHolds where dragonriders would be able to support themselves through farming, trade or craft rather than relying on Hold and Craft generosity.     Seeking out good sites for WeyrHolds quickly became a popular pastime for dragonriders in their off-hours, though only two are officially established in the canon books.     Honshū Weyrhold was built by one of the original colonists and abandoned some 42  years later when the residents were evacuated in the short story Rescue Run": null
    }
]