[
    {
        "     In ": null
    },
    {
        "Māori mythology": "māori mythology"
    },
    {
        ", Whaitiri is a female deity, a personification of ": null
    },
    {
        "thunder": "thunder"
    },
    {
        ", and the grandmother of ": null
    },
    {
        "Tāwhaki": "tāwhaki"
    },
    {
        " and ": null
    },
    {
        "Karihi": "karihi"
    },
    {
        ". Whaitiri is the granddaughter of Te Kanapu, and the great-granddaughter of Te Uira, both of whom are personified forms of ": null
    },
    {
        "lightning": "lightning"
    },
    {
        " . In Maori mythology, there is also a male deity of thunder, ": null
    },
    {
        "Tāwhirimātea": "tāwhirimātea"
    },
    {
        ".       Whaitiri is a fearsome figure, fond of ": null
    },
    {
        "cannibalism": "cannibalism"
    },
    {
        ". When she hears of a mortal named ": null
    },
    {
        "Kaitangata": "kaitangata"
    },
    {
        " , she is certain he will make a fine husband for her. She comes down to ": null
    },
    {
        "earth": "earth"
    },
    {
        " and marries him, but is disappointed to learn that he is a gentle person, nothing like his name suggests. Whaitiri kills her favourite slave, Anonokia, takes out her ": null
    },
    {
        "heart": "heart"
    },
    {
        " and ": null
    },
    {
        "liver": "liver"
    },
    {
        ", and offers them to Kaitangata as a sign of her affection. He is horrified at the grisly offering .     Kaitangata is a hard worker, spending a lot of time ": null
    },
    {
        "fish": "fish"
    },
    {
        "ing to feed his family. Unfortunately, he has never learned how to make hooks with a barb, and so most of his fish escape. Whaitiri gives him a barbed hook, and he catches a grouper, which she offers to the gods. Whaitiri quickly tires of a diet of fish, so when her husband is away fishing, she takes a net and catches two of her husbands relatives, Tupeke-ti and Tupeke-ta. When Kaitangata returns, she asks him to perform the incantations that are used when human flesh is offered to the gods. He does not know the chants, so she tries to perform them herself, not willing to confess that she is ignorant of the correct words to use. She mumbles nonsense words, before cooking the bodies, cutting them up and gorging herself on the flesh, to the disgust of the villagers. Only the ": null
    },
    {
        "bone": "bone"
    },
    {
        "s are left .     Later, Kaitangata uses the bones to make barbed hooks, and goes fishing. He catches grouper, and gives them to Whaitiri. He does not tell her that he used hooks made from the bones of Tupeke-ti and Tupeke-ta. She eats the fish, and because the fish is infused with the tapu from the bodies of the two men, Whaitiri gradually begins to go blind. At first she is mystified at the reason for this, but eventually she is visited by a woman from the underworld who tells her what has happened .       One day, Whaitiri overhears her husband describe her to two strangers. She is offended when she hears him say that his wifes ": null
    },
    {
        "skin": "skin"
    },
    {
        " is like the ": null
    },
    {
        "wind": "wind"
    },
    {
        ", and her heart is as cold as ": null
    },
    {
        "snow": "snow"
    },
    {
        ". On another occasion, she is ashamed when Kaitangata complains that their children are dirty. She explains to her husband that she is unable to wash her children because she is a sacred being from the ": null
    },
    {
        "heaven": "heaven"
    },
    {
        "s, and she tells him for the first time that her ": null
    },
    {
        "name": "name"
    },
    {
        " is thunder. She prepares to return to her true home in the heavens, and foretells that her children will follow her one day. She departs in a ": null
    },
    {
        "cloud": "cloud"
    },
    {
        ", leaving her children, one of whom is ": null
    },
    {
        "Hemā": "hemā"
    },
    {
        " .       This is fulfilled when Tāwhaki and Karihi, Hemās sons, set off to climb up to the ": null
    },
    {
        "sky": "sky"
    },
    {
        ". At the foot of the ascent they find their grandmother, Whaitiri, now blind, who sits continually counting the tubers of ": null
    },
    {
        "sweet potato": "sweet potato"
    },
    {
        " or ": null
    },
    {
        "taro": "taro"
    },
    {
        " that are her only food. The brothers tease her by snatching them away, one by one, and upsetting her count. Eventually, they reveal themselves to her and restore her sight. In return, she gives them advice about how best to make the climb into the sky. Karihi tries first, but makes the error of climbing up the aka taepa, or hanging vine. He is blown violently around by the winds of heaven, and falls to his death. Tāwhaki climbs by the aka matua, or parent ": null
    },
    {
        "vine": "vine"
    },
    {
        ", recites the right incantations, and reaches the highest of the 42 heavens. There he learns many spells from Tama-i-waho, and marries a woman named Hāpai, or as others say, Maikuku-makaka. They have a son, and according to some versions of the story it is this child who is named ": null
    },
    {
        "Wahieroa": "wahieroa"
    },
    {
        " .       Waitiri   Whatitiri   Whaitiri-mātakataka   Waitiri Station, a large Central Otago New Zealand high country ": null
    },
    {
        "ranch": "ranch"
    },
    {
        ". Named after the thundering waters of the ": null
    },
    {
        "Kawarau River": "kawarau river"
    },
    {
        ". Waitiri Station is the major ranch of the Kawarau Gorge and runs from the Bungy Bridge to the Roaring Meg on SH42 It is a merino sheep station and is run in conjunction with Eastburn Station.   Waitiri Run A Grade IV at less than  and Grade V over ": null
    }
]