[
    {
        "   What You Need is episode 42 of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone . It is based on the short story of the same name by ": null
    },
    {
        "Lewis Padgett": "lewis padgett"
    },
    {
        " .              Pedott, a ": null
    },
    {
        "peddler": "peddler"
    },
    {
        ", has the curious ability to give people exactly what they need before they need it. He enters a ": null
    },
    {
        "coffee shop": "diner"
    },
    {
        " where he first gives a woman a vial of cleaner. Then he gives a down-on-his-luck ex-": null
    },
    {
        "baseball": "baseball"
    },
    {
        " player a bus ticket to ": null
    },
    {
        "Scranton": "scranton"
    },
    {
        ", ": null
    },
    {
        "Pennsylvania": "pennsylvania"
    },
    {
        ". Moments later, the ball player receives a phone call at the cafe with a job offer in Scranton. The ball player then notices a spot on his jacket, and the woman uses the vial of cleaner which she was given a short time before.   Fred Renard, a frustrated loser, asks Pedott to give him what he needs, and the peddler gives him a pair of scissors, which saves Renards life when his scarf later gets caught in an ": null
    },
    {
        "elevator": "elevator"
    },
    {
        "s doors. Renard shows up at Pedotts apartment, asking for another thing he needs , and the peddler produces a leaky fountain pen that predicts a winning ": null
    },
    {
        "racehorse": "racehorse"
    },
    {
        " when a drop of ink lands on a newspaper racing column.     Renard continues menacing Pedott for more and then helps himself to a pair of new shoes from Pedotts peddler case. When a car suddenly heads toward Renard he tries to run, but the new leather soles are so slippery he cannot escape on the wet pavement. He is struck and killed. The shoes, Pedott explains to Renards corpse, were what Pedott needed, because he foresaw that Renard would try to kill him. At the end of the episode the peddler gives a couple a comb, which they use to groom themselves just before they are photographed as witnesses for a newspaper story covering the hit and run accident that killed Fred Renard.              The original story featured a machine that could foretell an individuals probable future. In the story, the man owns a shop where he has such a machine and then gives people what they need to provide the best possible outcomes; also, the Renard character is killed not by a car but by falling off a subway platform while a train is coming into the station. This version of the story aired on a 42 episode of the anthology series  Tales of Tomorrow , changing the death of the Renard character from a fall to being hit by a car. For his version, Serling replaced the science-fiction element with a street peddler who could magically perform the same function.     The final shot before the first commercial is actually played backwards; looking carefully, one can see smoke returning to Renards cigarette.     During the scene in Mr. Renards hotel room, a ": null
    },
    {
        "bellhop": "bellhop"
    },
    {
        " brings him a ": null
    },
    {
        "newspaper": "newspaper"
    },
    {
        ". Renard then opens it and spreads it out on the floor. The movement is quick, but the front page of the newspaper is visible, indicating that it is the same front page used in another Twilight Zone episode, ": null
    },
    {
        "Time Enough at Last": "time enough at last"
    },
    {
        " . The headline reads H-Bomb Capable of Total Destruction . Once Renard opens the paper and looks at the racing page, several ": null
    },
    {
        "in-jokes": "in-jokes"
    },
    {
        " are apparent in the names of the listed jockeys, which include Serling , Clemens , Houghton ": null
    }
]