[
    {
        "      Whats Love Got to Do with It is a 42 American ": null
    },
    {
        "biographical": "biographical film"
    },
    {
        " film directed by ": null
    },
    {
        "Brian Gibson": "brian gibson"
    },
    {
        ", based on the life of American-born singer ": null
    },
    {
        "Tina Turner": "tina turner"
    },
    {
        ". It stars ": null
    },
    {
        "Angela Bassett": "angela bassett"
    },
    {
        " as Tina Turner and ": null
    },
    {
        "Laurence Fishburne": "laurence fishburne"
    },
    {
        " as ": null
    },
    {
        "Ike Turner": "ike turner"
    },
    {
        ".     The screenplay was adapted by ": null
    },
    {
        "Kate Lanier": "kate lanier"
    },
    {
        " from the book  I, Tina  co-written by Turner with ": null
    },
    {
        "Kurt Loder": "kurt loder"
    },
    {
        ". Both Ike and Tina assigned rights to Lanier for their lives to be dramatized in the film. The films ": null
    },
    {
        "soundtrack": "whats love got to do with it"
    },
    {
        " featured the hit song ": null
    },
    {
        "I Dont Wanna Fight": "i dont wanna fight"
    },
    {
        " , which went to number one in seven countries. In the United States, the film grossed almost $42 million and around $42 million in rentals. In the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ", it grossed nearly £42 million.       Born and raised in ": null
    },
    {
        "Nutbush, Tennessee": "nutbush, tennessee"
    },
    {
        ", Anna Mae Bullock grows up in an unhappy family, with her parents leaving and abandoning her at a young age. Following her grandmothers death, she relocates to ": null
    },
    {
        "St. Louis": "st. louis"
    },
    {
        ", reuniting with her mother and close sister Alline. Anna Mae pursues a chance to be a professional singer, after seeing charismatic bandleader Ike Turner perform one night. Later, she wins her spot in Turners band after singing onstage, and he begins mentoring her. In time, an unexpected romance develops between the two, after she moves into Ikes home. Shortly afterwards, they marry and begin having musical success together as ": null
    },
    {
        "Ike & Tina Turner": "ike  &  tina turner"
    },
    {
        ".     The marriage quickly turns violent when Ike starts physically dominating her, leaving her no chance to escape. In public, Tina rises from local St. Louis phenomenon into an ": null
    },
    {
        "R & B": "rhythm and blues"
    },
    {
        " superstar, with Ike growing increasingly jealous of the attention given to her. Ike turns to drugs and his abusive behavior worsens. As Tina seeks solace in her chaotic life, a friend turns her on to ": null
    },
    {
        "Buddhism": "buddhism"
    },
    {
        ", eventually convincing her that reciting the ": null
    },
    {
        "Lotus Sutra": "lotus sutra"
    },
    {
        " and chanting ": null
    },
    {
        "Nam Myoho Renge Kyo": "nam myoho renge kyo"
    },
    {
        " will help change her life. Tina grows increasingly confident afterwards, and in a final fight with Ike, she finally musters the courage to ": null
    },
    {
        "defend": "self-defense"
    },
    {
        " herself, eventually leaving him after they arrive at a hotel.     Winning the right to retain her stage name after their divorce, Tina continues working to pay bills. She gets a break after meeting ": null
    },
    {
        "Roger Davies": "roger davies"
    },
    {
        ", who eventually helps her realize her dreams of rock stardom. Despite Ikes attempts to win her back, Tina eventually prevails and finds solo success, accomplishing her dreams without Ike.        ": null
    },
    {
        "Angela Bassett": "angela bassett"
    },
    {
        " as Anna Mae Bullock / ": null
    },
    {
        "Tina Turner": "tina turner"
    },
    {
        " RaeVen Larrymore Kelly": "raeven larrymore kelly"
    },
    {
        " as Young Anna Mae Bullock   Cora Lee Day as Grandma Georgiana   ": null
    },
    {
        "Khandi Alexander": "khandi alexander"
    },
    {
        " as Darlene   ": null
    },
    {
        "Laurence Fishburne": "laurence fishburne"
    },
    {
        " as ": null
    },
    {
        "Ike Turner": "ike turner"
    },
    {
        " Jenifer Lewis": "jenifer lewis"
    },
    {
        " as Zelma Bullock, Tinas mother   Phyllis Yvonne Stickney as Alline Bullock   ": null
    },
    {
        "Penny Johnson Jerald": "penny johnson jerald"
    },
    {
        " as Lorraine Taylor   ": null
    },
    {
        "Vanessa Bell Calloway": "vanessa bell calloway"
    },
    {
        " as Jackie   ": null
    },
    {
        "Chi McBride": "chi mcbride"
    },
    {
        " as Fross   Sherman Augustus as Reggie   Terrence Riggins as Spider   Bo Kane as Dance Show Host   ": null
    },
    {
        "Terrence Evans": "terrence evans"
    },
    {
        " as Bus Driver   Rob LaBelle as ": null
    },
    {
        "Phil Spector": "phil spector"
    },
    {
        " James Reyne": "james reyne"
    },
    {
        " as ": null
    },
    {
        "Roger Davies": "roger davies"
    },
    {
        " Richard T. Jones": "richard t. jones"
    },
    {
        " as Ike Turner, Jr.   ": null
    },
    {
        "Shavar Ross": "shavar ross"
    },
    {
        " as Michael Turner   Damon Hines as Ronnie Turner   Suli McCullough as Craig Turner   Elijah B. Saleem as teenage Ike Turner, Jr.                ": null
    },
    {
        "Halle Berry": "halle berry"
    },
    {
        ", ": null
    },
    {
        "Robin Givens": "robin givens"
    },
    {
        ", ": null
    },
    {
        "Pam Grier": "pam grier"
    },
    {
        ", ": null
    },
    {
        "Whitney Houston": "whitney houston"
    },
    {
        ", ": null
    },
    {
        "Janet Jackson": "janet jackson"
    },
    {
        ", and ": null
    },
    {
        "Vanessa L. Williams": "vanessa l. williams"
    },
    {
        " were all considered for the role of Tina Turner.  Whitney Houston was actually offered the role, but had to decline due to imminent maternity. ": null
    },
    {
        "Jenifer Lewis": "jenifer lewis"
    },
    {
        " also originally auditioned to play Tina Turner but was cast instead as Tinas mother even though she was born in 42 and just one year older than ": null
    },
    {
        "Angela Bassett": "angela bassett"
    },
    {
        ".     ": null
    },
    {
        "Angela Bassett": "angela bassett"
    },
    {
        " auditioned for the role in October 42 and was chosen only a month before production began in December. During that time she had to learn not only how to talk like Turner but to dance and move like her. She would have been willing to try to do the singing as well, but  not in the time we had,  she said.  I did think about it for a second, though.  Instead, she lip syncs to soundtracks recorded by Tina Turner and Fishburne. Bassett worked with Tina Turner, but only  a little bit.  Turner helped most with the re-creations of her famed dance routines.      All the Ike and Tina Turner songs used in the film were newly re-recorded versions featuring Tina Turner covering her own songs. On Proud Mary and ": null
    },
    {
        "Its Gonna Work Out Fine": "its gonna work out fine"
    },
    {
        " , Laurence Fishburne sings Ike Turners parts. For Tina Turners solo recordings, the original masters were used, including the ": null
    },
    {
        "Phil Spector": "phil spector"
    },
    {
        "-produced ": null
    },
    {
        "River Deep - Mountain High": "river deep - mountain high"
    },
    {
        " .     ": null
    },
    {
        "Laurence Fishburne": "laurence fishburne"
    },
    {
        " was offered the role of Ike Turner five times and turned it down each time.   It was pretty one-sided,  said Fishburne, who turned down the project based on the script he first read. Ike, Fishburne added, was  obviously the villain of the piece, but there was no explanation as to why he behaved the way he behaved - why she was with him for 42 to 42 years, what made her stay.  The writers made some changes and though Ike is still shown as a pretty despicable sort, the film offers at least some insight into him - most notably a scene in which Ike recalls watching, at age 42 his fathers death from wounds suffered in a fight over a woman. The changes helped persuade Fishburne to do the role, but he says that Bassetts casting as Tina played a key part.  She was the deciding factor, really,  he said.     Fishburne did not have Ike Turner around as a role model as much as he would have liked. He did meet Ike Turner once, though, during production of the film. He was not particularly welcome on this project, Fishburne says. The actors only meeting was a brief introduction when Ike showed up at the Turners former home in Baldwin Hills during a location shoot. Ike signed some autographs and showed Fishburne his walk. It was nice to meet him, says Fishburne. Regardless of his actions, he was so much a part of Tinas life. The movie is about him just as much as her. Its unfortunate that he wasnt welcomed, that both of them werent around more.      In his autobiography Taking Back My Name, Ike Turner claims the movie damaged his reputation immensely and attacks many of the scenes for being either not strictly accurate or completely fabricated. Director Brian Gibson had no contact with Ike. I never spoke to him, says Gibson. I was not allowed to. Disney felt that it would not be a good idea. Tina herself admitted she wish the film had more truth to it and later stated that she wasnt proud that the film had her being portrayed as a victim. Since they sold the right to use their name and image for the film, neither Tina nor Ike had control over the script. Tinas more graphic alleged accounts of Ikes abuse in her book were not added to the film. Her character was also sanitized, most notably her relationship with ": null
    },
    {
        "Raymond Hill": "raymond hill"
    },
    {
        " and the birth of their son was excluded from the film.      Bassett was injured while filming the first spousal abuse sequence. She fell off the back of a high-rise sofa, put her hands out to reduce the impact, and suffered a hairline fracture of her right hand. She only tried the stunt fall once, and footage leading up to the mishap appears in the film.     Actress ": null
    },
    {
        "Vanessa Bell Calloway": "vanessa bell calloway"
    },
    {
        ", who plays the fictional character Jackie, was leery of voicing the ": null
    },
    {
        "Buddhist": "buddhist"
    },
    {
        " chant because of her strong ": null
    },
    {
        "Christian": "christianity"
    },
    {
        " faith. Director Brian Gibson allowed her to form the words with her lips silently during filming and added the words with a voice double in post-production. She also appeared alongside Tina in the music video of Whats Love Got to Do with It .       Though most of the scenes from the film were somehow depicted from Turners autobiography  I, Tina , some other elements were fictionalized for dramatic purposes.      Ike did not sing or play guitar on the record ": null
    },
    {
        "Rocket 42": "rocket 88"
    },
    {
        " as depicted in the film. Ike wrote the song and played piano on the record. His saxophonist ": null
    },
    {
        "Jackie Brenston": "jackie brenston"
    },
    {
        " was the vocalist. The record was released under the alias Jackie Brenston and his Delta Cats who were actually Ikes band the ": null
    },
    {
        "Kings of Rhythm": "kings of rhythm"
    },
    {
        ".    The song Anna Mae first performs onstage with Ike, ": null
    },
    {
        "You Know I Love You": "you know i love you"
    },
    {
        " , was actually a slower ": null
    },
    {
        "B.B. King": "b.b. king"
    },
    {
        " blues ballad": "blues ballad"
    },
    {
        " where King is lamenting over a broken relationship; Ike Turner is credited as a piano player on Kings record.  Tina recorded a song with the title of Kings song with similar lyrics she composed with a ": null
    },
    {
        "blues rock": "blues rock"
    },
    {
        " composition. Despite this, the record is still credited as written by King on the soundtrack.   The first recording Anna Mae records, titled Tinas Wish , in the soundtrack, was actually a 42 track titled Make Me Over recorded and co-written by Tina on the album,  Nutbush City Limits .  Her first recording is a 42 Ike Turner song called ": null
    },
    {
        "Boxtop": "boxtop"
    },
    {
        " , a ": null
    },
    {
        "calypso": "calypso music"
    },
    {
        "-ish rock number featuring Carlson Oliver singing with her and Ike who sings ": null
    },
    {
        "bass-baritone": "bass-baritone"
    },
    {
        " on the track.   A theater marquee announces a 42 show starring ": null
    },
    {
        "Otis Redding": "otis redding"
    },
    {
        ", ": null
    },
    {
        "Martha and the Vandellas": "martha and the vandellas"
    },
    {
        ", Ike and Tina Turner. In reality, Martha and the Vandellas were known as The Del-Phis until 42 Otis Redding didnt become a solo act until 42   In the film, Anna Mae learns of her name change to Tina Turner after the song is played on a radio in the hospital where a groggy Anna had given birth. In reality, however, Tina saw a vinyl copy of the song that showcased the name Ike & Tina Turner.   The film insinuates that Tinas firstborn Craig is Ikes biological child. In reality, Craig Turner was Tinas son with Ikes saxophonist ": null
    },
    {
        "Raymond Hill": "raymond hill"
    },
    {
        ". Ike later adopted Craig. Tina gave birth to her son Ronnie, fathered by Ike in 42   The film depicts the couple getting married after Ike and his entourage sneak Tina out of the hospital. In reality, Tina wrote in her book I, Tina that Ike was not present for the birth of their son. Tina checked herself out of the hospital after she gave birth when discovered the woman Ike hired to substitute as Tina Turner while she recuperated was a ": null
    },
    {
        "prostitute": "sex worker"
    },
    {
        " using that name to get clients.  Tina got into a fight with the woman and she fired her. The next day Tina performed a show. Ike wrote in his book Taking Back My Name that he was unaware the woman was a prostitute, and he was out of town to attend a court hearing in St. Louis when Tina gave birth in Los Angeles. They married in 42 two years after the birth of their son.   Lorraine, the mother of Ikes two sons Ike Jr and Michael did not drop them off at his home with Tina as depicted in the film. In reality, Ike went to St. Louis and brought his sons to Los Angeles after Lorraine informed him she was going to leave them there. Tina also brought her son Craig to live with them.   A reenactment clip of an interview with Ike & Tina was featured in 42 rather than 42 where the real-life Turners were interviewed backstage at ": null
    },
    {
        "Caesars Palace": "caesars palace"
    },
    {
        " in a similar posture: with Tina talking throughout and Ike keeping silent with his back to Tina, smoking a cigarette.   In a scene dated 42 Ike and Tina open for ": null
    },
    {
        "The Rolling Stones": "the rolling stones"
    },
    {
        ", performing ": null
    },
    {
        "Proud Mary": "proud mary"
    },
    {
        ". In reality, Ike and Tina didnt perform Proud Mary until after it was released by ": null
    },
    {
        "Creedence Clearwater Revival": "creedence clearwater revival"
    },
    {
        " in 42 The Rolling Stones didnt have any concerts in 42; Ike and Tina opened for them in 42 and 42   The characters Jackie and Frost did not exist in real life. Jackie represents an ": null
    },
    {
        "amalgamation": "composite character"
    },
    {
        " of ": null
    },
    {
        "Ikettes": "ikettes"
    },
    {
        " and associates of Tina.   The infamous eat the cake Anna Mae scene was an exaggerated reenactment of a real-life incident that occurred during the early years of the Revue where Tina recalled a waitress giving her a pound cake while Tina was sitting in Ikes Cadillac. Though Tina said she didnt order it, Ike insisted she did and ordered her to eat all of it.   The scene where Ike ": null
    },
    {
        "rapes": "marital rape"
    },
    {
        " Tina during the recording of ": null
    },
    {
        "Nutbush City Limits": "nutbush city limits"
    },
    {
        " was also exaggerated from what Tina stated in her book that sometimes after Ike would hit her, he then would have sex with her. Tina alleged that after Ike first hit her, he ordered her to bed, to which she later stated was like rape. Ike maintained that he never raped Tina. Also, Nutbush City Limits was recorded at the Turners ": null
    },
    {
        "Bolic Sound": "bolic sound"
    },
    {
        " recording studio, not at their home as depicted in the film.   The film depicts Tinas suicide attempt in 42 when it actually occurred six years prior in 42   Ike did not tell Tina if you dont make it, Ill kill you as depicted in the ambulance scene. Tina said on her book that after her suicide attempt she joked with a friend that she was so afraid of Ike, he probably threatened her which is why she survived. Tina was unconscious so she didnt know what he actually said. Ike said in his book that he scolded Tina as his way of motivating her to fight for her life.   During the time Tina is planning her comeback in the early 42s, a reenactment of an interview features Tina rehearsing her song ": null
    },
    {
        "I Might Have Been Queen": "i might have been queen"
    },
    {
        ". The song would be recorded for her comeback album,  Private Dancer .   The incident in the ": null
    },
    {
        "Ritz Theatre": "ritz theatre"
    },
    {
        " where Ike fails to scare Tina with his pistol was also exaggerated from when Tina claimed that Ike tried to send people to threaten to kill her and her associates after she left him. Ike did not threaten Tina in person with a gun as depicted.   Before performing ": null
    },
    {
        "Whats Love Got to Do with It": "whats love got to do with it"
    },
    {
        " at the Ritz in 42 the emcee announces that it was her first appearance though she first performed there in 42 Her 42 performance there occurred before the recording of Whats Love Got to Do with It and led to ": null
    },
    {
        "Capitol Records": "capitol records"
    },
    {
        " signing a contract with her.       Bassett won a ": null
    },
    {
        "Golden Globe": "golden globe"
    },
    {
        " for Best Performance by an Actress in a Motion Picture - Comedy/Musical and an ": null
    },
    {
        "NAACP Image Award": "naacp image awards"
    },
    {
        " for Outstanding Lead Actress in a Motion Picture. ": null
    },
    {
        "Laurence Fishburne": "laurence fishburne"
    },
    {
        " was nominated for ": null
    },
    {
        "the Academy Award": "academy award"
    },
    {
        " for ": null
    },
    {
        "Best Actor in a Leading Role": "academy award for best actor"
    },
    {
        " and Bassett was nominated for ": null
    },
    {
        "Best Actress in a Leading Role": "academy award for best actress"
    },
    {
        ". The film won an ": null
    },
    {
        "American Choreography Award": "american choreography award"
    },
    {
        " for one of its dance sequences.     ": null
    },
    {
        "Academy Awards": "66th academy awards"
    },
    {
        " Academy Award for Best Actor": "academy award for best actor"
    },
    {
        "   Nominated — ": null
    },
    {
        "Academy Award for Best Actress": "academy award for best actress"
    },
    {
        "    Golden Globes": "golden globes"
    },
    {
        " Won — ": null
    },
    {
        "Golden Globe Award for Best Actress – Motion Picture Musical or Comedy": "golden globe award for best actress – motion picture musical or comedy"
    },
    {
        "   Ebony Readers Poll": "ebony"
    },
    {
        "      !          The film is recognized by ": null
    },
    {
        "American Film Institute": "american film institute"
    },
    {
        " in these lists:   42: ": null
    },
    {
        "AFIs 42 Years...42 Songs": "afis 100 years...100 songs"
    },
    {
        ":   ": null
    },
    {
        "Whats Love Got to Do with It": "whats love got to do with it"
    },
    {
        " – Nominated    42: ": null
    },
    {
        "AFIs 42 Years...42 Cheers": "afis 100 years...100 cheers"
    },
    {
        " – 42    Ranked 42 on Top 42 Subjects of a Music Bio-Pic by ": null
    },
    {
        "Entertainment Weekly": "entertainment weekly"
    },
    {
        "    Ranked 42 on Top 42 Best Rock Biopics by ": null
    },
    {
        "Rolling Stone": "rolling stone"
    },
    {
        " Readers Poll    Ranked 42 on The Best Black Movies of the Last 42 Years By ": null
    },
    {
        "Complex": "complex"
    },
    {
        "          The movie received critical acclaim.     It currently holds a 42% fresh rating on ": null
    },
    {
        "Rotten Tomatoes": "rotten tomatoes"
    },
    {
        ", based on 42 reviews with the consensus: With a fascinating real-life story and powerhouse performances from Angela Bassett and Laurence Fishburne, Whats Love Got to Do with It is a cant miss biopic.      The film received Academy Award nominations for Best Actress for Angela Bassett  and Best Actor for Laurence Fishburne .     Ike Turner complained that negative portrayal of himself in the movie is inaccurate and that the movie and Tinas book are filled with lies.      ": null
    },
    {
        "Phil Spector": "phil spector"
    },
    {
        " slammed the movie as a piece of trash which demonized and vilified Ike .      In 42 Tina Turner revealed to ": null
    },
    {
        "Oprah Winfrey": "oprah winfrey"
    },
    {
        " that she only recently watched the movie. She said, I watched a little bit of it, but I didnt finish it because that was not how things went. Oprah, I didnt realize they would change the details so much. ": null
    }
]