[
    {
        "     Whipping Star is a 42 ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " novel by American writer ": null
    },
    {
        "Frank Herbert": "frank herbert"
    },
    {
        ". It is the first full-length novel set in the ": null
    },
    {
        "ConSentiency universe": "consentiency universe"
    },
    {
        " established by Herbert in his novelette  The Tactful Saboteur .         In the far future, humankind has made contact with numerous other species: Gowachin, ": null
    },
    {
        "Laclac": "laclac"
    },
    {
        ", ": null
    },
    {
        "Wreaves": "wreaves"
    },
    {
        ", ": null
    },
    {
        "Pan Spechi": "pan spechi"
    },
    {
        ", ": null
    },
    {
        "Taprisiot": "taprisiot"
    },
    {
        "s, and Caleban and has helped to form the ConSentiency to govern among the species. After suffering under a tyrannous pure democracy which had the power to create laws so fast that no thought could be given to the effects, the sentients of the galaxy found the need for a ": null
    },
    {
        "Bureau of Sabotage": "bureau of sabotage"
    },
    {
        " to slow the wheels of government, thereby preventing it from legislating recklessly.     In Whipping Star, ": null
    },
    {
        "Jorj X. McKie": "jorj x. mckie"
    },
    {
        " is a saboteur extraordinary, a born troublemaker who has naturally become one of BuSabs best agents. As the novel opens, it is revealed that Calebans, who are beings visible to other sentient species as stars, have been disappearing one by one. Each disappearance is accompanied by millions of sentient deaths and instances of incurable insanity.     Ninety years prior to the setting of Whipping Star, the Calebans appeared and offered jumpdoors to the collective species, allowing sentients to travel instantly to any point in the universe. Gratefully accepting, the sentiency didnt question the consequences. Now Mliss Abnethe, a psychotic human female with immense power and wealth, has bound a Caleban in a contract that allows the Caleban to be whipped to death; when the Caleban dies, everyone who has ever used a jumpdoor will die as well.     The Calebans begin to disappear one at a time, leaving our plane of existence to save themselves. As all Calebans are connected, if all were to remain in our existence, when Fannie Mae died, all Calebans would die. As each Caleban exits, millions of the ConSentiency are killed or rendered insane. McKie has to find Mliss and stop her before Fannie Mae reaches, in her words, ultimate discontinuity , but he is constrained by the law protecting private individuals by restricting the ministrations of BuSab to public entities.     McKie succeeds in saving Fannie Mae by opening a jumpdoor into space which shunts a large interstellar cloud of hydrogen into her stellar body, rejuvenating her from her torture at the hands of the Palenki henchmen hired by Mliss Abnethe. Fannie Mae agreed to the contract with Abnethe in return for education. Calebans have great difficulty understanding and communicating with the more limited species of the ConSentiency , but Fannie Mae is curious. Abnethes wealth provides the best tutors in exchange for Fannie Maes agreement to take the whippings. Abnethe has an insane sadistic streak, but a court-mandated Clockwork-Orange-style conditioning session leaves her unable to tolerate the suffering of others. Abnethe needs a Caleban to take the whippings because she still craves a way to satisfy her sadistic urges and Calebans do not broadcast their pain in a way that is easily recognized by other species.       Whipping Star was followed in 42 by Herberts  The Dosadi Experiment  and preceded by the short story ": null
    },
    {
        "The Tactful Saboteur": "the tactful saboteur"
    },
    {
        " . While these stories are not exactly related to Whipping Star, they take place in the same imaginary universe and have the same main character, Jorj X. McKie.     The chairdog mentioned on page 42 is also mentioned in multiple Dune novels; both the original series by Frank Herbert as well as the extended series by Brian Herbert and Kevin J. Anderson.         Jorj X. McKie - BuSab Saboteur Extraordinary - Human   Bildoon - BuSab Director - ": null
    },
    {
        "Pan Spechi": "pan spechi"
    },
    {
        "                           ": null
    }
]