[
    {
        "   Whit, or, Isis amongst the unsaved is a ": null
    },
    {
        "novel": "novel"
    },
    {
        " by the ": null
    },
    {
        "Scottish": "scottish people"
    },
    {
        " writer ": null
    },
    {
        "Iain Banks": "iain banks"
    },
    {
        ", published in 42 Isis Whit, a young but important member of a small, quirky ": null
    },
    {
        "cult": "cult"
    },
    {
        " in ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ", narrates. The community suspects that Isis cousin Morag is in danger, and sends Isis out to help.         Isis, otherwise The Blessed Very Reverend Gaia-Marie Isis Saraswati Minerva Mirza Whit of Luskentyre, Beloved Elect of God III, is the 42-year-old granddaughter and designated spiritual heir of Salvador Whit, patriarch of the Luskentyrians. They are a ": null
    },
    {
        "religious cult": "religious cult"
    },
    {
        " who live in a ": null
    },
    {
        "commune": "commune"
    },
    {
        " in ": null
    },
    {
        "Stirlingshire": "stirlingshire"
    },
    {
        " and reject most ": null
    },
    {
        "technology": "technology"
    },
    {
        ". They run their lives according to a collection of beliefs and rituals revealed to Salvador after he washed ashore on ": null
    },
    {
        "Harris": "harris, outer hebrides"
    },
    {
        " in the ": null
    },
    {
        "Western Isles": "western isles"
    },
    {
        " and married two young ": null
    },
    {
        "Asian": "british asian"
    },
    {
        " ladies .      The novel opens shortly before the Luskentyrian Festival of Love, held every four years, about nine months before every ": null
    },
    {
        "leap year": "leap year"
    },
    {
        " day . The Luskentyrians believe that those born on that day have special power. This includes Isis herself, Elect of God, and expected to take over leadership of the cult.     The bulk of the novel tells of Isis voyages in the world of the Unsaved , through Scotland and southern England in search of Morag, who is feared to have ": null
    },
    {
        "rejected the cult": "apostasy"
    },
    {
        ".     While searching for her cousin, Isis meets ": null
    },
    {
        "Rastas": "rastafari movement"
    },
    {
        ", policemen, ": null
    },
    {
        "white power skinhead": "white power skinhead"
    },
    {
        "s, and other characters of a sort she has never encountered before, and tells the story of the cult and the rationale behind its rules. Isis maternal grandmother, Yolanda, a feisty ": null
    },
    {
        "Texan": "texas"
    },
    {
        " woman, appears and lends her support to Isis quest. Isis friend Sophi, although not part of the cult, is very close to her. Isis meets her whenever she goes to her house to use the Luskentyrian method of free telephone communication, using coded rings.     Returning with enhanced maturity and a lot more information, Isis must decide what to tell the other members of the cult.       Like many of Banks characters, from Frank Cauldhame in  The Wasp Factory  to Prentice McHoan in  The Crow Road , Isis engages in a half-unconscious search for ": null
    },
    {
        "knowledge": "knowledge"
    },
    {
        " which will inevitably turn her world upside down. The novel thus becomes a type of  Bildungsroman .     Banks portrays the cult largely sympathetically, especially given its publication shortly after the ": null
    },
    {
        "Waco Siege": "waco siege"
    },
    {
        " in 42 . Banks ensures that the Luskentyrian ": null
    },
    {
        "theology": "theology"
    },
    {
        " has coherence and consistency, even as events cause her to start to doubt.     Banks has called it:     a book about religion and culture written by a dedicated evangelical ": null
    },
    {
        "atheist": "atheist"
    },
    {
        " — I thought I was very kind to them... Essentially, Isis makes the recognition that the value of the Luskentyrian cult is in their community values rather than their religious ones. She recognises that efficiency isnt everything, that people not profit are what matters.             Whit, Iain Banks, London : Abacus, 42                                         ": null
    }
]