[
    {
        "           A whole note or semibreve is a kind of note used in music notation. It has a time duration of four ": null
    },
    {
        "beats": "beat"
    },
    {
        " in  ": null
    },
    {
        "time": "time signature"
    },
    {
        ".       The whole note or semibreve has a ": null
    },
    {
        "note head": "note head"
    },
    {
        " in the shape of a hollow oval—like a ": null
    },
    {
        "half note": "half note"
    },
    {
        " —but with no ": null
    },
    {
        "note stem": "note stem"
    },
    {
        " . Since it is equal to four ": null
    },
    {
        "beats": "beat"
    },
    {
        " in  ": null
    },
    {
        "time": "time signature"
    },
    {
        ", it occupies the entire length of a measure.     Other notes are multiples or fractions of the whole note. For example, a ": null
    },
    {
        "double whole note": "double whole note"
    },
    {
        "  lasts twice the duration of the whole note, a half note lasts one half the duration, and a ": null
    },
    {
        "quarter note": "quarter note"
    },
    {
        "  lasts one quarter the duration.     A related symbol is the whole rest  . It usually applies for an entire measure, but may occasionally signify a rest for the duration of a whole note in longer time signatures such as  or . Whole rests are drawn as filled-in rectangles generally hanging under the second line from the top of a ": null
    },
    {
        "musical staff": "musical staff"
    },
    {
        ", though they may occasionally be put under a different line  in more complicated ": null
    },
    {
        "polyphonic": "polyphonic"
    },
    {
        " passages, or when two instruments or vocalists are written on one staff and one is temporarily silent.     The whole note and whole rest may also be used to denote a whole measure in music of free rhythm, such as ": null
    },
    {
        "Anglican chant": "anglican chant"
    },
    {
        ", irrespective of the time of the measure. This usage can be applied generally to any form of music.       The whole note symbol is first found in music notation from the late thirteenth century . It derives from the round, stemless  of ": null
    },
    {
        "mensural notation": "mensural notation"
    },
    {
        ", hence the origin of the British name.         The British term is taken from Italian semibreve, itself built upon Latin -semi half and brevis short. The American whole note is a ": null
    },
    {
        "calque": "calque"
    },
    {
        " of the German . Some languages derive the name of the note from its round shape, such as Catalan rodona, French ronde, and Spanish redonda": null
    }
]