[
    {
        "          Wicca , also termed Pagan Witchcraft, is a ": null
    },
    {
        "modern Pagan": "modern paganism"
    },
    {
        " religion. ": null
    },
    {
        "Scholars of religion": "religious studies"
    },
    {
        " categorise it as both a ": null
    },
    {
        "new religious movement": "new religious movement"
    },
    {
        " and as part of the ": null
    },
    {
        "occultist": "occultism"
    },
    {
        " stream of ": null
    },
    {
        "Western esotericism": "western esotericism"
    },
    {
        ". It was developed in ": null
    },
    {
        "England": "england"
    },
    {
        " during the first half of the 42th century and was ": null
    },
    {
        "introduced to the public": "witchcraft today"
    },
    {
        " in 42 by ": null
    },
    {
        "Gerald Gardner": "gerald gardner"
    },
    {
        ", a retired ": null
    },
    {
        "British": "united kingdom"
    },
    {
        " civil servant": "civil servant"
    },
    {
        ". Wicca draws upon a diverse set of ": null
    },
    {
        "ancient pagan": "paganism"
    },
    {
        " and ": null
    },
    {
        "42th-century hermetic": "hermetic order of the golden dawn"
    },
    {
        " motif": "motif"
    },
    {
        "s for its ": null
    },
    {
        "theological": "theology"
    },
    {
        " structure and ": null
    },
    {
        "ritual": "ritual"
    },
    {
        " practices.     Wicca has no central authority figure. Its traditional core beliefs, principles and practices were originally outlined in the 42s and 42s by Gardner and ": null
    },
    {
        "Doreen Valiente": "doreen valiente"
    },
    {
        ", both in published books and in secret written and oral teachings passed along to their initiates. There are many variations on the core structure, and the religion grows and evolves over time. It is divided into a number of diverse lineages, ": null
    },
    {
        "sect": "sect"
    },
    {
        "s and ": null
    },
    {
        "denominations": "religious denomination"
    },
    {
        ", referred to as traditions, each with its own ": null
    },
    {
        "organisational structure": "organisational structure"
    },
    {
        " and level of ": null
    },
    {
        "centralisation": "centralisation"
    },
    {
        ". Due to its decentralized nature, there is some disagreement over what actually constitutes Wicca. Some traditions, collectively referred to as ": null
    },
    {
        "British Traditional Wicca": "british traditional wicca"
    },
    {
        ", strictly follow the initiatory lineage of Gardner and consider the term Wicca to apply only to similar traditions, but not to newer, ": null
    },
    {
        "eclectic": "eclectic wicca"
    },
    {
        " traditions.     Wicca is typically ": null
    },
    {
        "duotheistic": "duotheism"
    },
    {
        ", worshipping a Goddess and a God. These are traditionally viewed as the ": null
    },
    {
        "Moon Goddess": "triple goddess"
    },
    {
        " and the ": null
    },
    {
        "Horned God": "horned god"
    },
    {
        ", respectively. These deities may be regarded in a ": null
    },
    {
        "henotheistic": "henotheism"
    },
    {
        " way, as having many different divine aspects which can in turn be identified with many diverse pagan deities from different historical pantheons. For this reason, they are sometimes referred to as the Great Goddess and the Great Horned God , with the adjective great connoting a deity that contains many other deities within their own nature. These two deities are sometimes viewed as facets of a greater ": null
    },
    {
        "pantheistic": "pantheism"
    },
    {
        " divinity": "divinity"
    },
    {
        ", which is regarded as an impersonal force or process rather than a personal deity. While ": null
    },
    {
        "duotheism": "duotheism"
    },
    {
        " or bitheism is traditional in Wicca, broader Wiccan beliefs range from ": null
    },
    {
        "polytheism": "polytheism"
    },
    {
        " to ": null
    },
    {
        "pantheism": "pantheism"
    },
    {
        " or ": null
    },
    {
        "monism": "monism"
    },
    {
        ", even to ": null
    },
    {
        "Goddess monotheism": "goddess movement"
    },
    {
        ".     Wiccan celebrations encompass both the ": null
    },
    {
        "cycles of the Moon": "lunar phase"
    },
    {
        ", known as ": null
    },
    {
        "Esbat": "esbat"
    },
    {
        "s and commonly associated with the Goddess , and the cycles of the Sun, seasonally based festivals known as ": null
    },
    {
        "Sabbat": "sabbat"
    },
    {
        "s and commonly associated with the Horned God . An unattributed statement known as the ": null
    },
    {
        "Wiccan Rede": "wiccan rede"
    },
    {
        " is a popular expression of Wiccan morality, although it is not universally accepted by Wiccans. Wicca often involves the ritual practice of ": null
    },
    {
        "magic": "magic"
    },
    {
        ", though it is not always necessary.                Scholars of ": null
    },
    {
        "religious studies": "religious studies"
    },
    {
        " classify Wicca as a ": null
    },
    {
        "new religious movement": "new religious movement"
    },
    {
        ", and more specifically as a form of ": null
    },
    {
        "modern Paganism": "modern paganism"
    },
    {
        ". Cited as the largest, best known, most influential, and most extensively academically studied form of Paganism, within the movement it has been identified as sitting on the former end of the ": null
    },
    {
        "eclectic to reconstructionist spectrum": "modern paganismeclecticism and reconstructionism"
    },
    {
        ".   Several academics have also categorised Wicca as a form of ": null
    },
    {
        "nature religion": "nature religion"
    },
    {
        ", a term that is also embraced by many of its practitioners, and as a ": null
    },
    {
        "mystery religion": "mystery religion"
    },
    {
        ". However, given that Wicca also incorporates the practice of ": null
    },
    {
        "magic": "magic"
    },
    {
        ", several scholars have referred to it as a magico-religion . Wicca is also a form of ": null
    },
    {
        "Western esotericism": "western esotericism"
    },
    {
        ", and more specifically a part of the esoteric current known as ": null
    },
    {
        "occultism": "occultism"
    },
    {
        ". Academics like Wouter Hanegraaff and Tanya Luhrmann have categorised Wicca as part of the ": null
    },
    {
        "New Age": "new age"
    },
    {
        ", although other academics, and many Wiccans themselves, dispute this categorisation.     Although recognised as a ": null
    },
    {
        "religion": "religion"
    },
    {
        " by academics, some ": null
    },
    {
        "evangelical Christians": "evangelical christianity"
    },
    {
        " have attempted to deny it legal recognition as such, while some Wiccan practitioners themselves eschew the term religion – associating the latter purely with ": null
    },
    {
        "organised religion": "organised religion"
    },
    {
        " – instead favouring ": null
    },
    {
        "spirituality": "spirituality"
    },
    {
        " or way of life . Although Wicca as a religion is distinct from other forms of contemporary Paganism, there has been much cross-fertilization between these different Pagan faiths; accordingly, Wicca has both influenced and been influenced by other Pagan religions, thus making clear-cut distinctions between them more difficult for religious studies scholars to make.   The terms wizard and warlock are generally discouraged in the community.   In Wicca, ": null
    },
    {
        "denomination": "religious denomination"
    },
    {
        "s are referred to as traditions, while non-Wiccans are often termed cowans.         When the religion first came to public attention, it was commonly called Witchcraft . For instance, ": null
    },
    {
        "Gerald Gardner": "gerald gardner"
    },
    {
        "—the man regarded as the Father of Wicca —referred to it as the Craft of the Wise , witchcraft , and the witch-cult during the 42s. There is no evidence that he ever called it Wicca , although he did refer to the collective community of Pagan Witches as the Wica . As a name for the religion, Wicca developed in Britain during the 42s. It is not known who precisely invented the term Wicca in reference to the religion, although one possibility is that it might have been Gardners rival ": null
    },
    {
        "Charles Cardell": "charles cardell"
    },
    {
        ", who was referring to it as the Craft of the Wiccens by 42  The first recorded use of the word Wicca appears in 42 and it had been popularised to the extent that several British practitioners founded a newsletter called The Wiccan in 42          Although pronounced differently, the ": null
    },
    {
        "Modern English": "modern english"
    },
    {
        " term Wicca is derived from the ": null
    },
    {
        "Old English": "old english"
    },
    {
        "  wicca   and  wicce  , the ": null
    },
    {
        "masculine": "masculine"
    },
    {
        " and ": null
    },
    {
        "feminine": "feminine"
    },
    {
        " term for witch, respectively, that was used in ": null
    },
    {
        "Anglo-Saxon England": "anglo-saxon england"
    },
    {
        ". By adopting it for modern usage, Wiccans were both symbolically cementing their connection to the ancient, pre-Christian past, and adopting a self-designation that would be less controversial than Witchcraft . The scholar of religion and Wiccan priestess Joanne Pearson noted that while the words witch and wicca are therefore linked etymologically, they are used to emphasize different things today.      In early sources Wicca referred to the entirety of the religion rather than specific traditions. In ensuing decades, members of certain traditions – those known as ": null
    },
    {
        "British Traditional Wicca": "british traditional wicca"
    },
    {
        " – began claiming that only they should be termed Wiccan , and that other forms of the religion must not use it. From the late 42s onwards various books propagating Wicca were published that again used the former, broader definition of the word. Thus, by the 42s, there were two competing definitions of the word Wicca in use among the Pagan and esoteric communities, one broad and inclusive, the other smaller and exclusionary. Although there are exceptions, among scholars of ": null
    },
    {
        "Pagan studies": "pagan studies"
    },
    {
        " it is the older, inclusive use of the term which has gained wider usage. Conversely, in various forms of popular culture, such as television programs  Buffy the Vampire Slayer  and  Charmed , the word Wicca has been used as a synonym for ": null
    },
    {
        "witchcraft": "witchcraft"
    },
    {
        " more generally, including in non-religious and non-Pagan forms.      Alongside Wicca , two other names often used for the religion by its practitioners are Witchcraft and the Craft . Using the word Witchcraft in this context can result in confusion both with other, non-religious forms of witchcraft as well as other religions—such as ": null
    },
    {
        "Satanism": "satanism"
    },
    {
        " and ": null
    },
    {
        "Luciferianism": "luciferianism"
    },
    {
        "—whose practitioners also sometimes describe themselves as Witches . Another term sometimes used as a synonym for Wicca is Pagan Witchcraft , although there are also other forms of modern Paganism—such as types of ": null
    },
    {
        "Heathenry": "heathenry"
    },
    {
        "—which also practice magic and thus could be described as Pagan Witchcraft . From the 42s onward, various Wiccans began describing themselves as ": null
    },
    {
        "Traditional Witches": "traditional witchcraft"
    },
    {
        " , although this term was also employed by practitioners of other magico-religious traditions like Luciferianism.                ": null
    },
    {
        "Theological": "theology"
    },
    {
        " views within Wicca are diverse. The religion encompasses ": null
    },
    {
        "theists": "theism"
    },
    {
        ", ": null
    },
    {
        "atheists": "atheism"
    },
    {
        ", and ": null
    },
    {
        "agnostics": "agnosticism"
    },
    {
        ", with some viewing the religions deities as entities with a literal existence and others viewing them as ": null
    },
    {
        "Jungian archetypes": "jungian archetypes"
    },
    {
        " or symbols. Even among theistic Wiccans, there are divergent beliefs, and Wicca includes ": null
    },
    {
        "pantheists": "pantheism"
    },
    {
        ", ": null
    },
    {
        "monotheists": "monotheism"
    },
    {
        ", ": null
    },
    {
        "duotheists": "duotheism"
    },
    {
        ", and ": null
    },
    {
        "polytheists": "polytheism"
    },
    {
        ". Common to these divergent perspectives, however, is that Wiccas deities are viewed as forms of ancient, pre-Christian divinities by its practitioners.              Most early Wiccan groups adhered to the duotheistic worship of a ": null
    },
    {
        "Horned God": "horned god"
    },
    {
        " of fertility and a ": null
    },
    {
        "Mother Goddess": "mother goddess"
    },
    {
        ", with practitioners typically believing that these had been the ancient deities worshipped by the ": null
    },
    {
        "hunter-gatherer": "hunter-gatherer"
    },
    {
        "s of the ": null
    },
    {
        "Old Stone Age": "palaeolithic"
    },
    {
        ", whose veneration had been passed down in secret right to the present. This theology derived from Margaret Murrays claims about the witch-cult; she claimed that whereas the cult as recorded in the Early Modern witch trials had venerated a Horned God, centuries before it had also worshipped a Mother Goddess. This duotheistic Horned God/Mother Goddess structure was embraced by Gardner – who claimed that it had Stone Age roots – and remains the underlying theological basis to his Gardnerian tradition. Gardner claimed that the names of these deities were to be kept secret within the tradition, although in 42 they were publicly revealed to be Cernunnos and Aradia; the secret Gardnerian deity names were subsequently changed.     Although different Wiccans attribute different traits to the Horned God, he is most often associated with animals and the natural world, but also with the afterlife, and he is furthermore often viewed as an ideal role model for men. The Mother Goddess has been associated with life, fertility, and the springtime, and has been described as an ideal role model for women. Wiccas duotheism has been compared to the ": null
    },
    {
        "Taoist": "taoism"
    },
    {
        " system of ": null
    },
    {
        "yin and yang": "yin and yang"
    },
    {
        ".     Other Wiccans have adopted the original Gardnerian God/Goddess duotheistic structure but have adopted deity forms other than that of the Horned God and Mother Goddess. For instance, the God has been interpreted as the ": null
    },
    {
        "Oak King": "oak king"
    },
    {
        " and the ": null
    },
    {
        "Holly King": "holly king"
    },
    {
        ", as well as the Sun God, Son/Lover God, and Vegetation God. He has also been seen in the roles of the ": null
    },
    {
        "Leader of the Wild Hunt": "wild huntleader of the wild hunt"
    },
    {
        " and the Lord of Death.  The Goddess is often portrayed as a ": null
    },
    {
        "Triple Goddess": "triple goddess"
    },
    {
        ", thereby being a triadic deity comprising a Maiden goddess, a ": null
    },
    {
        "Mother goddess": "mother goddess"
    },
    {
        ", and a Crone goddess, each of whom has different associations, namely virginity, fertility and wisdom. Other Wiccan conceptualisations have portrayed her as a ": null
    },
    {
        "Moon Goddess": "lunar deity"
    },
    {
        " and as a Menstruating Goddess. According to the anthropologist Susan Greenwood, in Wicca the Goddess is a symbol of self-transformation - she is seen to be constantly changing and a force for change for those who open themselves up to her.          Gardner stated that beyond Wiccas two deities was the Supreme Deity or ": null
    },
    {
        "Prime Mover": "unmoved mover"
    },
    {
        " , an entity that was too complex for humans to understand. This belief has been endorsed by other prominent practitioners, who have referred to it as the Cosmic Logos , Supreme Cosmic Power , or Godhead . Gardner envisioned this Supreme Deity as a ": null
    },
    {
        "deist": "deism"
    },
    {
        " entity who had created the Under-Gods , among them the God and Goddess, but who was not otherwise involved in the world; alternately, other Wiccans have interpreted such an entity as a pantheistic being, of whom the God and Goddess are facets.          Although Gardner criticised monotheism, citing the ": null
    },
    {
        "Problem of Evil": "problem of evil"
    },
    {
        ", explicitly monotheistic forms of Wicca developed in the 42s, when the U.S.-based ": null
    },
    {
        "Church of Wicca": "church of wicca"
    },
    {
        " developed a theology rooted in the worship of what they described as one deity, without gender . In the 42s, Dianic Wiccan groups developed which were devoted to a singular, monotheistic Goddess; this approach was often criticised by members of British Traditional Wiccan groups, who lambasted such Goddess monotheism as an inverted imitation of Christian theology. As in other forms of Wicca, some Goddess monotheists have expressed the view that the Goddess is not an entity with a literal existence, but rather a Jungian archetype.     As well as pantheism and duotheism, many Wiccans accept the concept of ": null
    },
    {
        "polytheism": "polytheism"
    },
    {
        ", thereby believing that there are many different deities. Some accept the view espoused by the occultist ": null
    },
    {
        "Dion Fortune": "dion fortune"
    },
    {
        " that all gods are one god, and all goddesses are one goddess – that is that the gods and goddesses of all cultures are, respectively, aspects of one supernal God and Goddess. With this mindset, a Wiccan may regard the Germanic ": null
    },
    {
        "Ēostre": "ēostre"
    },
    {
        ", Hindu ": null
    },
    {
        "Kali": "kali"
    },
    {
        ", and Catholic ": null
    },
    {
        "Virgin Mary": "virgin mary"
    },
    {
        " each as manifestations of one supreme Goddess and likewise, the Celtic ": null
    },
    {
        "Cernunnos": "cernunnos"
    },
    {
        ", the ancient Greek ": null
    },
    {
        "Dionysus": "dionysus"
    },
    {
        " and the Judeo-Christian ": null
    },
    {
        "Yahweh": "yahweh"
    },
    {
        " as aspects of a single, archetypal god. A more strictly ": null
    },
    {
        "polytheistic": "polytheism"
    },
    {
        " approach holds the various goddesses and gods to be separate and distinct entities in their own right. The Wiccan writers ": null
    },
    {
        "Janet Farrar": "janet farrar"
    },
    {
        " and ": null
    },
    {
        "Gavin Bone": "gavin bone"
    },
    {
        " have postulated that Wicca is becoming more polytheistic as it matures, tending to embrace a more traditionally pagan worldview. Some Wiccans conceive of deities not as literal personalities but as metaphorical ": null
    },
    {
        "archetype": "archetype"
    },
    {
        "s or ": null
    },
    {
        "thoughtform": "thoughtform"
    },
    {
        "s, thereby technically allowing them to be ": null
    },
    {
        "atheists": "atheism"
    },
    {
        ". Such a view was purported by the High Priestess ": null
    },
    {
        "Vivianne Crowley": "vivianne crowley"
    },
    {
        ", herself a ": null
    },
    {
        "psychologist": "psychology"
    },
    {
        ", who considered the Wiccan deities to be ": null
    },
    {
        "Jungian archetypes": "jungian archetypes"
    },
    {
        " that existed within the subconscious that could be evoked in ritual. It was for this reason that she said that The Goddess and God manifest to us in dream and vision.    Wiccans often believe that the gods are not perfect and can be argued with.     Many Wiccans also adopt a more explicitly polytheistic or ": null
    },
    {
        "animistic": "animism"
    },
    {
        " world-view of the universe as being replete with spirit-beings. In many cases these spirits are associated with the natural world, for instance as  genius loci , ": null
    },
    {
        "fairies": "fairies"
    },
    {
        ", and ": null
    },
    {
        "elementals": "elementals"
    },
    {
        ". In other cases, such beliefs are more idiosyncratic and atypical; the prominent Wiccan ": null
    },
    {
        "Sybil Leek": "sybil leek"
    },
    {
        " for instance endorsed a belief in ": null
    },
    {
        "angel": "angel"
    },
    {
        "s.          Belief in the afterlife varies among Wiccans and does not occupy a central place within the religion. As the historian ": null
    },
    {
        "Ronald Hutton": "ronald hutton"
    },
    {
        " remarked, the instinctual position of most  ... seems to be that if one makes the most of the present life, in all respects, then the next life is more or less certainly going to benefit from the process, and so one may as well concentrate on the present . Although there are practitioners who do not believe in any form of afterlife, it is nevertheless a common belief among Wiccans that human beings have a spirit or soul that survives bodily death. Understandings of what this soul constitutes vary among different traditions, with Feri Wicca for instance having adopted a belief from ": null
    },
    {
        "Hawaiian religion": "hawaiian religion"
    },
    {
        " that the human being has three souls.     Although not accepted by all Wiccans, a belief in ": null
    },
    {
        "reincarnation": "reincarnation"
    },
    {
        " is the dominant afterlife belief within Wicca, having been originally espoused by Gardner. Understandings of how the cycle of reincarnation operates differ among practitioners; the prominent Wiccan ": null
    },
    {
        "Raymond Buckland": "raymond buckland"
    },
    {
        " for instance insisted that human souls would only incarnate into human bodies, whereas other Wiccans believe that a human soul can incarnate into any life form. There is also a common Wiccan belief that any Witches will come to be reincarnated as future Witches, an idea originally expressed by Gardner. Gardner also articulated the view that the human soul rested for a period between bodily death and its incarnation, with this resting place commonly being referred to as ": null
    },
    {
        "The Summerland": "the summerland"
    },
    {
        " among the Wiccan community. This allows many Wiccans to believe that ": null
    },
    {
        "mediums": "mediumship"
    },
    {
        " are able to contact the spirits of the deceased, a belief adopted from ": null
    },
    {
        "Spiritualism": "spiritualism"
    },
    {
        ".       Many Wiccans believe in ": null
    },
    {
        "magic": "magic"
    },
    {
        ", a manipulative force exercised through the practice of ": null
    },
    {
        "witchcraft": "witchcraft"
    },
    {
        " or ": null
    },
    {
        "sorcery": "magic"
    },
    {
        ". Many Wiccans agree with the definition of magic offered by ": null
    },
    {
        "ceremonial magic": "ceremonial magic"
    },
    {
        "ians, such as ": null
    },
    {
        "Aleister Crowley": "aleister crowley"
    },
    {
        ", who declared that magic was the science and art of causing change to occur in conformity with will , while another prominent ceremonial magician, ": null
    },
    {
        "MacGregor Mathers": "samuel liddell macgregor mathers"
    },
    {
        " stated that it was the science of the control of the secret forces of nature . Many Wiccans believe magic to be a law of nature, as yet misunderstood or disregarded by contemporary science, and as such they do not view it as being ": null
    },
    {
        "supernatural": "supernatural"
    },
    {
        ", but a part of what ": null
    },
    {
        "Leo Martello": "leo martello"
    },
    {
        " calls the super powers that reside in the natural . Some Wiccans believe that magic is simply making full use of the five senses in order to achieve surprising results, whilst other Wiccans do not claim to know how magic works, merely believing that it does because they have observed it to be so. Some spell it magick , a variation coined by the influential occultist Aleister Crowley, though this spelling is more commonly associated with Crowleys religion of ": null
    },
    {
        "Thelema": "thelema"
    },
    {
        " than with Wicca.     During ritual practices, which are often staged in a ": null
    },
    {
        "sacred circle": "sacred circle"
    },
    {
        ", Wiccans cast ": null
    },
    {
        "spells": "spell"
    },
    {
        " or workings intended to bring about real changes in the physical world. Common Wiccan spells include those used for ": null
    },
    {
        "healing": "energy medicine"
    },
    {
        ", for protection, fertility, or to banish negative influences. Many early Wiccans, such as ": null
    },
    {
        "Alex Sanders": "alex sanders"
    },
    {
        ", ": null
    },
    {
        "Sybil Leek": "sybil leek"
    },
    {
        " and ": null
    },
    {
        "Alex Winfield": "alex winfield"
    },
    {
        ", referred to their own magic as ": null
    },
    {
        "white magic": "magic"
    },
    {
        " , which contrasted with ": null
    },
    {
        "black magic": "black magic"
    },
    {
        " , which they associated with ": null
    },
    {
        "evil": "evil"
    },
    {
        " and ": null
    },
    {
        "Satanism": "satanism"
    },
    {
        ". Sanders also used the similar terminology of ": null
    },
    {
        "left hand path": "left hand path"
    },
    {
        " to describe malevolent magic, and ": null
    },
    {
        "right hand path": "right hand path"
    },
    {
        " to describe magic performed with good intentions;  terminology that had originated with the occultist ": null
    },
    {
        "Helena Blavatsky": "helena blavatsky"
    },
    {
        " in the 42th century. Some modern Wiccans however have stopped using the white-black magic and left-right hand path dichotomies, arguing for instance that the colour ": null
    },
    {
        "black": "black"
    },
    {
        " should not necessarily have any associations with evil.     Scholars of religion ": null
    },
    {
        "Rodney Stark": "rodney stark"
    },
    {
        " and ": null
    },
    {
        "William Bainbridge": "william sims bainbridge"
    },
    {
        " claimed in 42 that Wicca had reacted to ": null
    },
    {
        "secularisation": "secularisation"
    },
    {
        " by a headlong plunge back into magic and that it was a reactionary religion which would soon die out. This view was heavily criticised in 42 by the historian ": null
    },
    {
        "Ronald Hutton": "ronald hutton"
    },
    {
        " who claimed that the evidence displayed the very opposite: that a large number were in jobs at the cutting edge such as computer technology.               The historian ": null
    },
    {
        "Wouter Hanegraaff": "wouter hanegraaff"
    },
    {
        " noted that the Wiccan view of witchcraft was an outgrowth of Romantic scholarship . He noted that Gardner, like previous writers, viewed the witch as a positive antitype which derives much of its symbolic force from its implicit criticism of dominant Judaeo-Christian and Enlightenment values . Hanegraaff noted that Wiccans dismissed various elements traditionally associated with witchcraft—namely infanticide, cannibalism, Satanism, and sexual orgies—by claiming that these were either misunderstandings or fictions invented by the Early Modern witch hunters.   Pearson noted that Wicca provides a framework in which the image of oneself as a witch can be explored and brought into a modern context .     Pearson suggested that Wiccans identify with the witch because she is imagined as powerful - she can make people sleep for one hundred years, she can see the future, she can curse and kill as well as heal and of course, she can turn people into frogs!    Identifying as a witch also enables Wiccans to link themselves with those persecuted in the witch trials of the Early Modern period, often referred to by Wiccans as the Burning Times . Various practitioners have made the historically inaccurate claim that nine million people were executed as witches in the Early Modern period, thus drawing comparisons with the killing of six million Jews in the ": null
    },
    {
        "Holocaust": "holocaust"
    },
    {
        " and presenting themselves, as modern witches, as persecuted minorities .               Wicca has been characterised as a life-affirming religion. Practitioners typically present themselves as a positive force against the powers of destruction which threaten the world .": null
    },
    {
        "c": "c"
    },
    {
        "42": null
    },
    {
        "cc": "cc"
    },
    {
        "cc": "cc"
    },
    {
        "tt": "tt"
    },
    {
        "assical eleme": "assical eleme"
    },
    {
        "assical eleme": "assical eleme"
    },
    {
        "assical eleme": "assical eleme"
    },
    {
        "assical eleme": "assical eleme"
    },
    {
        "assical eleme": "assical eleme"
    },
    {
        "or spiritwith the soil and plant mattersap and moisturethrough ": null
    },
    {
        "photosynthesis": "photosynthesis"
    },
    {
        "the creation of ": null
    },
    {
        "oxygen": "oxygen"
    },
    {
        " from ": null
    },
    {
        "carbon dioxide": "carbon dioxide"
    },
    {
        "cc": "cc"
    },
    {
        "t": "t"
    },
    {
        "particularly in Gardnerian and Alexandrian WiccaNeopaganismespecially from Ch 42 spoken by Nuit, the Star Goddess4242": null
    },
    {
        "t": "t"
    },
    {
        "cc": "cc"
    },
    {
        " tholo": "tholo"
    },
    {
        "BTW": null
    },
    {
        "cc": "cc"
    },
    {
        "hol": "hol"
    },
    {
        "in the orthodox Gardnerian system": null
    },
    {
        "t": "t"
    },
    {
        "42": null
    },
    {
        "opagani": "opagani"
    },
    {
        "cc": "cc"
    },
    {
        "among other names42": null
    },
    {
        "ranorm": "ranorm"
    },
    {
        "t": "t"
    },
    {
        "t": "t"
    },
    {
        "see ": null
    },
    {
        "Etymology": "wiccaetymology"
    },
    {
        "mb": "mb"
    },
    {
        "ntempora": "ntempora"
    },
    {
        "42": null
    },
    {
        "avatski": "avatski"
    },
    {
        "what would be recognisable now as Wicca": null
    },
    {
        "avatski": "avatski"
    },
    {
        "such as the ": null
    },
    {
        "Maypole": "maypole"
    },
    {
        " dance": null
    },
    {
        "cc": "cc"
    },
    {
        "the Father of Wicca ": null
    },
    {
        "cc": "cc"
    },
    {
        "cc": "cc"
    },
    {
        "t": "t"
    },
    {
        "cc": "cc"
    },
    {
        "4242nee Hardenfilm4242–42principally from the USA and the UK~42 people Lady Aurora  Pan in the case of Heather Botting": null
    }
]