[
    {
        "           Wieringen  is part of the new municipality of ": null
    },
    {
        "Hollands Kroon": "hollands kroon"
    },
    {
        ", established in 42 in the province of ": null
    },
    {
        "North Holland": "north holland"
    },
    {
        " in the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ". It is a former municipality in this province, with its name appearing in records of the late 42th and early 42th century. From 42 it was known as an island, also named Wieringen, which was separated by water from the mainland during one of the disastrous storm floods towards the end of the late Middle Ages that changed the coastline. By draining, dikes and landfill from 42 to 42 the island was rejoined to the mainland.     In the 42st century, the local governments proposed a project to restore the insular status of Wieringen by construction of a recreational lake to be called the ": null
    },
    {
        "Wieringerrandmeer": "wieringerrandmeer"
    },
    {
        ". The project was cancelled in 42 for financial reasons.       The former municipality of Wieringen consisted of the following cities, towns, villages and/or districts: ": null
    },
    {
        "Dam": "dam, netherlands"
    },
    {
        ", ": null
    },
    {
        "De Haukes": "de haukes"
    },
    {
        ", ": null
    },
    {
        "De Hoelm": "de hoelm"
    },
    {
        ", ": null
    },
    {
        "Den Oever": "den oever"
    },
    {
        ", ": null
    },
    {
        "Hippolytushoef": "hippolytushoef"
    },
    {
        ", ": null
    },
    {
        "Hollebalg": "hollebalg"
    },
    {
        ", ": null
    },
    {
        "Noordburen": "noordburen"
    },
    {
        ", ": null
    },
    {
        "Oosterklief": "oosterklief"
    },
    {
        ", ": null
    },
    {
        "Oosterland": "oosterland, north holland"
    },
    {
        ", ": null
    },
    {
        "Smerp": "smerp"
    },
    {
        ", ": null
    },
    {
        "Stroe": "stroe, north holland"
    },
    {
        ", ": null
    },
    {
        "Vatrop": "vatrop"
    },
    {
        ", ": null
    },
    {
        "Westerklief": "westerklief"
    },
    {
        " and ": null
    },
    {
        "Westerland": "westerland, netherlands"
    },
    {
        ".        The landscape of Wieringen is not all flat: it is characterised by dam ramparts of ": null
    },
    {
        "boulder clay": "boulder clay"
    },
    {
        ", which were formed during the Saale ": null
    },
    {
        "Ice Age": "ice age"
    },
    {
        ". The name Wieringen has nothing to do with wier , but this connection was often made in former days. Probably the name came from ": null
    },
    {
        "Old Frisian": "old frisian"
    },
    {
        " wîr height .       The first known written references to Wieringen are as Wiron or pagus Wirense in ": null
    },
    {
        "Latin": "latin"
    },
    {
        " in a  owned by the ": null
    },
    {
        "monastery": "monastery"
    },
    {
        " at ": null
    },
    {
        "Fulda": "fulda"
    },
    {
        ", dated late 42th century or early 42th century AD. In that list, the entries that mention Wieringen are:-     :Ego Gebi tradidi ad monasterium sancti Bonifacii in pago Wirense curtilem unam cum omnibus que ad eam pertinent, terris et mancipiis, domibus et mancipiis.   : I, Gebi, have transferred to the monastery of St. ": null
    },
    {
        "Bonifacius": "bonifacius"
    },
    {
        " in the area Wieringen one mansion with all that goes with it, land with the serfs and dwellings with the serfs. .     :Ego Gerwic de Fresia trado sancto Bonifacio ad Fuldense monasterium terram iuris mei iuxta fluvium Maresdeop et quicquid proprietatis habui sive in agris vel pratis, silvis, domibus vel mancipiis.   : I, Gerwic of ": null
    },
    {
        "Friesland": "friesland"
    },
    {
        ", transfer to St. ": null
    },
    {
        "Bonifacius": "bonifacius"
    },
    {
        " of the ": null
    },
    {
        "monastery": "monastery"
    },
    {
        " of ": null
    },
    {
        "Fulda": "fulda"
    },
    {
        " the land that is under my jurisdiction near the river ": null
    },
    {
        "Marsdiep": "marsdiep"
    },
    {
        ", and all I had in possession either fields or meadows, forests, houses or serfs. .     ::It describes the ": null
    },
    {
        "Marsdiep": "marsdiep"
    },
    {
        " as fluvium Maresdeop : fluvium is ": null
    },
    {
        "Latin": "latin"
    },
    {
        " for river ; it seems that in that time ": null
    },
    {
        "Texel": "texel"
    },
    {
        " and Wieringen were much bigger and spread across what is now the western end of the ": null
    },
    {
        "Waddenzee": "waddenzee"
    },
    {
        " and perhaps also other areas which are now sea or have been re-empoldered since. Wieringen and Texel may have met as opposite banks of the Maresdeop , which was then an ordinary river with banks of permanent land .     :Ego Geltrud tradidi ad monasterium sancti Bonifacii omnem proprietatem meam in agris, silvis et de pratis ad XX carradas feni, in loco nuncupato Wictulfingafurt in pago Wironi. I, Geltrud, have transferred to the monastery of St. ": null
    },
    {
        "Bonifacius": "bonifacius"
    },
    {
        " all my property in fields, forests and from the meadows to 42 cart-loads of ": null
    },
    {
        "hay": "hay"
    },
    {
        ", in the place named Wictulfingafurt, in the area Wieringen ... . Wictulfingafurt means the ": null
    },
    {
        "ford": "ford"
    },
    {
        " of the sons or people of a man called Wictulf .     :Ego in Dei nomine Isanbalt et uxor mea Sigibirn de Fresia tradimus ad sanctum Bonifacium in villa que dicitur Brochenlar, in pago Wirah, quicquid proprietatis habuimus, hoc est de terra arabili quantum XI modus conseri potest. In Gods name I, Isanbalt and my wife Sigibirn from ": null
    },
    {
        "Friesland": "friesland"
    },
    {
        ", transfer to St. Bonifacius in the ": null
    },
    {
        "manor": "manorialism"
    },
    {
        " which is named Brochenlar, in the area Wieringen, all we had in property, that is of ": null
    },
    {
        "plough": "plough"
    },
    {
        "land as much as can be sowed with 42 measures     ::The places Wictulfingafurt and Brochenlar cannot now be found, and their sites are likeliest now under the sea, or under some ": null
    },
    {
        "polder": "polder"
    },
    {
        " which has been made since.     :Ego Hunbertus tradidi ad sanctum Bonifacium quicquid mihi in regione Frésionum in pago Wirah mei reliquere parentes in hereditatem, cunctamque meam possessionem, hoc est in terris, agris, pratis, pascuis, silvis, aquis, domibus ac familiis. I, Hunbertus, have transferred to St. Bonifacius whatever in the region of the ": null
    },
    {
        "Frisians": "frisians"
    },
    {
        " in the area Wieringen my parents left me in inheritance, and my complete possessions, that it in fields, meadows, grassland, forests, waters, dwellings, and all the families .     ::These gifts are all dated between 42AD and 42AD and include 42 manors. A possessions list of the St. Martins church in ": null
    },
    {
        "Utrecht": "utrecht"
    },
    {
        ", dated 42 lists a church domain with 42 farms at Alvitlo , and 42 farms at Strude . Both these places still exist and are in Wieringen. The amount of property in land in these two lists composed an area larger than the modern island of Wieringen.       In 42 ": null
    },
    {
        "silver": "silver"
    },
    {
        " treasure": "treasure"
    },
    {
        " was found in a pasture at the hamlet of ": null
    },
    {
        "Westerklief": "westerklief"
    },
    {
        ". It has been dated to the 42th century and is attributed to ": null
    },
    {
        "Viking": "viking"
    },
    {
        "s, who likely had an operating base there. The treasure is approx. 42 kilograms of silver coins and jewels, and small silver ingots. It now can be seen in the ": null
    },
    {
        "Rijksmuseum voor Oudheden": "rijksmuseum voor oudheden"
    },
    {
        " in Leiden. Some years later smaller silver treasures from the same period were found in this area, confirming the theories of origin. Wieringen became an island around 42 as a result of successive storm floods that surrounded it with water. This status lasted for more than 42 years.     The ": null
    },
    {
        "All Saints Flood ": "all saints flood"
    },
    {
        " created the islands of Wieringen and Texel from ": null
    },
    {
        "North Holland": "north holland"
    },
    {
        ".  The larger area was inhabited and controlled by ": null
    },
    {
        "Frisians": "frisians"
    },
    {
        ", until the Dutch count ": null
    },
    {
        "Floris V": "floris v"
    },
    {
        " made the Wieringers subject in 42 Afterwards the area was unquiet for a time. Since 42 it was directly under the ": null
    },
    {
        "county of Holland": "county of holland"
    },
    {
        ", for it fell under Westfriesland, for a time under Frisian rule. In 42 the county of Holland retook Holland and Westfriesland. Wieringen was included in the district of Westfriesland.     In 42 all the island of Wieringen officially was designated as one township and received ": null
    },
    {
        "city rights": "city rights in the netherlands"
    },
    {
        ". But as more of Holland and Westfriesland were developed and became more habitable, the importance of Wieringen decreased.             In 42 when the ": null
    },
    {
        "Batavian Republic": "batavian republic"
    },
    {
        " formed, the province of ": null
    },
    {
        "Holland": "holland"
    },
    {
        " and ": null
    },
    {
        "West Friesland": "west friesland"
    },
    {
        " was divided differently: it fell under the ": null
    },
    {
        "département": "département"
    },
    {
        " of Texel . In 42 under ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        ", the province was subdivided into two separate provinces; Amstelland and Maasland, but this organization ended in 42 In 42 Holland with Westfriesland became a province of the Kingdom of the Netherlands. To reduce the dominance of the province of Holland, in 42 under King Willem I, it was split into the provinces of ": null
    },
    {
        "Noord-Holland": "noord-holland"
    },
    {
        " and ": null
    },
    {
        "Zuid-Holland": "zuid-holland"
    },
    {
        ". Since then Wieringen has been within the province of ": null
    },
    {
        "Noord-Holland": "noord-holland"
    },
    {
        ".     In the early 42th century, Wieringen was known as the place of exile of German crown prince ": null
    },
    {
        "Wilhelm": "william, german crown prince"
    },
    {
        ", who received political asylum after fleeing with his father ": null
    },
    {
        "Wilhelm II": "william ii, german emperor"
    },
    {
        " from Flanders to the Netherlands in November 42 during the ": null
    },
    {
        "German Revolution": "german revolution"
    },
    {
        ". Wilhelm II went into exile in ": null
    },
    {
        "Doorn": "doorn"
    },
    {
        ". The crown prince settled on the island on 42 November 42 where he stayed until his return to Germany on 42 November 42 During this time he learned how to forge ": null
    },
    {
        "horseshoe": "horseshoe"
    },
    {
        "s at the blacksmithy in ": null
    },
    {
        "Hippolytushoef": "hippolytushoef"
    },
    {
        ".     On 42 July 42 the ": null
    },
    {
        "Amsteldiep": "amsteldiep"
    },
    {
        " was closed by a short dam called the Amsteldiepdijk. In 42 the Eastern Wieringermeerdijk was completed in the Zuiderzee, and with it the adjacent polder the ": null
    },
    {
        "Wieringermeer": "wieringermeer"
    },
    {
        ". The closing of the Zuiderzee was completed in 42 by the ": null
    },
    {
        "Afsluitdijk": "afsluitdijk"
    },
    {
        ", a large dike which connects Wieringen with Friesland, making it part of the mainland again. This dike starts at ": null
    },
    {
        "Den Oever": "den oever"
    },
    {
        ".       The former municipal council of Wieringen consisted of 42 seats, which were divided as follows:     OW 42 – 42 seats   ": null
    },
    {
        "VVD": "peoples party for freedom and democracy"
    },
    {
        " – 42 seats   ": null
    },
    {
        "PvdA": "labour party"
    },
    {
        " – 42 seats   ": null
    },
    {
        "CDA": "christian democratic appeal"
    }
]