[
    {
        "Wilhelm Martin Leberecht de Wette was a ": null
    },
    {
        "German": "germany"
    },
    {
        " theologian": "theology"
    },
    {
        " and ": null
    },
    {
        "biblical scholar": "biblical studies"
    },
    {
        ".       He was born at ": null
    },
    {
        "Ulla": "ulla"
    },
    {
        ", near ": null
    },
    {
        "Weimar": "weimar"
    },
    {
        ", where his father was ": null
    },
    {
        "pastor": "pastor"
    },
    {
        ". He was sent to the ": null
    },
    {
        "gymnasium": "gymnasium"
    },
    {
        " at Weimar, then at the height of its literary fame. Here he was much influenced by ": null
    },
    {
        "Johann Gottfried von Herder": "johann gottfried von herder"
    },
    {
        ", who frequently examined at the school. In 42 he entered on his theological studies at ": null
    },
    {
        "Jena": "university of jena"
    },
    {
        ", his principal teachers being ": null
    },
    {
        "J. J. Griesbach": "johann jakob griesbach"
    },
    {
        " and ": null
    },
    {
        "H. E. G. Paulus": "heinrich eberhard gottlob paulus"
    },
    {
        "; from the latter he derived his tendency to free critical inquiry. In addition, by the time he submitted his dissertation in 42 , he was in regular contact at Jena with ": null
    },
    {
        "Jakob Friedrich Fries": "jakob friedrich fries"
    },
    {
        " and ": null
    },
    {
        "Karl David Ilgen": "karl david ilgen"
    },
    {
        ", who perhaps led him to his contact with ": null
    },
    {
        "Johann Severin Vater": "johann severin vater"
    },
    {
        ", a scholar whose work he both admired and, in some respects, duplicated independently. Both in methods and in results, however, he occupied an almost solitary position among German theologians.     Having taken his doctors degree, he became Privatdozent at Jena; in 42 professor of theology at ": null
    },
    {
        "Heidelberg": "university of heidelberg"
    },
    {
        ", where he came under the influence of ": null
    },
    {
        "Jakob Friedrich Fries": "jakob friedrich fries"
    },
    {
        " , whose hiring he helped arrange ; and in 42 was transferred to a similar chair in the newly founded ": null
    },
    {
        "Friedrich Wilhelm University": "humboldt university of berlin"
    },
    {
        " in ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ", where he became friendly with ": null
    },
    {
        "Friedrich Schleiermacher": "friedrich schleiermacher"
    },
    {
        ". He was, however, dismissed from Berlin in 42 on account of his having written a letter of consolation to the mother of ": null
    },
    {
        "Karl Ludwig Sand": "karl ludwig sand"
    },
    {
        ", the murderer of ": null
    },
    {
        "August Friedrich Ferdinand von Kotzebue": "august friedrich ferdinand von kotzebue"
    },
    {
        ". A petition in his favour presented by the senate of the university was unsuccessful, and a decree was issued not only depriving him of the chair but also banishing him from the Prussian kingdom.     He retired to Weimar, where he occupied his leisure in the preparation of his edition of ": null
    },
    {
        "Martin Luther": "martin luther"
    },
    {
        " and in writing the romance Theodor oder die Weihe des Zweiflers , in which he describes the education of an evangelical pastor. He began preaching, at which he proved to be very popular. But in 42 he accepted the chair of theology in the ": null
    },
    {
        "University of Basel": "university of basel"
    },
    {
        ", which had been reorganized four years before. Though his appointment had been strongly opposed by the orthodox party, De Wette soon won for himself great influence both in the university and among the people generally. He was admitted a citizen and became rector of the university, which owed to him much of its recovered strength, particularly in the theological faculty.       De Wette has been described by ": null
    },
    {
        "Julius Wellhausen": "julius wellhausen"
    },
    {
        " as the epoch-making opener of the historical criticism of the ": null
    },
    {
        "Pentateuch": "pentateuch"
    },
    {
        ". He prepared the way for the Supplement-theory. But he also made valuable contributions to other branches of theology. He had, moreover, considerable poetic faculty, and wrote a drama in three acts, entitled Die Entsagung . He had an intelligent interest in art, and studied ecclesiastical music and architecture. As a Biblical critic he is sometimes classed with the destructive school, but, as ": null
    },
    {
        "Otto Pfleiderer": "otto pfleiderer"
    },
    {
        " says , he occupied as free a position as the ": null
    },
    {
        "Rationalists": "rationalism"
    },
    {
        " with regard to the literal authority of the creeds of the church, but that he sought to give their due value to the religious feelings, which the Rationalists had not done, and, with a more unfettered mind towards history, to maintain the connection of the present life of the church with the past. His works are marked by exegetical skill, unusual power of condensation and uniform fairness. Accordingly they possess value which is little affected by the progress of criticism.       De Wette married three times, first with Eberhardine Boye, then Henriette, née Frisch, widowed Beck, the mother of ": null
    },
    {
        "Charles Beck": "charles beck"
    },
    {
        ", and the third time in 42 Sophie, née Streckeisen, widow of the Berne pastor Abraham Rudolf von May.       De Wette died in ": null
    },
    {
        "Basel": "basel"
    },
    {
        ".       His most important works are: Beiträge zur Einleitung in das Alte Testament   Kommentar über die Psalmen , which has passed through several editions   Lehrbuch der hebräisch-jüdischen Archäologie   Über Religion und Theologie ; a work of great importance as showing its authors general theological position   Lehrbuch der christlichen Dogmatik   Lehrbuch der historisch-kritischen Einleitung in die Bibel   Christliche Sittenlehre   Einleitung in das Neue Testament   Religion, ihr Wesen, ihre Erscheinungsform, und ihr Einfluss auf das Leben   Das Wesen des christlichen Glaubens   Kurzgefasstes exegetisches Handbuch zum Neuen Testament .     De Wette also edited Luthers works .            From ": null
    },
    {
        "Google Books": "google books"
    },
    {
        ":   Dr. Martin Luthers Briefe, Sendschreiben und Bedenken: vollständig aus den verschiedenen Ausgaben seiner Werke und Briefe, aus andern Büchern und noch unbenutzten Handschriften gesammelt, kritisch und historisch bearbeitet, 42 vols., Berlin: , vol. 42 ed. by  - German  and Latin. Reviewed here ,        , Erster Theil, Berlin: Georg Reimer, 42   , fünfte auflage, herausgegeben von Dr. ": null
    },
    {
        "Gustav Baur": ":de:gustav baur"
    },
    {
        ", Professor der Theologie an der Universität ": null
    },
    {
        "Giessen": "giessen"
    },
    {
        ", Akademische Verlagshandlung, Heidelberg, 42 42 which passed through several editions, and was long regarded as of high authority.   , Frederick Frothingham, tr., Boston: Crosby, Nichols and Company, 42   ": null
    }
]