[
    {
        "   Wilhelm Heinrich Immanuel Bleek was a German ": null
    },
    {
        "linguist": "linguistics"
    },
    {
        ". His work included A Comparative Grammar of South African Languages and his great project jointly executed with ": null
    },
    {
        "Lucy Lloyd": "lucy lloyd"
    },
    {
        ": The Bleek and Lloyd Archive of ": null
    },
    {
        "ǀxam": "ǀxam language"
    },
    {
        " and ": null
    },
    {
        "!kun": "!kung language"
    },
    {
        " texts. A short form of this eventually reached press with  Specimens of Bushman Folklore , which ": null
    },
    {
        "Laurens van der Post": "laurens van der post"
    },
    {
        " drew on heavily.         Wilhelm Heinrich Immanuel Bleek was born in ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        " on 42 March 42 He was the eldest son of ": null
    },
    {
        "Friedrich Bleek": "friedrich bleek"
    },
    {
        ", Professor of Theology at ": null
    },
    {
        "Berlin University": "berlin university"
    },
    {
        " and then at the ": null
    },
    {
        "University of Bonn": "university of bonn"
    },
    {
        ", and Augusta Charlotte Marianne Henriette Sethe. He graduated from the University of Bonn in 42 with a doctorate in linguistics, after a period in Berlin where he went to study Hebrew and where he first became interested in ": null
    },
    {
        "African languages": "african languages"
    },
    {
        ". Bleeks thesis featured an attempt to link North African and ": null
    },
    {
        "Khoikhoi": "khoikhoi"
    },
    {
        " languages – the thinking at the time being that all African languages were connected. After graduating in Bonn, Bleek returned to Berlin and worked with a ": null
    },
    {
        "zoologist": "zoologist"
    },
    {
        ", Dr ": null
    },
    {
        "Wilhelm K H Peters": "wilhelm peters"
    },
    {
        ", editing vocabularies of ": null
    },
    {
        "East African languages": "east african languages"
    },
    {
        ". His interest in African languages was further developed during 42 and 42 by learning ": null
    },
    {
        "Egyptian Arabic": "egyptian arabic"
    },
    {
        " from Professor ": null
    },
    {
        "Karl Richard Lepsius": "karl richard lepsius"
    },
    {
        ", whom he met in Berlin in 42     Bleek was appointed official linguist to Dr ": null
    },
    {
        "William Balfour Baikie": "william balfour baikie"
    },
    {
        "s ": null
    },
    {
        "Niger": "niger"
    },
    {
        " Tshadda Expedition": "tshadda expedition"
    },
    {
        " in 42 Ill-health  forced his return to England where he met ": null
    },
    {
        "George Grey": "george edward grey"
    },
    {
        " and ": null
    },
    {
        "John William Colenso": "john william colenso"
    },
    {
        ", the Anglican ": null
    },
    {
        "Bishop of Natal": "bishop of natal"
    },
    {
        ", who invited Bleek to join him in Natal in 42 to help compile a ": null
    },
    {
        "Zulu": "zulu language"
    },
    {
        " grammar. After completing Colensos project, Bleek travelled to ": null
    },
    {
        "Cape Town": "cape town"
    },
    {
        " in 42 to become Sir George Greys official interpreter as well as to catalogue his private library. Grey had philological interests and was Bleeks patron during his time as ": null
    },
    {
        "Governor of the Cape": "governor of the cape"
    },
    {
        ". The two had a good professional and personal relationship based on an admiration that appears to have been mutual. Bleek was widely respected as a ": null
    },
    {
        "philologist": "philologist"
    },
    {
        ", particularly in the Cape. While working for Grey he continued with his philological research and contributed to various publications during the late 42s. Bleek requested examples of ": null
    },
    {
        "African literature": "african literature"
    },
    {
        " from missionaries and travellers, such as the Revd W Kronlein who provided Bleek with ": null
    },
    {
        "Namaqua": "nama people"
    },
    {
        " texts in 42     In 42 Bleek briefly returned to Europe in an effort to improve his poor health but returned to the Cape and his research soon after. In 42 Bleek met his future wife, Jemima Lloyd, at the ": null
    },
    {
        "boarding house": "boarding house"
    },
    {
        " where he lived in Cape Town , while she was waiting for a passage to England, and they developed a relationship through correspondence. She returned to Cape Town from England the following year.     Bleek married Jemima Lloyd on 42 November 42 The Bleeks first lived at The Hill in ": null
    },
    {
        "Mowbray": "mowbray, cape town"
    },
    {
        " but moved in 42 to ": null
    },
    {
        "Charlton House": "charlton house, cape town"
    },
    {
        ". Jemimas sister, ": null
    },
    {
        "Lucy Lloyd": "lucy lloyd"
    },
    {
        ", joined the household, became his colleague, and carried on his work after his death.     When Grey was appointed ": null
    },
    {
        "Governor of New Zealand": "governor of new zealand"
    },
    {
        ", he presented his collection to the ": null
    },
    {
        "National Library of South Africa": "national library of south africa"
    },
    {
        " on condition that Bleek be its ": null
    },
    {
        "curator": "curator"
    },
    {
        ", a position he occupied from 42 until his death in 42 In addition to this work, Bleek supported himself and his family by writing regularly for  Het Volksblad  throughout the 42s and publishing the first part of his A Comparative Grammar of South African Languages in London in 42 The second part was also published in London in 42 with the first chapter appearing in manuscript form in Cape Town in 42 Unfortunately, much of Bleeks working life in the Cape, like that of his sister-in-law after him, was characterised by extreme financial hardship which made his research even more difficult to continue with.         Bleeks first contact with ": null
    },
    {
        "San people": "san people"
    },
    {
        " was with prisoners at ": null
    },
    {
        "Robben Island": "robben island"
    },
    {
        " and the Cape Town Gaol and House of Correction, in 42 He conducted interviews with a few of these prisoners, which he used in later publications. These people all came from the ": null
    },
    {
        "Burgersdorp": "burgersdorp"
    },
    {
        " and ": null
    },
    {
        "Colesberg": "colesberg"
    },
    {
        " regions and variations of one similar-sounding Bushman language. Bleek was particularly keen to learn more about this ": null
    },
    {
        "Bushman": "khoisan languages"
    },
    {
        " language and compare it to examples of Bushman vocabulary and language earlier noted by ": null
    },
    {
        "Hinrich Lichtenstein": "hinrich lichtenstein"
    },
    {
        " and obtained from missionaries at the turn of the 42th century.     In 42 resident magistrate Louis Anthing introduced the first ": null
    },
    {
        "ǀXam": "ǀxam language"
    },
    {
        "-speakers to Bleek. He brought three men to Cape Town from the Kenhardt district to stand trial for attacks on farmers . In 42 two San prisoners from the Achterveldt near Calvinia were transferred from the ": null
    },
    {
        "Breakwater prison": "breakwater lodge"
    },
    {
        " to the Cape Town prison, making it easier for Bleek to meet them. With their help, Bleek compiled a list of words and sentences and an alphabetical vocabulary. Most of these words and sentences were provided by Adam Kleinhardt .     In 42 Bleek and ": null
    },
    {
        "Lloyd": "lucy lloyd"
    },
    {
        ", by now working together on the project to learn Bushman language and record personal narratives and folklore, became aware of the presence of a group of 42 ": null
    },
    {
        "ǀXam": "ǀxam"
    },
    {
        " prisoners at the Breakwater Convict Station and received permission to relocate one prisoner to their home in Mowbray so as to learn his language. The prison chaplain, Revd Fisk, was in charge of the selection of this individual – a young man named |a!kunta. But because of his youth, |a!kunta was unfamiliar with much of his peoples folklore and an older man named ||kabbo was then permitted to accompany him. ||kabbo became Bleek and Lloyds first real teacher, a title by which he later regarded himself. Over time, members of ||kabbos family and other families lived with Bleek and Lloyd in Mowbray, and were interviewed by them. Many of the |xam-speakers interviewed by Bleek and Lloyd were related to one another. Bleek and Lloyd learned and wrote down their language, first as lists of words and phrases and then as stories and narratives about their lives, history, folklore and remembered beliefs and customs.     Bleek, along with Lloyd, made an effort to record as much anthropological and ethnographic information as possible. This included genealogies, places of origin, and the customs and daily life of the informants. Photographs and measurements  were also taken of all their informants in accordance with the norms of scientific research of the time in those fields. More intimate and personal painted portraits were also commissioned of some of the ": null
    },
    {
        "xam": "ǀxam language"
    },
    {
        " teachers.     Although Bleek and ": null
    },
    {
        "Lloyd": "lucy lloyd"
    },
    {
        " interviewed other individuals during 42 and 42 , most of their time was spent interviewing only six individual |xam contributors. Bleek wrote a series of reports on the language and the literature and folklore of the |xam-speakers he interviewed, which he sent to the Cape Secretary for Native Affairs. This was first in an attempt to gain funding to continue with his studies and then also to make Her Majestys Colonial Government aware of the need to preserve San folklore as an important part of the nations heritage and traditions. In this endeavour Bleek must surely have been influenced by Louis Anthing.          Bleek died in Mowbray on 42 August 42 aged 42 and was buried in ": null
    },
    {
        "Wynberg": "wynberg, cape town"
    },
    {
        " Anglican": "anglican"
    },
    {
        " cemetery in Cape Town along with his two infant children, who had died before him. His all-important work recording the |Xam language and literature was continued and expanded by ": null
    },
    {
        "Lucy Lloyd": "lucy lloyd"
    },
    {
        ", fully supported by his wife Jemima. In his obituary in the South African Mail of 42 August 42 he was lauded in the following terms: As a comparative philologist he stood in the foremost rank, and as an investigator and authority on the ": null
    },
    {
        "South African languages": "south african languages"
    }
]