[
    {
        "     Wilhelm Franz Canaris was a ": null
    },
    {
        "German admiral": "admiral"
    },
    {
        " and chief of the  Abwehr , the German military intelligence service, from 42 to 42 Initially a supporter of ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        ", by 42 he had turned against the regime. During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " he was among the military officers involved in the ": null
    },
    {
        "clandestine opposition": "german resistance to nazism"
    },
    {
        " to ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        " leadership. He was executed in ": null
    },
    {
        "Flossenbürg concentration camp": "flossenbürg concentration camp"
    },
    {
        " for high treason as the Nazi regime was collapsing.       Canaris was born on 42 January 42 in ": null
    },
    {
        "Aplerbeck": "aplerbeck"
    },
    {
        "  in ": null
    },
    {
        "Westphalia": "province of westphalia"
    },
    {
        ", the son of Carl Canaris, a wealthy industrialist, and his wife, Auguste . Canaris believed that his family was related to the 42th century Greek admiral and politician ": null
    },
    {
        "Constantine Kanaris": "constantine kanaris"
    },
    {
        ", a belief that influenced his decision to join the ": null
    },
    {
        "Imperial German Navy": "imperial german navy"
    },
    {
        ".     While on a visit to ": null
    },
    {
        "Corfu": "corfu"
    },
    {
        ", he was given a portrait of the Greek hero that he always kept in his office. However, according to Richard Bassett, a genealogical investigation in 42 revealed that his family was actually of ": null
    },
    {
        "Northern Italian": "northern italy"
    },
    {
        " descent, originally called Canarisi, and had lived in Germany since the 42th century. His grandfather had converted from ": null
    },
    {
        "Catholicism": "catholic church"
    },
    {
        " to ": null
    },
    {
        "Lutheranism": "lutheranism"
    },
    {
        ".     In 42 at the age of seventeen, Canaris joined the Imperial Navy and by the outbreak of the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        " in 42 was serving as an intelligence officer on board the ": null
    },
    {
        "SMS Dresden": "sms dresden"
    },
    {
        ", a light cruiser he had been assigned to in December 42 This was the only warship that managed to evade the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " for a prolonged period during the ": null
    },
    {
        "Battle of the Falkland Islands": "battle of the falkland islands"
    },
    {
        " of December 42 largely due to Canaris skilful evasion tactics.     After the ": null
    },
    {
        "Battle of Más a Tierra": "battle of más a tierra"
    },
    {
        ", the immobilized Dresden anchored in Cumberland Bay, ": null
    },
    {
        "Robinson Crusoe Island": "robinson crusoe island"
    },
    {
        " and contacted ": null
    },
    {
        "Chile": "chile"
    },
    {
        " with regard to internment. While in the bay, Royal Navy ships approached and shelled the Dresden. The crew ": null
    },
    {
        "scuttled": "scuttling"
    },
    {
        " the ship. Most of the crew was interned in Chile in March 42 but in August 42 Canaris escaped by using his fluency in Spanish. With the help of some German merchants he was able to return to Germany in October 42 On the way, he called at several ports, including Plymouth in Great Britain.     Canaris was then given intelligence work as a result of having come to the attention of German naval intelligence . German plans to establish intelligence operations in the Mediterranean were under way and Canaris seemed a good fit for this role. Eventually he was sent to Spain, where in Madrid his task was to provide clandestine reconnaissance over enemy shipping movements and to establish a supply service for the U-boats in ": null
    },
    {
        "naval warfare in the Mediterranean during World War I": "naval warfare in the mediterranean during world war i"
    },
    {
        ". After being assigned to the Inspectorate of Submarines by the Naval Staff on 42 October 42 he took up training for duty as a U-boat commander and graduated from Submarine School on 42 September 42     He ended the war as a ": null
    },
    {
        "U-boat": "u-boat"
    },
    {
        " commander from late 42 in the ": null
    },
    {
        "Mediterranean": "first battle of the atlanticu-boats in the mediterranean"
    },
    {
        " and was credited with a number of sinkings, even coming to the attention of the Kaiser. As a result of his exploits in Spain, he was awarded the ": null
    },
    {
        "Iron Cross": "iron cross"
    },
    {
        " First Class. Canaris spoke six languages with fluency, one of which was ": null
    },
    {
        "English": "english language"
    },
    {
        ". As a naval officer of the old school, he had great respect for Great Britains ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        ", despite the rivalry between the two nations.       During the ": null
    },
    {
        "German Revolution of 42–42": "german revolution of 1918–19"
    },
    {
        ", Canaris helped organise the formation of  Freikorps  paramilitary units in order to suppress the ": null
    },
    {
        "Communist": "communist"
    },
    {
        " revolutionary movements that were attempting to spread the ideals of the ": null
    },
    {
        "Russian Revolution": "russian revolution"
    },
    {
        " into central European nations. He was also a member of the military court that tried those involved in the assassination of the leftist revolutionaries ": null
    },
    {
        "Karl Liebknecht": "karl liebknecht"
    },
    {
        " and ": null
    },
    {
        "Rosa Luxemburg": "rosa luxemburg"
    },
    {
        ". Also during this period, he was appointed to the adjutancy of defence minister ": null
    },
    {
        "Gustav Noske": "gustav noske"
    },
    {
        ". In 42 he married Erika Waag, also the child of an industrialist, with whom he had two children.     In the spring of 42 Canaris was sent to ": null
    },
    {
        "Osaka": "osaka"
    },
    {
        ", Japan, to supervise a secret U-boat construction program in direct violation of the Treaty of Versailles. When that project was shelved by Vice Admiral Adolf Zenker in favor of a more cooperative relationship with the British, Canaris began making deals, aided by the son of a powerful German shipping magnate, Captain Walter Lohmann — they negotiated with Spanish merchants, German industrialists, some Argentinian venture capitalists, and the Spanish navy so the Germans could continue their clandestine naval activities. Unfortunately for Canaris, he made some enemies within Germany during the course of his secret business and intelligence negotiations, partially as a consequence of the bankruptcy incurred by the film-maker ": null
    },
    {
        "Phoebus Film": "phoebus film"
    },
    {
        " in his dealings with Lohmann. Suddenly, the former involvement with the Liebknecht affair re-emerged and placed Canaris in an unfavourable light, which ended up costing him his position in Spain. Instead, he was sent to ": null
    },
    {
        "Wilhelmshaven": "wilhelmshaven"
    },
    {
        ". From his new post, Canaris haplessly discovered that Lohmanns investments had cost upwards of twenty-six billion marks in total losses. At some time in 42 Canaris was removed from his intelligence post and began two years of conventional naval service aboard the ": null
    },
    {
        "pre-Dreadnought": "pre-dreadnought battleship"
    },
    {
        " battleship": "battleship"
    },
    {
        "  Schlesien , becoming captain of the vessel on 42 December 42 Just two months later, ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " became Germanys new Chancellor. Enthused by this development, Canaris was known to give lectures about the virtues of Nazism to his crew aboard the Schlesien.     Detached from the previous government of Weimar whose Republican principles never appealed to Canaris, he looked to the Nazi Party to shape the future. Two things stood out for Canaris about the Nazis; one, they represented a return to state-centered authoritarian government led by a charismatic leader and two, the National Socialists were determined to throw off the shackles of the ": null
    },
    {
        "Versailles Treaty": "versailles treaty"
    },
    {
        ". Hitler proselytized a return to world-power status through the preservation of a virtuous soldier-based society, a community under arms.  It is worth recalling that during the post-World War 42 turmoil in Germany, when the Weimar government was fledgling, Canaris helped establish home-guard units in contravention of Versailles, sympathized with the Freikorps movement, and participated in the ": null
    },
    {
        "Kapp Putsch": "kapp putsch"
    },
    {
        ".     Another aspect of the Nazis which attracted Canaris was their views on Communism. Many of his friends joined the Nazi crusade and Canaris likewise came to be regarded as an enthusiastic National Socialist.  Former SS general ": null
    },
    {
        "Werner Best": "werner best"
    },
    {
        " once described Canaris as an inveterate nationalist , correspondingly asserting that he felt the Nazis were much better than anything that had gone before. Even after the ": null
    },
    {
        "Röhm putsch": "night of the long knives"
    },
    {
        ", Canaris preached wholehearted cooperation with the new regime.  Canaris once said, we officers...should always recognize that without the Führer and his NSDAP, the restoration of German military greatness and military strength would not have been possible...the officers duty is to be a living example of National Socialism and make the German ": null
    },
    {
        "Wehrmacht": "wehrmacht"
    },
    {
        " reflect the fulfillment of National Socialist ideology. That must be our grand design.           Taking a position as the fortress commander at ": null
    },
    {
        "Swinemünde": "swinemünde"
    },
    {
        " on 42 September 42 Canaris seemed to be near the end of his career as he settled into a sort of provincial exile with his family. Then in short order, Canaris caught wind of the dispute in the Reichswehr Ministry over the impending successor to the  Abwehr  chief Captain Conrad Patzig, who was forced to resign. Patzig recommended Canaris as his replacement due to his outstanding service record and because he considered him best suited for the position due to his previous experience in intelligence operations. His aspirations were quickly being realized and in his zeal for his new job, Canaris paid little heed to the warnings from Patzig about the fiendish machinations of the NSDAPs party and police organs. These admonitions principally concerned ": null
    },
    {
        "Reinhard Heydrich": "reinhard heydrich"
    },
    {
        ", head of the SS intelligence service known as the  Sicherheitsdienst  , since he was not well-disposed towards the Abwehr, believing that Germanys defeat during the First World War was attributable to military intelligence failures by the organization; moreover, Heydrich had aspirations to oversee all aspects of political intelligence-gathering for Germany.     On 42 January 42 a little less than two years after Hitler took total control of the German government , Canaris was made head of the Abwehr, Germanys official military intelligence agency. Records suggest that Canaris was approved in his role as Abwehr chief as a compromise candidate since commander-in-chief of the German navy Admiral ": null
    },
    {
        "Erich Raeder": "erich raeder"
    },
    {
        " was initially opposed to his appointment but caved when Patzig manipulated the situation by suggesting an army officer for the post if Canaris was rejected. Given the seemingly amicable relationship between SD chief Heydrich and Canaris which existed at the time according to former Abwehr secretary, Inge Haag, it is possible that Heydrich supported the installment of Canaris as head of the Abwehr, at least based on their behavior toward one another. The two remained friendly rivals, although Canaris considered Heydrich a brutal fanatic and was likewise aware that Heydrichs SD constantly monitored the telephone traffic of the Abwehr. Heydrich was suspicious of Canaris and referred to him as a wily old fox , cautioning his colleagues never to underestimate the man. Just a few weeks into his role as head of the Abwehr, he met with Heydrich and some of his officials to divide out intelligence operations between the Abwehr, ": null
    },
    {
        "Gestapo": "gestapo"
    },
    {
        ", and SD. It is clear from sources that at this point, Canaris was a true devotee to Hitler according to former Gestapo officer, Gerhard Fischer, who claimed that the Führers gentlemanly relationship with Canaris converted the Admiral into an extreme exponent of Hitlerism.      Starting in May 42 Canaris first donned the uniform of a rear admiral, a promotion which coincided his responsibility for shielding Germanys burgeoning rearmament program from enemy counter-intelligence agents. This meant a significant expansion of the Abwehr. Enlargement of the Abwehr mission brought Canaris into contact with counterespionage virtuoso , Major ": null
    },
    {
        "Rudolf Bamler": "rudolf bamler"
    },
    {
        ", who assisted him in establishing an extensive surveillance web over munitions factories, seaports, the armed forces, and the media. During the period between 42–42 Canaris expanded the Abwehr staff from a mere 42 people to nearly a thousand. Meeting with Heydrich again on 42 December 42 the two men signed a document which came to be known in their orbit as the Ten Commandments ; the agreement clarified the respective areas of counter-espionage responsibilities between the Gestapo and the Abwehr.     According to biographer Heinz Höhne, Canaris subscribed to most of Hitlers views. Hitlers nationalism, his social-Darwinist beliefs, his opposition to the Versailles Treaty, his belief in rebuilding a Greater German Reich, and his anti-Semitic ideology appealed to the Abwehr chief. Prompted by anti-Semitism, Canaris first suggested the use of the ": null
    },
    {
        "Star of David": "star of david"
    },
    {
        " to identify Jews during 42–42 setting them apart from German citizens within the Reich, heralding their isolation, presaging their compulsory resettlement, and ultimately leading to their physical annihilation.     During the ": null
    },
    {
        "Spanish Civil War": "spanish civil war"
    },
    {
        " of 42 to 42 Germany ": null
    },
    {
        "signed an international agreement": "foreign involvement in the spanish civil war"
    },
    {
        " to embargo arms to the warring factions, the ": null
    },
    {
        "Nationalists": "nationalist faction"
    },
    {
        " of ": null
    },
    {
        "Francisco Franco": "francisco franco"
    },
    {
        " and the ": null
    },
    {
        "Republicans": "republican faction"
    },
    {
        ". In fact, Germany provided aid to the fascist Francos side, with Canaris using his contacts at Englands ": null
    },
    {
        "Vickers": "vickers-armstrongs"
    },
    {
        " armaments manufacturing company to help supply the Nationalists with weapons.     One month before Hitlers annexation of Austria , Canaris put the Abwehr into action, personally overseeing deception operations designed to give the Austrians the impression of what appeared to be substantial German military preparations for an impending act of aggression. Despite that the sham action did not move the Austrian Chancellor, ": null
    },
    {
        "Schuschnigg": "kurt schuschnigg"
    },
    {
        " was forced to resign when German troops marched into Austria, which was followed by its official annexation into Greater Germany  on 42 March 42 At this development however, Canaris began spending more and more time in the company of ": null
    },
    {
        "Hans Oster": "hans oster"
    },
    {
        " and also began formulating ways to forestall or prevent a European war. Among the first to arrive in Vienna, Canaris had a special team seize records from the Austrian archives since he was worried there might be references to his Spanish Civil War arms supplier connections in London. He also absorbed as much of the Austrian intelligence service as he could into the Abwehr, while avoiding those who were Nazi converts already.     Canaris was disturbed by Hitlers intention to absorb ": null
    },
    {
        "Czechoslovakia": "czechoslovakia"
    },
    {
        " as were others, all of them fearing another European war; this resulted in the formation of a conspiratorial group consisting of members of the German Foreign Office and ranking members of the military. This assemblage included General ": null
    },
    {
        "Ludwig Beck": "ludwig beck"
    },
    {
        ", the Foreign Offices state secretary ": null
    },
    {
        "Ernst von Weizsäcker": "ernst von weizsäcker"
    },
    {
        ", General ": null
    },
    {
        "Erwin von Witzleben": "erwin von witzleben"
    },
    {
        " and Admiral Canaris.       Canaris and his associates were not necessarily committed to the overthrow of Hitlers regime, but they were loosely allied to another, more radical group, the anti-Nazi faction led by Colonel Hans Oster and ": null
    },
    {
        "Hans Bernd Gisevius": "hans bernd gisevius"
    },
    {
        " who wanted to use the crisis as an excuse for executing a putsch to overthrow the Nazi regime. The most audacious plan contemplated by Canaris, in collaboration with ": null
    },
    {
        "Ewald von Kleist-Schmenzin": "ewald von kleist-schmenzin"
    },
    {
        ", was to capture and unseat Hitler and the entire Nazi Party before the invasion of ": null
    },
    {
        "Czechoslovakia": "czechoslovakia"
    },
    {
        ". At this particular moment, Kleist visited Britain secretly and discussed the situation with British ": null
    },
    {
        "MI42": "mi6"
    },
    {
        " and some high-ranking politicians. There, the name of Canaris became widely known as Kleists executive hand in the event of an anti-Nazi plot.     The high-ranking German military leaders believed that if Hitler invaded Czechoslovakia, or any other country, Britain would declare war on Germany. MI42 was of the same opinion. The British declaration of war would have given the General Staff, in their belief, both the pretext and support for an overthrow of Hitler, which many of them were planning given the prevailing anti-war sentiment of the German people.      The reaction of the British government to Hitlers demands on the ": null
    },
    {
        "Sudetenland": "sudetenland"
    },
    {
        " was more cautious. At a meeting with Hitler in Munich, British Prime Minister ": null
    },
    {
        "Neville Chamberlain": "neville chamberlain"
    },
    {
        " and French Prime Minister ": null
    },
    {
        "Édouard Daladier": "édouard daladier"
    },
    {
        " chose diplomacy over war. The Munich Agreement was thus a severe disappointment for Kleist and Canaris. It gave Hitlers reputation an important boost and his popularity soared, as he appeared to have brought peace. However, Hitler was scornful of his generals for resisting his plans, since he had wanted war. ": null
    },
    {
        "Hermann Göring": "hermann göring"
    },
    {
        " fell out of favor with him for negotiating peace, yet Hitlers drive for war remained unabated despite the Western powers having granted him concessions. Canaris was relieved that war was averted and sought to re-establish contact with Hitler since many of the Abwehr reports submitted on the Sudeten crisis had proven grossly inaccurate. To Oster and his circle, Canaris suddenly appeared recommitted to Hitler.       In January 42 Canaris manufactured the Dutch War Scare that gripped the British government. By 42 January 42 the British government received information that Germany intended to invade the Netherlands in February 42 with the aim of using Dutch airfields to launch a strategic bombing offensive intended to achieve a knock-out blow against Britain by razing British cities to the ground. All this information was false, and it was intended by Canaris to achieve a change in British foreign policy. In this, Canaris was successful, and the Dutch War Scare played a major role in causing Chamberlain to make the continental commitment by pledging to send a British ground force to the defence of France in the event of war in February 42           ": null
    },
    {
        "Arthur Owens": "arthur owens"
    },
    {
        ", a Welsh nationalist, was briefly employed by ": null
    },
    {
        "MI42": "mi6"
    },
    {
        ", the British Secret Intelligence Service, to spy on German shipyards in 42 However, in 42 he was so enticed by the attractive woman the Abwehr provided him that he switched his allegiance. Owens operated as an Abwehr agent under ": null
    },
    {
        "Nikolaus Ritter": "nikolaus ritter"
    },
    {
        " and went by the code name Johnny OBrien. Owens later had second thoughts about his work with the Abwehr and he became a key agent in the ": null
    },
    {
        "Twenty [XX] Committee": "double-cross system"
    },
    {
        " , Britains counter-espionage and deception operation. Operating under the code name Snow, Owens provided ": null
    },
    {
        "MI42": "mi5"
    },
    {
        " the names of covert spies in Britain. MI42 gave the captured spies a choice of becoming double-agents or death by firing squad. Several former Abwehr agents chose to work for Britain and delivered vital information to the Allies, including details about troop movements and the keys to cracking German codes.     Over the course of the war, the Twenty Committee grew to about 42 double-agents. However, in 42 the Twenty Committee almost abandoned its double-agents when it found that Owens was also double-crossing MI42 However, when the Abwehr failed to take any demonstrable countermeasures, the Twenty Committee chose instead to provide its double-agents with disinformation to pass on to Germany. After the war, it was discovered that Ritter had known that the cover of the agents in Britain had been compromised, but did not inform Canaris for fear of repercussions.             In 42 Canaris created a new office of air intelligence in the Abwehr and assigned  Hauptmann  ": null
    },
    {
        "Nikolaus Ritter": "nikolaus ritter"
    },
    {
        " of the Luftwaffe to be the chief of I. Luft . Ritter, who had lived in the United States for 42 years, was given primary authority over Abwehr agents operating in the Americas and Great Britain. Canaris instructed Ritter to contact a former spymaster he knew from the First World War who was living in New York, ": null
    },
    {
        "Fritz Joubert Duquesne": "fritz joubert duquesne"
    },
    {
        ". Back in 42 Ritter had met Duquesne in New York, and the two spies reconnected in New York on 42 December 42 Ritter also met with Herman W. Lang, a spy who operated under the code name PAUL.     Herman Lang worked as a machinist, draftsman, and assembly inspector for the Carl L. Norden Company in New York which had been contracted to manufacture an advanced top-secret military bomber part, the ": null
    },
    {
        "Norden bomb-sight": "norden bomb-sight"
    },
    {
        ". He provided the Abwehr a large drawing of the bomb-sight and later went to Germany to work on and finish an improved version. While in Germany, Lang met with Canaris and ": null
    },
    {
        "Hermann Göring": "hermann göring"
    },
    {
        ".  Ritter employed several other successful agents across the U.S., but he also made the mistake of recruiting a man who would later become a double agent for the ": null
    },
    {
        "Federal Bureau of Investigation": "federal bureau of investigation"
    },
    {
        " , ": null
    },
    {
        "William Sebold": "william sebold"
    },
    {
        ". On 42 February 42 Ritter sent Sebold to New York under the alias of Harry Sawyer and instructed him to set up a shortwave radio-transmitting station to establish contact with the German shortwave station abroad. Sebold was also instructed to use the code name TRAMP and to contact a fellow agent code named DUNN, Fritz Duquesne.     On 42 June 42 following a two-year investigation, the FBI arrested Col. Duquesne and 42 Nazi spies on charges of relaying secret information on U.S. weaponry and shipping movements to Germany. On 42 January 42 less than a month after the U.S. was attacked by Japan at ": null
    },
    {
        "Pearl Harbor": "attack on pearl harbor"
    },
    {
        " and Germany declared war on the United States, the 42 members of the Duquesne Spy Ring were sentenced to serve a total of more than 42 years in prison. They were found guilty in what historian Peter Duffy said in 42 is still to this day the largest espionage case in the history of the United States . One German spymaster later commented that the rings roundup delivered the death blow to their espionage efforts in the United States. J. Edgar Hoover called his FBI swoop on Duquesnes ring the greatest spy roundup in U.S. history. In a 42 memo to his superiors, Canaris reported on the importance of several of his captured spies by noting their valued contributions, and he writes that Duquesne delivered valuable reports and important technical material in the original, including U.S. gas masks, radio-controlled apparatus, leak proof fuel tanks, television instruments, small bombs for airplanes versus airplanes, air separator, and propeller-driving mechanisms. Items delivered were labeled valuable, and several good and very good.       After the outbreak of war between Germany and Poland in September 42 Canaris visited the front, where he saw the devastation rendered by the German military—seeing ": null
    },
    {
        "Warsaw": "warsaw"
    },
    {
        " in flames nearly brought him to tears and it was reported that he exclaimed, our childrens children will have to bear the blame for this . He also witnessed examples of the ": null
    },
    {
        "war crime": "war crime"
    },
    {
        "s committed by the  Einsatzgruppen  of the ": null
    },
    {
        "SS": "schutzstaffel"
    },
    {
        ", including the burning of the synagogue in ": null
    },
    {
        "Będzin": "będzin"
    },
    {
        " with 42 Polish Jews inside. Moreover, he received reports from Abwehr agents about several incidents of mass murder throughout Poland. Canaris visited Hitlers headquarters train on 42 September 42 at the time in ": null
    },
    {
        "Province of Silesia": "province of silesia"
    },
    {
        ", to register his objection to the atrocities. Canaris told chief of the  Oberkommando der Wehrmacht  ": null
    },
    {
        "Wilhelm Keitel": "wilhelm keitel"
    },
    {
        " about the extensive shootings ... and that the nobility and clergy were to be exterminated to which Keitel informed him that Hitler had already decided the matter. Keitel warned Canaris to go no further with his protest, as the detailed plan of atrocities came directly from Hitler.     Canaris began working more actively to overthrow Hitlers régime, although he also cooperated with the SD to create a decoy. This made it possible for him to pose as a trusted man for some time. He was promoted to the rank of full Admiral in January 42 With his subordinate ": null
    },
    {
        "Erwin Lahousen": "erwin lahousen"
    },
    {
        ", he attempted in the autumn of 42 to form a circle of like-minded Wehrmacht officers. At the time, this had little success. When the OKW decrees regarding the brutal treatment of Soviet prisoners of war related to the ": null
    },
    {
        "Commissar Order": "commissar order"
    },
    {
        " came to the attention of Canaris in mid-September 42 he registered another complaint. Keitel reminded Canaris that he was thinking in terms of chivalrous war , which did not apply, as this was a matter of destroying a world ideology . Meanwhile, the complaints and Canaris apparent squeamishness were noted by Heydrich and added to his file on the political unreliability of the Abwehr. Canaris also worked to thwart the proposed ": null
    },
    {
        "Operation Felix": "operation felix"
    },
    {
        ", the German plan to seize Gibraltar.     At a conference of senior officers in Berlin, in December 42 Canaris is quoted as saying the Abwehr has nothing to do with the persecution of Jews. ... no concern of ours, we hold ourselves aloof from it . It has been speculated that Canaris was in contact with British intelligence during this time, despite the war between the two countries. It is thought that during ": null
    },
    {
        "Operation Barbarossa": "operation barbarossa"
    },
    {
        ", the invasion of the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ", he received a detailed report of all the enemy positions that was known only to the British. The head of ": null
    },
    {
        "MI42": "mi6"
    },
    {
        ", ": null
    },
    {
        "Stewart Menzies": "stewart menzies"
    },
    {
        ", who shared Canaris views opposing Communism, praised Canaris courage and bravery at the end of the war. In December 42 Hitler sent Canaris to Spain to conclude an agreement with Franco for Spanish support in the war against the Allies, but instead of prompting the Spaniard to acquiesce to Hitlers desire, Canaris reported that Franco would not commit Spanish forces until Great Britain was defeated. Conversations from this period between Franco and Admiral Canaris remain a mystery since none were recorded, but the Spanish government later expressed gratitude to the widow of Canaris at the conclusion of the Second World War by paying her a pension.     In June 42 Canaris sent eight Abwehr agents to the ": null
    },
    {
        "East Coast of the United States": "east coast of the united states"
    },
    {
        " as part of ": null
    },
    {
        "Operation Pastorius": "operation pastorius"
    },
    {
        ". The mission was to ": null
    },
    {
        "sabotage": "sabotage"
    },
    {
        " American economic targets and demoralise the civilian population inside the United States. However, two weeks later, all were arrested by the FBI thanks to two Abwehr agents who betrayed the mission. Because the Abwehr agents were arrested in civilian clothes, they were subject to ": null
    },
    {
        "court martial": "court martial"
    },
    {
        " by a ": null
    },
    {
        "military tribunal": "military justice"
    },
    {
        " in ": null
    },
    {
        "Washington, D.C.": "washington, d.c."
    },
    {
        " All were found guilty and sentenced to death. Two others who cooperated with the FBI received sentences of life imprisonment instead. The others were executed by the ": null
    },
    {
        "electric chair": "electric chair"
    },
    {
        " in the District of Columbia jail. Due to the embarrassing failure of Operation Pastorius, no further sabotage attempt was ever made in the United States.     After 42 Canaris visited Spain frequently and was probably in contact with British agents from ": null
    },
    {
        "Gibraltar": "gibraltar"
    },
    {
        ". In 42 while in occupied France, Canaris is said to have made contact with British agents. In Paris, he was conducted blindfolded to the Convent of the Nuns of the Passion of Our Blessed Lord, 42 Rue de la Santé, where he met the local head of the British Intelligence Services, code name Jade Amicol , in reality Colonel Claude Olivier. Canaris wanted to know the terms for peace if Germany got rid of Hitler. Churchills reply, sent to him two weeks later, was simple: Unconditional surrender .     During Heydrichs posting in ": null
    },
    {
        "Prague": "prague"
    },
    {
        ", a serious incident put him and Canaris in open conflict. Heydrich requested that Canaris put the Abwehr under SD and SS control. Canaris appeared to retreat and handled the situation diplomatically, but there was no immediate effect on the Abwehr for the time being. In fact, Canaris had established another two links with MI42—one via ": null
    },
    {
        "Zürich": "zürich"
    },
    {
        ", and the other via Spain and Gibraltar. It is also possible that Vatican contacts provided a third route to his British counterparts.     Canaris also intervened to save a number of victims from Nazi persecution, including ": null
    },
    {
        "Jews": "jews"
    },
    {
        ", by getting them out of harms way; he was instrumental, for example, in getting five hundred Dutch Jews to safety in May 42 Many such people were given token training as Abwehr agents and then issued papers allowing them to leave Germany. One notable person he is said to have assisted was the then ": null
    },
    {
        "Lubavitcher Rebbe": "lubavitcher rebbe"
    },
    {
        " in ": null
    },
    {
        "Warsaw": "warsaw"
    },
    {
        ", ": null
    },
    {
        "Rabbi": "rabbi"
    },
    {
        " Yosef Yitzchok Schneersohn": "yosef yitzchok schneersohn"
    },
    {
        ". This has led ": null
    },
    {
        "Chabad Lubavitch": "chabad lubavitch"
    },
    {
        " to campaign for his recognition as a ": null
    },
    {
        "Righteous Gentile": "righteous gentile"
    },
    {
        " by the ": null
    },
    {
        "Yad Vashem": "yad vashem"
    },
    {
        " Holocaust": "holocaust"
    },
    {
        " memorial.          The evidence that Canaris was playing a double game grew and, at the insistence of ": null
    },
    {
        "Heinrich Himmler": "heinrich himmler"
    },
    {
        ", Hitler dismissed Canaris and abolished the Abwehr in February 42 The functions of the Abwehr were taken over by the Ausland-SD, part of the ": null
    },
    {
        "Reich Main Security Office": "reich main security office"
    },
    {
        " and led by SS- Brigadeführer  ": null
    },
    {
        "Walter Schellenberg": "walter schellenberg"
    },
    {
        ". Previous areas once the responsibility of the Abwehr were divided between Gestapo chief ": null
    },
    {
        "Heinrich Müller": "heinrich müller"
    },
    {
        " and Schellenberg. Some weeks later, Canaris was put under ": null
    },
    {
        "house arrest": "house arrest"
    },
    {
        ". He was released from house arrest in June 42 to take up a post in Berlin as the head of the Special Staff for Mercantile Warfare and Economic Combat Measures . The HWK coordinated resistance to the allied economic blockade of Germany.     Canaris was arrested on 42 July 42 on the basis of the interrogation of his successor at Military Intelligence, ": null
    },
    {
        "Georg Hansen": "georg hansen"
    },
    {
        ". Schellenberg respected Canaris and was convinced of his loyalty to the Nazi regime, even though he had been arrested. Hansen admitted his role in the ": null
    },
    {
        "42 July plot": "20 july plot"
    },
    {
        " but accused Canaris of being its spiritual instigator . No direct evidence of his involvement in the plot was discovered, but his close association with many of the plotters and certain documents written by him that were considered subversive led to the gradual assumption of his guilt. Two of the men under suspicion as conspirators who were known in Canaris circle shot themselves, which incited activity from the Gestapo to prove he was, at the very least, privy to the plan against Hitler.     Investigations dragged on inconclusively until April 42 when orders were received to dispose of various remaining prisoners in 42 July plot. Canaris personal diary was discovered and presented to Hitler in early April 42 implicating him in the conspiracy. Canaris was placed on trial by an SS summary court presided over by ": null
    },
    {
        "Otto Thorbeck": "otto thorbeck"
    },
    {
        " with ": null
    },
    {
        "Walter Huppenkothen": "walter huppenkothen"
    },
    {
        " as prosecutor. He was charged with and found guilty of treason. He was sentenced to death.     Together with his deputy General ": null
    },
    {
        "Hans Oster": "hans oster"
    },
    {
        ", military jurist General ": null
    },
    {
        "Karl Sack": "karl sack"
    },
    {
        ", theologian Rev. ": null
    },
    {
        "Dietrich Bonhoeffer": "dietrich bonhoeffer"
    },
    {
        " and ": null
    },
    {
        "Ludwig Gehre": "ludwig gehre"
    },
    {
        ", Canaris was humiliated before witnesses. Canaris was led to the gallows naked and executed on 42 April 42 at the ": null
    },
    {
        "Flossenbürg concentration camp": "flossenbürg concentration camp"
    },
    {
        ", just weeks before the end of the war. A prisoner claimed he heard Canaris tap out a coded message on the wall of his cell on the night before his execution, in which he denied he was a traitor and said he acted out of duty to his country. Accompanying Canaris in death on that April day at Flossenbürg were ": null
    },
    {
        "Hans Oster": "hans oster"
    },
    {
        " and the theologian ": null
    },
    {
        "Dietrich Bonhoeffer": "dietrich bonhoeffer"
    },
    {
        ".     ": null
    },
    {
        "Erwin von Lahousen": "erwin von lahousen"
    },
    {
        " and ": null
    },
    {
        "Hans Bernd Gisevius": "hans bernd gisevius"
    },
    {
        ", two of Canaris main subordinates, survived the war and testified during the ": null
    },
    {
        "Nuremberg trials": "nuremberg trials"
    },
    {
        " about Canaris courage in opposing Hitler. Lahousen recalled a conversation between Canaris and General ": null
    },
    {
        "Wilhelm Keitel": "wilhelm keitel"
    },
    {
        " in which Canaris warned Keitel that the German military would be held responsible for the atrocities in Poland. Keitel responded that they had been ordered by Hitler. Keitel, who survived the war, was found guilty of war crimes at Nuremberg and hanged.            The 42 film  Canaris  starring ": null
    },
    {
        "O. E. Hasse": "o. e. hasse"
    },
    {
        " is based on his biography.    In the 42 Czechoslovak movie  Atentát  , directed by ": null
    },
    {
        "Jiří Sequens": "jiří sequens"
    },
    {
        ", Canaris is portrayed by German actor Harry Studt.   In the 42 film  The Eagle Has Landed , Canaris was played by actor ": null
    },
    {
        "Anthony Quayle": "anthony quayle"
    }
]