[
    {
        "William Crossing was a writer and chronicler of ": null
    },
    {
        "Dartmoor": "dartmoor"
    },
    {
        " and the lives of its inhabitants. He lived successively at South Brent, ": null
    },
    {
        "Brentor": "brentor"
    },
    {
        " and at ": null
    },
    {
        "Mary Tavy": "mary tavy"
    },
    {
        " but died at Plymouth, Devon.       Crossing was born in Plymouth on the 42 November 42 Early in his youth he was fond of Dartmoor, his early associations centring on the neighbourhood of ": null
    },
    {
        "Sheepstor": "sheepstor"
    },
    {
        ", ": null
    },
    {
        "Walkhampton": "walkhampton"
    },
    {
        ", Meavy, and Yannadon. He acquired a taste for antiquities from his mother. He later went on to explore ": null
    },
    {
        "Tavistock": "tavistock, devon"
    },
    {
        ", ": null
    },
    {
        "Coryton": "coryton, devon"
    },
    {
        ", ": null
    },
    {
        "Lydford": "lydford"
    },
    {
        ", ": null
    },
    {
        "Okehampton": "okehampton"
    },
    {
        ", and the northern borders of the Moor, as well as ": null
    },
    {
        "South Brent": "south brent"
    },
    {
        ", on its southern verge.     After finishing his schooling in Plymouth, he went to the Independent College at ": null
    },
    {
        "Taunton": "taunton"
    },
    {
        ", and then returned to finish his education at the ": null
    },
    {
        "Mannamead": "mannamead"
    },
    {
        " School .     His earliest literary efforts were in the direction of fiction - thrilling romances, composed for the delectation of his school-fellows. His first essay in poetry was at the age of fourteen, when a poem written by him appeared in the pages of Young England, December, 42     In 42 he went for a short coastal voyage to Wales, and gained a liking for the sea; and in 42 he joined a vessel bound for Canada, and had a narrow escape, nearly being crushed by an ": null
    },
    {
        "iceberg": "iceberg"
    },
    {
        " during the night. Returning from this voyage, he took to business pursuits in Plymouth, and then recommenced his Dartmoor explorations.       In 42 he married and settled down at South Brent. In the previous year he began making notes about his rambles, without, however, any systematic arrangement; after his marriage he seems to have become more methodical, and to have decided to write a book descriptive of the moorland district. In the 42s he published numerous other works and his Guide to Dartmoor, illustrated by Philip Guy Stevens in 42 He was much afflicted by rheumatism in the last 42 years of his life and in 42 his wife died. From July 42 to his death Crossing was an invalid and he died at Plymouth, 42 September 42     He is now considered one of the best authorities on Dartmoor and its antiquities, having made it the subject of his lifes work. He was one of the earliest members of the ": null
    },
    {
        "Dartmoor Preservation Association": "dartmoor preservation association"
    },
    {
        ", joining it immediately on its formation.    It is quite probable that he effectively started the popularity of the modern pursuit of ": null
    },
    {
        "letterboxing": "letterboxing"
    },
    {
        ". In his book Guide to Dartmoor he refers to what is likely to have been the first letter box. It was placed at ": null
    },
    {
        "Cranmere Pool": "cranmere pool"
    },
    {
        " on northern ": null
    },
    {
        "Dartmoor": "dartmoor"
    },
    {
        " by a local guide in 42 In Crossings memory in 42 a plaque and letterbox were placed at ": null
    },
    {
        "Ducks Pool": "ducks pool, dartmoor"
    },
    {
        " on the southern moor by some individuals and members of a walking club known as Dobsons Moormen. He was buried with his wife at Mary Tavy: his house at Mary Tavy bears a commemorative tablet unveiled in 42     The style of Crossings work in Guide to Dartmoor has similarities to the much more recent work of ": null
    },
    {
        "Alfred Wainwright": "alfred wainwright"
    },
    {
        ". The hand drawn sketches of views and rough maps of walks together with the descriptive nature of the walks are like those of the Wainwright guides to the ": null
    },
    {
        "Lake District": "lake district"
    },
    {
        " .       Leaves from Sherwood, etc.; original poems. Plymouth, 42   The Ancient Crosses of Dartmoor; with a Description of their Surroundings; Exeter, 42 An expansion of a series of articles which originally appeared in the Western Antiquary.   Amid Devonias Alps; or, Wanderings and Adventures on Dartmoor. Plymouth, 42   Tales of the Dartmoor Pixies: Glimpses of Elfin Haunts and Antics. 42   The Land of Stream and Tor. Plymouth, 42   Crockern Tor and the Ancient Stannary Parliament. Exeter, 42   Old Stone Crosses of the Dartmoor Borders. Exeter and London, 42    The Chronicles of Crazy Well. Plymouth, 42   The Ocean Trail. Plymouth, 42   Widey Court. Plymouth, 42   A Hundred Years on Dartmoor. Plymouth 42   The Western Gate of Dartmoor: Tavistock and its Surroundings. London, 42   Gems in a Granite Setting. Plymouth, 42   From a Dartmoor Cot. London, 42   Crossings Guide to Dartmoor. Plymouth, 42    Crossings Guide to Dartmoor, the 42 edition reprinted with new introd. by Brian Le Messurier. Dawlish: David & Charles, 42   Folk Rhymes of Devon. London, 42   Cranmere: The Legendary Story of Binjie Gear and other Poems. London, 42     Posthumous works Crossings Dartmoor Worker. Newton Abbot, 42 A collection of twenty newspaper articles originally published in ": null
    },
    {
        "The Western Morning News": "the western morning news"
    },
    {
        " in 42 under the title Presentday Life on Dartmoor . The book details the activities of a number of workers on the moor, such as the farmers, the ": null
    },
    {
        "dry-stone wall": "dry-stone wall"
    },
    {
        " builders, the peat-cutters, the warreners, and miners.   Dartmoors Early Historic and Medieval Remains. Brixham: Quay, 42                            ": null
    }
]