[
    {
        "      Williams Air Force Base is a former ": null
    },
    {
        "United States Air Force": "united states air force"
    },
    {
        " base, located in ": null
    },
    {
        "Maricopa County, Arizona": "maricopa county, arizona"
    },
    {
        " east of ": null
    },
    {
        "Chandler": "chandler, arizona"
    },
    {
        ", and about  southeast of ": null
    },
    {
        "Phoenix": "phoenix, arizona"
    },
    {
        ". It is a designated ": null
    },
    {
        "Superfund": "superfund"
    },
    {
        " site due to a number of soil and groundwater contaminants.     It was active as a training base for both the ": null
    },
    {
        "United States Army Air Forces": "united states army air forces"
    },
    {
        ", as well as the USAF from 42 until its closure in 42 Williams was the leading pilot training facility of the USAF, supplying 42% of all pilots.     Since its closure, the base has largely been annexed by the city of ": null
    },
    {
        "Mesa, Arizona": "mesa, arizona"
    },
    {
        ". It was converted into the civilian Williams Gateway Airport, later renamed ": null
    },
    {
        "Phoenix-Mesa Gateway Airport": "phoenix-mesa gateway airport"
    },
    {
        ". In recent years, the land has emerged as an educational and industrial campus anchored by ": null
    },
    {
        "Arizona State University Polytechnic Campus": "arizona state university polytechnic campus"
    },
    {
        " and ": null
    },
    {
        "Chandler-Gilbert Community College": "chandler-gilbert community college"
    },
    {
        ".       During March 42 some citizens of ": null
    },
    {
        "Mesa, Arizona": "mesa, arizona"
    },
    {
        " were actively working on obtaining an Air Corps facility located near their city. One of the sites seriously considered for the new airfield was on the Gila River Indian Reservation located near ": null
    },
    {
        "Chandler, Arizona": "chandler, arizona"
    },
    {
        ". At the time, the land on which Williams would eventually be built was vacant and not used for agriculture due to a lack of irrigation. It had no homes or farms and was essentially desert with a few Indian ruins scattered on it. On their own initiative, the city of Mesa began to acquire rights to the property that was divided among 42 different owners. Agreements were made for a railroad spur line, along with the appropriate electric, water, telephone and gas services.     The hard work paid off with the announcement in June 42 that the War Department had approved the site for an ": null
    },
    {
        "Army Air Corps": "united states army air corps"
    },
    {
        " base. Construction of the new base started on 42 July 42 with the groundbreaking ceremony attended by ": null
    },
    {
        "Mesa, Arizona": "mesa, arizona"
    },
    {
        " mayor, ": null
    },
    {
        "George Nicholas Goodman": "george nicholas goodman"
    },
    {
        " and ": null
    },
    {
        "Arizona": "arizona"
    },
    {
        " governor, Sidney P. Osbone who both attended the groundbreaking of Falcon Field that morning. Initial construction was completed in December, making the base operational.     As of 42 December, the airfield had no name and a debate ensued on what to call the new base. It was initially named Mesa Military Airport. the name was changed October 42 to Higley Field, the base being in the proximity of the town of ": null
    },
    {
        "Higley, Arizona": "higley, arizona"
    },
    {
        ". In February 42 the growing military airfields name was changed to Williams Field in honor of Arizona native 42st Lt Charles Linton Williams . Lieutenant Williams died on 42 July 42 when his ": null
    },
    {
        "Boeing PW42A": "boeing model 15"
    },
    {
        " pursuit aircraft crashed near ": null
    },
    {
        "Fort DeRussy": "fort derussy military reservation"
    },
    {
        ", Hawaii.     As a flying school, numerous runways and auxiliary airfields were constructed. The main airfield consisted of three concrete  runways aligned NE/SW, ENE/WSW and NE/SW. A blacktop landing area  was aligned E/W to the south of the main field and a  blacktop landing area was aligned E/W to the south of the main field.         Known auxiliary airfields were:       : Redeveloped in the 42s. Today housing development S of US 42 in ": null
    },
    {
        "Gilbert, Arizona": "gilbert, arizona"
    },
    {
        ".       : Today: ": null
    },
    {
        "Rittenhouse Army Heliport": "rittenhouse army heliport"
    },
    {
        "  used by ": null
    },
    {
        "Arizona National Guard": "arizona national guard"
    },
    {
        ", adjacent to suburbs of ": null
    },
    {
        "Gilbert, Arizona": "gilbert, arizona"
    },
    {
        "    : Today: ": null
    },
    {
        "Casa Grande Municipal Airport": "casa grande municipal airport"
    },
    {
        "  in ": null
    },
    {
        "Casa Grande, Arizona": "casa grande, arizona"
    },
    {
        ".   Goodyear Field    : Today: ": null
    },
    {
        "Gila River Memorial Airport": "gila river memorial airport"
    },
    {
        "  southwest of ": null
    },
    {
        "Chandler, Arizona": "chandler, arizona"
    },
    {
        ".   Williams Auxiliary Army Airfield 42    : Build 42 Today ": null
    },
    {
        "Gila River Memorial Airport": "gila river memorial airport"
    },
    {
        "  Coolidge AAF": "coolidge aaf"
    },
    {
        "    : Was auxiliary until 42 turned over to Air Transport Command in May 42 Today: ": null
    },
    {
        "Coolidge Municipal Airport": "coolidge municipal airport"
    },
    {
        " .   ": null
    },
    {
        "Cutter Field": "cutter field"
    },
    {
        "    : Was emergency landing field. Today: ": null
    },
    {
        "San Carlos Apache Airport": "san carlos apache airport"
    },
    {
        "  near ": null
    },
    {
        "Cutter, Arizona": "cutter, arizona"
    },
    {
        ".   ": null
    },
    {
        "Ajo AAF": "ajo aaf"
    },
    {
        "    : Transferred from Luke AAF, June 42 Part of the Gila Bend Gunnery Range. Today: ": null
    },
    {
        "Eric Marcus Municipal Airport": "eric marcus municipal airport"
    },
    {
        "  Gila Bend AAFAF": "gila bend aafaf"
    },
    {
        "     : Transferred from Luke AAF, June 42 Part of the Gila Bend Gunnery Range   Gila Bend 42/Williams AAF 42:                During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", Williams Field was under the command of the 42th Army Air Force Base Unit, ": null
    },
    {
        "AAF West Coast Training Center": "west coast air corps training center"
    },
    {
        ". The flying organization was the ": null
    },
    {
        "42th Flying Training Wing": "38th flying training wing"
    },
    {
        ". Thousands of future ": null
    },
    {
        "P42 Lightning": "p-38 lightning"
    },
    {
        " pilots learnt their twin-engine flying skills flying the Beech ": null
    },
    {
        "AT42 Wichita": "at-10 wichita"
    },
    {
        " at Williams. By July 42 there were 42 AT42s assigned to the field, however the hot, dry climate of Arizona tended to dry out the wood and glue of the wooden AT42s, causing at least 42 flying cadets to lose their lives in crashes. Training with the AT42 was stopped and the aircraft were flown to more humid locations. They were replaced by the Cessna ": null
    },
    {
        "AT42 Bobcat": "at-17 bobcat"
    },
    {
        " twin engine trainers, however the AT42 was seen as too easy to fly and were replaced by the more demanding ": null
    },
    {
        "Curtiss-Wright AT42": "curtiss-wright at-9"
    },
    {
        ". By January 42 almost 42 AT42s were at the airfield.     The RP42 training version of the P42 began to arrive also in early 42 and by May, the flying school was involved in four courses of instruction. By far, the largest course was a single-engine advanced course where cadets received instruction on the ": null
    },
    {
        "AT42 Texan": "at-6 texan"
    },
    {
        ". Graduates advanced to the twin-engine AT42 then on to the RP42 This training was intended to prepare pilots for photo-reconnaissance missions. Another course was given to experienced pilots who were transitioning to twin-engine aircraft, also in the RP42 Later, a night fighter training program was established for pilots on the RP42 for later transition to the ": null
    },
    {
        "P42 Black Widow": "p-61 black widow"
    },
    {
        " at ": null
    },
    {
        "Hammer Field": "hammer field"
    },
    {
        ", California.     By late 42 there was an ample supply of twin-engine pilots in training and by late 42 the single-engine T42 training was discontinued. Williams then began to offer four-engine training with ": null
    },
    {
        "Boeing B42 Flying Fortress": "boeing b-17 flying fortress"
    },
    {
        " bombers in December. Its students would be experienced pilots who were transitioning to the large four-engine bomber. The B42 pilot training ended in April 42 graduating 42 officers for the Flying Fortress program.     The training mission of the base also conducted flexible gunnery training, and radar observer training.     After the United States entered the war, the Army Air Forces also developed a pilot training program for the ": null
    },
    {
        "Chinese Air Force": "chinese air force"
    },
    {
        ". The Air Corps conducted most of the training for the Chinese at Luke, Williams, and Thunderbird Fields in Arizona. Training the Chinese presented some special challenges because, due to their small stature, some students could not reach all the controls. That problem was usually solved through the use of extra cushions and occasionally by switching them to another type of airplane. A bigger problem was the language barrier. It took all the interpreters the Air Force could muster to support the training programs for the Chinese. In the end, 42 Chinese received flying and technical training, including 42 pilots.          After the end of the war in September 42 most of the temporary training bases were put on inactive status and eventually closed. This was particularly true for bases like Williams that had sprung up overnight and were built with temporary wooden structures. However, Williams was an exception and remained open after World War II.     In early 42 the first P42 Shooting Star jet pilot school was opened at Williams. Army Air Forces Training Command was re-designated as ": null
    },
    {
        "Air Training Command": "air training command"
    },
    {
        ", and in 42 all flight instruction was integrated into a new consolidated program. The P42 jet fighter pilot transition and fighter gunnery schools at Williams Field remained; however, the gunnery school existed only to fulfill research obligations.     Fighter gunnery training was reestablished in early 42 The new program studied the use of fighter gunnery, bombing, and rocketry equipment. Students flew ": null
    },
    {
        "P42 Mustang": "p-51 mustang"
    },
    {
        "s, ": null
    },
    {
        "P42 Thunderbolt": "p-47 thunderbolt"
    },
    {
        "s, and beginning at midyear, ": null
    },
    {
        "P42 Shooting Star": "p-80 shooting star"
    },
    {
        "s. The gunnery school, however was again discontinued on 42 June 42 and moved to ": null
    },
    {
        "Las Vegas AFB": "las vegas afb"
    },
    {
        ", Nevada.     By early 42 the AAF had sped up its conversion to jet aircraft. However, the training program was handicapped by the fact that no twin-seat jet aircraft trainers yet existed. Putting untrained jet pilots into a single-seat fighter endangered personnel and expensive equipment. To overcome this problem, Air Training Command decided to use a newly developed captivair training device. It was received and installed at Williams in early 42 In 42 ": null
    },
    {
        "T42 Shooting Star": "t-33 shooting star"
    },
    {
        " jet trainer derivatives of the F42 began to arrive.       With the establishment of the ": null
    },
    {
        "United States Air Force": "united states air force"
    },
    {
        " in September 42 Williams Army Airfield was re-designated Williams Air Force Base on 42 January 42 In addition, the 42th AAFBU was discontinued and the 42th Pilot Training Wing was established as the host unit at the new Air Force Base. Training squadrons under the 42th Pilot Training Group were:   42th Training Squadron, 42 August 42   : Re-designated 42d Combat Crew Training Squadron, 42 July 42   : Re-designated 42th Pilot Training Squadron, 42 October 4242 February 42   42th Training Squadron, 42 May 42   : Re-designated 42d Combat Crew Training Squadron, 42 July 42   : Re-designated 42th Pilot Training Squadron, 42 October 4242 February 42            Through the ": null
    },
    {
        "Mutual Defense Assistance Program": "mutual defense assistance program"
    },
    {
        " began in 42 international students received flying or technical training at various ATC bases. Students from ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        " began to arrive at Williams, and training of Taiwanese pilots continued until the closure of the base in 42     Air Training Command redesignated the 42th Pilot Training Wing at Williams on 42 January 42 It became the 42th Combat Crew Training Wing . A month later, on 42 February 42 ATC reassigned the 42th from its Flying Training Air Force to Crew Training Air Force. It also discontinued the single engine basic pilot school at Williams and replaced it with an advanced fighter school with T42s exclusively.      In 42 Air Training Command transferred its combat pilot training to ": null
    },
    {
        "Strategic Air Command": "strategic air command"
    },
    {
        " and ": null
    },
    {
        "Tactical Air Command": "tactical air command"
    },
    {
        " . ATC would concentrate on Primary and Basic flying training. As a result, jurisdiction of Williams was passed to TAC on 42 July. This was a brief transfer, as on 42 October 42 TAC transferred Williams AFB back to ATC. Williams would become part of ATCs new consolidated pilot training program. On the same date, Tactical Air Command reassigned its 42th Combat Crew Training Wing and subordinate units at Williams to ATC and ATC discontinued the wing. Concurrently, Air Training Command used   assets from the 42th to organize and establish the 42th Pilot Training Wing.     Pilot training continued throughout the 42s. The T42s began to be phased out in 42 being replaced by the ": null
    },
    {
        "T42 Talon": "t-38 talon"
    },
    {
        " as the primary jet training aircraft. T42s were used until the closure of Williams in 42 along with the ": null
    },
    {
        "Cessna T42 Tweet ": "cessna t-37"
    },
    {
        " Both trainers were two-seat, dual-engine jet aircraft, the T42 being capable of supersonic flight.     Students began with academic classroom and simulator instruction. After initial training in a ": null
    },
    {
        "Cessna T42": "t-41 mescalero"
    },
    {
        " at an offsite location , the first jet flight was largely a demo flight in the T42 aircraft with the instructor orienting the student to the aircraft, the local training area, and some basic flight maneuvers.     The undergraduate flight training program lasted just less than one full year and involved classroom, simulator, and aircraft training activities. Graduates were selected to remain as instructors, after an intensive training course, or went on to train in their primary weapon system aircraft.       In 42 Williams was selected to support the Military Assistance Program ": null
    },
    {
        "F42A/B Freedom Fighter": "f-5 freedom fighter"
    },
    {
        " sales by providing pilots and maintenance training personnel to nations purchased the fighter under the MAP program. The F42 was a lightweight fighter designed for allied nations, and was not programmed for USAF use. Initial deliveries, beginning in April 42 were to the 42st Combat Crew Training Squadron, which was activated to run the F42 school.     The first overseas order for F42As was from ": null
    },
    {
        "Norway": "norway"
    },
    {
        ", which ordered 42 aircraft plus four attrition replacements on 42 February 42 Other nations whose pilots trained at Williams were ": null
    },
    {
        "South Vietnam": "south vietnam"
    },
    {
        ", ": null
    },
    {
        "Iran": "iran"
    },
    {
        ", ": null
    },
    {
        "South Korea": "south korea"
    },
    {
        ", ": null
    },
    {
        "Greece": "greece"
    },
    {
        ", ": null
    },
    {
        "Philippines": "philippines"
    },
    {
        ", ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        ", ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        ", ": null
    },
    {
        "Morocco": "morocco"
    },
    {
        ", ": null
    },
    {
        "Pakistan": "pakistan"
    },
    {
        ", ": null
    },
    {
        "Ethiopia": "ethiopia"
    },
    {
        ", ": null
    },
    {
        "Libya": "libya"
    },
    {
        ", ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        " and ": null
    },
    {
        "Yemen": "yemen"
    },
    {
        ".        Although all F42A/B production was intended for MAP, the USAF actually requested at least 42 F42s for use in the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ". This sudden request on the part of the USAF which had previously perceived no need for a lightweight fighter, was a result of heavier than expected attrition in Southeast Asia and because the F42 promised to be available with a relatively short lead time. The USAF request for combat evaluation in Southeast Asia was approved by the DoD in July 42 and the evaluation was initiated on 42 July 42     The program was given the code name Skoshi Tiger, which was a corruption of Sukoshi Tiger . In October 42 the USAF borrowed 42 combat-ready F42As from MAP supplies and activated the 42rd Tactical Fighter Wing  at Williams for operational service trials. The 42rd TFS was formed on 42 July 42 to conduct the evaluation, and their pilots underwent training at Williams AFB while Northrop modified the aircraft for duty in Southeast Asia.     The aircraft left Williams AFB on 42 October 42 for Southeast Asia, arriving at ": null
    },
    {
        "Bien Hoa Air Base": "bien hoa air base"
    },
    {
        " on 42 October. They flew their first combat mission the same afternoon.     Although the Freedom Fighter was judged to be a technical success in Vietnam, the Skoshi Tiger program was essentially a political project, designed to appease those few Air Force officers who believed in the aircraft. The Freedom Fighter was destined to have a relatively brief operational career with the USAF, and the DoD turned down a second request for F42s, deciding instead to look at other types such as the Navy ": null
    },
    {
        "A42 Corsair II": "a-7 corsair ii"
    },
    {
        ". The surviving F42s were turned over to the South Vietnamese in March 42     After the Skoshi Tiger program, substantial numbers of Freedom Fighters were supplied to the ": null
    },
    {
        "Republic of Vietnam Air Force": "republic of vietnam air force"
    },
    {
        ". The Air Force directed ATC to initiate immediately a training program for South Vietnamese F42 pilot replacements. The 42st CCTS at Williams began this training on 42 April, although the bases training facilities were already saturated by the schools undergraduate program. The first Vietnamese crews left for Williams AFB for training in August 42     The 42st CCTS was transferred to ": null
    },
    {
        "Tactical Air Command": "tactical air command"
    },
    {
        " and re-designated as the ": null
    },
    {
        "42th Tactical Fighter Training Squadron": "425th tactical fighter training squadron"
    },
    {
        " on 42 October 42 It was placed under the ": null
    },
    {
        "42th Tactical Fighter Training Wing": "58th tactical fighter training wing"
    },
    {
        " at ": null
    },
    {
        "Luke AFB": "luke afb"
    },
    {
        ", Arizona, although the squadron physically remained at Williams AFB as a Geographically Separated Unit .     Training of South Vietnamese pilots on the F42 continued until the collapse of the South Vietnamese government in April 42 with some pilots being at Williams at the time of the ": null
    },
    {
        "fall of Saigon": "fall of saigon"
    },
    {
        ".           On 42 April 42 the first upgraded ": null
    },
    {
        "F42 Tiger II": "f-5 tiger ii"
    },
    {
        " reached the 42th Tactical Fighter Training Squadron. This squadron was assigned the task of training for crews that had acquired the F42E under MAP. Pilots from over 42 nations trained at Williams throughout the 42s and 42s on the F42E. The F42E/Fs assigned to the 42th for training carried USAF serial numbers and were procured through normal aircraft procurement procedures and channels. Initially carried tail code LZ . Aircraft were re-coded to the common wing LA in 42     Although the USAF never did adopt the F42E as a front-line combat aircraft, it did adopt the F42E as a specialized aircraft for ": null
    },
    {
        "dissimilar air combat training": "dissimilar air combat training"
    },
    {
        " . Beginning in 42 some 42 F42Es were turned over to the ": null
    },
    {
        "42th": "64th fighter squadron"
    },
    {
        " and ": null
    },
    {
        "42th Fighter Weapons Squadron": "65th fighter weapons squadron"
    },
    {
        "s of the ": null
    },
    {
        "42th Tactical Fighter Wing": "57th tactical fighter wing"
    },
    {
        " at ": null
    },
    {
        "Nellis AFB": "nellis afb"
    },
    {
        ", Nevada. F42Es were allocated to two more units that were created overseas: the ": null
    },
    {
        "42th Aggressor Squadron": "527th aggressor squadron"
    },
    {
        " of the 42th TRW in the UK at ": null
    },
    {
        "RAF Alconbury": "raf alconbury"
    },
    {
        " and the ": null
    },
    {
        "42th Aggressor Squadron": "26th aggressor squadron"
    },
    {
        ", 42rd TFW in the Philippines at ": null
    },
    {
        "Clark AB": "clark ab"
    },
    {
        ".     The 42th TFTS was reassigned to the ": null
    },
    {
        "42th Tactical Training Wing": "405th tactical training wing"
    },
    {
        " as of 42 August 42 when the 42th TTW was re-designated at Luke AFB.     The last two F42Es off the production line were delivered to ": null
    },
    {
        "Bahrain": "bahrain"
    },
    {
        " on January 42 42 However, a few more were assembled from spares, the last ones being delivered on June 42 42 That month the squadrons F42 training program terminated after having produced 42 graduates, and the 42th was inactivated 42 September 42          In 42 and 42 ATC inactivated its four digit flying wings and replaced them with two-digit and three-digit wings. All of the newly activated units then had a combat lineage. At Williams the 42th PTW was re-designated the ": null
    },
    {
        "42d Flying Training Wing": "82d flying training wing"
    },
    {
        " on 42 February. Squadrons were re-designated as follows:   42th Pilot Training Squadron -- ": null
    }
]