[
    {
        " Will the Real Martian Please Stand Up?  is episode 42 of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone . It originally aired on May 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ".              Two state troopers, investigating a report about a UFO, find evidence something has crashed in a frozen pond: footprints in the snow from the pond lead to a nearby, isolated late-night diner called the Hi-Way. Upon arriving, the troopers find a bus parked outside the Hi-Way Cafe. Inside the Hi-Way, the troopers find a cook behind the counter named Haley, a bus driver, and his passengers.     The troopers, Dan Perry and Bill Padgett, announce a suspected alien from a nearby crashed UFO may be among them, and asks for everyone to identify themselves. The bus driver tells them his name is Olmstead, and states they were forced to stop at the Hi-Way Café due to the snow storm and could not go back to their previous destination because the diner was at the bottom of an icy hill. The troopers state they will have a long wait, perhaps until the morning, because the bridge ahead was closed due to the snow storm, adding the county engineer is currently examining the bridge. “Looks like you’re stuck here,” Haley the cook says.     The troopers ask the bus driver if he has a passenger manifest, at which the driver laughs and asks the troopers to take a look outside. “That’s a 42-year old bus, not a 42 and business is lousy.” He claims when they boarded, it was snowing, and he didnt ask names. He counted six passengers. The company gave him six, and hes supposed to deliver six. The troopers make a quick count, and there are seven passengers: Connie and George Prince, a young married couple; Rose and Peter Kramer, an older married couple; Ethel McConnell, a professional dancer; an outlandish old man with a lazy eye named Avery, and Ross, a craggy businessman. Hayley the cook says the diner was empty due to the snow, before the bus had arrived, and these were only customers hed had in hours.     The troopers then ask the group, Who wasnt on the bus,” to which Ross, the businessman, loudly responds, We were all on the bus, and castigates the bus driver for causing this confusion by miscounting, and suggesting the troopers are from the ": null
    },
    {
        "Gestapo": "gestapo"
    },
    {
        ".     After some initial debate on how to figure this out, Ethel suggests the couples be cleared on the grounds the spouses would surely know each other. Both couples readily agree but begin to eye each other with suspicion; Connie asking her husband, “George, I thought you had a mole on your chin,” and Peter becoming irritated with Rose whod been giving him a long look.     The troopers then ask Ethel for her ID, but she claims her ID was sent ahead with her luggage. The bus driver vouches for her, admitting that he did at least notice her when she boarded. She smiles and thanks him. Avery, clearly enjoying the hilarity of this situation, cracks jokes and chides the businessman who complains about the bus companys unreliability; he must make an important meeting in Boston by 42 oclock the next morning. The bus driver, not having it, shoots back to the businessman that the weather is not the bus companys fault and decrees the bus will in fact not be crossing that bridge until he believes it is safe. Throughout these exchanges tensions rise, and suspicions are confirmed that someone present must indeed be the Martian as the jukebox starts and stops on its own, the lights flash on and off, and the tabletop sugar dispensers explode. The troopers draw their weapons.     The payphone then rings, bringing a report from the county engineer that the bridge is safe, and can be crossed. The bus driver asks the troopers, Are you sure? I dont like that old bridge. She sways in the wind and is not a suspension. The troopers tell him that if the county engineer says shes safe, shes safe.     Unable to hold them without evidence to the contrary, the troopers allow all seven people plus the driver to board the bus and be on their way. The troopers offer to drive ahead to make sure the bridge was safe. Everyone lines up at the cash register to settle-up with Haley, board the bus and leave.     Sometime later, Ross returns to the diner alone, surprising Haley. Hey, Haley says, werent you on that bus? The businessman takes a seat, orders a coffee, and explains to the cook that the bridge had not been safe after all: it collapsed, and everyone—the bus, its passengers and the troopers—had all plunged into the river and drowned. Shocked, Haley asks the businessman, “Everyone but you? Why – how could that be? You aren’t even wet.” The businessman blinks and asks, Wet? What is . . . wet? Haley says, “What do you mean what is wet?”     The businessman then calmly explains who he really is, revealing a third hand from under his coat. He uses all three hands to stir his coffee and light a cigarette, off which he takes a drag and comments hed taken “quite a liking as we dont have anything like these on his planet. He then demonstrates, offhandedly, that everything which happened earlier—the jukebox, the lights and the sugar dispensers—had been illusions, including the call from the county engineer.     Now, before you faint dead away, the businessman says, and you will, he tells Haley that he is in fact a Martian scout sent ahead of the Martian fleet which was on its way. Earth , he says, has been identified as a perfect spot for Martian colonization as it is so remote , so off-the-beaten path —and he is awaiting their arrival.     Haley smiles and says that he has some waiting to do himself. He agrees this planet is a prime spot for colonization, and that we folks from Venus determined this several years ago. Haley then informs the businessman that the Martian fleet will not be coming as the Venusian fleet has intercepted it. Oh, the cook says, this planet will be colonized, but by Venus . . . and if youre still alive, you will see, the cook continues, reaching up to remove his hat to reveal a third eye in the center of his forehead, just how much we differ.        ": null
    },
    {
        "John Hoyt": "john hoyt"
    },
    {
        " as Ross, the businessman   ": null
    },
    {
        "Jean Willes": "jean willes"
    },
    {
        " as Ethel McConnell, the dancer   ": null
    },
    {
        "Jack Elam": "jack elam"
    },
    {
        " as Avery, the crazy man   ": null
    },
    {
        "Barney Phillips": "barney phillips"
    },
    {
        " as Haley, the cook   ": null
    },
    {
        "John Archer": "john archer"
    },
    {
        " as Trooper Bill Padgett   ": null
    },
    {
        "William Kendis": "william kendis"
    },
    {
        " as Olmstead, the bus driver   ": null
    },
    {
        "Morgan Jones": "morgan jones"
    },
    {
        " as Trooper Dan Perry   ": null
    },
    {
        "Gertrude Flynn": "gertrude flynn"
    },
    {
        " as Rose Kramer, the older wife   ": null
    },
    {
        "Bill Erwin": "bill erwin"
    },
    {
        " as Peter Kramer, the older husband   ": null
    },
    {
        "Jill Ellis": "jill ellis"
    },
    {
        " as Connie Prince, the younger wife   ": null
    },
    {
        "Ron Kipling": "ron kipling"
    },
    {
        " as George Prince, the younger husband            The episode is unique, as an actual Twilight Zone contributor is mentioned. As the patrons realize that an alien is among the group, Jack Elams character laughs and says, Shes just like science fiction, that what she is. A regular ": null
    },
    {
        "Ray Bradbury": "ray bradbury"
    },
    {
        ". One of Bradburys stories became a Twilight Zone episode during the third season.      In one of the few times Serling accommodated his sponsor during an episode, Ross takes out a pack of cigarettes and lights and smokes one using three hands, commenting on how much he enjoys them. The cigarettes were Oasis menthol, the brand that ": null
    },
    {
        "Liggett & Myers": "liggett  &  myers"
    },
    {
        " was advertising on the program at the time. During the 42s and 42s, advertisers sometimes subtly ": null
    },
    {
        "placed": "product placement"
    }
]