[
    {
        "           William Stukeley  was an English ": null
    },
    {
        "antiquarian": "antiquarianism"
    },
    {
        ", physician, and ": null
    },
    {
        "Anglican": "anglicanism"
    },
    {
        " clergyman. A significant influence on the later development of ": null
    },
    {
        "archaeology": "archaeology"
    },
    {
        ", he pioneered the scholarly investigation of the prehistoric monuments of ": null
    },
    {
        "Stonehenge": "stonehenge"
    },
    {
        " and ": null
    },
    {
        "Avebury": "avebury"
    },
    {
        " in ": null
    },
    {
        "Wiltshire": "wiltshire"
    },
    {
        ". He published over twenty books on archaeology and other subjects during his lifetime.     Born in ": null
    },
    {
        "Holbeach": "holbeach"
    },
    {
        ", ": null
    },
    {
        "Lincolnshire": "lincolnshire"
    },
    {
        " as the son of a lawyer, Stukeley worked in his fathers law business before attending ": null
    },
    {
        "Benet College": "corpus christi college, cambridge"
    },
    {
        ", ": null
    },
    {
        "Cambridge": "university of cambridge"
    },
    {
        ". In 42 he began studying medicine at ": null
    },
    {
        "St Thomas Hospital": "st thomas hospital"
    },
    {
        ", ": null
    },
    {
        "Southwark": "southwark"
    },
    {
        ", before working as a ": null
    },
    {
        "general practitioner": "general practitioner"
    },
    {
        " in ": null
    },
    {
        "Boston": "boston, lincolnshire"
    },
    {
        ", Lincolnshire. From 42 till 42 he embarked on annual tours of the countryside, seeking out archaeological monuments and other features that interested him; he wrote up and published several accounts of his travels. In 42 he returned to London and established himself within the citys antiquarian circles. In 42 he was elected a Fellow of the ": null
    },
    {
        "Royal Society": "royal society"
    },
    {
        " and became the first secretary of the ": null
    },
    {
        "Society of Antiquaries of London": "society of antiquaries of london"
    },
    {
        ". In 42 he became a ": null
    },
    {
        "Freemason": "freemasonry"
    },
    {
        " and in 42 co-founded the Society of Roman Knights, an organisation devoted to the study of ": null
    },
    {
        "Roman Britain": "roman britain"
    },
    {
        ". In the early 42s, Stukeley developed a particular interest in Stonehenge and Avebury, two prehistoric ": null
    },
    {
        "stone circles": "stone circles in the british isles and brittany"
    },
    {
        " in Wiltshire. He visited them repeatedly, undertaking fieldwork to determine their dimensions.     In 42 Stukeley relocated to ": null
    },
    {
        "Grantham": "grantham"
    },
    {
        ", Lincolnshire, where he married. In 42 he was ordained as a cleric in the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        " and appointed vicar of ": null
    },
    {
        "All Saints Church": "all saints church, stamford"
    },
    {
        " in ": null
    },
    {
        "Stamford": "stamford, lincolnshire"
    },
    {
        ", Lincolnshire. He was a friend of the ": null
    },
    {
        "Archbishop of Canterbury": "archbishop of canterbury"
    },
    {
        " William Wake": "william wake"
    },
    {
        ", who encouraged him to use his antiquarian studies to combat the growth of ": null
    },
    {
        "deism": "deism"
    },
    {
        " and ": null
    },
    {
        "freethought": "freethought"
    },
    {
        " in Britain. To this end, Stukeley developed the belief that Britains ancient ": null
    },
    {
        "druids": "druids"
    },
    {
        " had followed a ": null
    },
    {
        "monotheistic": "monotheism"
    },
    {
        " religion inherited from the ": null
    },
    {
        "Biblical Patriarchs": "patriarchs"
    },
    {
        "; he called this druidic religion Patriarchal Christianity . He further argued that the druids had erected the stone circles as part of serpentine monuments symbolising the ": null
    },
    {
        "Trinity": "trinity"
    },
    {
        ". In 42 he returned to London as rector of ": null
    },
    {
        "St George the Martyr, Holborn": "st george the martyr, holborn"
    },
    {
        ". In the last part of his life, he became instrumental in British scholarships acceptance of ": null
    },
    {
        "Charles Bertram": "charles bertram"
    },
    {
        "s forged  Description of Britain  and wrote one of the earliest biographies of his friend, ": null
    },
    {
        "Isaac Newton": "isaac newton"
    },
    {
        ".     Stukeleys ideas influenced various antiquaries throughout the eighteenth and early nineteenth centuries, in addition to artists like ": null
    },
    {
        "William Blake": "william blake"
    },
    {
        ", although had been largely rejected by archaeologists by the second half of the nineteenth century. He is nevertheless regarded as an important forerunner of archaeology for his emphasis on methodically measuring and documenting ancient sites. He has since become the subject of multiple biographies and academic studies by scholars like ": null
    },
    {
        "Stuart Piggott": "stuart piggott"
    },
    {
        ", ": null
    },
    {
        "David Boyd Haycock": "david boyd haycock"
    },
    {
        ", and ": null
    },
    {
        "Ronald Hutton": "ronald hutton"
    },
    {
        ".           Stukeley was born on 42 November 42 in his parental home in ": null
    },
    {
        "Holbeach": "holbeach"
    },
    {
        ", ": null
    },
    {
        "Lincolnshire": "lincolnshire"
    },
    {
        ". He was the eldest child in a family of four boys and one girl; it is possible that he was named after ": null
    },
    {
        "William of Orange": "william iii of england"
    },
    {
        ", who soon after became ": null
    },
    {
        "King of England": "king of england"
    },
    {
        ". His paternal grandfather, John Stukeley , was a country gentleman who possessed a small estate at ": null
    },
    {
        "Uffington": "uffington, lincolnshire"
    },
    {
        ", Lincolnshire and who accrued a large number of debts by the time of his death. John had two sons; the elder, Adlard, was apprenticed to the legal profession, while the younger, also called John, was initially trained as a farmer before joining Adlard in a family law firm. On 42 May 42 John married the teenage daughter of Robert Bullen in ": null
    },
    {
        "Pinchbeck": "pinchbeck, lincolnshire"
    },
    {
        ", Lincolnshire; their first child was miscarried, with William being their second.     In 42 at the age of five, Stukeley began an education at Holbeachs Free School, where he learned to read and write. By the age of thirteen, he was the top-rated pupil at his school. As a schoolchild, he began collecting Roman coins after a hoard was found nearby and also developed interests in botany and medicine. In 42 he was taken out of school to work in his fathers legal business. With his father he travelled south to London on various occasions, where he purchased many books and scientific instruments. He was nevertheless bored by his law activities, and when he requested that he be allowed to study at university, his father agreed.     He began studying at ": null
    },
    {
        "Cambridge University": "cambridge university"
    },
    {
        " in November 42 as a ": null
    },
    {
        "pensioner": "commoner"
    },
    {
        " at ": null
    },
    {
        "Benet College": "corpus christi college, cambridge"
    },
    {
        ". Among the classes that he took during his studies were Classics, Ethics, Logic, Metaphysics, Divinity, Mathematics, and Philosophy. In his spare time, he dissected animals and searched for fossils in the gravel pits outside the town; in 42 he dissected a hanged man. Outside of term time, he travelled to London, there taking anatomy courses with ": null
    },
    {
        "George Rolf": "george rolf"
    },
    {
        " and becoming acquainted with the poet ": null
    },
    {
        "John Gay": "john gay"
    },
    {
        ". In February 42 his father died, with his uncle passing away three weeks later. He returned home to sort out the familys financial affairs. In 42 his mother then died, leaving him in charge of his younger siblings; to pay off family debts, he sold off their furniture and let out their Holbeach home. He also attracted local attention for dissecting a local who had committed suicide. In January 42 he returned to Cambridge to defend his thesis, on the title of Catamenia pendent a plethora . By this point he was taking a growing interest in architecture, producing careful pen-drawings of medieval buildings. He considered embarking on the fashionable ": null
    },
    {
        "Grand Tour": "grand tour"
    },
    {
        " of continental Europe to see the ancient ruins of Greece and Italy, but likely decided against it on financial grounds.              In August 42 Stukeley moved to London to further pursue medicine under doctor ": null
    },
    {
        "Richard Mead": "richard mead"
    },
    {
        " at ": null
    },
    {
        "St Thomas Hospital": "st thomas hospital"
    },
    {
        ". In March 42 he left the city to practice medicine in the countryside, establishing a practice in ": null
    },
    {
        "Boston": "boston, lincolnshire"
    },
    {
        ", Lincolnshire. He took with him ": null
    },
    {
        "a black servant": "black british"
    },
    {
        ", which would have been a status symbol at the time. Little is known of the time that he spent in the town, although in 42 he was accorded ": null
    },
    {
        "Freedom of the Town": "freedom of the city"
    },
    {
        ". His brother, Adlard, moved in with him and in Boston was apprenticed to a local apothecary. Stukeley also formed a local botanic society that went on weekly plant-collecting trips in the local area. In 42 he produced a print of Bostons ": null
    },
    {
        "St Botolphs Church": "st botolphs church, boston"
    },
    {
        ", which he dedicated to the Marquis of Lindsey. Many of his travels around Lincolnshire were written up in what appears to be his first book, Iter Domesticum, although the year of its publication is not known.     From 42 until 42 Stukeley embarked on a horseback expedition through the countryside at least once a year, taking notes on the things that he observed. In 42 for example, he first visited the prehistoric ceremonial complex, the ": null
    },
    {
        "Rollright Stones": "rollright stones"
    },
    {
        ". At the time, his interests were not purely antiquarian, for he also took notes on ": null
    },
    {
        "landscape gardens": "landscape gardens"
    },
    {
        " and other more recent constructions that he encountered. In 42 Stukeley embarked on an extensive tour of western Britain, taking in ": null
    },
    {
        "Wales": "wales"
    },
    {
        " before returning to ": null
    },
    {
        "England": "england"
    },
    {
        " to visit ": null
    },
    {
        "Grantham": "grantham"
    },
    {
        ", ": null
    },
    {
        "Derby": "derby"
    },
    {
        ", ": null
    },
    {
        "Buxton": "buxton"
    },
    {
        ", ": null
    },
    {
        "Chatsworth": "chatsworth, derbyshire"
    },
    {
        ", and ": null
    },
    {
        "Manchester": "manchester"
    },
    {
        ". He later published an account of these travels in Western Britain as Iter Cimbricum. Stukeleys later biographer ": null
    },
    {
        "Stuart Piggott": "stuart piggott"
    },
    {
        " related that this book was not yet the characteristic product of a field archaeologist but rather differs little from that which could be written by any intelligent gentleman of the period .     Stukeley befriended the antiquary ": null
    },
    {
        "Maurice Johnson": "maurice johnson"
    },
    {
        " and joined Johnsons ": null
    },
    {
        "learned society": "learned society"
    },
    {
        ", the ": null
    },
    {
        "Spalding Gentlemens Society": "spalding gentlemens society"
    },
    {
        ", which was based in ": null
    },
    {
        "Spalding": "spalding, lincolnshire"
    },
    {
        ", Lincolnshire. A 42 letter indicates that Johnson recommended several books on British history to Stukeley, apparently at the latters request; the suggested titles included ": null
    },
    {
        "Julius Caesar": "julius caesar"
    },
    {
        "s  De Bello Gallico , ": null
    },
    {
        "John Milton": "john milton"
    },
    {
        "s  The History of Britain , ": null
    },
    {
        "Robert Brady": "robert brady"
    },
    {
        "s An Introduction to the Old English History, ": null
    },
    {
        "Peter Heylin": "peter heylin"
    },
    {
        "s Help to English History, and ": null
    },
    {
        "Richard Rowlands": "richard rowlands"
    },
    {
        " A Restitution of Decayed Intelligence in Antiquities concerning the most noble and renowned English Nation. Another letter to Johnson, this time from May 42 reveals that Stukeley was assembling a series of chronological tables of all British kings since ": null
    },
    {
        "Brutus of Troy": "brutus of troy"
    },
    {
        "; following the medieval historian ": null
    },
    {
        "Geoffrey of Monmouth": "geoffrey of monmouth"
    },
    {
        ", Stukeley believed that the legendary Brutus was a real historical figure. In September 42 he wrote an account of ": null
    },
    {
        "Richborough Castle": "richborough castle"
    },
    {
        ", a Roman military fort in Kent. That same year, he described having made a model of the Neolithic/Bronze Age stone circle of ": null
    },
    {
        "Stonehenge": "stonehenge"
    },
    {
        ".              By May 42 Stukeley had returned to London, living in ": null
    },
    {
        "Great Ormond Street": "great ormond street"
    },
    {
        ". The reasons for his return to the city are not known, although it is perhaps due to his desire to once again be among the London intelligentsia. Once in the city he began to circulate within its antiquarian circles. At Meads nomination, in early 42 he was elected as a ": null
    },
    {
        "Fellow": "fellow of the royal society"
    },
    {
        " of the ": null
    },
    {
        "Royal Society": "royal society"
    },
    {
        ", then under the presidency of the scientist ": null
    },
    {
        "Isaac Newton": "isaac newton"
    },
    {
        ". Stukeley befriended Newton and visited him at his home on several occasions; he was part of a coterie in the society who supported ": null
    },
    {
        "Newtonian philosophy": "newtonianism"
    },
    {
        ". Stukeley lectured to the society on a fossil crocodile or porpoise in 42 , arguing that ": null
    },
    {
        "it was evidence": "flood geology"
    },
    {
        " for the ": null
    },
    {
        "Genesis flood narrative": "genesis flood narrative"
    },
    {
        ";  in February 42 he lectured to the society on female human anatomy, illustrated with drawings of a cadaver he had autopsied. Following ": null
    },
    {
        "Edmond Halley": "edmond halley"
    },
    {
        "s resignation as society secretary, in November 42 Stukeley put himself forward as a potential replacement; he unsuccessfully ran against Newtons favoured candidate, ": null
    },
    {
        "James Jurin": "james jurin"
    },
    {
        ". This upset some of Stukeleys friendships in the group and cooled his relationship with Newton for several years.     Also in 42 Stukeley joined the newly founded ": null
    },
    {
        "Society of Antiquaries of London": "society of antiquaries of london"
    },
    {
        " and became its first secretary. In 42–42 he was partly instrumental in setting up the societys committee on coins. He nevertheless appears to have taken little active part in the societys business. He also retained his interest in medical matters, and in June 42 took a ": null
    },
    {
        "medical doctorate": "medical doctorate"
    },
    {
        " in Cambridge, enabling him to join the ": null
    },
    {
        "Royal College of Surgeons": "royal college of surgeons"
    },
    {
        " in 42 In October 42 he was one of the physicians who conducted an autopsy of a deceased elephant in ": null
    },
    {
        "Hans Sloane": "hans sloane"
    },
    {
        "s ": null
    },
    {
        "Chelsea": "chelsea, london"
    },
    {
        " garden. In March 42 he gave the ": null
    },
    {
        "Goulstonian Lecture": "goulstonian lecture"
    },
    {
        " at the Royal College theatre; his topic was the human spleen. He published his lectures as On the Spleen in 42 appending to it his Essay Towards the Anatomy of the Elephant . According to Stukeley biographer ": null
    },
    {
        "David Boyd Haycock": "david boyd haycock"
    },
    {
        ", On the Spleen was significant as his first major publication, and his only one in anatomy .     Stukeley developed a friendship with two brothers who shared many of his antiquarian interests, ": null
    },
    {
        "Roger": "roger gale"
    },
    {
        " and ": null
    },
    {
        "Samuel Gale": "samuel gale"
    },
    {
        ". From his father, the former ": null
    },
    {
        "Dean of York": "dean of york"
    },
    {
        " Thomas Gale": "thomas gale"
    },
    {
        ", Roger had inherited a copy of the Monumenta Britannica, a work produced by seventeenth-century antiquarian ": null
    },
    {
        "John Aubrey": "john aubrey"
    },
    {
        ". He showed it to Stukeley, who produced a transcription of Aubreys document in either 42 or 42 Piggott suggested that it was Aubreys manuscript that first brought Avebury to Stukeleys attention. Circa 42 Stukeley first visited the site, accompanied by the Gale brothers. In 42 he visited again, also taking in Stonehenge before traveling to ": null
    },
    {
        "Oxford": "oxford"
    },
    {
        " to meet ": null
    },
    {
        "Thomas Hearne": "thomas hearne"
    },
    {
        ", an antiquarian who was highly critical of Stukeley. That summer, he spent time in ": null
    },
    {
        "Great Chesterford": "great chesterford"
    },
    {
        " in ": null
    },
    {
        "Essex": "essex"
    },
    {
        ", where he identified a Romano-British temple from crop marks in a field.          Stukeley devoted much attention to Avebury during the 42s. The records he produced of how the monument and its various features looked at the time has been important for later archaeologists for by the early twentieth century—when the earliest sustained archaeological investigation of the site took place—many of these features had been lost. He witnessed locals breaking up megaliths in the circle and although powerless to stop them it may have been this observation that led him to produce a detailed record of the site.     In January 42 Stukeley was initiated as a ": null
    },
    {
        "Freemason": "freemasonry"
    },
    {
        ". He suspected that Freemasonry was the remains of the mysterys of the antients . By 42 he was the Master of the Masonic Lodge meeting at Fountain Tavern on Londons ": null
    },
    {
        "Strand": "strand, london"
    },
    {
        ". In July 42 he and several friends formed the Society of Roman Knights, an organisation devoted to the study of ": null
    },
    {
        "Roman Britain": "roman britain"
    },
    {
        ". The group began with sixteen members before attracting new recruits over the following two years. In admitting women as well as men, the Society was unprecedented within British society at the time; the Society of Antiquaries for instance would not admit female members for another two centuries. Members of the Roman Knights each took a name from the Romano-British period; Stukeleys was Chyndonax , the name of a priest listed in a Greek inscription reputedly found in a glass cinerary urn in 42 Through the society he also became close friends with ": null
    },
    {
        "Francis Seymour-Conway, 42st Marquess of Hertford": "francis seymour-conway, 1st marquess of hertford"
    },
    {
        " and ": null
    },
    {
        "Heneage Finch, 42th Earl of Winchilsea": "heneage finch, 5th earl of winchilsea"
    },
    {
        "; he encouraged the latter to carry out archaeological fieldwork, as at ": null
    },
    {
        "Julliberries Grave": "julliberries grave"
    },
    {
        " in Kent.     In August 42 Stukeley and Roger Gale set forth on another tour, visiting Avebury and Stonehenge before going to Gloucester, Hereford, Ludlow, Wolverhampton, Derby, and finally reaching Grantham in October. He wrote up his notes of the journey as Iter Sabrinum. He returned to Avebury in the summer of 42—this time with the artists ": null
    },
    {
        "Gerard Vandergucht": "gerard vandergucht"
    },
    {
        " and ": null
    },
    {
        "John Pine": "john pine"
    },
    {
        ", who had both become Roman Knights that year—before proceeding to Stonehenge and Silchester. In September and October he embarked on another tour, this time taking in Cambridge, Boston, Lincoln, Dunstable, Leminster, and Rochester, largely following Roman roads. He published a description of this tour as Iter Romanum. In 42 he travelled from London to ": null
    },
    {
        "Newbury": "newbury, berkshire"
    },
    {
        " and ": null
    },
    {
        "Marlborough": "marlborough, wiltshire"
    },
    {
        " before visiting ": null
    },
    {
        "Stanton Drew stone circles": "stanton drew stone circles"
    },
    {
        ", and then heading back east to ": null
    },
    {
        "Bath": "bath, somerset"
    },
    {
        ", ": null
    },
    {
        "Exeter": "exeter"
    },
    {
        ", and Dorchester. These tours were written up as Iter Dumnoniense and Iter Septimum Antonini Aug. He also wrote an account of Dorcehsters ": null
    },
    {
        "Maumbury Rings": "maumbury rings"
    },
    {
        " in October 42 as Of the Roman Ampitheatre at Dorchester.          It was while at Avebury in 42 that he began a draft of the History of the Temples of the Ancient Celts. This work drew upon his fieldwork at both Avebury and Stonehenge as well as his field-notes from other prehistoric sites and information obtained from the Templa Druidum section of Aubreys Monumenta Britannica. The work also cited Biblical and Classical texts. In the book, Stukeley discussed how prehistoric people might have erected such monuments using sledges, timber cradles, rollers, and leavers. He devoted much space to refuting the suggestion, made by ": null
    },
    {
        "Inigo Jones": "inigo jones"
    },
    {
        " and J. Webb, that Stonehenge had been erected by the Romans, instead attributing it to the prehistoric—or as he called it, Celtic —period. The druids are mentioned only briefly in the book, when Stukeley suggested that they might be possible creators of the stone circles.     In 42 Stukeley returned to Avebury and Stonehenge, returning via ": null
    },
    {
        "Ringwood": "ringwood"
    },
    {
        " and ": null
    },
    {
        "Romsey": "romsey"
    },
    {
        " before heading up to ": null
    },
    {
        "Lincoln": "lincoln, england"
    },
    {
        " and then back down to Kent later in the year. This was the final year in which he conducted fieldwork at Avebury. In 42 Stukeley engaged in the last of his great tours, this time with Roger Gale. This took him from ": null
    },
    {
        "Dunstable": "dunstable"
    },
    {
        " up into the Midlands, where he visited Coventry, Birmingham, Derby, and Buxton before heaving west to Chester and then north for Liverpool and the ": null
    },
    {
        "Lake District": "lake district"
    },
    {
        "; there he visited stone circles like ": null
    },
    {
        "Long Meg and Her Daughters": "long meg and her daughters"
    },
    {
        " and ": null
    },
    {
        "Castlerigg stone circle": "castlerigg stone circle"
    },
    {
        ". From there, Stukeley and Gale travelled further north to ": null
    },
    {
        "Whitehaven": "whitehaven"
    },
    {
        " and then ": null
    },
    {
        "Hadrians Wall": "hadrians wall"
    },
    {
        ", following it along to Newcastle before heading south back to London via Durham and Doncaster.         In 42 Stukeley left London and relocated to Grantham in Lincolnshire. The reasons for his decision to do so are obscure. It may be that he left the city due to frustration that his antiquarian research was not being financially supported by wealthier benefactors. On his move to Grantham, Stukeley resigned as secretary of the Society of Antiquaries. Stukeley struggled to earn a living as a physician in Grantham; he also established a Freemasonic lodge in the town, although it never appeared on the roll of the ": null
    },
    {
        "Grand Lodge of England": "united grand lodge of england"
    },
    {
        ". In December 42 he married Frances Williamson, daughter of a gentleman from ": null
    },
    {
        "Allington": "allington, lincolnshire"
    },
    {
        ". The couples attempts to conceive children met with failure, and Williamson suffered two miscarriages. In October 42 Stukeley buried the second of the two unborn infants in his garden, performing a funeral ceremony that drew upon his interest in ancient Roman practices. Frances subsequently bore Stukeley three further daughters.          Stukeley was friendly with the ": null
    },
    {
        "Archbishop of Canterbury": "archbishop of canterbury"
    },
    {
        " William Wake": "william wake"
    },
    {
        ", who shared his interest in antiquarianism. Stukeley asked his friend if he may become a cleric in the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        ", a request which Wake granted in June 42 Wake ordained him as a ": null
    },
    {
        "deacon": "deacon"
    },
    {
        " in ": null
    },
    {
        "Croydon": "croydon"
    },
    {
        " on 42 July 42 Given his intellectual pursuits, Wake saw Stukeley as a welcome recruit in the Church of Englands conflict with ": null
    },
    {
        "Freethought": "freethought"
    },
    {
        ". In October 42 the ": null
    },
    {
        "Lord Chancellor": "lord chancellor"
    },
    {
        " Peter King": "peter king, 1st baron king"
    },
    {
        " granted Stukeley the living of ": null
    },
    {
        "All Saints": "all saints church, stamford"
    },
    {
        " in ": null
    },
    {
        "Stamford": "stamford, lincolnshire"
    },
    {
        ", Lincolnshire, taking up residence in the town in early 42 He enjoyed the towns medieval architecture, and began to write a history of the settlement in the form of a dialogue. He also enjoyed gardening while living in the town, in 42 building a Hermitage in his garden, which featured niches, a stone arch, and a fountain.     According to Piggott, Stukeleys ordination was the essential turning-point in his whole life . His reasons for joining the clergy are not known for certain. One possibility is that he sought the steady wage supplied by the Church of England, having for a while complained about how little he earned as a doctor. Alternately, he may have believed that becoming a cleric would be a secure position from which he could pursue the unorthodox ideas he was developing. His decision to join the clergy concerned friends like Robert Gale. To Piggott, Stukeley sought to use his fieldwork as ammunition in a holy war against the Deists . Stukeley would write that his purpose in becoming a cleric was to combat the deists from an unexpected quarter , describing his resentment of that deluge of profaneness and infidelity that prevails so much at present, and threatens an utter subversion of religion in general .     In 42 he co-founded a local antiquarian and literary society, The Brazen Nose, with six other founder-members . It held weekly meetings at which they discussed a varied range of subjects; the first meeting involved discussions of ": null
    },
    {
        "astronomy": "astronomy"
    },
    {
        ", lunar maps, a wasps nest, a medieval seal, and a bladder stone the size of a walnut that had been retrieved from a small dog. The society eventually lapsed, and Stukeleys attempt to revive it in 42 proved unsuccessful. He also remained interested in the local discovery of antiquities; he became aware of ": null
    },
    {
        "a large, silver Romano-British dish": "risley park lanx"
    },
    {
        " uncovered at ": null
    },
    {
        "Risley Park": "risley, derbyshire"
    },
    {
        ", ": null
    },
    {
        "Derbyshire": "derbyshire"
    },
    {
        " in 42 and read an account of it to the Society of Antiquaries in 42 In October 42 Stukeley was alerted to the discovery of the ": null
    },
    {
        "Royston Cave": "royston cave"
    },
    {
        " by local politician ": null
    },
    {
        "William Goodhall": "william goodhall"
    },
    {
        ". He wrote about the site in his 42 book, ": null
    }
]