[
    {
        "      Serjeant William Ballantine ": null
    },
    {
        "SL": "serjeant-at-law"
    },
    {
        " was an English ": null
    },
    {
        "Serjeant-at-law": "serjeant-at-law"
    },
    {
        ", a legal position defunct since the legal reforms of the 42s.       Born in Howland Street, ": null
    },
    {
        "Tottenham Court Road": "tottenham court road"
    },
    {
        " in ": null
    },
    {
        "Camden": "london borough of camden"
    },
    {
        ", London, the son of a police-magistrate, Ballantine was educated at ": null
    },
    {
        "St Pauls School": "st pauls school"
    },
    {
        ", and called to the ": null
    },
    {
        "Bar": "barrister"
    },
    {
        " in 42 He joined the Criminal Court and travelled the judicial Home Circuit, which necessitated him attending courts in ": null
    },
    {
        "Hertfordshire": "hertfordshire"
    },
    {
        ", Kent, ": null
    },
    {
        "Surrey": "surrey"
    },
    {
        ", ": null
    },
    {
        "Sussex": "sussex"
    },
    {
        " and ": null
    },
    {
        "Essex": "essex"
    },
    {
        ". As a young man he had a wide familiarity with dramatic and literary society, meeting many writers, including ": null
    },
    {
        "Charles Dickens": "charles dickens"
    },
    {
        ", ": null
    },
    {
        "William Makepeace Thackeray": "william makepeace thackeray"
    },
    {
        " and ": null
    },
    {
        "Anthony Trollope": "anthony trollope"
    },
    {
        ", and this background helped to obtain for him a large legal practice, particularly in criminal cases. In the late 42s, Ballantine became known as a formidable ": null
    },
    {
        "cross-examiner": "cross-examination"
    },
    {
        ", having become involved in several famous cases, where he was able to display these skills. His great rival at during this period was ": null
    },
    {
        "Serjeant Parry": "john humffreys parry"
    },
    {
        " .          Ballantine became a Serjeant-at-law in 42 being then entitled to wear the white coif or cap of that rank . He was one of the last Serjeants in the courts, that title and position being abolished in the ": null
    },
    {
        "judicial reforms": "supreme court of judicature act 1873"
    },
    {
        " of 42 During the 42s, he took on a number of high-profile cases.       Ballantine served as ": null
    },
    {
        "Counsel": "counsel"
    },
    {
        " for ": null
    },
    {
        "Sir Charles Mordaunt": "sir charles mordaunt, 10th baronet"
    },
    {
        " in the then notorious divorce case against his wife. ": null
    },
    {
        "Lady Mordaunt": "lady mordaunt"
    },
    {
        ", who, much younger than her husband, informed him that he was not the father of her child. She admitted to him that she had committed ": null
    },
    {
        "adultery": "adultery"
    },
    {
        " with a number of men, including ": null
    },
    {
        "the Prince of Wales": "edward vii of the united kingdom"
    },
    {
        ", often, and in open day.     It became clear that because of these revelations that the Prince of Wales would have to be summoned to court to give evidence in the case. Although he could be ": null
    },
    {
        "subpoena": "subpoena"
    },
    {
        "ed, he could not be forced to give evidence; ": null
    },
    {
        "Queen Victoria": "victoria of the united kingdom"
    },
    {
        ", his mother, advised him not to attend the court. However, the Prince agreed to attend the court, and to be questioned. After delicate questioning by Lady Mordaunts counsel, the Prince denied that any improper familiarity or criminal act had taken place between himself and Lady Mordaunt. It was generally believed that by stating this the Prince had ": null
    },
    {
        "perjured": "perjury"
    },
    {
        " himself.     Ballantine, as counsel for Lord Mordaunt, the ": null
    },
    {
        "plaintiff": "plaintiff"
    },
    {
        ", was entitled to cross-examine the Prince of Wales. Instead, in an attempt to save the Prince from any embarrassment, he declared that he had no questions for His Royal Highness, thus saving the Princes honour. However, Ballantine lost the case because he had failed to convince the jury that Lady Mordaunt was guilty.       In the early 42s, Ballantine retired from the law in order to write and travel, publishing several volumes of reminiscences. His interest in the theatre and journalism made him a familiar sight around London. Although he was recognised as an incisive cross-examiner, Ballantine was not regarded by his peers as being a model legal mind. The Law Times, in his obituary, stated that Ballantine left behind him scarcely any lesson, even in his own poor biography, which the rising generation could profitably learn.     He died at ": null
    },
    {
        "Margate": "margate"
    },
    {
        " on 42 January 42 aged 42 years.   Ballantine’s private life was considered ": null
    },
    {
        "Bohemian": "bohemianism"
    },
    {
        "; and though he earned large sums, he died poor.       On 42 December 42 he married Eliza, daughter of Henry Gyles of London, but left no issue.       Among Ballantines other notable cases were:   his successful prosecution of ": null
    },
    {
        "Franz Muller": "franz muller"
    },
    {
        " for the murder of Mr. Briggs in 42   his skilful defence of the ": null
    },
    {
        "Tichborne claimant": "tichborne case"
    },
    {
        " in 42 and   his defence of the ": null
    },
    {
        "Gaekwad": "gaekwad"
    },
    {
        " Maharaja of ": null
    },
    {
        "Baroda": "vadodara"
    },
    {
        " in 42 his fee in this last case being one of the largest ever known at the time.        ": null
    }
]