[
    {
        "Wilmot N. Hess was an American physicist who was involved with many ambitious scientific projects of the 42th century, including: the Plowshares project, the ": null
    },
    {
        "NASA": "nasa"
    },
    {
        " Apollo moon missions, the ": null
    },
    {
        "National Oceanic and Atmospheric Administration": "national oceanic and atmospheric administration"
    },
    {
        " hurricane research and oil spill cleanup research, the ": null
    },
    {
        "National Center for Atmospheric Research": "national center for atmospheric research"
    },
    {
        " weather modification research, and the US Department of Energy Superconducting Super Collider project. Dr. Hess retired as the Associate Director of the ": null
    },
    {
        "US Department of Energy": "united states department of energy"
    },
    {
        ", of which he was first elected in 42 Hess lived in ": null
    },
    {
        "California": "california"
    },
    {
        ", and died on April 42 42 at the age of 42 of leukemia.       Hess was born on October 42 42 in Oberlin, Ohio to Walter and Rachel Hess. The family moved to Clinton, NY where he grew up during the Great Depression. He attended a one-room schoolhouse for the first six grades, with only three in his class but plenty of opportunity to skip ahead due to the commingled age groups. Hess received his B.S. in Electrical Engineering from Columbia University in 42 at the age of 42 In his privately published Wilmots World biography, he says I took the test to get into the Navy ": null
    },
    {
        "V42 program": "v-12 navy college training program"
    },
    {
        ".... We had military drills and wore Navy uniforms, but it was mostly just going to college. The first entry in our Navy log every day started out USS Hartley Hall securely moored at Broadway and 42th Street..... The Commodore in charge of all Naval Officer Procurement had his office in our building. We apprentice seamen stood watch near his door. At 42 pm we had to go in and say : Sir, the time is reported as 42 The galley fires are out and the prisoners are ashore. If you smiled during the presentation, you might be thrown in the brig . He was 42th in his family line to go to ": null
    },
    {
        "Oberlin College": "oberlin college"
    },
    {
        ", where he received his M.A. in Physics in 42 Hess then attended the ": null
    },
    {
        "University of California at Berkeley": "university of california at berkeley"
    },
    {
        " where he received his Ph.D. in Physics in 42     Bill married Winifred Esther Lowdermilk in June 42 during his first year of graduate school at UC Berkeley. They had three children, Walter , Alison and Carl.       42 - Lawrence Livermore Labs, working on nuclear weapons. Frequent travel to Nevada Test site.   42 - Radiation Lab in Berkeley, to work at the bevatron and on the health physics team.   42 - Project director of Plowshare at Livermore. Technical advisor at the Nuclear Test Ban Conference in Geneva.   42 - Director of Theoretical Division at NASA. Measured cosmic ray neutrons in space and was the first to make a quantitative energy spectrum on them. From Wilmots World : I always felt a little bit like a fraud as Director of the Theoretical Division, not really being a theorist.   Goddard Space Flight Center. From Wilmots World : My years at Goddard were very happy and productive. The space program was just a few years old. I organized a series of Friday afternoon seminars on space research. Almost every week we heard about something brand new about space. The director of Goddard was an aeronautical engineer, Harry Goett. He was a fine man with a research background and gave us a lot of freedom.... My own research was on the ": null
    },
    {
        "Van Allen radiation belt": "van allen radiation belt"
    },
    {
        ". a theory to explain how solar protons can diffuse inward and gain energy in the Earths magnetic field. This quantitatively explained the observed Leo Davis protons.   42 - Director of Science and Applications for Apollo Moon Program, in Houston.   42 - Director of the Research Labs of the National Oceanic and Atmospheric Association in Boulder, CO.   4242 - Director of National Center for Atmospheric Research in Boulder, CO.   42 - Director of the High Energy and Nuclear Physics Program at the Department of Energy , Washington, D.C.   42 - Retired. From Wilmots World : I have much enjoyed wandering through Space Science and meteorology and oceanography and changing fields every decade. I think it was a lot more fun than staying in one place and doing one thing all my life....        Introduction to Space Science      The nature of the lunar surface; proceedings of the 42 IAU-NASA Symposium.     The Radiation Belt and Magnetosphere     Weather and Climate Modification     The Amoco Cadiz oil spill : a preliminary scientific report        42 -- ": null
    },
    {
        "Arthur S. Flemming Award": "arthur s. flemming award"
    },
    {
        " NASA Group Achievement Award": "nasa group achievement award"
    }
]