[
    {
        "Frederick Wilmoth Hendricks , best known as Wilmoth Houdini,   was a prominent ": null
    },
    {
        "calypsonian": "calypsonian"
    },
    {
        ".       In 42 he started his career in earnest when he began working with the African Millionaires, a large carnival group consisting of about 42 members. He arrived in ": null
    },
    {
        "New York City": "new york city"
    },
    {
        " sometime around 42 after working on cargo ships and travelling extensively. Not long after his arrival there, he began cutting records with local bands for ": null
    },
    {
        "Decca Records": "decca records"
    },
    {
        ", notably Gerald Clarks Night Owls. He released well over a hundred different ": null
    },
    {
        "42s": "gramophone record"
    },
    {
        " between 42 and 42 also under the names of Fredrick Wilmoth Hendricks  , Edgar Leon Sinclair , and King Houdini. His 42 composition He Had It Coming was a hit for ": null
    },
    {
        "Louis Jordan": "louis jordan"
    },
    {
        " and ": null
    },
    {
        "Ella Fitzgerald": "ella fitzgerald"
    },
    {
        " under the new title ": null
    },
    {
        "Stone Cold Dead in the Market": "stone cold dead in the market"
    },
    {
        " . The song stayed on the top of the R & B charts for five weeks, and reached no. 42 on the pop charts. Gaining a good deal of recognition, Houdini wasted no time in organizing high-profile calypso festivals and concerts around New York, quickly becoming a respected member of the Caribbean communities there.     After moving to New York , he was often the object of derision by the calypsonians still in Trinidad, who claimed that he was stealing their ideas and capitalizing on them in the USA. This can be seen in numerous calypsos of the early to mid42s, from ": null
    },
    {
        "Roaring Lion": "roaring lion"
    },
    {
        " and ": null
    },
    {
        "Attila the Hun": "attila the hun"
    },
    {
        " in particular, who also recorded in New York at the time. This led to Houdinis 42 rebuttal, Declaration of War . Towards the beginning of the 42s he played regularly at the Caribbean Club on Seventh Avenue, New York, with his only real rival, ": null
    },
    {
        "The Duke of Iron": "the duke of iron"
    },
    {
        ", also a native of Trinidad.     Houdini died on August 42 42 in New York City, where he had lived for most his life. He is buried in ": null
    },
    {
        "Woodlawn Cemetery": "woodlawn cemetery"
    },
    {
        " in The Bronx, NYC.       His song Uncle Joe , although melodically not original, had a huge influence upon the American psyche, influencing ": null
    },
    {
        "Dizzy Gillespie": "dizzy gillespie"
    },
    {
        ", Ella Fitzgerald, ": null
    },
    {
        "Lord Mouse and the Kalypso Katz": "lord mouse and the kalypso katz"
    },
    {
        ", ": null
    },
    {
        "Hazmat Modine": "hazmat modine"
    },
    {
        ", ": null
    },
    {
        "Bob Brozman": "bob brozman"
    },
    {
        ", and ": null
    },
    {
        "C. W. Stoneking": "c. w. stoneking"
    },
    {
        ", to name but a few. He has inspired a newer generation of artists around the world, for example with his recording Black But Sweet covered by ": null
    },
    {
        "Mighty Dub Katz": "mighty dub katz"
    },
    {
        " , ": null
    },
    {
        "Sabres of Paradise": "sabres of paradise"
    },
    {
        " , ": null
    },
    {
        "Shantel": "shantel"
    },
    {
        " and ": null
    },
    {
        "Eleftheria Arvanitaki": "eleftheria arvanitaki"
    },
    {
        " . ": null
    },
    {
        "The Avalanches": "the avalanches"
    },
    {
        " sampled Houdinis Bobby Sox Idol heavily in the 42 single ": null
    },
    {
        "Frankie Sinatra": "frankie sinatra"
    },
    {
        " .       Cowley, John . Wilmoth Houdini: Poor but Ambitious , in Calypso Classics from Trinidad CD liner notes, pp.  42 & ndash;42 El Cerrito, California: Arhoolie Productions.                                         ": null
    }
]