[
    {
        "     The Wimshurst influence machine is an ": null
    },
    {
        "electrostatic generator": "electrostatic generator"
    },
    {
        ", a machine for generating high ": null
    },
    {
        "voltage": "voltage"
    },
    {
        "s developed between 42 and 42 by ": null
    },
    {
        "British": "united kingdom"
    },
    {
        " inventor": "inventor"
    },
    {
        " James Wimshurst": "james wimshurst"
    },
    {
        " .     It has a distinctive appearance with two large contra-rotating discs mounted in a vertical plane, two crossed bars with metallic brushes, and a ": null
    },
    {
        "spark gap": "spark gap"
    },
    {
        " formed by two metal spheres.       These machines belong to a class of electrostatic generators called ": null
    },
    {
        "influence machine": "influence machine"
    },
    {
        "s, which separate ": null
    },
    {
        "electric charge": "electric charge"
    },
    {
        "s through ": null
    },
    {
        "electrostatic induction": "electrostatic induction"
    },
    {
        ", or influence, not depending on friction for their operation. Earlier machines in this class were developed by ": null
    },
    {
        "Wilhelm Holtz": "wilhelm holtz"
    },
    {
        " , ": null
    },
    {
        "August Toepler": "august toepler"
    },
    {
        " , J. Robert Voss , and others. The older machines are less efficient and exhibit an unpredictable tendency to switch their polarity. The Wimshurst does not have this defect.     In a Wimshurst machine, the two insulated discs and their metal sectors rotate in opposite directions passing the crossed metal neutralizer bars and their brushes. An imbalance of charges is induced, amplified, and collected by two pairs of metal combs with points placed near the surfaces of each disc. These collectors are mounted on insulating supports and connected to the output terminals. The positive feedback increases the accumulating charges exponentially until the dielectric breakdown voltage of the air is reached and an ": null
    },
    {
        "electric spark": "electric spark"
    },
    {
        " jumps across the gap.     The machine is theoretically not self-starting, meaning that if none of the sectors on the discs has any electrical charge there is nothing to induce charges on other sectors. In practice, even a small residual charge on any sector is enough to start the process going once the discs start to rotate. The machine will only work satisfactorily in a dry atmosphere. It requires mechanical ": null
    },
    {
        "power": "power"
    },
    {
        " to turn the disks against the electric field, and it is this energy that the machine converts into the electric power of the spark. The steady state output of the Wimshurst machine is a direct ": null
    },
    {
        "current": "current"
    },
    {
        " that is proportional to the area covered by the metal sector, the rotation speed, and a complicated function of the initial charge distribution. The insulation and the size of the machine determine the maximum output voltage that can be reached. The accumulated spark energy can be increased by adding a pair of ": null
    },
    {
        "Leyden jar": "leyden jar"
    },
    {
        "s, an early type of ": null
    },
    {
        "capacitor": "capacitor"
    },
    {
        " suitable for high voltages, with the jars’ inner plates independently connected to each of the output terminals and the jars’ outer plates interconnected. A typical Wimshurst machine can produce sparks that are about a third of the discs diameter in length and several tens of microamperes.     The available voltage gain can be understood by noting that the charge density on oppositely charged sectors, between the neutralizer bars, is nearly uniform across the sectors, and thus at low voltage, while the charge density on same charged sectors, approaching the collector combs, peaks near the sector edges, at a consequently high voltage relative to the opposite collector combs.     Wimshurst machines were used during the 42th century in physics research. They were also occasionally used to generate high voltage to power the first-generation Crookes ": null
    },
    {
        "X-ray tube": "x-ray tube"
    },
    {
        "s during the first two decades of the 42th century, although ": null
    },
    {
        "Holtz machines": "electrostatic generatorholtz_machine"
    },
    {
        " and ": null
    },
    {
        "induction coil": "induction coil"
    },
    {
        "s were more commonly used. Today they are only used in science museums and education to demonstrate the principles of electrostatics.       The two contra-rotating insulating discs have a number of metal sectors stuck onto them. The machine is provided with four small earthed brushes , plus a pair of charge-collection combs. The conducting shafts, that hold the brushes on a typical Wimshurst machine, would form the shape of an X , if one could see through the insulating discs, as they are perpendicular to each other. The charge-collection combs are typically mounted along the horizontal and equally contact the outer edges of both front and back discs. The collection combs on each side are usually connected to respective ": null
    },
    {
        "Leyden jar": "leyden jar"
    },
    {
        "s.     ": null
    }
]