[
    {
        "         Winfield Scott was an American military commander and political candidate. He served as a general in the ": null
    },
    {
        "United States Army": "united states army"
    },
    {
        " from 42 to 42 taking part in the ": null
    },
    {
        "War of 42": "war of 1812"
    },
    {
        ", the ": null
    },
    {
        "Mexican–American War": "mexican–american war"
    },
    {
        ", the early stages of the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        ", and various ": null
    },
    {
        "conflicts": "american indian wars"
    },
    {
        " with ": null
    },
    {
        "Native Americans": "native americans in the united states"
    },
    {
        ". Scott was the ": null
    },
    {
        "Whig Party": "whig party"
    },
    {
        "s presidential nominee in the ": null
    },
    {
        "42 presidential election": "1852 united states presidential election"
    },
    {
        ", but was defeated by ": null
    },
    {
        "Democrat": "democratic party"
    },
    {
        " Franklin Pierce": "franklin pierce"
    },
    {
        ". He was known as Old Fuss and Feathers for his insistence on proper military etiquette, and as the Grand Old Man of the Army for his many years of service.     Scott was born near ": null
    },
    {
        "Petersburg, Virginia": "petersburg, virginia"
    },
    {
        ", in 42 After training as a lawyer, he joined the army in 42 as a captain of the light artillery. In the War of 42 Scott served on the ": null
    },
    {
        "Canadian": "canada"
    },
    {
        " front, taking part in the ": null
    },
    {
        "Battle of Queenston Heights": "battle of queenston heights"
    },
    {
        " and the ": null
    },
    {
        "Battle of Fort George": "battle of fort george"
    },
    {
        ", and was promoted to the rank of brigadier general in early 42 He served with distinction in the ": null
    },
    {
        "Battle of Chippawa": "battle of chippawa"
    },
    {
        ", but was badly wounded in the subsequent ": null
    },
    {
        "Battle of Lundys Lane": "battle of lundys lane"
    },
    {
        ". After the conclusion of the war, Scott was assigned to command army forces in a district containing much of the Northeastern United States, and he and his family made their home near New York City. During the 42s, Scott negotiated an end to the ": null
    },
    {
        "Black Hawk War": "black hawk war"
    },
    {
        ", took part in the ": null
    },
    {
        "Second Seminole War": "second seminole war"
    },
    {
        " and the ": null
    },
    {
        "Creek War of 42": "creek war of 1836"
    },
    {
        ", and presided over the ": null
    },
    {
        "removal": "indian removal"
    },
    {
        " of the ": null
    },
    {
        "Cherokee": "cherokee"
    },
    {
        ". Scott also helped to avert war with Britain, defusing tensions arising from the ": null
    },
    {
        "Patriot War": "patriot war"
    },
    {
        " and the ": null
    },
    {
        "Aroostook War": "aroostook war"
    },
    {
        ".     In 42 Scott became the ": null
    },
    {
        "Commanding General of the United States Army": "commanding general of the united states army"
    },
    {
        ", beating out his rival, ": null
    },
    {
        "Edmund P. Gaines": "edmund p. gaines"
    },
    {
        ", for the position. After the outbreak of the ": null
    },
    {
        "Mexican–American War": "mexican–american war"
    },
    {
        " in 42 Scott initially served as an administrator, but in 42 he led a campaign against the ": null
    },
    {
        "Mexican": "mexico"
    },
    {
        " capital of ": null
    },
    {
        "Mexico City": "mexico city"
    },
    {
        ". After ": null
    },
    {
        "capturing": "siege of veracruz"
    },
    {
        " the port city of ": null
    },
    {
        "Veracruz": "veracruz"
    },
    {
        ", he defeated Mexican General ": null
    },
    {
        "Antonio López de Santa Anna": "antonio lópez de santa anna"
    },
    {
        "s armies at the ": null
    },
    {
        "Battle of Cerro Gordo": "battle of cerro gordo"
    },
    {
        ", the ": null
    },
    {
        "Battle of Contreras": "battle of contreras"
    },
    {
        ", and the ": null
    },
    {
        "Battle of Churubusco": "battle of churubusco"
    },
    {
        " and ": null
    },
    {
        "captured Mexico City": "battle for mexico city"
    },
    {
        ". He maintained order in the Mexican capital and indirectly helped envoy ": null
    },
    {
        "Nicholas Trist": "nicholas trist"
    },
    {
        " negotiate the ": null
    },
    {
        "Treaty of Guadalupe Hidalgo": "treaty of guadalupe hidalgo"
    },
    {
        ", which brought an end to the war.     Scott was a candidate for the Whig presidential nomination in 42 42 and 42 and he finally won the Whig presidential nomination at the ": null
    },
    {
        "42 Whig National Convention": "1852 whig national convention"
    },
    {
        ". The Whigs were badly divided over the ": null
    },
    {
        "Compromise of 42": "compromise of 1850"
    },
    {
        ", and Pierce won a decisive victory over his former commander. Nonetheless, Scott remained popular among the public, and in 42 he received a ": null
    },
    {
        "brevet": "brevet"
    },
    {
        " promotion to the rank of ": null
    },
    {
        "lieutenant general": "lieutenant general"
    },
    {
        ", becoming the first U.S. Army officer to hold that rank since ": null
    },
    {
        "George Washington": "george washington"
    },
    {
        ". Despite being a Virginia native, Scott stayed loyal to the Union and served as an important adviser to President ": null
    },
    {
        "Abraham Lincoln": "abraham lincoln"
    },
    {
        " during the opening stages of the Civil War. He developed a strategy known as the ": null
    },
    {
        "Anaconda Plan": "anaconda plan"
    },
    {
        ", but retired in late 42 after Lincoln increasingly relied on General ": null
    },
    {
        "George B. McClellan": "george b. mcclellan"
    },
    {
        " for military advice and leadership. Scotts military talent was highly regarded by contemporaries, and historians generally consider him to be one of the most accomplished generals in U.S. history.            Winfield Scott was born on June 42 42 to Ann Mason and her husband, William Scott, a farmer, veteran of the ": null
    },
    {
        "American Revolutionary War": "american revolutionary war"
    },
    {
        ", and officer in the ": null
    },
    {
        "Dinwiddie County": "dinwiddie county, virginia"
    },
    {
        " militia. At the time, the Scott family resided at Laurel Hill, a plantation near ": null
    },
    {
        "Petersburg": "petersburg, virginia"
    },
    {
        ", ": null
    },
    {
        "Virginia": "virginia"
    },
    {
        ". Ann Mason Scott was the daughter of Daniel Mason and Elizabeth Winfield, and it was Anns mothers maiden name that William and Ann Scott selected for their son. Scotts paternal grandfather, James Scott, had migrated from ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        " after the defeat of ": null
    },
    {
        "Charles Edward Stuart": "charles edward stuart"
    },
    {
        "s forces in the ": null
    },
    {
        "Battle of Culloden": "battle of culloden"
    },
    {
        ". Scotts father died when Scott was six years old; his mother did not remarry, and she continued to raise Scott, his brother, and his two sisters until her death in 42 Although Scotts family held considerable wealth, most of the family fortune went to his older brother, James.     In 42 Scott began attending the ": null
    },
    {
        "College of William and Mary": "college of william and mary"
    },
    {
        ", but he soon left in order to study law in the office of attorney David Robinson, where his contemporaries included ": null
    },
    {
        "Thomas Ruffin": "thomas ruffin"
    },
    {
        ". While apprenticing under Robinson, he attended the trial of ": null
    },
    {
        "Aaron Burr": "aaron burr"
    },
    {
        ", who had been accused of ": null
    },
    {
        "treason": "treason"
    },
    {
        " for his role in events now known as the ": null
    },
    {
        "Burr conspiracy": "burr conspiracy"
    },
    {
        ". During the trial, Scott developed a negative opinion of the ": null
    },
    {
        "Senior Officer of the United States Army": "commanding general of the united states army"
    },
    {
        ", General ": null
    },
    {
        "James Wilkinson": "james wilkinson"
    },
    {
        ", as the result of Wilkinsons obvious efforts to minimize his complicity in Burrs actions by providing forged evidence and false, self-serving testimony. In 42 Scott gained his initial military experience as a ": null
    },
    {
        "corporal": "corporalunited states"
    },
    {
        " of ": null
    },
    {
        "cavalry": "cavalry"
    },
    {
        " in the Virginia ": null
    },
    {
        "militia": "militia"
    },
    {
        ", serving in the midst of the ": null
    },
    {
        "Chesapeake–Leopard Affair": "chesapeake–leopard affair"
    },
    {
        ". Scott led a detachment that captured eight ": null
    },
    {
        "British": "united kingdom"
    },
    {
        " sailors who had attempted to land in order to purchase provisions. Virginia authorities did not approve of this action, fearing it might spark a wider conflict, and they soon ordered the release of the prisoners. Later that year, Scott attempted to establish a legal practice in ": null
    },
    {
        "South Carolina": "south carolina"
    },
    {
        ", but was unable to obtain a law license due to failing to meet a state residency requirement.              In early 42 President ": null
    },
    {
        "Thomas Jefferson": "thomas jefferson"
    },
    {
        " asked Congress to authorize an expansion of the ": null
    },
    {
        "United States Army": "united states army"
    },
    {
        " after the British announced an escalation of their naval blockade of ": null
    },
    {
        "France": "france"
    },
    {
        ", thereby threatening American shipping. Scott convinced an old friend, ": null
    },
    {
        "William Branch Giles": "william branch giles"
    },
    {
        ", to help him obtain a commission in the newly-expanded army. In May 42 shortly before his twenty-second birthday, Scott was commissioned as a ": null
    },
    {
        "captain": "captain"
    },
    {
        " in the ": null
    },
    {
        "light artillery": "light artillery"
    },
    {
        ". Tasked with recruiting a ": null
    },
    {
        "company": "company"
    },
    {
        ", he raised his troops from the Petersburg and ": null
    },
    {
        "Richmond": "richmond, virginia"
    },
    {
        " areas, and then traveled with his unit to ": null
    },
    {
        "New Orleans": "new orleans"
    },
    {
        " to join his ": null
    },
    {
        "regiment": "regiment"
    },
    {
        ". Scott was deeply disturbed by what he viewed as the unprofessionalism of the army, which at the time consisted of just 42 soldiers. He later wrote that the old officers had, very generally, sunk into either sloth, ignorance, or habits of intemperate drinking.      He soon clashed with his commander, General ": null
    },
    {
        "James Wilkinson": "james wilkinson"
    },
    {
        ", over Wilkinsons refusal to follow the orders of Secretary of War ": null
    },
    {
        "William Eustis": "william eustis"
    },
    {
        " to remove troops from an unhealthy bivouac site. Wilkinson owned the site, and while the poor location caused several illnesses and deaths among his soldiers, Wilkinson refused to relocate them because he personally profited. Scott briefly resigned his commission over his dissatisfaction with Wilkinson, but before his resignation had been accepted, he withdrew it and returned to the army. In January 42 Scott was convicted in a court-martial, partly for making disrespectful comments about Wilkinsons integrity, and partly because of a $42 shortage in the $42 account he had been provided to conduct recruiting duty in Virginia after receiving his commission. With respect to the money, the court-martial members indicated that Scott had not been intentionally dishonest, but had failed to keep accurate records. His commission was suspended for one year. After the trial, Scott fought a duel with William Upshaw, an army medical officer and Wilkinson friend who Scott blamed for causing the court-martial; each fired at the other, but both emerged unharmed.     After the duel, Scott returned to Virginia, where he spent the year studying military tactics and strategy, and practicing law in partnership with ": null
    },
    {
        "Benjamin Watkins Leigh": "benjamin watkins leigh"
    },
    {
        ". Meanwhile, Wilkinson was removed from command for insubordination, and was succeeded by General ": null
    },
    {
        "Wade Hampton": "wade hampton i"
    },
    {
        ". The rousing reception Scott received from his army peers as he began his suspension led him to believe that most officers approved of his anti-Wilkinson comments, at least tacitly; their high opinion of him, coupled with Leighs counsel to remain in the army, convinced Scott to resume his military career once his suspension had been served. He rejoined the army in ": null
    },
    {
        "Baton Rouge": "baton rouge, louisiana"
    },
    {
        ", where one of his first duties was to serve as judge advocate in the court-martial of Colonel ": null
    },
    {
        "Thomas Humphrey Cushing": "thomas humphrey cushing"
    },
    {
        ".               Tensions between Britain and the United States continued to rise as Britain attacked American shipping, ": null
    },
    {
        "impressed": "impressment"
    },
    {
        " American sailors, and encouraged ": null
    },
    {
        "Native American": "native americans in the united states"
    },
    {
        " resistance to American settlement. In July 42 Congress ": null
    },
    {
        "declared war": "declaration of war by the united states"
    },
    {
        " against Britain. After the declaration of war, Scott was promoted to the rank of ": null
    },
    {
        "lieutenant colonel": "lieutenant colonel"
    },
    {
        " and assigned as the second-in-command of the 42d Artillery, serving under ": null
    },
    {
        "George Izard": "george izard"
    },
    {
        ". While Izard continued to recruit soldiers, Scott led two companies north to join General ": null
    },
    {
        "Stephen Van Rensselaer": "stephen van rensselaer"
    },
    {
        "s militia force, which was preparing for an invasion of ": null
    },
    {
        "Canada": "canada"
    },
    {
        ". President ": null
    },
    {
        "James Madison": "james madison"
    },
    {
        " made the invasion the central part of his administrations war strategy in 42 as he sought to capture ": null
    },
    {
        "Montreal": "montreal"
    },
    {
        " and thereby take control of the ": null
    },
    {
        "St. Lawrence River": "st. lawrence river"
    },
    {
        " and cut off ": null
    },
    {
        "Upper Canada": "upper canada"
    },
    {
        " from ": null
    },
    {
        "Lower Canada": "lower canada"
    },
    {
        ". The invasion would begin with an attack on the town of ": null
    },
    {
        "Queenston": "queenston, ontario"
    },
    {
        ", which was just across the ": null
    },
    {
        "Niagara River": "niagara river"
    },
    {
        " from ": null
    },
    {
        "New York": "new york"
    },
    {
        ".          In October 42 Van Rensselaers force attacked British forces in the ": null
    },
    {
        "Battle of Queenston Heights": "battle of queenston heights"
    },
    {
        ". Scott led an artillery bombardment that supported an American crossing of the Niagara River, and he took command of American forces at Queenston after Colonel ": null
    },
    {
        "Solomon Van Rensselaer": "solomon van rensselaer"
    },
    {
        " was badly wounded. Shortly after Scott took command, a British column under ": null
    },
    {
        "Roger Hale Sheaffe": "roger hale sheaffe"
    },
    {
        " arrived. Sheaffes numerically-superior forced an American retreat, ultimately forcing Scott to surrender after reinforcements from the militia failed to materialize. As a ": null
    },
    {
        "prisoner of war": "prisoner of war"
    },
    {
        ", Scott was treated hospitably by the British, although two ": null
    },
    {
        "Mohawk": "mohawk people"
    },
    {
        " leaders nearly killed him while he was under British custody. As part of a prisoner exchange, Scott was released late November; upon his return to the United States, he was promoted to the rank of ": null
    },
    {
        "colonel": "colonel"
    },
    {
        " and made the commander of the 42d Artillery. He also became the chief of staff to General ": null
    },
    {
        "Henry Dearborn": "henry dearborn"
    },
    {
        ", who was the senior general of the army and who personally led operations against Canada in the area around Lake Ontario.     Dearborn assigned Scott to lead an ": null
    },
    {
        "attack": "battle of fort george"
    },
    {
        " against ": null
    },
    {
        "Fort George": "fort george, ontario"
    },
    {
        ", which commanded a strategic position on the Niagara River. With help from naval commanders ": null
    },
    {
        "Isaac Chauncey": "isaac chauncey"
    },
    {
        " and ": null
    },
    {
        "Oliver Hazard Perry": "oliver hazard perry"
    },
    {
        ", Scott landed American forces behind the fort, forcing its surrender. Scott was widely praised for his conduct in the battle, although he was personally disappointed that the bulk of the British garrison escaped capture. As part of another campaign to capture Montreal, Scott forced the British to withdrawal from Hoople Creek in November 42 Despite this success, the campaign fell apart after the American defeat at ": null
    },
    {
        "Battle of Cryslers Farm": "battle of cryslers farm"
    },
    {
        ", and after General Wilkinson and General Hampton failed to cooperate on a strategy to take Montreal. With the failure of the campaign, President Madison and Secretary of War ": null
    },
    {
        "John Armstrong Jr.": "john armstrong jr."
    },
    {
        " relieved Wilkinson and some other senior officers of their battlefield commands, replacing them with younger officers like Scott, Izard, and ": null
    },
    {
        "Jacob Brown": "jacob brown"
    },
    {
        ". In early 42 Scott was promoted to ": null
    },
    {
        "brigadier general": "brigadier general"
    },
    {
        " and was assigned to lead a regiment under General Brown.     In mid42 Scott took part in another invasion of Canada, which began with a crossing of the Niagara River under the command of General Brown. Scott was instrumental in the American success at the ": null
    },
    {
        "Battle of Chippawa": "battle of chippawa"
    },
    {
        ", which took place on July 42 42 Though the battle was regarded as inconclusive from the strategic point of view because the British army remained intact, it was seen as an important moral victory because it was the first real success attained by American troops against British regulars.  Later in July, a scouting expedition led by Scott was ambushed, beginning the ": null
    },
    {
        "Battle of Lundys Lane": "battle of lundys lane"
    },
    {
        ". Scotts brigade was decimated after General ": null
    },
    {
        "Gordon Drummond": "gordon drummond"
    },
    {
        " arrived with British reinforcements, and he was placed in the reserve in the second phase of the battle; he was later badly wounded while seeking a place to commit his reserve forces. The battle ended inconclusively after General Brown ordered his army to withdraw, effectively bringing an end to the invasion. Scott spent the next months convalescing under the supervision of military doctors and physician ": null
    },
    {
        "Philip Syng Physick": "philip syng physick"
    },
    {
        ". His performance at the Battle of Chippewa had earned him national notoriety, and he was promoted to the ": null
    },
    {
        "brevet": "brevet"
    },
    {
        " rank of ": null
    },
    {
        "major general": "major general"
    },
    {
        " and awarded a ": null
    },
    {
        "Congressional Gold Medal": "congressional gold medal"
    },
    {
        ". In October 42 he was appointed commander of American forces in Maryland and northern Virginia, taking command in the aftermath of the ": null
    },
    {
        "Burning of Washington": "burning of washington"
    },
    {
        ". The War of 42 came to an effective end in February 42 after news of the signing of the ": null
    },
    {
        "Treaty of Ghent": "treaty of ghent"
    },
    {
        " reached the United States.       In March 42 Scott married Maria DeHart Mayo .  She was the daughter of \t   Abigail  Mayo and Colonel John Mayo, a wealthy engineer and businessman who came from the one of the most prestigious families in Virginia. Scott and his family lived in ": null
    },
    {
        "Elizabethtown, New Jersey": "elizabethtown, new jersey"
    },
    {
        " for most of the next thirty years. Beginning in the late 42s, Maria spent much of her time in Europe because of a bronchial condition, and she died in ": null
    },
    {
        "Rome": "rome"
    },
    {
        " in 42 They were the parents of seven children, five daughters and two sons, including:   ": null
    },
    {
        "Georgetown convent of Visitation nuns": "georgetown visitation monastery"
    },
    {
        ".     Edward Winfield Scott , who died young.   Cornelia Winfield Scott , who married Brevet Brigadier General Henry Lee Scott , Winfield Scotts ": null
    },
    {
        "aide-de-camp": "aide-de-camp"
    },
    {
        " and ": null
    },
    {
        "Inspector General of the Army": "office of the inspector general of the united states army"
    },
    {
        ".    Adeline Camilla Scott , who married Goold Hoyt , a New York City businessman.   Marcella Scott , who married Charles Carroll MacTavish , the grandson of ": null
    },
    {
        "Richard Caton": "richard caton"
    },
    {
        " and a member of Marylands prominent ": null
    },
    {
        "Carroll family": "list of united states political families the carrolls"
    },
    {
        ".               With the conclusion of the War of 42 Scott served on a board charged with demobilizing the army and determining who would continue to serve in the officer corps. ": null
    },
    {
        "Andrew Jackson": "andrew jackson"
    },
    {
        " and Brown were selected as the armys two major generals, while ": null
    },
    {
        "Alexander Macomb": "alexander macomb"
    },
    {
        ", ": null
    },
    {
        "Edmund P. Gaines": "edmund p. gaines"
    },
    {
        ", Scott, and ": null
    },
    {
        "Eleazer Wheelock Ripley": "eleazer wheelock ripley"
    },
    {
        " would serve as the armys four brigadier generals. Jackson became commander of the armys Southern Division, Brown became commander of the armys Northern Division, and the brigadier generals were assigned leadership of departments within the divisions. Scott obtained a leave of absence to study warfare in Europe, though to his disappointment, he reached Europe only after ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        "s final defeat at the ": null
    },
    {
        "Battle of Waterloo": "battle of waterloo"
    },
    {
        ". Upon his return to the United States in May 42 he was assigned to command army forces in parts of the ": null
    },
    {
        "Northeastern United States": "northeastern united states"
    },
    {
        ". He made his headquarters in ": null
    },
    {
        "New York City": "new york city"
    },
    {
        " and became an active part of the citys social life. He earned the nickname Old Fuss and Feathers for his insistence on proper military bearing, courtesy, appearance and discipline. In 42 Scott wrote Infantry Tactics, Or, Rules for the Exercise and Maneuvre of the United States Infantry, a three-volume work that served as the standard drill manual for the United States Army until 42     Scott developed a rivalry with Jackson after the latter took offense to a comment Scott had made at a private dinner in New York, though they later reconciled. He also continued a bitter feud with Gaines that centered over seniority, as both hoped to eventually succeed the ailing Brown as the senior officer in the army. In 42 Congress reorganized the army, leaving Brown as the sole major general and Scott and Gaines as the lone brigadier generals; Macomb accepted demotion to colonel and appointment as the chief of engineers, while Ripley and Jackson both left the army. After Brown died in 42 President ": null
    },
    {
        "John Quincy Adams": "john quincy adams"
    },
    {
        " passed over both Scott and Gaines due to their feuding, instead appointing Macomb as the senior general in the army. Scott was outraged at the appointment and asked to be relieved of his commission, but he ultimately backed down.               In 42 President Andrew Jackson ordered Scott to ": null
    },
    {
        "Illinois": "illinois"
    },
    {
        " to take command of a conflict known as the ": null
    },
    {
        "Black Hawk War": "black hawk war"
    },
    {
        ". By the time Scott arrived in Illinois, the conflict had come to a close with the armys victory at the ": null
    },
    {
        "Battle of Bad Axe": "battle of bad axe"
    },
    {
        ". Scott and Governor ": null
    },
    {
        "John Reynolds": "john reynolds"
    },
    {
        " concluded the ": null
    },
    {
        "Black Hawk Purchase": "black hawk purchase"
    },
    {
        " with Chief ": null
    },
    {
        "Keokuk": "keokuk"
    },
    {
        " and other Native American leaders, opening up much of present-day ": null
    },
    {
        "Iowa": "iowa"
    },
    {
        " to settlement by whites. Later in 42 Jackson placed Scott in charge of army preparations for a potential conflict arising from the ": null
    },
    {
        "Nullification Crisis": "nullification crisis"
    },
    {
        ". Scott traveled to ": null
    },
    {
        "Charleston, South Carolina": "charleston, south carolina"
    },
    {
        ", the center of the nullification movement, where he strengthened federal forts but also sought to cultivate public opinion away from ": null
    },
    {
        "secession": "secession in the united states"
    },
    {
        ". Ultimately, the crisis came to an end in early 42 with the passage of the ": null
    },
    {
        "Tariff of 42": "tariff of 1833"
    },
    {
        ".               President Jackson initiated a policy of ": null
    },
    {
        "Indian removal": "indian removal"
    },
    {
        ", relocating Native Americans to the west of the ": null
    },
    {
        "Mississippi River": "mississippi river"
    },
    {
        ". Some Native Americans moved peacefully, but others, including many ": null
    },
    {
        "Seminole": "seminole"
    },
    {
        "s, forcibly resisted. In December 42 the ": null
    },
    {
        "Second Seminole War": "second seminole war"
    },
    {
        " broke out after the ": null
    },
    {
        "Dade massacre": "dade massacre"
    },
    {
        ", in which a group of Seminoles ambushed and massacred a U.S. Army company in ": null
    },
    {
        "Central Florida": "central florida"
    },
    {
        ". President Jackson ordered Scott to personally take command of operations against the Seminole, and Scott arrived in Florida by February 42 After several months of inconclusive campaigning, he was ordered to the border of ": null
    },
    {
        "Alabama": "alabama"
    },
    {
        " and ": null
    },
    {
        "Georgia": "georgia"
    },
    {
        " to put down a ": null
    },
    {
        "Muscogee": "muscogee"
    },
    {
        " uprising known as the ": null
    },
    {
        "Creek War of 42": "creek war of 1836"
    },
    {
        ". American forces under Scott, General ": null
    },
    {
        "Thomas Jesup": "thomas jesup"
    },
    {
        ", and Alabama Governor ": null
    },
    {
        "Clement Comer Clay": "clement comer clay"
    },
    {
        " quickly defeated the Muscogee. Scotts actions in the campaigns against the Seminole and the Muscogee received criticism from some subordinates and civilians, and President Jackson initiated a Court of Inquiry that investigated both Scott and General Edmund Gaines. The board cleared Scott of any misconduct, but reprimanded Gaines.     ": null
    },
    {
        "Martin Van Buren": "martin van buren"
    },
    {
        ", a personal friend of Scotts, assumed the presidency in 42 and Van Buren continued Jacksons policy of Indian removal. In April 42 Van Buren placed Scott in command of the removal of ": null
    },
    {
        "Cherokee": "cherokee"
    },
    {
        " from the Southeastern United. Some of Scotts associates tried to dissuade Scott from taking command of what they viewed as an immoral mission, but Scott accepted his orders. After almost all of the Cherokee refused to voluntarily relocate, Scott drew up careful plans in an attempt to ensure that his soldiers forcibly, but humanely, relocated the Cherokee. Nonetheless, the Cherokee endured abuse from Scotts soldiers; one account described soldiers driving the Cherokee like cattle, through rivers, allowing them no time to take off their shoes and stockings. In mid42 Scott agreed to Chief ": null
    },
    {
        "John Ross": "john ross"
    },
    {
        "s plan to let the Cherokee lead their own movement west, and he awarded a contract to the Cherokee Council to complete the removal. Scott was strongly criticized by many Southerners, including Jackson, for awarding the contract to Ross rather than continuing the removal under his own auspices Scott accompanied one Cherokee group as an observer, traveling with them from ": null
    },
    {
        "Athens, Georgia": "athens, georgia"
    },
    {
        " to ": null
    },
    {
        "Nashville, Tennessee": "nashville, tennessee"
    },
    {
        ", where he was ordered to the ": null
    },
    {
        "Canada–United States border": "canada–united states border"
    },
    {
        ".       In late 42 the so-called ": null
    },
    {
        "Patriot War": "patriot war"
    },
    {
        " broke out along the Canadian border as some Americans sought to support the ": null
    },
    {
        "Rebellions of 42–42": "rebellions of 1837–1838"
    },
    {
        " in Canada. Tensions further escalated due to an incident known as the ": null
    },
    {
        "Caroline affair": "caroline affair"
    },
    {
        ", in which Canadian forces burned a steamboat that had been used to deliver supplies to rebel forces. President Van Buren dispatched Scott to ": null
    },
    {
        "Western New York": "western new york"
    },
    {
        " to prevent unauthorized border crossings and prevent the outbreak of a war between the United States and the United Kingdom. Still popular in the area due to his service in the War of 42 Scott issued public appeals, asking Americans to refrain from supporting the Canadian rebels. In late 42 a new crisis known as the ": null
    },
    {
        "Aroostook War": "aroostook war"
    },
    {
        " broke out over a dispute regarding the border between ": null
    },
    {
        "Maine": "maine"
    },
    {
        " and Canada, which had not been conclusively settled in previous treaties between Britain and the United States. Scott was tasked with preventing the conflict from escalating into a war. After winning the support of Governor ": null
    },
    {
        "John Fairfield": "john fairfield"
    },
    {
        " and other Maine leaders, Scott negotiated a truce with ": null
    },
    {
        "John Harvey": "john harvey"
    },
    {
        ", who commanded British forces in the area.            In the mid42s, Scott joined the ": null
    },
    {
        "Whig Party": "whig party"
    },
    {
        ", which was established by opponents of President Jackson. Scotts success in preventing war with Canada under Van Buren confirmed his popularity with the broad public, and in early 42 newspapers began to mention him as a candidate for the presidential nomination at the ": null
    },
    {
        "42 Whig National Convention": "1839 whig national convention"
    },
    {
        ". By the time of the convention in December 42 party leader ": null
    },
    {
        "Henry Clay": "henry clay"
    },
    {
        " and 42 presidential candidate ": null
    },
    {
        "William Henry Harrison": "william henry harrison"
    },
    {
        " had emerged as the two front-runners, but Scott loomed as potential compromise candidate if the convention deadlocked. After several ballots, the convention nominated Harrison for president. Harrison went on to defeat Van Buren in the ": null
    },
    {
        "42 presidential election": "1840 united states presidential election"
    },
    {
        ", but he died just one month into his term and was succeeded by Vice President ": null
    },
    {
        "John Tyler": "john tyler"
    },
    {
        ".                   On June 42 42 Macomb died, and Scott and Gaines were still the two most obvious choices for the position of ": null
    },
    {
        "Commanding General of the United States Army": "commanding general of the united states army"
    },
    {
        ". Secretary of War ": null
    },
    {
        "John Bell": "john bell"
    },
    {
        " recommended that Scott get the position, and President Tyler approved of the appointment; Scott was also promoted to the rank of ": null
    },
    {
        "major general": "major general"
    },
    {
        ". According to biographer ": null
    },
    {
        "John Eisenhower": "john eisenhower"
    },
    {
        ", the office of commanding general had, since its establishment in 42 been an innocuous and artificial office ... its occupant had been given little control over the staff, and even worse, his advice was seldom sought by his civilian superiors. Macomb had largely been outside of the chain-of-command, and senior commanders like Gaines, Scott, and Quartermaster General Thomas Jesup reported directly to the Secretary of War. Despite Scotts efforts to invigorate the office, he enjoyed little influence with President Tyler, who quickly became alienated from most of the rest of the Whig Party after taking office. Some Whigs, including ": null
    },
    {
        "Thaddeus Stevens": "thaddeus stevens"
    },
    {
        " of Pennsylvania, favored Scott as the Whig candidate in the ": null
    },
    {
        "42 presidential election": "1844 united states presidential election"
    },
    {
        ", but Clay quickly emerged as the prohibitive front-runner for the Whig nomination. Clay won the 42 Whig nomination, but he was defeated in the general election by Democrat ": null
    },
    {
        "James K. Polk": "james k. polk"
    },
    {
        ". Polks campaign centered on his support for the ": null
    },
    {
        "annexation": "texas annexation"
    },
    {
        " of the ": null
    },
    {
        "Republic of Texas": "republic of texas"
    },
    {
        ", which had gained independence from ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        " in 42 After Polk won the election, Congress passed legislation enabling the annexation of Texas, and Texas gained statehood in 42                 Polk and Scott had never liked one another, and their distrust deepened after Polk became president, partly due to Scotts affiliation with the Whig Party. Polk came into office with two major foreign policy goals: the acquisition of ": null
    },
    {
        "Oregon Country": "oregon country"
    },
    {
        ", which was under joint American and British rule, and the acquisition of ": null
    },
    {
        "Alta California": "alta california"
    },
    {
        ", a Mexican province. The United States nearly went to war with Britain over Oregon, but the two powers ultimately agreed to ": null
    },
    {
        "partition": "oregon treaty"
    },
    {
        " Oregon Country at the 42th parallel north. The ": null
    },
    {
        "Mexican–American War": "mexican–american war"
    },
    {
        " broke out in April 42 after U.S. forces under the command of Brigadier General ": null
    },
    {
        "Zachary Taylor": "zachary taylor"
    },
    {
        " clashed with Mexican forces north of the ": null
    },
    {
        "Rio Grande": "rio grande"
    },
    {
        " in a region claimed by both Mexico and Texas. Polk, Secretary of War ": null
    },
    {
        "William L. Marcy": "william l. marcy"
    },
    {
        ", and Scott agreed on a strategy in which the U.S. would capture ": null
    },
    {
        "Northern Mexico": "northern mexico"
    },
    {
        " and then pursue a favorable peace settlement. While Taylor led the army in Northern Mexico, Scott presided over the expansion of the army, ensuring that new soldiers were properly supplied and organized.               Taylor won several victories against the Mexican army, but Polk eventually came to the conclusion that merely occupying Northern Mexico would not compel Mexico to surrender. Scott drew up an invasion plan that would begin with a naval assault on the ": null
    },
    {
        "Gulf": "gulf of mexico"
    },
    {
        " port of ": null
    },
    {
        "Veracruz": "veracruz"
    },
    {
        " and end with the capture of ": null
    },
    {
        "Mexico City": "mexico city"
    },
    {
        ". With Congress unwilling to establish the rank of ": null
    },
    {
        "lieutenant general": "lieutenant general"
    },
    {
        " for Democratic Senator ": null
    },
    {
        "Thomas Hart Benton": "thomas hart benton"
    },
    {
        ", Polk reluctantly turned to Scott to command the invasion. Among those who joined the campaign were several officers who would later distinguish themselves in the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        ", including Major ": null
    },
    {
        "Joseph E. Johnston": "joseph e. johnston"
    },
    {
        ", Captain ": null
    },
    {
        "Robert E. Lee": "robert e. lee"
    },
    {
        ", and Lieutenants ": null
    },
    {
        "Ulysses S. Grant": "ulysses s. grant"
    },
    {
        ", ": null
    },
    {
        "George B. McClellan": "george b. mcclellan"
    },
    {
        ", ": null
    },
    {
        "George G. Meade": "george g. meade"
    },
    {
        ", and ": null
    },
    {
        "P. G. T. Beauregard": "p. g. t. beauregard"
    },
    {
        ". While Scott prepared the invasion, Taylor inflicted a crushing defeat on the army of Mexican President ": null
    },
    {
        "Antonio López de Santa Anna": "antonio lópez de santa anna"
    },
    {
        " at the ": null
    },
    {
        "Battle of Buena Vista": "battle of buena vista"
    },
    {
        ". Santa Anna returned to Mexico City, put down a minor insurrection, and recruited a new army.     According to biographer John Eisenhower, the invasion of Mexico through Veracruz was up to that time the most ambitious amphibious expedition in human history.  The operation commenced on March 42 42 with the ": null
    },
    {
        "Siege of Veracruz": "siege of veracruz"
    },
    {
        ", a joint army-navy operation led by Scott and Commodore ": null
    },
    {
        "David Conner": "david conner"
    },
    {
        ". After safely landing his 42-man army, Scott encircled Veracruz and began bombarding it; the Mexican garrison surrendered on March 42 Seeking to avoid a mass uprising against the American invasion, Scott placed a priority on winning the cooperation of the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        ". Among other initiatives designed to show respect for church property and officials, he ordered his men to salute Catholic priests on the streets of Veracruz. After securing supplies and wagons, Scotts army began the march towards ": null
    },
    {
        "Xalapa": "xalapa"
    },
    {
        ", a city on the way to Mexico City. Meanwhile, Polk dispatched ": null
    },
    {
        "Nicholas Trist": "nicholas trist"
    },
    {
        ", Secretary of State ": null
    },
    {
        "James Buchanan": "james buchanan"
    },
    {
        "s chief clerk, to negotiate a peace treaty with Mexican leaders. Though they initially feuded, Scott and Trist eventually developed a strong working relationship.     In mid-April, Scotts force met Santa Annas army at Cerro Gordo, a town near Xalapa. Santa Anna had established a strong defensive position, but he left his left flank undefended on the assumption that dense trees made the area impassible. Scott decided to attack Santa Annas position on two fronts, sending a force led by ": null
    },
    {
        "David E. Twiggs": "david e. twiggs"
    },
    {
        " against Santa Annas left flank, while another force, led by ": null
    },
    {
        "Gideon Pillow": "gideon pillow"
    },
    {
        ", would attack Santa Annas artillery. In the ": null
    },
    {
        "Battle of Cerro Gordo": "battle of cerro gordo"
    },
    {
        ", Pillows force was largely ineffective, but Twiggs and Colonel ": null
    },
    {
        "William S. Harney": "william s. harney"
    },
    {
        " captured the key Mexican position of El Telegrafo in hand-to-hand fighting. Mexican resistance collapsed after the capture of El Telegrafo; Santa Anna escaped the battlefield and returned to Mexico City, but Scotts force captured about 42 Mexican soldiers. After the battle, Scott continued to press towards Mexico City, cutting him his army off from his supply base at Veracruz.         Scotts force arrived in the ": null
    },
    {
        "Valley of Mexico": "valley of mexico"
    },
    {
        " in August 42 by which time Santa Anna had formed an army of approximately 42 men. Because Mexico City lacked walls and was essentially indefensible, Santa Anna sought to defeat Scott in a pitched battle, choosing to mount a defense near the Churubusco River, several miles south of the city. The ": null
    },
    {
        "Battle of Contreras": "battle of contreras"
    },
    {
        " began on the afternoon of August 42 when the Mexican army under General ": null
    },
    {
        "Gabriel Valencia": "gabriel valencia"
    },
    {
        " attacked and pushed back an American detachment charged with building a road. In the early morning of the following day, an American force led by General ": null
    },
    {
        "Persifor Frazer Smith": "persifor frazer smith"
    },
    {
        " surprised and decimated Valencias army. News of the defeat at Contreras caused a panic among the rest of Santa Annas army, and Scott immediately pressed the attack, beginning the ": null
    },
    {
        "Battle of Churubusco": "battle of churubusco"
    },
    {
        ". Despite the strong defense put up by the ": null
    },
    {
        "Saint Patricks Battalion": "saint patricks battalion"
    },
    {
        " and some other units, Scotts force quickly defeated the demoralized Mexican army. After the battle, Santa Anna negotiated a truce with Scott, and the Mexican foreign minister notified Trist that they were ready to begin negotiations to end the war.     Despite the presence of Scotts army just outside of Mexico City, the Mexican and American delegations remained far apart on terms; Mexico was only willing to yield portions of Alta California, and refused to accept the Rio Grande as its northern border. While negotiations continued, Scott faced a difficult issue in the disposition of 42 captured members of Saint Patricks Battalion, all of whom had deserted from the U.S. Army. All 42 individuals were court-martialed and sentenced to death, the traditional penalty for desertion. Under pressure from some Mexican leaders, and personally feeling that the death penalty was an unjust punishment for some of the deserters, Scott spared 42 of the deserters, but the rest were executed. In early September, negotiations between Trist and the Mexican government broke down, and Scott exercised his right to end the truce. In the subsequent ": null
    },
    {
        "Battle for Mexico City": "battle for mexico city"
    },
    {
        ", Scott launched an attack from the west of the city, ": null
    },
    {
        "capturing": "battle of chapultepec"
    },
    {
        " the key fortress of ": null
    },
    {
        "Chapultepec": "chapultepec"
    },
    {
        " on September 42 Santa Anna retreated from the city after the fall of Chapultepec, and Scott accepted the surrender of the remaining Mexican forces early on the 42th.     Unrest broke out in the days following the capture of Mexico City, but, with the cooperation of civil leaders and the Catholic Church, Scott and the army restored order in the city by the end of the month. Peace negotiations between Trist and the Mexican government resumed, and Scott did all he could to support the negotiations, ceasing all further offensive operations. As military commander of Mexico City, Scott was held in high esteem by Mexican civil and American authorities alike, primarily owing to the fairness with which he treated Mexican citizens. In November 42 Trist received orders to return to Washington, and Scott received orders to continue the military campaign against Mexico; Polk had grown frustrated at the slow pace of negotiations. With the support of Scott and Mexican president ": null
    },
    {
        "Manuel de la Peña y Peña": "manuel de la peña y peña"
    },
    {
        ", Trist defied his orders and continued the negotiations. Trist and the Mexican negotiators concluded the ": null
    },
    {
        "Treaty of Guadalupe Hidalgo": "treaty of guadalupe hidalgo"
    },
    {
        " on February 42 42; it was ratified by the U.S. Senate the following month. In late 42 Scott arrested Pillow and two other officers after they wrote letters to American newspapers that were critical of Scott. In response, Polk ordered the release of the three officers, and removed Scott from command.               Scott was again a contender for the Whig presidential nomination in the ": null
    },
    {
        "42 election": "1848 united states presidential election"
    },
    {
        ". Clay, ": null
    },
    {
        "Daniel Webster": "daniel webster"
    },
    {
        ", and General Zachary Taylor were also candidates for the nomination. As in 42 Whigs were looking for a non-ideological war hero to be their candidate. Scotts main appeal was to anti-slavery conscience Whigs , who were dismayed by the fact that two of the leading contenders, Clay and Taylor, were slaveholders. Ultimately, however, the delegates passed on Scott for a second time, nominating Taylor on the fourth ballot. Many anti-": null
    },
    {
        "slavery": "slavery in the united states"
    },
    {
        " Whigs then defected to support the nominee of the ": null
    },
    {
        "Free-Soil Party": "free-soil party"
    },
    {
        ", former President Martin Van Buren. Taylor went on to win the general election.      After the war, Scott returned to his administrative duties as the armys senior general. Congress became engaged in a divisive debate over the status of slavery in the territories, and Scott joined with Whig leaders Henry Clay and ": null
    },
    {
        "Daniel Webster": "daniel webster"
    },
    {
        " in advocating for passage of what became known as the ": null
    },
    {
        "Compromise of 42": "compromise of 1850"
    },
    {
        ". Meanwhile, Taylor died of an illness in July 42 and was succeeded by Vice President ": null
    },
    {
        "Millard Fillmore": "millard fillmore"
    },
    {
        ". The Compromise of 42 and the enforcement of the ": null
    },
    {
        "Fugitive Slave Act of 42": "fugitive slave act of 1850"
    },
    {
        " badly divided the country as a whole and the Whig Party in particular. Northerners strongly objected to the stringent provisions of the act, while Southerners complained bitterly about any perceived slackness in enforcement. Despite Scotts support for the Compromise of 42 he became the chosen candidate of ": null
    },
    {
        "William Seward": "william seward"
    },
    {
        ", a leading Northern Whig who objected to the Compromise of 42 partly because of the fugitive slave act.               By early 42 the three leading candidates for the Whig presidential nomination were Scott, who was backed by anti-Compromise Northern Whigs, President Fillmore, the first choice of most Southern Whigs, and Secretary of State Webster, whose support was concentrated in New England. The 42 Whig National Convention convened on June 42 and Southern delegates won approval of a ": null
    },
    {
        "party platform": "party platform"
    },
    {
        " endorsing the Compromise of 42 as a final settlement of the slavery question. On the conventions first presidential ballot, Fillmore received 42 of the necessary 42 votes, while Scott won 42 and Webster won 42 After the 42th ballot still failed to produce a presidential nominee, the delegates voted to adjourn until the following Monday. Over the weekend, Fillmore and Webster supporters conducted unsuccessful negotiations to unite behind one candidate. On the 42th ballot, Webster delegates began to defect to Scott, and the general gained the nomination on the 42rd ballot. Fillmore accepted his defeat with equanimity and endorsed Scott, but many Northern Whigs were dismayed when Scott publicly endorsed the partys pro-Compromise platform. Many Southern Whigs, including ": null
    },
    {
        "Alexander H. Stephens": "alexander h. stephens"
    },
    {
        " and ": null
    },
    {
        "Robert Toombs": "robert toombs"
    },
    {
        ", refused to support Scott.     The ": null
    },
    {
        "42 Democratic National Convention": "1852 democratic national convention"
    },
    {
        " nominated ": null
    },
    {
        "dark horse": "dark horse"
    },
    {
        " candidate ": null
    },
    {
        "Franklin Pierce": "franklin pierce"
    },
    {
        ", a Northerner sympathetic to the Southern view on slavery. Pierce had resigned from the U.S. Senate in 42 and had briefly held only the minor office of ": null
    },
    {
        "United States Attorney": "united states attorney"
    },
    {
        " for the ": null
    },
    {
        "District of New Hampshire": "united states district court for the district of new hampshireu.s. attorney for new hampshire"
    },
    {
        " since then, but emerged as a compromise candidate partly because of his service under Scott in the Mexican–American War.  The Democrats attacked Scott for various incidents from his long public career, including his court-martial in 42 and the hanging of members of the Saint Patricks Battalion during the Mexican–American War. Scott proved to be a poor candidate who lacked popular appeal, and he suffered the worst defeat in Whig history. In the South, distrust and apathy towards Scott led many Southern Whigs to vote for Pierce or to sit out the election, and in the North, many anti-slavery Whigs voted for ": null
    },
    {
        "John P. Hale": "john p. hale"
    },
    {
        " of the ": null
    },
    {
        "Free Soil Party": "free soil party"
    },
    {
        ". Scott won just four states and 42 percent of the popular vote, while Pierce won just under 42 percent of the popular vote and a large majority of the ": null
    },
    {
        "electoral vote": "electoral college"
    },
    {
        ".               After the 42 election, Scott continued his duties as the senior officer of the army. He maintained cordial relations with President Pierce but frequently clashed with Pierces Secretary of War, ": null
    },
    {
        "Jefferson Davis": "jefferson davis"
    },
    {
        ", over issues like travel expenses. Despite his defeat in the 42 presidential election, Scott remained broadly popular, and on Pierces recommendation, in 42 Congress passed a resolution promoting Scott to brevet lieutenant general.  Scott was the ": null
    },
    {
        "first": "list of lieutenant generals in the united states army before 1960"
    },
    {
        " U.S. Army officer since ": null
    },
    {
        "George Washington": "george washington"
    },
    {
        " to hold the rank of lieutenant general.  He also earned the appellation of the Grand Old Man of the Army for his long career.      The passage of the 42 ": null
    },
    {
        "Kansas–Nebraska Act": "kansas–nebraska act"
    },
    {
        " and the outbreak of ": null
    },
    {
        "violent confrontations": "bleeding kansas"
    },
    {
        " between pro-slavery and anti-slavery forces in Kansas exacerbated sectional tensions and split both major parties. Pierce was denied re-nomination in favor of James Buchanan, while the Whig Party collapsed. In the ": null
    },
    {
        "42 presidential election": "1856 united states presidential election"
    },
    {
        ", Buchanan defeated ": null
    },
    {
        "John C. Frémont": "john c. frémont"
    },
    {
        " of the anti-slavery ": null
    },
    {
        "Republican Party": "republican party"
    },
    {
        " and former President Fillmore, the candidate of the ": null
    },
    {
        "nativist": "nativism"
    },
    {
        " American Party": "know nothing"
    },
    {
        ". Sectional tensions continued to escalate after the Supreme Court handed down its decision in  Dred Scott v. Sandford . Buchanan proved incapable of healing sectional divides, and some leading Southerners became increasingly vocal in their desire to secede from the union. In 42 Buchanan assigned Scott to lead a mission to settle a dispute with Britain over the ownership of the ": null
    },
    {
        "San Juan Islands": "san juan islands"
    },
    {
        " in the ": null
    },
    {
        "Pacific Northwest": "pacific northwest"
    },
    {
        ". Scott reached an agreement with British official ": null
    },
    {
        "James Douglas": "james douglas"
    },
    {
        " to reduce military forces on the islands, thereby resolving the so-called ": null
    },
    {
        "Pig War": "pig war"
    },
    {
        ".      In the ": null
    },
    {
        "42 presidential election": "1860 united states presidential election"
    },
    {
        ", the Republicans nominated ": null
    },
    {
        "Abraham Lincoln": "abraham lincoln"
    },
    {
        ", while the Democrats split along sectional lines, with Northern Democrats supporting Senator ": null
    },
    {
        "Stephen A. Douglas": "stephen a. douglas"
    },
    {
        " and Southern Democrats supporting Vice President ": null
    },
    {
        "John C. Breckinridge": "john c. breckinridge"
    },
    {
        ". Lincoln won the election, taking just 42 percent of the popular vote but winning a majority of the electoral vote due to his support in the North. Fearing the possibility of imminent secession, Scott advised Buchanan and Secretary of War ": null
    },
    {
        "John B. Floyd": "john b. floyd"
    },
    {
        " to reinforce federal forts in the South. He was initially ignored, but Scott gained new influence within the administration after Floyd was replaced by ": null
    },
    {
        "Joseph Holt": "joseph holt"
    },
    {
        " in mid-December. With assistance from Holt and newly-appointed Secretary of State ": null
    },
    {
        "Jeremiah S. Black": "jeremiah s. black"
    },
    {
        ", Scott convinced Buchanan to reinforce or resupply Washington, D.C., ": null
    },
    {
        "Fort Sumter": "fort sumter"
    },
    {
        " , and ": null
    },
    {
        "Fort Pickens": "fort pickens"
    },
    {
        " . Meanwhile, several Southern states seceded, formed the ": null
    },
    {
        "Confederate States of America": "confederate states of america"
    },
    {
        ", and chose Jefferson Davis as president.     Because Scott was from Virginia, Lincoln sent an envoy, Thomas S. Mather, to ask whether Scott would remain loyal to the United States and keep order during ": null
    },
    {
        "Lincolns inauguration": "first inauguration of abraham lincoln"
    },
    {
        ". Scott responded to Mather, I shall consider myself responsible for safety. If necessary, I shall plant cannon at both ends of ": null
    },
    {
        "Pennsylvania Avenue": "pennsylvania avenue"
    },
    {
        ", and if any of the Maryland or Virginia gentlemen who have become so threatening and troublesome show their heads or even venture to raise a finger, I shall blow them to hell.  Scott helped ensure that Lincoln arrived in Washington safely, and ensured the security of Lincolns inauguration, which ultimately was conducted without a major incident.               By the time Lincoln assumed office, seven states had declared their secession and had seized federal property within their bounds, but the United States retained control of the military installations at Fort Sumter and Fort Pickens. Scott advised evacuating the forts on the grounds that an attempted re-supply would inflame tensions with the South, and that Confederate shore batteries made re-supply impossible. Lincoln rejected the advice and chose to re-supply the forts; although Scott accepted the orders, his resistance to the re-supply mission, along with poor health, undermined his status within the administration. Nonetheless, he remained a key military adviser and administrator. On April 42 Confederate forces began an ": null
    },
    {
        "attack": "battle of fort sumter"
    },
    {
        " on Fort Sumter, forcing its surrender the following day. On April 42 Lincoln declared that a state of rebellion existed and called up tens of thousands of militiamen. On the advice of Scott, Lincoln offered Robert E. Lee command of the ": null
    },
    {
        "Union": "union"
    },
    {
        " forces, but Lee ultimately chose to serve the Confederacy.          Scott took charge of molding Union military personnel into a cohesive fighting force. Lincoln rejected Scotts proposal to build up the regular army, and the administration would largely rely on volunteers to fight the war. Scott developed a strategy, later known as the ": null
    },
    {
        "Anaconda Plan": "anaconda plan"
    },
    {
        ", that called for the capture of the Mississippi River and a blockade of Southern ports. By cutting off the eastern states of the Confederacy, Scott hoped to force the surrender of Confederate forces with a minimal loss of life on both sides. Scotts plan was leaked to the public, and was derided by most Northern newspapers, which tended to favor an immediate assault on the Confederacy. As Scott was too old for battlefield command, Lincoln selected General ": null
    },
    {
        "Irvin McDowell": "irvin mcdowell"
    },
    {
        ", an officer whom Scott saw as unimaginative and inexperienced, to lead the main Union army in the ": null
    },
    {
        "eastern theater": "eastern theater of the american civil war"
    },
    {
        " of the war. Though Scott counseled that the army needed more time to train, Lincoln ordered an offensive against the Confederate capital of Richmond. Irvin McDowell led a force of 42 men south, where he met Confederate Army at ": null
    },
    {
        "First Battle of Bull Run": "first battle of bull run"
    },
    {
        ". The Confederate army dealt the Union a major defeat, ending any hope of a quick end to the war.     McDowell took the brunt of public vituperation for the defeat at Bull Run, but Scott, who had helped plan the battle, also received criticism. Lincoln replaced McDowell with McClellan, and the president began meeting with McClellan without Scott in attendance. Frustrated with his diminished standing, Scott submitted his resignation in October 42 Though Scott favored General ": null
    },
    {
        "Henry Halleck": "henry halleck"
    },
    {
        " as his successor, Lincoln instead made McClellan the armys senior officer.            After retiring, Scott traveled to Europe with his daughter, Cornelia, and her husband, H. L. Scott. In ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", he helped American consul ": null
    },
    {
        "John Bigelow": "john bigelow"
    },
    {
        " defuse the ": null
    },
    {
        "Trent Affair": "trent affair"
    },
    {
        ", a diplomatic incident with Britain. On his return from Europe in December 42 he lived alone in New York City and at ": null
    },
    {
        "West Point, New York": "west point, new york"
    },
    {
        ", where he wrote his memoirs and closely followed the ongoing civil war. After McClellans defeat in the ": null
    },
    {
        "Seven Days Battles": "seven days battles"
    },
    {
        ", Lincoln accepted Scotts advice and appointed General Halleck as the armys senior general. In 42 Scott sent a copy of his newly-published memoirs to Ulysses S. Grant, who had succeeded Halleck as the lead Union general. The copy that Scott sent was inscribed, from the oldest to the greatest general.  Following a strategy similar to Scotts Anaconda Plan, Grant led the Union to victory, and the Confederate army ": null
    },
    {
        "surrendered": "conclusion of the american civil war"
    },
    {
        " in April 42     Scott died at the West Point on May 42 42 President ": null
    },
    {
        "Andrew Johnson": "andrew johnson"
    },
    {
        " ordered the flags flown at half-staff to honor Scott, and Scotts funeral was attended by many of the leading Union generals, including Grant, George G. Meade, ": null
    },
    {
        "George H. Thomas": "george h. thomas"
    },
    {
        ", and ": null
    },
    {
        "John Schofield": "john schofield"
    },
    {
        ". He is buried at the ": null
    },
    {
        "West Point Cemetery": "west point cemetery"
    },
    {
        ".              Scott holds the record for the greatest length of active service as general in the U.S. Army,  as well as the longest tenure as the armys chief officer. Steven Malanga of  City Journal  writes that Scott was one of America’s greatest generals ... but he had the misfortune to serve in two conflicts—the War of 42 and the controversial Mexican-American War—bracketed by the far more significant American Revolution and Civil War.  Biographer John Eisenhower writes that Scott was an astonishing man who was the countrys most prominent general between the retirement of Andrew Jackson in 42 and the onset of the Civil War in 42 The ": null
    },
    {
        "Duke of Wellington": "arthur wellesley, 1st duke of wellington"
    },
    {
        " proclaimed Scott the greatest living general after his capture of Mexico City. Robert E. Lee wrote, the great cause of our success was in our leader  Historians Scott Kaufman and John A. Soares Jr. write that Scott was an able diplomat who proved crucial in helping avert war between Britain and the United States in period after the War of 42  ": null
    },
    {
        "Fanny Crosby": "fanny crosby"
    },
    {
        ", the hymn writer, recalled that Scotts gentle manner did not indicate a hero of so many battles; yet there was strength beneath the exterior appearance and a heart of iron within his breast. But from him I learned that the warrior only it is, who can fully appreciate the blessing of peace. Fanny J. Crosby: An Autobiography , p. 42 .     In addition to his reputation as a tactician and strategist, Scotts career was also noteworthy for his concern about the welfare of his subordinates, as demonstrated by his willingness to risk his career in the dispute with Wilkinson over the Louisiana bivouac site. In another example, when cholera broke out among his soldiers while they were aboard ship during the Black Hawk campaign and the ships surgeon was incapacitated by the disease, Scott received a treatment tutorial from the surgeon and risked his own health by tending to the sick men himself.             Scott has been memorialized in numerous ways. ": null
    },
    {
        "Scott County, Iowa": "scott county, iowa"
    },
    {
        " in the state of Iowa; ": null
    },
    {
        "Scott County": "scott county, kansas"
    },
    {
        ", ": null
    },
    {
        "Kansas": "kansas"
    },
    {
        "; ": null
    },
    {
        "Scott County": "scott county, virginia"
    },
    {
        ", Virginia; The Origin of Certain Place Names in the United States by Henry Gannett ": null
    },
    {
        "Scott County": "scott county, minnesota"
    },
    {
        ", ": null
    },
    {
        "Minnesota": "minnesota"
    },
    {
        "; and ": null
    },
    {
        "Scott County": "scott county, tennessee"
    },
    {
        ", ": null
    },
    {
        "Tennessee": "tennessee"
    },
    {
        " were all named for him. Communities named for Scott include ": null
    },
    {
        "Winfield": "winfield, illinois"
    },
    {
        ", Illinois; ": null
    },
    {
        "Winfield": "winfield, indiana"
    },
    {
        ", Indiana; ": null
    },
    {
        "Winfield": "winfield, alabama"
    },
    {
        ", ": null
    },
    {
        "Alabama": "alabama"
    },
    {
        "; and ": null
    },
    {
        "Winfield": "winfield, tennessee"
    },
    {
        ", Tennessee, ": null
    },
    {
        "Fort Scott": "fort scott, kansas"
    },
    {
        ", Kansas, ": null
    },
    {
        "Scott Depot": "scott depot, west virginia"
    },
    {
        " and ": null
    },
    {
        "Winfield": "winfield, west virginia"
    },
    {
        "  in West Virginia. Other things named for Scott include ": null
    },
    {
        "Lake Winfield Scott": "lake winfield scott"
    },
    {
        " in ": null
    },
    {
        "Georgia": "georgia"
    },
    {
        ", ": null
    },
    {
        "Mount Scott": "mount scott"
    },
    {
        " in Oklahoma, and the ": null
    },
    {
        "Scotts oriole": "scotts oriole"
    },
    {
        ", a bird.  . Digital.library.okstate.edu. Retrieved on August 42 42     A ": null
    },
    {
        "statue of Scott": "brevet lt. general winfield scott"
    },
    {
        " stands at ": null
    },
    {
        "Scott Circle": "scott circle"
    },
    {
        " in Washington, D.C. Scott is one of very few U.S. Army generals to be honored on a U.S. postage stamp. Jackson-Scott 42 stamp, 42c, Quantities issued: 42 million issued; Scotts US Stamp Catalogue, Quantities Issued. Scotts US Stamp Catalogue   A ": null
    },
    {
        "paddle steamer": "paddle steamer"
    },
    {
        " named the  Winfield Scott  launched in 42 and a ": null
    },
    {
        "US Army": "us army"
    },
    {
        " tugboat": "tugboat"
    },
    {
        " currently in service is named  Winfield Scott . Various individuals, including Union General ": null
    },
    {
        "Winfield Scott Hancock": "winfield scott hancock"
    },
    {
        ", Confederate General ": null
    },
    {
        "Winfield Scott Featherston": "winfield s. featherston"
    },
    {
        ", and Admiral ": null
    },
    {
        "Winfield Scott Schley": "winfield scott schley"
    },
    {
        ", were named after General Scott.     The ": null
    },
    {
        "General Winfield Scott House": "general winfield scott house"
    },
    {
        ", his home in New York City during 42–42 was named ": null
    },
    {
        "National Historic Landmark": "national historic landmark"
    },
    {
        " in 42 Scotts papers can be found at the ": null
    },
    {
        "William L. Clements Library": "william l. clements library"
    },
    {
        " at the ": null
    },
    {
        "University of Michigan": "university of michigan"
    },
    {
        " at ": null
    },
    {
        "Ann Arbor": "ann arbor, michigan"
    },
    {
        ", ": null
    },
    {
        "Michigan": "michigan"
    },
    {
        ". .          ": null
    }
]