[
    {
        "        Zenas Winsor McCay  was an American ": null
    },
    {
        "cartoonist": "cartoonist"
    },
    {
        " and ": null
    },
    {
        "animator": "animator"
    },
    {
        ". He is best known for the comic strip  Little Nemo  and the animated film  Gertie the Dinosaur  . For contractual reasons, he worked under the pen name Silas on the comic strip  Dream of the Rarebit Fiend .     From a young age, McCay was a quick, prolific, and technically dextrous artist. He started his professional career making posters and performing for ": null
    },
    {
        "dime museum": "dime museum"
    },
    {
        "s, and in 42 began illustrating newspapers and magazines. In 42 he joined the  New York Herald , where he created popular comic strips such as  Little Sammy Sneeze  and Dream of the Rarebit Fiend. In 42 his signature strip Little Nemo in Slumberland debuted—a fantasy strip in an ": null
    },
    {
        "Art Nouveau": "art nouveau"
    },
    {
        " style about a young boy and his adventurous dreams. The strip demonstrated McCays strong graphic sense and mastery of color and ": null
    },
    {
        "linear perspective": "perspective"
    },
    {
        ". McCay experimented with the formal elements of the comic strip page, arranging and sizing panels to increase impact and enhance the narrative. McCay also produced numerous detailed ": null
    },
    {
        "editorial cartoon": "editorial cartoon"
    },
    {
        "s and was a popular performer of ": null
    },
    {
        "chalk talk": "chalk talk"
    },
    {
        "s on the ": null
    },
    {
        "vaudeville": "vaudeville"
    },
    {
        " circuit.     McCay was an early animation pioneer; between 42 and 42 he self-financed and animated ten films, some of which survive only as fragments. The first three served in his vaudeville act; Gertie the Dinosaur was an interactive routine in which McCay appeared to give orders to a trained dinosaur. McCay and his assistants worked for twenty-two months on his most ambitious film,  The Sinking of the Lusitania  , a patriotic recreation of the ": null
    },
    {
        "German torpedoing in 42": "sinking of the rms lusitania"
    },
    {
        " of the  RMS Lusitania . Lusitania did not enjoy as much commercial success as the earlier films, and McCays later movies attracted little attention. His animation, vaudeville, and comic strip work was gradually curtailed as newspaper magnate ": null
    },
    {
        "William Randolph Hearst": "william randolph hearst"
    },
    {
        ", his employer since 42 expected McCay to devote his energies to editorial illustrations.     In his drawing, McCay made bold, prodigious use of linear perspective, particularly in detailed architecture and cityscapes. He textured his editorial cartoons with copious fine ": null
    },
    {
        "hatching": "hatching"
    },
    {
        ", and made color a central element in Little Nemo. His comic strip work has influenced generations of cartoonists and illustrators. The technical level of McCays animation—its naturalism, smoothness, and scale—was unmatched until the work of ": null
    },
    {
        "Fleischer Studios": "fleischer studios"
    },
    {
        " in the late 42s, followed by ": null
    },
    {
        "Walt Disney": "the walt disney company"
    },
    {
        "s feature films in the 42s. He pioneered ": null
    },
    {
        "inbetweening": "inbetweening"
    },
    {
        ", the use of ": null
    },
    {
        "registration marks": "printing registration"
    },
    {
        ", ": null
    },
    {
        "cycling": "traditional animationanimation loops"
    },
    {
        ", and other animation techniques that were to become standard.         McCays paternal grandparents, farmers Donald and Christiana , immigrated from Scotland to ": null
    },
    {
        "Upper Canada": "upper canada"
    },
    {
        " in the mid42s. McCays father, Robert  was born in ": null
    },
    {
        "Woodstock": "woodstock, ontario"
    },
    {
        ", Upper Canada, the third of six children. McCays maternal grandparents, Peter and Mary Murray, were also Scottish immigrants, and settled as farmers in ": null
    },
    {
        "East Zorra": "east zorra-tavistock"
    },
    {
        " in Upper Canada. Their daughter Janet was the third of nine children.          Robert was a member of King Solomons No.  42 ": null
    },
    {
        "Masonic Lodge": "masonic lodge"
    },
    {
        " in Woodstock. In 42 Robert first traveled to the U.S. Robert and the twenty-five-year-old Janet married on January  42 42 at Woodstocks Methodist Episcopal Church. The couple moved across the Canada–US border later in the year and settled in ": null
    },
    {
        "Spring Lake, Michigan": "spring lake, michigan"
    },
    {
        ", on the eastern coast of ": null
    },
    {
        "Lake Michigan": "lake michigan"
    },
    {
        ". Robert was employed by American entrepreneur Zenas  G. Winsor , with whom he had made contact in Canada.     Records of McCays birth are not extant. He stated in an interview in 42 that he was born in 42 and this is the year listed on his grave marker.  in life, he told friends he was born September  42 42 in Spring Lake, and they published this information in a magazine. Michigan census records from 42 and 42 list a Zenas  W. , who was born in Canada in 42 and others have speculated 42 or 42 based on evidence on how the censuses were carried out. No Canadian birth record has been found, and a fire in Spring Lake in May 42 could have destroyed any American birth record he may have had. His obituary in the  New York Herald Tribune  stated, not even Mr. McCay knew his exact age .     The McCays had two more children: Arthur in 42 and Mae in 42 Both were born in Michigan. Robert worked as a ": null
    },
    {
        "teamster": "teamster"
    },
    {
        " under Winsor, and by May 42 had saved enough money to buy a parcel of land. From 42 to 42 he worked as a retail grocer. In 42 he moved the family to ": null
    },
    {
        "Stanton, Michigan": "stanton, michigan"
    },
    {
        ", and expanded his land holdings; he was successful in real estate with his brother Hugh, who moved from  in 42     By 42 Robert was also a ": null
    },
    {
        "notary public": "notary public"
    },
    {
        ". He had settled in ": null
    },
    {
        "Edmore, Michigan": "edmore, michigan"
    },
    {
        ", and by this point had changed the spelling of his surname from McKay to McCay . His son related this story about the change:                 McCay came to be known by his middle name, Winsor. His drawing skills emerged early. According to a story told within the family, McCay made his first drawing in the aftermath of one of the many fires that hit Spring Lake: he picked up a nail and etched the scene of the fire in the frost of a windowpane. Drawing became obsessive for him; he drew anything he saw, and the level of detail and accuracy in his drawing was noted at a young age. He was able to draw accurately from memory even things he had never before drawn—what McCay called memory sketching . His father thought little of his sons artistic talents, though, and had him sent to ": null
    },
    {
        "Cleary Business College": "cleary university"
    },
    {
        " in ": null
    },
    {
        "Ypsilanti, Michigan": "ypsilanti, michigan"
    },
    {
        ". McCay rarely attended classes. He bragged about how he would catch the train to Detroit to show off his drawing skills at the Wonderland and Eden Musee ": null
    },
    {
        "dime museum": "dime museum"
    },
    {
        ". He drew portraits there for 42 apiece, of which he kept half.     McCay thrived on the attention he received, and his talents soon drew wider attention. John Goodison, a geography and drawing professor at ": null
    },
    {
        "Michigan State Normal School": "eastern michigan university"
    },
    {
        ", offered to teach art to McCay privately, and McCay eagerly accepted. The lessons were practical and focused on using observation to learn to draw in geometrical ": null
    },
    {
        "perspective": "perspective"
    },
    {
        ". Goodison, a former ": null
    },
    {
        "glass stainer": "stained glass"
    },
    {
        ", influenced McCays use of color. McCay learned how to draw quickly using drills on a blackboard, and gained an appreciation for master artists of the past.       McCay spent two years in ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        " after making his way there sometime in 42 with his friend Mort Touvers. He traded art techniques there with painter ": null
    },
    {
        "Jules Guérin": "jules guérin"
    },
    {
        ", whom he met at a boarding house in which he lodged, and did artwork for posters and pamphlets at the National Printing and Engraving Company.          In 42 McCay moved to ": null
    },
    {
        "Cincinnati": "cincinnati"
    },
    {
        ", where he did more dime museum work while living in a boarding house near his workplace. He spent nine years making posters and other advertisements for the Kohl & Middleton Dime Museum, and later Heck and Averys Family Theater , Averys New Dime Museum , and Will S. Hecks Wonder World and Theater  on ": null
    },
    {
        "Vine Street": "vine street, cincinnati"
    },
    {
        ". At the museum in 42 a demonstration of ": null
    },
    {
        "Thomas Edison": "thomas edison"
    },
    {
        "s ": null
    },
    {
        "Vitascope": "vitascope"
    },
    {
        " was given, which was likely McCays first exposure to the young medium of film. He also did work during this time for Ph. Mortons printing and lithography company. McCays ability to draw quickly with great accuracy drew crowds when he painted advertisements in public.     His first year at Kohl & Middleton, McCay was smitten when Maude Leonore Dufour walked into the dime museum with her sister while he was painting. He rushed to his studio to change into a custom-tailored suit, returned, and introduced himself to the fourteen-year-old Maude. Soon they ": null
    },
    {
        "eloped": "elopement"
    },
    {
        " in ": null
    },
    {
        "Covington, Kentucky": "covington, kentucky"
    },
    {
        ".     McCay began working on the side for the  Cincinnati Commercial Tribune , where he learned to draw with a ": null
    },
    {
        "dip pen": "dip pen"
    },
    {
        " under the tutelage of Commercial Tribune art room manager Joseph Alexander. In 42 he accepted a full-time position there. His many illustrations for the paper displayed his bold use of perspective and mastery of ": null
    },
    {
        "hatchwork": "hatching"
    },
    {
        ". Soon after, he began ": null
    },
    {
        "freelancing": "freelancer"
    },
    {
        " for the humor magazine  Life  as well.     In 42 McCay accepted a position with a higher salary at  The Cincinnati Enquirer . There, he produced a prolific number of drawings, did some reporting, and became head of the art department. In his drawings, he began using line thickness to indicate depth, and used thick lines to surround his characters in an ": null
    },
    {
        "Art Nouveau": "art nouveau"
    },
    {
        "-inspired style that became a trademark of his work.                 From January until November 42 McCay drew an ongoing proto-comic strip for the Enquirer based on poems written by ": null
    },
    {
        "George Randolph Chester": "george randolph chester"
    },
    {
        " called A Tale of the Jungle Imps by Felix Fiddle. Before the last two installments appeared in print, McCay had moved to New York City to work for ": null
    },
    {
        "James Gordon Bennett, Jr.": "james gordon bennett, jr."
    },
    {
        "s  New York Herald , at first doing illustrations and editorial cartoons. He worked alongside comic strip pioneer ": null
    },
    {
        "Richard F. Outcault": "richard f. outcault"
    },
    {
        ", who was doing the  Buster Brown  strip at the Herald. A rivalry built up between the two cartoonists which resulted in Outcault leaving the Herald to return to his previous employer, ": null
    },
    {
        "William Randolph Hearst": "william randolph hearst"
    },
    {
        " at  The New York Journal .     McCays first continuing comic strip, Mr. Goodenough, debuted in ": null
    },
    {
        "The Evening Telegram": "the telegram"
    },
    {
        " on January 42 42 The formula for the strip was that a sedentary millionaire would seek ways to become more active, with embarrassing results. Sisters Little Sisters Beau, McCays first strip with a child protagonist, lasted one installment that April, and his first color strip, Phurious Phinish of Phoolish Philipes Phunny Phrolics, appeared in the Heralds Sunday supplement that May.          McCays first popular comic strip was  Little Sammy Sneeze . The strip starred a young boy whose sneeze would build panel by panel until it was released, with explosively disastrous results, for which he was usually punished or chased away by those affected. The strip debuted in July 42 and ran until December 42     McCays longest-running strip,  Dream of the Rarebit Fiend , first appeared in The Evening Telegram in September 42 The strip was aimed at an adult audience, and had no recurring characters. The characters that appeared in the strip would have fantastic, sometimes terrifying dreams, only to wake up in the last panel, cursing the ": null
    },
    {
        "Welsh rarebit": "welsh rarebit"
    },
    {
        " they had eaten the night before, which they blamed for bringing on the dream. Rarebit Fiend was so popular that a book collection appeared in 42 from publisher ": null
    },
    {
        "Frederick A. Stokes": "frederick a. stokes"
    },
    {
        ". It was adapted to film by ": null
    },
    {
        "Edwin S. Porter": "edwin stanton porter"
    },
    {
        ", and plans were made for a comic opera or musical extravaganza for stage that failed to materialize. McCay signed the Rarebit Fiend strips with the pen name Silas , as his contract required that he not use his real name for Evening Telegram work.     The McCays had been living in Manhattan, close to the Herald offices; before 42 they moved to ": null
    },
    {
        "Sheepshead Bay": "sheepshead bay, brooklyn"
    },
    {
        " in Brooklyn, New York, a seaside resort on ": null
    },
    {
        "Long Island": "long island"
    },
    {
        ". It was an hour commute from the Herald offices, but they believed it to be a better place to raise children. They lived at a number of addresses before settling into a three-story house at 42 Voorhies Avenue, where McCay resided for the rest of his life. As his reputation grew, his employers allowed him to work from his home studio more often.          While still turning out illustrations and editorial cartoons daily, McCay began three more continuing strips in 42 In January, he began The Story of Hungry Henrietta, in which the child protagonist visibly ages week by week, and eats compulsively in lieu of the love she craves from her parents. A Pilgrims Progress by Mister Bunion was another Silas strip for The Evening Telegram, which ran from June 42 until December 42 Mr. Bunion spent each strip unsuccessfully scheming to rid himself of his suitcase, labeled Dull Care .     McCay got an idea from the Rarebit Fiend to please the little folk , and in October 42 the full-page ": null
    },
    {
        "Sunday strip": "sunday comics"
    },
    {
        "  Little Nemo in Slumberland  debuted in the Herald. Considered McCays masterpiece, its child protagonist had fabulous dreams, interrupted each week with his awakening in the final panel. Nemos appearance was based on McCays son Robert. McCay experimented with formal aspects of the comics page: he made inventive use of timing and pacing, the size and shape of panels, perspective, and architectural and other details. The Herald was considered to have the highest quality color printing of any newspaper at the time; its printing staff used the ": null
    },
    {
        "Ben Day process": "ben-day dots"
    },
    {
        " for color, and McCay annotated the Nemo pages with precise color schemes for the printers.     Impresario ": null
    },
    {
        "F.  F. Proctor": "frederick freeman proctor"
    },
    {
        " approached McCay in April 42 to perform ": null
    },
    {
        "chalk talk": "chalk talk"
    },
    {
        "s for the ": null
    },
    {
        "vaudeville": "vaudeville"
    },
    {
        " circuit. For $42 per week he was to draw twenty-five sketches in fifteen minutes before live audiences, as a pit band played a piece called Dream of the Rarebit Fiend .  In his The Seven Ages of Man routine, he drew two faces and progressively aged them. His first performance was on June 42 42 in a show that also featured entertainer ": null
    },
    {
        "W.  C. Fields": "w. & nbsp;c. fields"
    },
    {
        ". It was a success, and McCay toured with the show throughout 42 while managing to complete his comic strip and illustration work on time, often working in hotel rooms or backstage.          As early as 42 several abortive attempts were made to produce a stage version of Little Nemo. In mid42 ": null
    },
    {
        "Marcus Klaw": "marcus klaw"
    },
    {
        " and ": null
    },
    {
        "A. L. Erlanger": "a. l. erlanger"
    },
    {
        " announced they would put on an extravagant Little Nemo show for an unprecedented $42, with a score by ": null
    },
    {
        "Victor Herbert": "victor herbert"
    },
    {
        " and lyrics by ": null
    },
    {
        "Harry B. Smith": "harry b. smith"
    },
    {
        ". It starred midget Gabriel Weigel as Nemo, ": null
    },
    {
        "Joseph Cawthorn": "joseph cawthorn"
    },
    {
        " as Dr. Pill, and ": null
    },
    {
        "Billy B. Van": "billy b. van"
    },
    {
        " as Flip. Reviews were positive; it played to sold-out houses in New York and toured for two seasons. McCay brought his vaudeville act to each city where Little Nemo played. When the ": null
    },
    {
        "Keith": "benjamin franklin keith"
    },
    {
        " circuit refused McCay to perform in Boston without a new act, McCay switched to the ": null
    },
    {
        "William Morris": "william morris endeavor"
    },
    {
        " circuit, with a $42-a-week raise. In several cities, McCay brought his son, who as publicity sat on a small throne dressed as Nemo.     As part of an improvised story, Cawthorn introduced a mythical creature he called a ": null
    },
    {
        "Whiffenpoof": "whiffenpoof"
    },
    {
        " . The word caught on with the public, and became the name of a ": null
    },
    {
        "hit song": "s:the whiffenpoof song"
    },
    {
        " and a ": null
    },
    {
        "singing group": "the whiffenpoofs"
    },
    {
        ". Despite the shows success, it failed to make back its investment due to its enormous expenses and came to an end in December 42     McCay displayed his ": null
    },
    {
        "social awareness": "social consciousness"
    },
    {
        " in the last strip he created for the Herald, Poor Jake. Its title character was a silent laborer who worked thanklessly for a Colonel and Mrs. Stall, who exploit him. The strip ran from 42 until spring 42     McCay was approached in early 42 to bring his vaudeville show to Europe. McCay requested the Heralds permission, but the plans never materialized. His show stayed within the eastern U.S. until he ceased performing in 42 Biographer ": null
    },
    {
        "John Canemaker": "john canemaker"
    },
    {
        " assumed McCays request to tour Europe was turned down, and that the refusal added to McCays growing frustration with the Herald. A distrust of big business became pronounced in McCays work around this time, including a ": null
    },
    {
        "story arc": "story arc"
    },
    {
        " in Little Nemo in which the characters visit a Mars oppressed by a greedy business magnate.       McCay said he was most proud of his animation work. He completed ten animated films between 42 and 42 and three more were planned.          Inspired by the ": null
    },
    {
        "flip book": "flip book"
    },
    {
        "s his son brought home, McCay came to see the possibility of making moving pictures  of his cartoons. He claimed to be the first man in the world to make animated cartoons , though he was preceded by others such as ": null
    },
    {
        "James Stuart Blackton": "james stuart blackton"
    },
    {
        " and ": null
    },
    {
        "Émile Cohl": "émile cohl"
    },
    {
        ". McCay made four thousand drawings on ": null
    },
    {
        "rice paper": "rice paper"
    },
    {
        " for his first animated short, which starred his Little Nemo characters. They were shot at ": null
    },
    {
        "Vitagraph Studios": "vitagraph studios"
    },
    {
        " under Blacktons supervision. Live-action sequences were added to the beginning and end of the film, in which McCay bets his newspaper colleagues that in one month he can make four thousand drawings that move. Among those featured in these sequences were cartoonist ": null
    },
    {
        "George McManus": "george mcmanus"
    },
    {
        " and actor ": null
    },
    {
        "John Bunny": "john bunny"
    },
    {
        ".  Little Nemo  debuted in movie theatres on April 42 42 and four days later McCay began using it as part of his vaudeville act. Its good reception motivated him to hand-color each of the frames of the originally black-and-white animation.          McCay had become frustrated with the Herald, partly over money issues and partly because he perceived a lack of freedom. He accepted a higher-paying offer in spring 42 from Hearst at the  New York American  and took Little Nemos characters with him. The Herald held the strips copyright, but McCay won a lawsuit that allowed him to continue using the characters, which he did under the title In the Land of Wonderful Dreams. The Herald was unsuccessful in finding another cartoonist to continue the original strip.     McCay began work that May on his next animated film,  How a Mosquito Operates , based on a Rarebit Fiend episode from June 42 42 in which a man in bed tries in vain to defend himself from a giant mosquito, which drinks itself so full that it explodes. The animation is naturalistic—rather than expanding like a balloon, with each sip of blood the mosquitos abdomen swells according to its body structure. The film was completed in January 42 and McCay toured with it that spring and summer.          Gertie the Dinosaur debuted in February 42 as part of McCays vaudeville act. McCay introduced Gertie as the only dinosaur in captivity , and commanded the animated beast with a whip. Gertie seemed to obey McCay, bowing to the audience, and eating a tree and a boulder, though she had a will of her own and sometimes rebelled. When McCay admonished her, she cried. McCay consoled her by throwing her an apple—in reality pocketing the cardboard prop apple as a cartoon one simultaneously appeared on screen. In the finale, McCay walked offstage, reappeared in animated form in the film, and had Gertie carry him away. Producer ": null
    },
    {
        "William Fox": "william fox"
    },
    {
        "s Box Office Attractions obtained distribution rights to a modified version of Gertie that could be played in regular movie theaters. This version was prefaced with a live-action sequence and replaced the interactive portions with ": null
    },
    {
        "intertitle": "intertitle"
    },
    {
        "s.     Gertie was McCays first piece of animation with detailed backgrounds. McCay drew the foreground characters, while art student neighbor John A. Fitzsimmons traced the backgrounds. McCay pioneered the McCay Split System of ": null
    },
    {
        "inbetweening": "inbetweening"
    },
    {
        ", in which major poses or positions were drawn first, and the intervening frames drawn after. This relieved tedium and improved the timing of the films actions. McCay refused to patent his system, and was sued in 42 by animator ": null
    },
    {
        "John Randolph Bray": "john randolph bray"
    },
    {
        ", who took advantage of McCays lapse by patenting many of McCays techniques, including the use of ": null
    },
    {
        "registration marks": "printing registration"
    },
    {
        ", tracing paper, the ": null
    },
    {
        "Mutoscope": "mutoscope"
    },
    {
        " action viewer, and the ": null
    },
    {
        "cycling": "traditional animationanimation loops"
    },
    {
        " of drawings to create repetitive action. The lawsuit was unsuccessful, and there is evidence that McCay may have countersued—he thereafter received ": null
    },
    {
        "royalty payments": "royalties"
    },
    {
        " from Bray for licensing the techniques.          Hearst was disappointed with the quality of McCays newspaper work. Infuriated that he couldnt reach McCay during a vaudeville performance, Hearst pulled from his papers advertising for the theatre where McCay performed. Editor ": null
    },
    {
        "Arthur Brisbane": "arthur brisbane"
    },
    {
        " told him that he was a serious artist, not a comic cartoonist , and that he was to give up his comic strip work to focus on editorial illustrations. Hearst pressured McCays agents to reduce the number of his vaudeville appearances, and he was induced to sign a contract with Hearst that limited his vaudeville appearances to greater New York, with occasional exceptions. In February 42 Hearst had McCay give up entirely on vaudeville and all other paid work outside the Hearst empire, though he was occasionally granted permission for particular shows. Hearst increased McCays salary to cover the loss of income.     McCay was expected to report daily to the American building, where he shared a ninth-floor office with humorist ": null
    },
    {
        "Arthur Bugs Baer": "arthur   bugs   baer"
    },
    {
        " and sports cartoonist Joe McGurk. There, he illustrated editorials by Arthur Brisbane, who often sent back McCays drawings with instructions for changes. The quality of his drawings varied depending on his interest in the subject of the assignment, whether or not he agreed with the sentiments portrayed, and on events in his personal life. For example, in March 42 he was subjected to a blackmail plot by a Mrs. Lambkin, who was seeking a divorce from her husband. Lambkin alleged that McCays wife Maude was seeing her husband. With McCays level of fame, such a story would likely be in the papers, and Mrs. Lambkin and her husband told McCay that she would keep it secret for $42. McCay did not believe the allegations, and gave testimony at the Lambkins divorce trial. The blackmail failed, and the divorce was not granted.     Hearst animation studio ": null
    },
    {
        "International Film Service": "international film service"
    },
    {
        " began in December 42 and brought Hearst cartoonists to the screen. McCay was initially listed as one of them, but the studio never produced anything either by his hands or featuring his creations. McCay derived satisfaction from doing the work himself. Begun in 42  The Sinking of the Lusitania  was his follow-up to Gertie. The film was not a fantasy but a detailed, realistic recreation of the ": null
    },
    {
        "42 German torpedoing": "sinking of the rms lusitania"
    },
    {
        " of the ": null
    },
    {
        "RMS Lusitania": "rms lusitania"
    },
    {
        ". The event counted 42 Americans among its 42 dead, and was a factor leading to the ": null
    },
    {
        "American entry into World War I": "american entry into world war i"
    },
    {
        ".     McCays daughter Marion married military man Raymond T. Moniz, eighteen years her senior, on October 42 42 She gave birth to McCays first grandchild, Ray Winsor Moniz, on July 42 42 Moniz and McCays son Robert were called up for service when the U.S. entered World War  I.          McCays self-financed Lusitania took nearly two years to complete. With the assistance of John Fitzsimmons and Cincinnati cartoonist William Apthorp Ap Adams, McCay spent his off hours drawing the film on sheets of ": null
    },
    {
        "cellulose acetate": "cellulose acetate"
    },
    {
        "  with white and black ": null
    },
    {
        "India ink": "india ink"
    },
    {
        " at McCays home. It was the first film McCay made using cels, a technology animator ": null
    },
    {
        "Earl Hurd": "earl hurd"
    },
    {
        " had patented in 42; it saved work by allowing dynamic drawings to be made on one or more layers, which could be laid over a static background layer, relieving animators of the tedium of retracing static images onto drawing after drawing. McCay had the cels photographed at the Vitagraph studios. The film was naturalistically animated, and made use of dramatic camera angles that would have been impossible in a live-action film.     Jewel Productions released the film on July 42 42 Advertising touted it as the picture that will never have a competitor ; the film itself called McCay the originator and inventor of Animated Cartoons  and drew attention to the fact that it took 42 drawings to complete. The Sinking of the Lusitania did not greatly return on McCays investment—after a few years run in theaters, it netted $42.     McCay continued to produce animated films using cels. By 42 he had completed six, though three were likely never shown commercially to audiences and have survived only in fragments: The Centaurs, Flips Circus, and Gertie on Tour. In 42 he released three films based on Dream of the Rarebit Fiend: Bug Vaudeville, in which insects and other creepy-crawlies perform on stage; The Pet, in which a creature with a bottomless appetite grows enormously and terrorizes the city in a way reminiscent of  King Kong ; and The Flying House, in which a man attaches wings to his house to flee from debt. McCays son Robert is credited with the animation on this last film, but Canemaker notes it is highly unlikely that a first-time animator could have produced such an accomplished piece of animation.       After 42 McCay was made to give up on animation when Hearst learned he devoted more of his time to animation than to his newspaper illustrations. Unexecuted ideas McCay had for animation projects included a collaboration with Jungle Imps author George Randolph Chester, a musical film called The Barnyard Band, and a film about the Americans role in World War I.          McCays son Robert married Theresa Tedda Munchausen on April 42 42 McCay bought them a nearby house as a wedding gift. The couple gave McCay two more grandchildren: Janet in 42 and Robert in 42 Robert suffered ": null
    },
    {
        "shell shock": "shell shock"
    },
    {
        " during World War I, and following the war had difficulty drawing. McCay tried to boost his sons confidence by finding him cartooning work, and some of the elder McCays editorial cartoons were signed Robert Winsor McCay, Jr.      In 42 McCay resumed doing vaudeville shows for the Keith circuit. He had a cameo in a newspaper office scene in the boxing film  The Great White Way  in early 42     McCay left Hearst upon the expiration of his contract in May 42 bitter over not having received a promised $42 bonus. He returned to the Herald Tribune, and brought back Little Nemo beginning that August. The new strip displayed the virtuoso technique of the old, but the panels were laid out in an unvarying grid. Nemo took a more passive role in the stories, and there was no continuity. The strip came to an end in December 42 as it was not popular with readers. Hearst executives had been trying to convince McCay to return to the American, and succeeded in 42 While McCay was gone, his place had been filled by ": null
    },
    {
        "Mel Cummin": "mel cummin"
    },
    {
        ", who was let go after McCays return. Due to the lack of the 42s Nemos success, the Herald Tribune signed over all copyrights to the strip to McCay for one dollar.          In 42 McCay attended a dinner in his honor in New York. After a considerable amount of drinking, McCay was introduced by animator ": null
    },
    {
        "Max Fleischer": "max fleischer"
    },
    {
        ". McCay gave the gathered group of animators some technical advice, but when he felt the audience was not giving him attention, he berated his audience, saying, Animation is an art. That is how I conceived it. But as I see, what you fellows have done with it, is making it into a trade. Not an art, but a trade. Bad Luck!  That September he appeared on the radio at ": null
    },
    {
        "WNAC": "wrko"
    },
    {
        ", and on November 42 he was interviewed by ": null
    },
    {
        "Frank Craven": "frank craven"
    },
    {
        " for  The Evening Journal s Womans Hour. During both appearances he complained about the state of contemporary animation.     An executive of the ": null
    },
    {
        "American Tobacco Company": "american tobacco company"
    },
    {
        " approached McCay in 42 to do an advertising campaign for a financial sum in excess of his annual salary . Brisbane refused, noting that McCays contract didnt allow outside work. When the executive stormed into Brisbanes office threatening to pull American Tobaccos advertising dollars from the American, Brisbane provided a written release for the work.     In 42 McCay found himself in what he recalled as the wildest ride in his life when Hearsts son ": null
    },
    {
        " Young Bill ": "william randolph hearst, jr."
    },
    {
        " drove him at  to the scene of the ": null
    },
    {
        "kidnapping of the Lindbergh baby": "lindbergh kidnapping"
    },
    {
        ". They arrived there two hours after the crime was first reported to police, and were able to interview the gathered police before the grounds were closed off to the public. McCay sketched the scene, the staff, and the ladders the kidnappers used, which he was allowed to see up close.     McCay enjoyed robust health most of his life. On July 42 42 he complained to his wife of a severe head-ache. To his horror, he found his right arm—his drawing arm—was paralyzed. He lost consciousness and was pronounced dead later that afternoon, with his wife, children, and son-in-law by his side. He had died of a ": null
    },
    {
        "cerebral embolism": "embolism"
    },
    {
        ", and was buried at the ": null
    },
    {
        "Cemetery of the Evergreens": "cemetery of the evergreens"
    },
    {
        " in Brooklyn in a family plot. He had a ": null
    },
    {
        "Masonic funeral": "masonic funeral"
    },
    {
        " in his home, attended by his newspaper colleagues, Hearst and his son, and the ": null
    },
    {
        "Society of Illustrators": "society of illustrators"
    },
    {
        ", among others.     Brisbane hired back Mel Cummin to replace McCay. Due to his lavish life-style, McCay left a smaller fortune than those around him had expected. By the early 42s, Maude had used up her inheritance and sold the house on Voorhies Avenue. When she died of a heart attack on March 42 42 she was living with her daughter and son-in-law. Son Robert was also careless with his inheritance, and less successful in art than his father. He worked for a short time at the Hearst papers, and tried unsuccessfully to get a job at the Disney studios, before finding a career as illustrator for Training Aids/Special Services at ": null
    },
    {
        "Fort Ord": "fort ord"
    },
    {
        ".       Self-conscious and introverted in private, McCay was nevertheless a charismatic showman and self-promoter, and maintained several lifelong friendships. McCay was a light but frequent drinker; he drank for ": null
    },
    {
        "camaraderie": "comrade"
    },
    {
        " rather than for a love of drinking. To his wifes chagrin, McCay was a smoker of cigars and cigarettes. He was self-taught at the piano, and was an avid reader of poetry, plays and novels; he admired ": null
    },
    {
        "W. B. Yeats": "w. b. yeats"
    },
    {
        ", knew the works of ": null
    },
    {
        "Percy Bysshe Shelley": "percy bysshe shelley"
    },
    {
        " and ": null
    },
    {
        "John Keats": "john keats"
    },
    {
        ", and could quote the Bible and Shakespeare.     McCay stood barely five feet  tall, and felt dominated by his wife, who was nearly as tall as he was. McCay married Maude Leonore Dufour, the youngest of three daughters of French-Canadian carriage painter John Dufour. About a decade separated the couples ages: Maude was 42 when they married.  Biographer Canemaker speculates this may explain the lack of certainty behind McCays birthdate, even by McCay himself, as he may have claimed to be younger than he was to justify marrying a teenage girl. Maude was also age-conscious: she preferred her grandchildren to call her Nan instead of Grandma and dyed her hair as she got older. The McCays took on the traditional roles of a married couple of the time, in that Winsor was the breadwinner and Maude the homemaker. Neither spouse got along well with the others mother.          The couple had two children: ": null
    },
    {
        "Robert Winsor": "bob mccay"
    },
    {
        ", born June 42 42; and Marion Elizabeth, born August 42 42 McCay was said to be easy-going with the children, and left discipline to their stern mother. Marion felt domineered by her mother and perceived that her brother was her mothers favorite; she was closer to her father and often appeared in public with him. Robert looked up to his father and became an artist himself. He was proud to have served as the model for Little Nemo.     The McCays lived lavishly. McCay disliked driving, so kept a chauffeur who also served as bodyguard, as the editorial cartoons McCay drew for Hearst sometimes attracted threatening letters. Maude made daily trips by limousine to shop in upscale downtown Brooklyn with other well-to-do wives. Maude often complained to her husband, but he refused to discuss matters with her.     McCays politics are unclear, and it is disputed whether he sympathized with the views displayed in his editorial cartoons. He was ": null
    },
    {
        "agnostic": "agnosticism"
    },
    {
        " and believed in ": null
    },
    {
        "reincarnation": "reincarnation"
    },
    {
        ". He was a ": null
    },
    {
        "Freemason": "freemasonry"
    },
    {
        ", whom he may have joined as early as when he was living in Chicago. His father had also been a Freemason, and was buried in 42 with full Masonic rites, with funerals arranged by his Masonic lodges in both Woodstock, Ontario, and Edmore, Michigan. His mother often visited him in Brooklyn, and attended Little Nemos Philadelphia premiere. She died in Edmore, Michigan, in 42     McCays brother Arthur was placed in a mental hospital in Traverse City, Michigan on March 42 42 where he stayed until his death from ": null
    },
    {
        "bronchopneumonia": "bronchopneumonia"
    },
    {
        " and ": null
    },
    {
        "arteriosclerosis": "arteriosclerosis"
    },
    {
        " on June 42 42 He never received family visits. McCay never let his children know about his brother, nor did they know about the existence of his sister Mae, who died in 42                 In 42 McCays son Robert attempted to carry on his fathers legacy by reviving Little Nemo. Comic book packager ": null
    },
    {
        "Harry A Chesler": "harry   a   chesler"
    },
    {
        "s syndicate announced a Sunday and daily Nemo strip, credited to Winsor McCay Jr. Robert also drew a comic book version for Chesler called Nemo in Adventureland starring grown-up versions of Nemo and the Princess. Neither project lasted long. In 42 Robert and fabric salesman Irving Mendelsohn organized the McCay Feature Syndicate, Inc. to revive the original Nemo strip from McCays original art, modified to fit the size of modern newspaper pages. This revival also did not last.      McCays original artwork has been poorly preserved. McCay insisted on having his originals returned to him, and a large collection that survived him was destroyed in a fire in the late 42s. His wife was unsure how to handle the surviving pieces, so his son took on the responsibility and moved the collection to his own house. The family sold off some of the artwork when they were in need of cash. Responsibility for it passed to Mendelsohn, then later to daughter Marion. By the early twenty-first century, most of McCays surviving artwork remained in family hands.        McCay destroyed many of his original cans of film to create more storage space. Of what film he kept, much has not survived, as it was photographed on 42mm ": null
    },
    {
        "nitrate film": "nitrocellulosefilm"
    },
    {
        ", which deteriorates and is flammable. Mendelsohns son and a friend, both young animators, discovered the film in Mendelsohns possession in 42 and rescued what they could. In some cases, such as The Centaurs, only fragments could be saved. A ": null
    },
    {
        "negative": "negative"
    },
    {
        " and incomplete positive was discovered of Performing Animals, a film of animals playing instruments that may have been intended for McCays vaudeville act; it was deemed unsalvageable and destroyed.     In 42 cartoonist ": null
    },
    {
        "Woody Gelman": "woody gelman"
    },
    {
        " discovered the original artwork for many Little Nemo strips at a cartoon studio where McCays son Robert had worked. Many of the recovered originals were displayed at the ": null
    },
    {
        "Metropolitan Museum of Art": "metropolitan museum of art"
    },
    {
        " under the direction of curator ": null
    },
    {
        "A. Hyatt Mayor": "a. hyatt mayor"
    },
    {
        ". In 42 Gelman published a collection of Little Nemo strips in Italy. His collection of McCay originals is preserved at the ": null
    },
    {
        "Billy Ireland Cartoon Library & Museum": "billy ireland cartoon library  &  museum"
    },
    {
        " at ": null
    },
    {
        "Ohio State University": "ohio state university"
    },
    {
        ".          McCays work, grounded solidly in his understanding of realistic perspective, presaged the techniques featured in ": null
    },
    {
        "Walt Disney": "the walt disney company"
    },
    {
        "s feature films. Disney paid tribute to McCay in 42 on an episode of  Disneyland . The episode, The Story of Animated Drawing , gave a history of animation, and dramatized McCays vaudeville act with Gertie. Robert was invited to the Disney studios as a consultant on the episode, where Disney told him, Bob, all this should be your fathers .     Animator and McCay biographer John Canemaker produced a film in 42 called Remembering Winsor McCay, narrated by McCays animation assistant John Fitzsimmons. Canemaker helped coordinate the first retrospective of McCays films at the third International Animation Film Festival in 42 in New York, which led to a film show at the ": null
    },
    {
        "Whitney Museum of American Art": "whitney museum of american art"
    },
    {
        " in winter 42–42 Canemaker also wrote a biography in 42 called Winsor McCay: His Life and Art. In 42 a revised and expanded version of the biography was released, which comics scholar Jeet Heer called far and away the most scholarly and intelligent biography ever written about an American cartoonist . Animation scholar Paul Wells stated, McCays influence on the history of animation cannot be understated . Film critic ": null
    },
    {
        "Richard Eder": "richard eder"
    },
    {
        " lamented that as an animation pioneer McCay was not able to reach the potential suggested by his work. Eder compared McCay to the ": null
    },
    {
        "Italian primitives": "italian primitives"
    },
    {
        " of the early Renaissance, highly skilled in the limited techniques they could command . Heer wrote that McCays strength was in his visuals, but that his writing and characters were weak.     Italian filmmaker ": null
    },
    {
        "Federico Fellini": "federico fellini"
    },
    {
        " read Little Nemo in the childrens magazine  Il corriere dei piccoli , and the strip was a powerful influence on the filmmaker, according to Fellini biographer ": null
    },
    {
        "Peter Bondanella": "peter bondanella"
    },
    {
        ". Comics historian ": null
    },
    {
        "R. C. Harvey": "r. c. harvey"
    },
    {
        " has called McCay the first original genius of the comic strip medium and in animation. Harvey said that McCays contemporaries lacked the skill to continue with his innovations, so that they were left for future generations to rediscover and build upon.     McCays work has inspired cartoonists from ": null
    },
    {
        "Carl Barks": "carl barks"
    },
    {
        " to ": null
    },
    {
        "Art Spiegelman": "art spiegelman"
    },
    {
        ". ": null
    },
    {
        "Robert Crumb": "robert crumb"
    },
    {
        " called McCay a genius and one of his favorite cartoonists. ": null
    },
    {
        "Art Spiegelman": "art spiegelman"
    },
    {
        "s 42 Real Dream strip was partially inspired by Rarebit Fiend, and his  In the Shadow of No Towers  in 42 appropriated some of McCays imagery, and included a page of Little Nemo in its appendix. ": null
    },
    {
        "Maurice Sendak": "maurice sendak"
    },
    {
        "s childrens book  In the Night Kitchen  was an homage to McCays work, as was ": null
    },
    {
        "Rick Veitch": "rick veitch"
    },
    {
        " comic book series Roarin Ricks Rarebit Fiends . ": null
    },
    {
        "Kim Deitch": "kim deitch"
    },
    {
        " and Simon Deitchs graphic novel  The Boulevard of Broken Dreams  revolved around a character named Winsor Newton, based on an aged McCay. Cartoonist ": null
    },
    {
        "Berke Breathed": "berke breathed"
    },
    {
        " lamented that the conditions of newspaper cartooning had devolved to such a degree since McCays time that, had he worked later in the century, he would not have been allotted space sufficient for his expansive full-page fantasies.          As ": null
    },
    {
        "Sigmund Freud": "sigmund freud"
    },
    {
        "s  The Interpretation of Dreams  first appeared in print in 42 McCays major dream strips work have invited speculation of a Freudian influence. A comic strip that appeared in Freuds book, A French Nurses Dream , strongly resembles the work of McCay in its theme, pacing, Art Nouveau style, and closing panel of the dreamer awakening in bed. However, the English translation of Freuds book was not published until 42     The ": null
    },
    {
        "Winsor McCay Award": "winsor mccay award"
    },
    {
        " was established in 42 to recognize individuals for lifetime or career contributions in animation, and is presented as part of the ": null
    },
    {
        "Annie Award": "annie award"
    },
    {
        "s. The ": null
    },
    {
        "Hammer Museum": "hammer museum"
    },
    {
        " in Los Angeles devoted a room to McCays work as part of the Masters of American Comics exhibit in 42 German publisher ": null
    },
    {
        "Taschen": "taschen"
    },
    {
        " published a complete, boxed, full-size edition of Little Nemo in two volumes in 42 entitled The Complete Little Nemo.     The American astronomer ": null
    },
    {
        "Roy A. Tucker": "roy a. tucker"
    },
    {
        " named the asteroid ": null
    },
    {
        "42": "113461 mccay"
    },
    {
        " after McCay in 42          Virtually from the beginning, McCay innovated with the forms of his chosen media. He varied the size and shape of comic strip panels for dramatic effect, as in the second instalment of Little Nemo , where the panels grow to adapt to a growing forest of mushrooms. Few of McCays contemporaries were so bold with their page layouts. Near-contemporary ": null
    },
    {
        "George Herriman": "george herriman"
    },
    {
        " with  Krazy Kat  was the most notable example, but it was not until a generation later that cartoonists such as ": null
    },
    {
        "Frank King": "frank king"
    },
    {
        " with  Gasoline Alley , ": null
    },
    {
        "Hal Foster": "hal foster"
    },
    {
        " with  Prince Valiant , and ": null
    },
    {
        "Roy Crane": "roy crane"
    },
    {
        " with  Captain Easy  attempted such daring designs on their Sunday pages.               McCays detailed ": null
    },
    {
        "hatching": "hatching"
    },
    {
        " mastery of ": null
    },
    {
        "perspective": "perspective"
    },
    {
        " enhanced the illusions in his drawings, particularly in Little Nemo. Fantastic grotesqueries such as what McCay witnessed during his time at the Wonderland and Eden Musee appeared often in McCays work. McCay was noted for the speed and accuracy with which he could draw; crowds of people would gather around to watch him paint billboards.          McCay had a taste for the ornate. The architecture he drew was inspired by that of carnivals, the 42 ": null
    },
    {
        "Worlds Columbian Exposition": "worlds columbian exposition"
    },
    {
        " in Chicago and the detailed illustrations in British illustrated newspapers  The Illustrated London News  and  The Graphic . The  of Paris published a series of illustrated books called Images Enphantines, whose pages bear a striking resemblance to McCays early Little Nemo strips, both in their graphic sense and their imaginative layouts.     To Canemaker, McCay had an absolute precision of line  akin to those of ": null
    },
    {
        "Northern Renaissance": "northern renaissance"
    },
    {
        " artist ": null
    },
    {
        "Albrecht Dürer": "albrecht dürer"
    },
    {
        " and 42th-century French illustrator ": null
    },
    {
        "Gustave Doré": "gustave doré"
    },
    {
        ". McCay drew with Higgins black drawing ink, ": null
    },
    {
        "Gillott": "joseph gillotts"
    },
    {
        "  pens, ": null
    },
    {
        "art gum": "eraserart gum erasers"
    },
    {
        ", a ": null
    },
    {
        "T-square": "t-square"
    },
    {
        " and ": null
    },
    {
        "angle": "set square"
    },
    {
        ", and an assortment of ": null
    },
    {
        "Venus": "venus pencils"
    },
    {
        " lead pencils. In his early magazine cartoons McCay often painted in ": null
    },
    {
        "gouache": "gouache"
    },
    {
        ".     McCay used ": null
    },
    {
        "metafiction": "metafiction"
    },
    {
        "al techniques such as ": null
    },
    {
        "self-referentiality": "self-reference"
    },
    {
        " in his work. This was most frequent in Dream of the Rarebit Fiend, where McCay sometimes put himself in the strip, or had characters address the reader. Sometimes characters become aware of the strip itself—a jealous lover tears the very strip apart in which he appears; another character fastens panel borders to his strip when he realizes the artist has forgotten them; and in a Sammy Sneeze episode Sammys sneeze destroys the panel borders.     In contrast to the high level of skill in the artwork, the dialogue in McCays speech balloons is crude, sometimes approaching illegibility, and disfigur his otherwise flawless work , according to critic ": null
    },
    {
        "R. C. Harvey": "r. c. harvey"
    },
    {
        ". This is further highlighted by the level of effort and skill apparent in the title lettering. McCay seemed to show little regard for the dialogue balloons, their content, and their placement in the visual composition. They tended to contain repetitive monologues expressing the increasing distress of the speakers, and showed that McCays gift was in the visual and not the verbal.     In his comics and animation McCay used stock ethnic stereotypes common in his era. A conscious attempt to offend is not apparent. He depicted ": null
    },
    {
        "blacks": "black people"
    },
    {
        " as savages, or wishing they could be ": null
    },
    {
        "white": "white people"
    },
    {
        ". Most prominent were a pair of characters in Little Nemo: the ill-tempered Irishman Flip and the rarely speaking grass-skirted African Little Imp. In the animated Little Nemo, the Anglo-Saxon Nemo is shown drawn in a dignified Art Nouveau style, and controls by magic the more grotesquely caricatured Flip and Imp. Women were few in McCays work, and were depicted as superficial, jealous, and argumentative; the Princess in Little Nemo never partook in the camaraderie the males shared.                     ": null
    }
]