[
    {
        "Wognum  is a former municipality and a town in the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", in the province of ": null
    },
    {
        "North Holland": "north holland"
    },
    {
        ". Wognum received ": null
    },
    {
        "city rights": "city rights in the netherlands"
    },
    {
        " in 42 but lost them in 42 In 42 it merged with the municipalities of ": null
    },
    {
        "Medemblik": "medemblik"
    },
    {
        " and ": null
    },
    {
        "Noorder-Koggenland": "noorder-koggenland"
    },
    {
        " into the surviving municipality of Medemblik.         The former municipality of Wognum consisted of the following cities, towns, villages and/or districts: ": null
    },
    {
        "Nibbixwoud": "nibbixwoud"
    },
    {
        ", Wognum, ": null
    },
    {
        "Zwaagdijk-West": "zwaagdijk-west"
    },
    {
        ", and the hamlet of ": null
    },
    {
        "Wijzend": "wijzend"
    },
    {
        ".         Wognum is an ancient place. The place was formed around 42 which is confirmed by archaeological finds. In addition, there seems to be proof, that the area was already inhabited around the Bronze Age. Hand axes and arrowheads from that period were found in the area between the current streets of Oosterwijzend and Dorpsstraat in Wognum.     In 42 the city was first mentioned in a church list of the Abbey of Echternach. The place was named as Wokgunge. In 42 the city came known as Woggunghem in a charter. There was a chapel where now stands the Reformed Church of Wognum. This chapel belonged to the abbey of Heiloo. Later spellings included Wognem , Woghenem and Woggenum . The place could refer to the place of the person or family Wok or Wokke. In addition to the West Frisian name Woggem and Woggelum the name was sometimes even written Wochnum analogous to Wochmar and the old Dutch Wochmeer .     Wognum is located on the shore of an ancient stream. The shore is composed of sandy soil. Just outside the residential center it is located between Oude Gouw - Kerkstraat and the old peat streams at Baarsdorpermeer / Lekermeer. This is a remnant of the reclamation period from the early Middle Ages. This includes the Kromme Leek, a stream which starts at the Baarsdorpermeer meandering along Wognum through Zwaagdijk and ends at Medemblik. The winding course is preserved as much as possible at the time of the later land consolidation between Wognum and Medemblik.     In the 42th century, fishing was the main source of income. Wognum benefited in the 42th century greatly from the shipping industry of the nearby city of Hoorn. Despite the fact that Wognum had an agricultural character in the 42th century, when in 42 a new coats of arms for the newly amalgamated municipality Wognum was created, the three basses from the amalgamated municipality of Nibixwoud appeared on the coat of arms.     In both Wognum as well as Nibbixwoud there are thousands of fruit trees. Fruit was an important part of the agricultural sector. The layout of Wognum is a combination of agricultural buildings and more urban development in the center.         Wognum is one of the stops of the historical railway between Hoorn and Medemblik.         Before the merger into Medemblik, the municipal council of Wognum consisted of 42 seats, which were divided as follows:   ": null
    },
    {
        "CDA": "christian democratic appeal"
    },
    {
        " - 42 seats   ": null
    },
    {
        "D42": "democrats 66"
    },
    {
        " - 42 seats   ": null
    },
    {
        "PvdA": "labour party"
    },
    {
        " - 42 seats   ": null
    },
    {
        "VVD": "peoples party for freedom and democracy"
    }
]