[
    {
        "        Worcester  is a ": null
    },
    {
        "cathedral city": "cathedral city"
    },
    {
        " in ": null
    },
    {
        "Worcestershire": "worcestershire"
    },
    {
        ", ": null
    },
    {
        "England": "england"
    },
    {
        ",  southwest of ": null
    },
    {
        "Birmingham": "birmingham"
    },
    {
        ",  west-northwest of ": null
    },
    {
        "London": "london"
    },
    {
        ",  north of ": null
    },
    {
        "Gloucester": "gloucester"
    },
    {
        " and  northeast of ": null
    },
    {
        "Hereford": "hereford"
    },
    {
        ". The population is approximately 42. The ": null
    },
    {
        "River Severn": "river severn"
    },
    {
        " flanks the western side of the city centre, which is overlooked by ": null
    },
    {
        "Worcester Cathedral": "worcester cathedral"
    },
    {
        ".     The ": null
    },
    {
        "Battle of Worcester": "battle of worcester"
    },
    {
        " in 42 was the final battle of the ": null
    },
    {
        "English Civil War": "english civil war"
    },
    {
        ", where ": null
    },
    {
        "Oliver Cromwell": "oliver cromwell"
    },
    {
        "s ": null
    },
    {
        "New Model Army": "new model army"
    },
    {
        " defeated King ": null
    },
    {
        "Charles IIs": "charles ii of england"
    },
    {
        " Royalists": "cavalier"
    },
    {
        ". Worcester is known as the home of ": null
    },
    {
        "Royal Worcester Porcelain": "royal worcester"
    },
    {
        ", composer ": null
    },
    {
        "Edward Elgar": "edward elgar"
    },
    {
        ",  . ELGAR. Retrieved on 42 August 42 ": null
    },
    {
        "Lea & Perrins": "lea  &  perrins"
    },
    {
        ", makers of traditional ": null
    },
    {
        "Worcestershire sauce": "worcestershire sauce"
    },
    {
        ", ": null
    },
    {
        "University of Worcester": "university of worcester"
    },
    {
        ", and ": null
    },
    {
        "Berrows Worcester Journal": "berrows worcester journal"
    },
    {
        ", claimed to be the worlds oldest ": null
    },
    {
        "newspaper": "newspaper"
    },
    {
        ".                 The trade route which ran past Worcester, later forming part of the ": null
    },
    {
        "Roman": "roman roads in britain"
    },
    {
        " Ryknild Street": "ryknild street"
    },
    {
        ", dates to ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " times. The position commanded a ": null
    },
    {
        "ford": "ford"
    },
    {
        " over the ": null
    },
    {
        "River Severn": "river severn"
    },
    {
        "  and was ": null
    },
    {
        "fortified": "british hillforts"
    },
    {
        " by the ": null
    },
    {
        "Britons": "britons"
    },
    {
        " around 42  . It would have been on the northern border of the ": null
    },
    {
        "Dobunni": "dobunni"
    },
    {
        " and probably subject to the larger communities of the ": null
    },
    {
        "Malvern": "malvern hills"
    },
    {
        " hillforts. City of Worcester.  Worcester City Council , 42       The ": null
    },
    {
        "Roman": "ancient romans"
    },
    {
        " settlement at the site passes unmentioned by ": null
    },
    {
        "Ptolemy": "claudius ptolemy"
    },
    {
        "s  Geography , the ": null
    },
    {
        "Antonine Itinerary": "antonine itinerary"
    },
    {
        " and the ": null
    },
    {
        "Register of Dignitaries": "notitia dignitatum"
    },
    {
        ", but would have grown up on the road opened between ": null
    },
    {
        "Glevum": "glevum"
    },
    {
        "  and ": null
    },
    {
        "Viroconium": "viroconium cornoviorum"
    },
    {
        "  in the 42s and 42s . The river crossing of the Severn at Worcester was also the likely destination of the unfinished east-west Roman-dated road that ran from ": null
    },
    {
        "Magnis": "magnis"
    },
    {
        " , until it disappeared from the historical record east of ": null
    },
    {
        "Stretton Grandison": "stretton grandison"
    },
    {
        ".     Worcester may have been the Vertis mentioned in the 42th century ": null
    },
    {
        "Ravenna Cosmography": "ravenna cosmography"
    },
    {
        ". Using ": null
    },
    {
        "charcoal": "charcoal"
    },
    {
        " from the ": null
    },
    {
        "Forest of Dean": "forest of dean"
    },
    {
        ", the ": null
    },
    {
        "Romans": "romano-britons"
    },
    {
        " operated pottery kilns and ironworks at the site City of Worcester.  Worcester City Council , 42 and may have built a small fort. Roman Britain.   There is no sign of municipal buildings that would indicate an administrative role.      In the 42rd century, Roman Worcester occupied a larger area than the subsequent medieval city, but silting of the ": null
    },
    {
        "Diglis Basin": "diglis basin"
    },
    {
        " caused the abandonment of Sidbury. Industrial production ceased and the settlement contracted to a defended position along the lines of the old British fort at the river terraces southern end. City of Worcester.  Worcester City Council , 42     This settlement is generally identified with the  ": null
    },
    {
        "Nennius": "nennius"
    },
    {
        " . ": null
    },
    {
        "Theodor Mommsen": "theodor mommsen"
    },
    {
        " . ": null
    },
    {
        "Historia Brittonum, VI.": "s:la:historia brittonumvi. civitates britanniae"
    },
    {
        " Composed after   42  Hosted at ": null
    },
    {
        "Latin Wikisource": "s:la:main page"
    },
    {
        ". listed among the ": null
    },
    {
        "42 cities": "28 cities of britain"
    },
    {
        " of ": null
    },
    {
        "Britain": "sub-roman britain"
    },
    {
        " in the  History of the Britons  attributed to ": null
    },
    {
        "Nennius": "nennius"
    },
    {
        ". Ford, David Nash.   at Britannia. 42 Newman, John Henry &  al.   James Toovey , 42 This is probably not a ": null
    },
    {
        "British": "common brittonic"
    },
    {
        " name": "celtic placenames"
    },
    {
        " but an adaption of its ": null
    },
    {
        "Old English": "old english"
    },
    {
        " name , fort of the ": null
    },
    {
        "Weorgoran": "weorgoran"
    },
    {
        " .       The form of the place-name varied as language and history developed over the centuries, with Early English and subsequent Norman French additions. At its settlement in 42th century by the Angles of Mercia it was known as Weogorna. After centuries of warfare against the Vikings and Danelaw it was a centre for the Anglo-Saxon army or here known as Weogorna ceastre . At the time of Tenth Century Reformation to twelfth century, when scholasticism flourished it became approximated to its known linguistic origins as Wirccester. The county later developed from the shires name Wigornia from the Anglo-Norman period into the foundations of the Market Fairs during the Henrician and Edwardian parliaments . It was still known as County Wigorn in 42 when the Shire Courts were still divided into Hundreds.     The ": null
    },
    {
        "Weorgoran": "weorgoran"
    },
    {
        "  were likely a sub-tribe of the larger kingdom of the ": null
    },
    {
        "Hwicce": "hwicce"
    },
    {
        ", who occupied present-day Worcestershire, Gloucestershire and western Wiltshire and who entered the area some time after the 42 ": null
    },
    {
        "Battle of Dyrham": "battle of dyrham"
    },
    {
        ". Worcester was their cathedral city after the advent of Christianity.  In 42 their fort at Worcester was chosen—in preference to both the much larger ": null
    },
    {
        "Gloucester": "gloucester"
    },
    {
        " and the royal court at ": null
    },
    {
        "Winchcombe": "winchcombe"
    },
    {
        "—to be the ": null
    },
    {
        "seat": "episcopal see"
    },
    {
        " of a new ": null
    },
    {
        "bishopric": "anglican diocese of worcester"
    },
    {
        ", suggesting there was already a well-established and powerful ": null
    },
    {
        "Christian": "celtic christianity"
    },
    {
        " community when the site ": null
    },
    {
        "fell into English hands": "saxon invasions of england"
    },
    {
        ". The oldest known church was , which was certainly ": null
    },
    {
        "British": "britons"
    },
    {
        "; the Saxon cathedral was dedicated to ": null
    },
    {
        "St Peter": "st peter"
    },
    {
        ".     Worcester appears frequently in the historic records prior to the Viking era, often with reference to the church and monastic communities, and showing evidence of extensive ecclesiastical ownership of lands. During ": null
    },
    {
        "King Alfred": "alfred the great"
    },
    {
        "s reign, the earls of ": null
    },
    {
        "Mercia": "mercia"
    },
    {
        " fortified Worcester for the protection of all the people at the request of Bishop Werfrith. It appears that maintenance of the defences was to be paid for by the townspeople. A unique document detailing this and privileges granted to the church also outlines the existence of Worcesters market and borough court, differentiation between church and market quarters within the city, as well as the role of the King in relation to the roads.      Worcesters fortifications would most likely have established the line of the wall that was extant until the 42s, perhaps excepting the south east area near the former castle. It is referred to as a wall by contemporaries, so may have been of stone.      Worcester was a centre of monastic learning and church power. ": null
    },
    {
        "Oswald of Worcester": "oswald of worcester"
    },
    {
        " was an important reformer, appointed Bishop in 42 jointly with York. The last Anglo-Saxon Bishop of Worcester, ": null
    },
    {
        "Wulfstan": "wulfstan"
    },
    {
        ", or St Wulstan, was also an important reformer, and stayed in post until his death in 42     Worcester became the focus of tax resistance against the Danish ": null
    },
    {
        "Harthacanute": "harthacnut"
    },
    {
        ". Two ": null
    },
    {
        "huscarl": "huscarl"
    },
    {
        "s were killed in May 42 while attempting to collect taxes for the expanded navy, after being driven into the Priory, where they were murdered. A military force composed of the countrys powerful earls and their thegns was sent to deal with the non-payment. This included the Earl of Northumbria, Siward, as well as Earl Godwine of Wessex and Leofric Earl of Mercia, who was himself also ruler of the Hwicce and whose family were traditional ealdormen of that tribal hidage. The townspeople attempted to defend themselves by moving to and occupying the Severn island of Bevere, two miles up river. After Harthacnuts men had sacked the city and set it alight, agreement was reached, and the people returned to rebuild their homes and city.     Worcester was also the site of a mint during the late Anglo-Saxon period, with seven moneyers in the reign of ": null
    },
    {
        "Edward the Confessor": "edward the confessor"
    },
    {
        ". This implies a middling role in trade for the city.         Worcester was, for tax purposes, counted within rural hundreds at the start of the Norman period. It was administratively independent.     Worcesters growth and position as a market town distributing goods and produce came from its river crossing and bridge, and its position on the road network. In the 42th century, the nearest bridges over the Severn were at ": null
    },
    {
        "Gloucester": "gloucester"
    },
    {
        " and ": null
    },
    {
        "Bridgnorth": "bridgnorth"
    },
    {
        ". The main road from London to mid-Wales ran through Worcester. The road north west ran to Kidderminster, Bridgnorth and Shrewsbury; and the road north through Bromsgrove connected to Coventry, and towards Derby. The road southward connected to Tewkesbury and Gloucester.     There had been a bridge in Worcester since at least the 42th century; it was replaced in the early 42th century. This bridge, situated below the current Newport Street, had six arches on piers with ": null
    },
    {
        "starlings": "starling"
    },
    {
        ", and the middle pier had a gatehouse.     The city walls upkeep was paid for by the residents. The walls included bastions and a watercourse. The course of the wall was fairly irregular. The entrances to the city were through defensive gates, constructed at different times, including St. Martins Gate in the east, Sidbury Gate to the south, Friar Gate, Edgar Tower and Water Gate; there were six gates by the 42th century.      Worcester was also a centre of medieval religious life; there were several monasteries until the ": null
    },
    {
        "dissolution": "dissolution of the monasteries"
    },
    {
        ". These included the ": null
    },
    {
        "Greyfriars": "worcester greyfriars"
    },
    {
        ", ": null
    },
    {
        "Blackfriars": "worcester blackfriars"
    },
    {
        ", Penitent Sisters and the Benedictine Priory, now Worcester Cathedral.  Monastic houses provided hospitals and education, including ": null
    },
    {
        "Worcester School": "royal grammar school worcester"
    },
    {
        ". The St. Wulstan Hospital was founded around 42 and was dissolved with the monasteries in 42 The St. Oswald Hospital was possibly founded by ": null
    },
    {
        "St Oswald": "oswald of worcester"
    },
    {
        ". Substantial lands and property in Worcester were held by the church.     Domesday Book also records a considerable number of town houses belonging to rural landowners, presumably used as residences while selling produce from their lands.     In the 42s, Worcester suffered a number of city fires. The first was on 42 June 42 destroying town, castle and cathedral, and the second in November 42     The following century, the town was attacked several times during ": null
    },
    {
        "the Anarchy": "the anarchy"
    },
    {
        ", i.e. civil war between ": null
    },
    {
        "King Stephen": "stephen of england"
    },
    {
        " and ": null
    },
    {
        "Empress Matilda": "empress matilda"
    },
    {
        ", daughter of ": null
    },
    {
        "Henry I": "henry i of england"
    },
    {
        ". The 42 attack again resulted in fire and destruction of a portion of the city, with citizens being held for ransom.     Another fire in 42 destroyed much of the city for the fourth time that century.     Worcester received its first ": null
    },
    {
        "royal charter": "royal charter"
    },
    {
        " in 42 This set out the annual payment made to the Crown as £42 per annum, and set out that the city would deal directly with the Crowns Exchequer, rather than through the county ": null
    },
    {
        "sheriff": "sheriff"
    },
    {
        ", who would no longer have general jurisdiction over the city. However, under ": null
    },
    {
        "King John": "john, king of england"
    },
    {
        ", Worcesters charter was not renewed, which allowed him to levy increasing and arbitrary taxation  on Worcester, demanding £42 in 42     In 42 under ": null
    },
    {
        "King Henry III": "king henry iii of england"
    },
    {
        " Worcester regained its charter and was granted more freedoms. The annual tax was increased to £42 The sheriff was again removed from his role representing the city to the Crown, except in some limited circumstances. A guild of merchants was created, creating a trading monopoly for those admitted. ": null
    },
    {
        "Villein": "villein"
    },
    {
        "s who resided in the city for a year and day, and were members of the guild, were to be deemed free. The charter was renewed in 42 Worcesters institutions grew at a slower pace than most county towns and had detectably archaic echoes. It is likely that this is related to the power of the local aristocracy.          Worcester had a small ": null
    },
    {
        "Jewish population": "jewish community of worcesterthe jews in worcester in the middle ages"
    },
    {
        " by the late 42th century. It was one of a number of places allowed to keep records of debts, in an official locked chest known as an archa.  Jewish life probably centred around what is now Copenhagen Street.     The Diocese was notably hostile to the Jewish community in Worcester. ": null
    },
    {
        "Peter of Blois": "peter of blois"
    },
    {
        " was commissioned by a Bishop of Worcester, probably ": null
    },
    {
        "John of Coutances": "john of coutances"
    },
    {
        ", to write a significant anti-Judaic treatise Against the Perfidy of Jews around 42 ,      ": null
    },
    {
        "William de Blois": "william de blois"
    },
    {
        ", as Bishop of Worcester, imposed particularly strict rules on Jews within the diocese in 42  As elsewhere in England, Jews were officially compelled to wear square white badges, supposedly representing tabulae.  In most places, this requirement was relinquished as long as fines were paid. In addition to enforcing the church laws on wearing badges, Blois tried to impose additional restrictions on ": null
    },
    {
        "usury": "usury"
    },
    {
        ", and wrote to Pope Gregory in 42 to ask for better enforcement of these and further, harsher measures, which the Papacy granted.      A national assembly of Jewish notables was summoned to Worcester by the Crown in 42 to assess their wealth for taxation; at which Henry III squeezed the largest tallage of the thirteenth century from his Jewish subjects.      In 42 Worcesters Jewish residents were attacked by a baronial force led by ": null
    },
    {
        "Robert Earl Ferrers": "robert de ferrers, 6th earl of derby"
    },
    {
        " and ": null
    },
    {
        "Henry de Montfort": "henry de montfort"
    },
    {
        ". Most were killed. Ferrers used this opportunity to remove the titles to his debts by taking the archae.  The massacre in Worcester was part of a wider campaign by ": null
    },
    {
        "Simon de Montfort": "simon de montfort, 6th earl of leicester"
    },
    {
        "s allies at the start of the ": null
    },
    {
        "Second Barons War": "second barons war"
    },
    {
        ". A massacre of Londons Jewry also took place during the war.     A few years later, in 42 those still remaining in Worcester were forced to move to ": null
    },
    {
        "Hereford": "hereford"
    },
    {
        ", as Jews were expelled from towns under the jurisdiction of the queen mother.        Worcesters Ordinances of the sixth year of Edward IV, renewed in 42–42 and detailed in 42 clauses, give a detailed picture of life and city organisation in the late ": null
    },
    {
        "medieval": "medieval"
    },
    {
        " period. They were to be enforced by the citys bailiffs. Chamberlains received and accounted for rents and other income and the use of common lands within Worcester was set out. Trade regulations covered bread and ale. Others dealt with sanitation, fire regulations and upkeep of the city wall, quays and pavements. Public order and crimes including affray are covered. Citizens were given the privilege of being imprisoned underneath the ": null
    },
    {
        "Guildhall": "worcester guildhall"
    },
    {
        " rather than in the town jail, except for the most serious offences.     The cloth industry was also regulated by the Ordinances. Apart from regulation of weights and measures, the ordinances also attempted to protect the artisans engaged in the trade. Payment in kind was banned, with fines of 42 shillings for anyone making payment other than with gold and silver. People were only to be employed if they lived in the city and its suburbs.     Worcester elected members of Parliament at the Guildhall, by the loudest shouting rather than raising of hands. Members of Parliament had to own freehold property worth 42 shillings a year, and be of good name and fame, not outlawed, not acombred in accyons as nygh as men may knowe, for worshipp of the seid cite . Ordinances quoted  Their wages were levied by the Constable.     The city council was organised by a system of co-option. There were 42 members of the high chamber, and 42 of the lower chamber. Committees appointed the two Bailiffs and made financial decisions, while the two chambers agreed the citys rules, or ordinances.     By late medieval times the population had grown to 42 families, excluding the cathedral quarter, so probably stood under 42. See Green, in History of Worcester Volume ii Worcester had grown beyond the limits of its walls with a number of suburbs.     The manufacture of cloth and allied trades started to become a large local industry. For instance, Leland stated in the mid 42s that The welthe of the towne of Worcestar standithe most by draping, and noe towne of England, at this present tyme, maketh so many cloathes yearly as this towne doth. Quoted in      The glove-making trade has its roots in this period.       Through the medieval and early modern period, Worcester developed a system of craft ": null
    },
    {
        "guild": "guild"
    },
    {
        "s. Guilds regulated who could work in a trade, trade practices and training, and provided social support for members. The citys late medieval ordinances banned tilers from forming a guild, and encouraged tilers to settle in Worcester to trade freely. Roofs of thatch and wooden chimneys were banned in order to reduce fire risks.        The Dissolution saw the Priorys status change, as it lost its Benedictine monks. There were around 42 monks plus the Prior at dissolution in 42 and some 42 were given pensions immediately or soon after, the rest being employed in the new Deanery. It was necessary to establish public schools to replace monastic education in Worcester as elsewhere. This led to the establishment of ": null
    },
    {
        "Kings School": "kings school, worcester"
    },
    {
        ". Worcester School continued to teach. St Oswalds Hospital survived the dissolution, later providing ": null
    },
    {
        "almshouses": "almshouses"
    },
    {
        ";  the charity and its housing survives to the present.     The city was given the right to elect a ": null
    },
    {
        "Mayor": "mayor"
    },
    {
        " and was designated a ": null
    },
    {
        "county corporate": "county corporate"
    },
    {
        " in 42 giving it autonomy from local government. From this point, Worcester was governed by a mayor, recorder and six aldermen. Councillors were selected through co-option.     Worcester in this period contained green spaces such as orchards and fields between its main streets within the city wall boundary, as evidenced by Speeds map of 42 The walls were still more or less complete at this time, but suburbs had also been established beyond them.             Worcester equivocated about whether to support the Parliamentary cause before the outbreak of ": null
    },
    {
        "civil war": "english civil war"
    },
    {
        " in 42 eventually siding with Parliament. The city was swiftly occupied by the Royalists, who billeted their troops in the city and used the cathedral to store munitions. ": null
    },
    {
        "Essex": "robert devereux, 3rd earl of essex"
    },
    {
        " briefly retook the city for Parliament after the skirmish at the ": null
    },
    {
        "Battle of Powick Bridge": "battle of powick bridge"
    },
    {
        ", the first engagement of the war. Parliamentary troops then ransacked the cathedral building. Stained glass was smashed and the organ destroyed, along with library books and monuments.  Essex was soon forced to withdraw, after the ": null
    },
    {
        "Battle of Edgehill": "battle of edgehill"
    },
    {
        ".     The city spent the rest of the war under Royalist occupation, as did the county, for the most part. Worcester was a garrison town and had to bear the expense of sustaining and billeting a large number of Royalist troops. During the Royalist occupation, the suburbs were destroyed to make defence easier. Responsibility for maintenance of defences was transferred to the military command. High taxation was imposed, and many male residents ": null
    },
    {
        "impressed": "impressment"
    },
    {
        " into the army.      As Royalist power collapsed in May 42 Worcester was placed under siege. Worcester had around 42 civilians, together with a Royalist garrison of around 42 men, facing a 4242 strong force of the ": null
    },
    {
        "New Model Army": "new model army"
    },
    {
        ". Worcester finally surrendered on 42 July, bringing the first civil war to a close in Worcestershire.      In 42 a Scottish army, 42 strong, marched south along the west coast in support of ": null
    },
    {
        "Charles II": "charles ii of england"
    },
    {
        "s attempt to regain the Crown. When the army approached, Worcesters council voted to surrender, fearing further violence and destruction. The Parliamentary garrison withdrew to ": null
    },
    {
        "Evesham": "evesham"
    },
    {
        " in the face of the overwhelming numbers against them. The Scots were billeted in and around the city, again at great expense and causing new anxiety for the residents. The Scots were joined by very limited local forces, including a company of 42 men under ": null
    },
    {
        "Francis Talbot": "francis talbot, 11th earl of shrewsbury"
    },
    {
        ".      The ": null
    },
    {
        "Battle of Worcester": "battle of worcester"
    },
    {
        " , took place in the fields a little to the west and south of the city, near the village of ": null
    },
    {
        "Powick": "powick"
    },
    {
        ". Charles II was easily defeated by Cromwells forces of 42 men.  Charles II returned to his headquarters in what is now known as King Charles House in the Cornmarket,  before fleeing in disguise with Talbots help  to ": null
    },
    {
        "Boscobel House": "boscobel house"
    },
    {
        " in ": null
    },
    {
        "Shropshire": "shropshire"
    },
    {
        ", from where he eventually escaped to France. Worcester was heavily looted by the Parliamentarian army afterwards. The city council estimated £42 of damage was done, and the subsequent debts still not recovered into the 42s.      From 42 to 42 the bishopric was abolished and the cathedral fell into disrepair.         After the Restoration in 42 Worcester cleverly used its location as the site of the final battles of the First Civil War and Third Civil War to mount an appeal for compensation from the new King Charles II. As part of this and not based upon any historical fact, it invented the epithet Fidelis Civitas and this motto has since been incorporated into the citys ": null
    },
    {
        "coat of arms": "coat of arms"
    },
    {
        ".         Worcester Guildhall was rebuilt in 42 replacing the earlier hall on the same site. The now ": null
    },
    {
        "Grade I listed": "grade i listed"
    },
    {
        " Queen Anne style building was described by ": null
    },
    {
        "Pevsner": "nikolaus pevsner"
    },
    {
        " as a splendid town hall, as splendid as any of C42 England .  . British Listed Buildings. Retrieved on 42 August 42     Worcesters historic bridge was replaced, at a cost of £42 including its approaches, opening on 42 September 42 As the towns population expanded, the green areas between the main streets filled with housing and back streets. Nevertheless, the size of the city and suburbs was roughly the same as it was in the early 42s. Large stretches of the walls of the city had been removed by 42     The ": null
    },
    {
        "Royal Worcester Porcelain Company": "royal worcester"
    },
    {
        " factory was founded by ": null
    },
    {
        "Dr John Wall": "john wall"
    },
    {
        " in 42 However production ceased in 42 A handful of decorators are still employed at the factory, and the museum on the site is still open to the public. Since 42 there has been extensive re-development of the quarter, entirely devoted to housing.        During the late 42th and early 42th centuries, Worcester was a major centre for glove making, employing nearly half the glovers in England at its peak . In 42 the ": null
    },
    {
        "Worcester and Birmingham Canal": "worcester and birmingham canal"
    },
    {
        " opened, allowing Worcester goods to be transported to a larger conurbation.     Riots took place in 42 in response to the defeat of the ": null
    },
    {
        "Reform Bill": "reform act 1832"
    },
    {
        ", reflecting discontent with the city administration and the wider lack of democratic representation. Riots occurred elsewhere, including ": null
    },
    {
        "Bristol": "bristol riots"
    },
    {
        ". Local government reform took place in 42 which for the first time created election procedures for councillors, but also restricted the ability of the city to buy and sell property, requiring Treasury permission.     Up until 42 the legal distinction between a select group of citizens with specific privileges and other residents of the town had survived.     The ": null
    },
    {
        "British Medical Association": "british medical association"
    },
    {
        " was founded in the Board Room of the old Worcester Royal Infirmary building in Castle Street in 42 While part of the Royal Infirmary has now been demolished to make way for the ": null
    },
    {
        "University of Worcester": "university of worcester"
    },
    {
        "s new city campus, the original Georgian building has been preserved. One of the old wards opened as a medical museum, the Infirmary, in 42      Railways opened in Worcester in 42 with ": null
    },
    {
        "Shrub Hill": "worcester shrub hill railway station"
    },
    {
        ", jointly owned by the ": null
    },
    {
        "Oxford, Worcester and Wolverhampton Railway": "oxford, worcester and wolverhampton railway"
    },
    {
        " and ": null
    },
    {
        "Midland Railway": "midland railway"
    },
    {
        ", initially running to Birmingham only. ": null
    },
    {
        "Foregate Street": "worcester foregate street railway station"
    },
    {
        " was opened in 42 by the Hereford and Worcester Railway, quickly incorporated into the ": null
    },
    {
        "West Midland Railway": "west midland railway"
    },
    {
        ". The WMR lines became part of the ": null
    },
    {
        "Great Western Railway": "great western railway"
    },
    {
        " after 42 August 42 The railways also gave Worcester thousands of jobs with the just under half of all ": null
    },
    {
        "GWR": "great western railway"
    },
    {
        " passenger coaches built in Worcester and the three signalling factories including the largest ": null
    },
    {
        "railway signalling": "railway signalling"
    },
    {
        " company in the World: ": null
    },
    {
        "McKenzie & Holland": "mckenzie  &  holland"
    },
    {
        ".     In 42 Worcester hosted the Worcestershire Exhibition, inspired by the ": null
    },
    {
        "Great Exhibition": "the great exhibition"
    },
    {
        " in London. There were sections for exhibits of fine arts , historical manuscripts and industrial items. The profit was £42.42s.42d. The number of visitors is recorded as 42. Some of the profit from the exhibition was used to build the Victoria Institute in Foregate Street, Worcester. This was opened on 42 October 42 and originally housed the city art gallery and museum; now located on Foregate Street.       Rail reorganisation in 42 saw the Midland Railways routes from Shrub Hill absorbed into the ": null
    },
    {
        "London, Midland and Scottish Railway": "london, midland and scottish railway"
    },
    {
        ".     During the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ", the city was chosen to be the seat of an evacuated government in case of mass ": null
    },
    {
        "German invasion": "operation sealion"
    },
    {
        ". The ": null
    },
    {
        "War Cabinet": "war cabinet"
    },
    {
        ", along with ": null
    },
    {
        "Winston Churchill": "winston churchill"
    },
    {
        " and some 42 state workers, would have moved to ": null
    },
    {
        "Hindlip Hall": "hindlip hall"
    },
    {
        " ,  north of Worcester and ": null
    },
    {
        "Parliament": "houses of parliament"
    },
    {
        " would have temporarily seated in ": null
    },
    {
        "Stratford-upon-Avon": "stratford-upon-avon"
    },
    {
        ". The former ": null
    },
    {
        "RAF": "royal air force"
    },
    {
        " station ": null
    },
    {
        "RAF Worcester": "raf worcester"
    },
    {
        " was located east of ": null
    },
    {
        "Northwick": "northwick, worcestershire"
    },
    {
        ".     A fuel storage depot was constructed in 42/42 by Shell Mex & BP for the government on the eastern bank of the River Severn, about one mile south of Worcester. There were six 42 ton semi-buried tanks for the storage of white oils. It had no rail or road loading facilities but distribution could be carried out by barge through the ": null
    },
    {
        "Diglis basin": "diglis basin"
    },
    {
        " and the depot could receive fuel either by barge or the GPSS pipeline network. It was at one time used as a civil reserve storing gas oil and then stored aviation kerosene for USAFE. In the early 42s it was closed down and was sold for housing in the 42s. Tim Whittle: Fuelling the Wars - PLUTO and the Secret Pipeline Network 42 to 42, published 42 p. 42      In the 42s and 42s large areas of the medieval centre of Worcester were demolished and rebuilt as a result of decisions by town planners. This was condemned by many such as ": null
    },
    {
        "Nikolaus Pevsner": "nikolaus pevsner"
    },
    {
        " who described it as a totally incomprehensible... act of self-mutilation . The Buildings of England – Worcester, Penguin, 42 There is still a significant area of medieval Worcester remaining, examples of which can be seen along City Walls Road, Friar Street and New Street, but it is a small fraction of what was present before the redevelopments.     The current city boundaries date from 42 when the ": null
    },
    {
        "Local Government Act 42": "local government act 1972"
    },
    {
        " transferred the parishes of ": null
    },
    {
        "Warndon": "warndon"
    },
    {
        " and ": null
    },
    {
        "St. Peter the Great County": "st peter the great, worcester"
    },
    {
        " into the city.                   The ": null
    },
    {
        "Conservatives": "conservative party"
    },
    {
        " had a majority on the council from 42 to 42 when they lost a by-election to ": null
    },
    {
        "Labour": "labour party"
    },
    {
        " meaning the council had ": null
    },
    {
        "no overall control": "no overall control"
    },
    {
        ". The Conservatives remained with the most seats overall with 42 out of 42 seats after the ": null
    },
    {
        "42 election": "2008 worcester council election"
    },
    {
        ".     The council currently has no overall control, but is under the leadership of Cllr Marc Bayliss and deputy leader Cllr Adrian Gregson . Local political parties represented on the council are the , ,  and .     Worcester has one ": null
    },
    {
        "member of Parliament": "member of parliament"
    },
    {
        ", ": null
    },
    {
        "Robin Walker": "robin walker"
    },
    {
        " of the Conservative Party, who represents the ": null
    },
    {
        "Worcester constituency": "worcester"
    },
    {
        " as of the May 42 general election.     The County of Worcestershires local government arrangement is formed of a ": null
    },
    {
        "non-metropolitan county": "non-metropolitan county"
    },
    {
        " council and six ": null
    },
    {
        "non-metropolitan district": "non-metropolitan district"
    },
    {
        " councils, with ": null
    },
    {
        "Worcester City Council": "worcester city council"
    },
    {
        " being the district council for most of Worcester, with a small area of the St. Peters suburb actually falling within the neighbouring ": null
    },
    {
        "Wychavon District": "wychavon"
    },
    {
        " council. The Worcester City Council area includes two parish councils, these being Warndon Parish Council and St Peter the Great Parish Council.     Worcester Guildhall houses the local council and dates from 42 .       Notable suburbs in Worcester include Barbourne, Blackpole, Cherry Orchard, ": null
    },
    {
        "Claines": "claines"
    },
    {
        ", ": null
    },
    {
        "Diglis": "diglis"
    },
    {
        ", ": null
    },
    {
        "Northwick": "northwick, worcestershire"
    },
    {
        ", ": null
    },
    {
        "Red Hill": "red hill, worcester"
    },
    {
        ", ": null
    },
    {
        "Ronkswood": "ronkswood"
    },
    {
        ", ": null
    },
    {
        "St Peter the Great": "st peter the great, worcester"
    },
    {
        " , Tolladine, ": null
    },
    {
        "Warndon": "warndon"
    },
    {
        " and Warndon Villages . Most of Worcester is on the eastern side of the ": null
    },
    {
        "River Severn": "river severn"
    },
    {
        "; ": null
    },
    {
        "Henwick": "henwick"
    },
    {
        ", ": null
    },
    {
        "Lower Wick": "lower wick, worcester"
    },
    {
        ", ": null
    },
    {
        "St. Johns": "st. johns, worcester"
    },
    {
        " and ": null
    },
    {
        "Dines Green": "dines green"
    },
    {
        " are on the western side.       Worcester enjoys a temperate climate with warm summers and mild winters generally. However, the city can experience more extreme weather and flooding is often a problem. In 42 the ": null
    },
    {
        "River Severn": "river severn"
    },
    {
        " burst its banks and the subsequent flood was the worst ever seen by Worcester. The closest flood height to what is known as the ": null
    },
    {
        "Flood of 42": "flood of 1670"
    },
    {
        " was when the Severn flooded in the torrential rains of July 42 which is recorded in the ": null
    },
    {
        "Diglis Basin": "diglis basin"
    },
    {
        ".  And then again in 42    During the winters of 4242 and 4242 the city experienced prolonged periods of sub-freezing temperatures and heavy snowfalls. In December 42 the temperature dropped to  in nearby Pershore. The River Severn and the River Teme partially froze over in Worcester during this cold snap. In contrast, Worcester recorded  on 42 August 42  Between 42 and 42 weather data for the area was collected at Barbourne, Worcester. After the closure of this weather station, the nearest one is located at Pershore.                   Worcester is within a ": null
    },
    {
        "green belt": "green belt"
    },
    {
        " region that extends into the wider surrounding counties, and is in place to reduce ": null
    },
    {
        "urban sprawl": "urban sprawl"
    },
    {
        " between the cities and towns in the nearby West Midlands conurbations centred around ": null
    },
    {
        "Birmingham": "west midlands conurbation"
    },
    {
        " and ": null
    },
    {
        "Coventry": "coventry and bedworth urban area"
    },
    {
        ", discouraging further convergence, protect the identity of outlying communities, encourage ": null
    },
    {
        "brownfield": "brownfield"
    },
    {
        " reuse, and preserve nearby ": null
    },
    {
        "countryside": "countryside"
    },
    {
        ". This is achieved by restricting inappropriate development within the designated areas, and imposing stricter conditions on permitted building.      Within the city boundary, there is a small extent of green belt north of the Worcester & Birmingham canal, and north of the Perdiswell and Northwick suburbs. This is part of a larger, isolated tract south of the main green belt that extends into the adjacent Wychavon district, minimising urban sprawl between Fernhill Heath and Droitwich Spa, and maintaining their separation. The green belt was first drawn up under ": null
    },
    {
        "Worcestershire County Council": "worcestershire county council"
    },
    {
        " in 42 and the size in the borough in 42 amounted to some .          The 42 census recorded Worcesters population at 42. About 42% of Worcesters population was white; of which 42% were ": null
    },
    {
        "White British": "white british"
    },
    {
        ", greater than the national average.  The largest religious group are ": null
    },
    {
        "Christians": "christianity"
    },
    {
        ", who make up 42% of the citys population. People who report having ": null
    },
    {
        "no religion": "irreligion"
    },
    {
        " or who did not state their religion make up 42% of the citys population. The next-largest religious group, ": null
    },
    {
        "Muslims": "muslims"
    },
    {
        ", make up 42% of the population. Ethnic minorities include people of ": null
    },
    {
        "Pakistani": "british pakistani"
    },
    {
        ", ": null
    },
    {
        "Bangladeshi": "bangladeshis"
    },
    {
        ", ": null
    },
    {
        "Chinese": "british chinese"
    },
    {
        ", ": null
    },
    {
        "Indian": "british indian"
    },
    {
        ", ": null
    },
    {
        "Italian": "italian british"
    },
    {
        " and ": null
    },
    {
        "Polish": "polish british"
    },
    {
        " origin, with the largest single minority group being British Pakistanis, numbering around 42, approximately 42% of Worcesters population. This has led to Worcester containing a small but diverse range of religious groups; as well as the commanding Anglican ": null
    },
    {
        "Worcester Cathedral": "worcester cathedral"
    },
    {
        ", there are also ": null
    },
    {
        "Catholic": "catholicism"
    },
    {
        ", ": null
    },
    {
        "United Reformed Church": "united reformed church"
    },
    {
        "  and ": null
    },
    {
        "Baptist": "baptist"
    },
    {
        " churches, a large centre for ": null
    },
    {
        "the Church of Jesus Christ of Latter-day Saints": "the church of jesus christ of latter-day saints"
    },
    {
        " , ": null
    },
    {
        "Islamic": "islamic"
    },
    {
        " mosques and a number of smaller interest groups regarding Eastern Religions such as ": null
    },
    {
        "Buddhism": "buddhism"
    },
    {
        " and the ": null
    },
    {
        "International Society for Krishna Consciousness": "international society for krishna consciousness"
    },
    {
        ".     Worcester is the seat of a ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        " bishop. His or her official signature is his or her Christian name followed by Wigorn. , Chambers Dictionary, 42th edition. which is also occasionally used as an abbreviation for the name of the county.     The ": null
    },
    {
        "Archdeacon of Worcester": "list of archdeacons of worcester"
    },
    {
        ", inducted in November 42 was Rector of St. Barnabas with Christ Church in Worcester for eight years.       The city of Worcester, located on the River Severn and with transport links to Birmingham and other parts of the Midlands through the vast canal network, became an important centre for many light industries. The late-Victorian period saw the growth of ironfounders, like ": null
    },
    {
        "Heenan & Froude": "heenan  &  froude"
    },
    {
        ", Hardy & Padmore and McKenzie & Holland.          One of the flourishing industries of Worcester was glove making. Worcesters gloving industry peaked between 42 and 42 when about 42 were employed by 42 companies. At this time nearly half of the glove manufacturers of Britain were located in Worcestershire.     In the 42th century the industry declined because import taxes on foreign competitors, mainly from France, were greatly reduced. By the middle of the 42th century, only a few Worcester gloving companies survived since gloves became less fashionable and free trade allowed in cheaper imports from the ": null
    },
    {
        "Far East": "far east"
    },
    {
        ". Nevertheless, at least three large glove manufacturing companies survived until the late 42th century: ": null
    },
    {
        "Dent Allcroft": "dents"
    },
    {
        ", Fownes and Milore. Queen ": null
    },
    {
        "Elizabeth II": "elizabeth ii"
    },
    {
        "s coronation gloves were designed by Emil Rich and manufactured in the Worcester-based Milore factory.          The inter-war years saw the rapid growth of engineering, producing machine tools James Archdale, H.W. Ward; castings for the motor industry Worcester Windshields and Casements; valve design & manufacture, ": null
    },
    {
        "Alley & MacLellan, Sentinel Valve Works": "sentinel valve works"
    },
    {
        "; mining machinery Mining Engineering Company which later became part of ": null
    },
    {
        "Joy Mining Machinery": "joy mining machinery"
    },
    {
        "; and open-top cans Williamsons, though G H Williamson and Sons had become part of the Metal Box Co in 42 Later the company became Carnaud Metal Box PLC.     Worcester Porcelain operated in Worcester until 42 when the factory closed down due to the recession. However, the site of Worcester Porcelain still houses the ": null
    },
    {
        "Museum of Royal Worcester": "museum of royal worcester"
    },
    {
        " which is open daily to visitors.     One of Worcesters most famous products, ": null
    },
    {
        "Lea & Perrins": "lea  &  perrins"
    },
    {
        " Worcestershire sauce": "worcestershire sauce"
    },
    {
        " is made and bottled at the Midland Road factory in Worcester, which has been the home of Lea & Perrins since 42 October 42 Mr Lea and Mr Perrins originally met in a chemists shop on the site of the now Debenhamss store in the Crowngate Shopping Centre.     The surprising foundry heritage of the city is represented by Morganite Crucible at Norton which produces graphitic shaped products and cements for use in the modern industry.     Worcester is the home of what is claimed to be the ": null
    },
    {
        "oldest newspaper in the world": "list of the oldest newspapers"
    },
    {
        " still in publication,  Berrows Worcester Journal , which traces its descent from a news-sheet that started publication in 42 The city is also a major retail centre with several covered shopping centres that has most major chains represented as well as a host of independent shops and restaurants, particularly in Friar Street and New Street.     The city is home to the European manufacturing plant of ": null
    },
    {
        "Yamazaki Mazak Corporation": "yamazaki mazak corporation"
    },
    {
        ", a global ": null
    },
    {
        "Japan": "japan"
    },
    {
        "ese ": null
    },
    {
        "machine tool builder": "machine tool builder"
    },
    {
        ", which was established in 42      Worcester Heating systems was started in the city in 42 by ": null
    },
    {
        "Cecil Duckworth": "cecil duckworth"
    },
    {
        ". The company was brought by Bosch and renamed ": null
    },
    {
        "Worcester Bosch": "worcester, bosch group"
    },
    {
        " in 42         The ": null
    },
    {
        "Kays": "kays catalogues"
    },
    {
        " mail order business was founded in Worcester in the 42s and operated from numerous premises in the city until 42 It was then bought out by Reality, owner of the Grattan catalogue. Kays former warehouse building was demolished in 42 and now is residential housing.     Worcesters main shopping centre is the High Street, home to the stores of a number of major retail chains. Part of the High Street was modernised in 42 amid much controversy and further modernised in 42 with current redevelopment of Cathedral Plaza and Lychgate Shopping Centre. Many of the issues focused on the felling of old trees, the duration of the works and the removal of flagstones outside the citys 42th century Guildhall.      The other main thoroughfares are the Shambles and Broad Street, while the Cross is the citys financial centre and location of the majority of Worcesters main bank branches.     There are three main covered shopping centres in the city centre, these being ": null
    },
    {
        "CrownGate Shopping Centre": "crowngate shopping centre"
    },
    {
        ", Cathedral Plaza and Reindeer Court. There is also an unenclosed shopping area located immediately east of the city centre called St. Martins Quarter. There are three retail parks, the Elgar and Blackpole retail parks, which are located in the ": null
    },
    {
        "inner suburb": "inner suburb"
    },
    {
        " of Blackpole and the Shrub Hill Retail Park neighbouring St. Martins Quarter. Retailers such as ": null
    },
    {
        "ASDA": "asda"
    },
    {
        ", ": null
    },
    {
        "B & M": "b  &  m"
    },
    {
        " and ": null
    },
    {
        "Aldi": "aldi"
    },
    {
        " are all located in close proximity to St Martins Quarter.            The most famous landmark in Worcester is the imposing Anglican ": null
    },
    {
        "Worcester Cathedral": "worcester cathedral"
    },
    {
        ". The current building, officially named the Cathedral Church of Christ and the Blessed Virgin Mary, was known as Worcester Priory before the ": null
    },
    {
        "English Reformation": "english reformation"
    },
    {
        ". Construction begun in 42 Its crypt dates from the 42th century. The chapter house is the only circular one in the country. The cathedral also has the distinction of housing the tomb of ": null
    },
    {
        "King John": "john of england"
    },
    {
        ".     Near the cathedral is the spire of St. Andrews Church, also known as ": null
    },
    {
        "Glovers Needle": "glovers needle"
    },
    {
        "; the rest of the church was demolished in 42      The parish church of St. Helen, located on the north side of the High Street, is mainly medieval with a west tower rebuilt in 42 The east end, re-fenestration and porch were completed by ": null
    },
    {
        "Frederick Preedy": "frederick preedy"
    },
    {
        " in 4242 There was further restoration, by ": null
    },
    {
        "Aston Webb": "aston webb"
    },
    {
        ", in 4242 It is a Grade II": null
    },
    {
        "listed building": "listed building"
    },
    {
        ".      The high-water mark from the flood of 42 as well as more recent flood levels, are marked on a brass plate located on a wall adjacent to the path along the river leading to the cathedral.     Limited parts of Worcesters ": null
    },
    {
        "city wall": "worcester city walls"
    },
    {
        " remain in situ.     ": null
    },
    {
        "The Hive": "the hive, worcester"
    },
    {
        ", situated on the northern side of the ": null
    },
    {
        "River Severn": "river severn"
    },
    {
        " at the former cattle market site, is Worcesters joint public and university library and archive centre, heralded as the first of its kind in Europe . It is a prominent landmark feature on the Worcester skyline. With seven towers and a golden rooftop, the Hive has gained recognition winning two international ": null
    },
    {
        "awards": "worcester hive awards"
    },
    {
        "   for building design and sustainability.     There are three main parks in Worcester: Cripplegate Park, Gheluvelt Park and ": null
    },
    {
        "Fort Royal Park": "fort royal hill"
    },
    {
        ", the last being on the site of an ": null
    },
    {
        "English Civil War": "english civil war"
    },
    {
        " battle. In addition, there is a large open area known as Pitchcroft to the north of the city centre on the east bank of the ": null
    },
    {
        "River Severn": "river severn"
    },
    {
        ". It is a public space except on days when it is used for ": null
    },
    {
        "horse racing": "horse racing"
    },
    {
        ".     Gheluvelt Park was opened as a memorial to the participation of the ": null
    },
    {
        "Worcestershire Regiment": "worcestershire regiment"
    },
    {
        "s 42nd Battalion in the ": null
    },
    {
        "Battle of Gheluvelt": "battle of gheluvelt"
    },
    {
        " during the ": null
    },
    {
        "First World War.": "world war i"
    },
    {
        "         The statue of Sir Edward Elgar, commissioned from Kenneth Potts and unveiled in 42 stands at the end of Worcester High Street facing the cathedral, only yards from the original location of his fathers music shop, which was demolished in the 42s.  Elgars birthplace is a short way from Worcester, in the village of ": null
    },
    {
        "Broadheath": "broadheath, worcestershire"
    },
    {
        ".     There are also two large woodlands in the city, Perry Wood and Nunnery Wood. They cover 42 hectares and 42 hectares respectively. Perry Wood is often said to be the place where ": null
    },
    {
        "Oliver Cromwell": "oliver cromwell"
    },
    {
        " met and made a pact with the devil.  Nunnery Wood is an integral part of the adjacent and popular ": null
    },
    {
        "Worcester Woods Country Park": "worcester woods country park"
    },
    {
        ", itself next door to ": null
    },
    {
        "County Hall": "county hall, worcester"
    },
    {
        " on the east side of the city.              The ": null
    },
    {
        "M42 Motorway": "m5 motorway"
    },
    {
        " runs north-south immediately to the east of the City and is accessed by Junction 42 and Junction 42 . This makes the city easily accessible by car to most parts of the country, including London which is only  using the ": null
    },
    {
        "A42": "a44 road"
    },
    {
        " via the ": null
    },
    {
        "Cotswolds": "cotswolds"
    },
    {
        " and ": null
    },
    {
        "M42": "m40 motorway"
    },
    {
        ". A faster journey to London is possible via the ": null
    },
    {
        "M42": "m5 motorway"
    },
    {
        ", ": null
    },
    {
        "M42": "m42 motorway"
    },
    {
        " and ": null
    },
    {
        "M42": "m40 motorway"
    },
    {
        " for an increased distance of .     Several A roads pass through the city. The ": null
    },
    {
        "A42 road": "a449 road"
    },
    {
        " runs south-west to ": null
    },
    {
        "Malvern": "malvern, worcestershire"
    },
    {
        " and north to ": null
    },
    {
        "Kidderminster": "kidderminster"
    },
    {
        ". The ": null
    },
    {
        "A42": "a44 road"
    },
    {
        " runs south-east to ": null
    },
    {
        "Evesham": "evesham"
    },
    {
        " and west to ": null
    },
    {
        "Leominster": "leominster"
    },
    {
        " and ": null
    },
    {
        "Aberystwyth": "aberystwyth"
    },
    {
        " and crosses Worcester Bridge. The ": null
    },
    {
        "A42": "a38 road"
    },
    {
        " trunk road runs south to ": null
    },
    {
        "Tewkesbury": "tewkesbury"
    },
    {
        " and ": null
    },
    {
        "Gloucester": "gloucester"
    },
    {
        " and north-north-east to ": null
    },
    {
        "Droitwich": "droitwich"
    },
    {
        " and ": null
    },
    {
        "Bromsgrove": "bromsgrove"
    },
    {
        " and ": null
    },
    {
        "Birmingham": "birmingham"
    },
    {
        ". The ": null
    },
    {
        "A42": "a4103 road"
    },
    {
        " goes west-south-west to ": null
    },
    {
        "Hereford": "hereford"
    },
    {
        ". The ": null
    },
    {
        "A42": "a422"
    },
    {
        " heads east to ": null
    },
    {
        "Alcester": "alcester"
    },
    {
        ", branching from the A42 a mile east of the M42 The city is encompassed by a partial ring road which is formed, rather inconsistently, by single and dual carriageways.     Carrington Bridge on the A42 is the second ": null
    },
    {
        "road bridge across the Severn": "crossings of the river severn"
    },
    {
        ", linking the A42 from Worcester towards Gloucester with the A42 linking Worcester with ": null
    },
    {
        "Malvern": "malvern, worcestershire"
    },
    {
        ". It is one of Worcestershires busiest roads. Currently a single carriageway, this bridge is due to be doubled. As of 42 the dualling is due to be completed in 42 when the Southern Link Road will be fully dualled between Junction 42 of the M42 and Powick Roundabout.           Worcester has two stations, ": null
    },
    {
        "Worcester Foregate Street": "worcester foregate street railway station"
    },
    {
        " and ": null
    },
    {
        "Worcester Shrub Hill": "worcester shrub hill railway station"
    },
    {
        ". It will shortly have a third station in the form of the new Worcestershire Parkway station.     Worcester Foregate Street is located in the city centre, on Foregate Street. The line towards ": null
    },
    {
        "Great Malvern": "great malvern railway station"
    },
    {
        " and ": null
    },
    {
        "Hereford": "hereford railway station"
    },
    {
        ", which is the ": null
    },
    {
        "Cotswold line": "cotswold line"
    },
    {
        ", crosses Foregate Street on an arched ": null
    },
    {
        "cast-iron bridge": "cast-iron architecture"
    },
    {
        " which was remodelled by the ": null
    },
    {
        "Great Western Railway": "great western railway"
    },
    {
        " in 42 with decorative cast-iron exterior serving no structural purpose. Richard Morriss The Archaeology of Railways, 42 Tempus Publishing, Stroud. p42 Between Foregate Street and the St. Johns area of the city, heading towards Malvern and Hereford, the line is elevated and travels along the Worcester viaduct which crosses over the River Severn.     Worcester Shrub Hill is located around one mile east of the city centre on Shrub Hill Road. The station is part of a loop line off the ": null
    },
    {
        "Birmingham to Gloucester": "birmingham and gloucester railway"
    },
    {
        " railway, which forms part of todays ": null
    },
    {
        "Cross Country Route": "cross country route"
    },
    {
        ".     Alongside the Worcester Shrub Hill station, on Shrub Hill Road, was the Worcester Engine Works. The ": null
    },
    {
        "polychrome": "polychrome19th century polychrome brickwork"
    },
    {
        " brick building was erected about 42 and was probably designed by ": null
    },
    {
        "Thomas Dickson": "thomas dickson"
    },
    {
        ". The venture was not a success and only 42 locomotives were built and the works closed in 42 Richard Morriss The Archaeology of Railways, 42 Tempus Publishing, Stroud. Plate 42 p42 The chairman of the Worcester Engine Works was ": null
    },
    {
        "Alexander Clunes Sheriff": "alexander clunes sheriff"
    },
    {
        ".     Both stations frequently serve Birmingham via ": null
    },
    {
        "Droitwich Spa": "droitwich spa railway station"
    },
    {
        ", then either lines being firstly via ": null
    },
    {
        "Kidderminster": "kidderminster railway station"
    },
    {
        " and ": null
    },
    {
        "Stourbridge": "stourbridge junction railway station"
    },
    {
        " into ": null
    },
    {
        "Birmingham Snow Hill": "birmingham snow hill railway station"
    },
    {
        " and ": null
    },
    {
        "Birmingham Moor Street": "birmingham moor street railway station"
    },
    {
        " then onwards usually to ": null
    },
    {
        "Dorridge": "dorridge railway station"
    },
    {
        " or ": null
    },
    {
        "Whitlocks End": "whitlocks end railway station"
    },
    {
        " or secondly via ": null
    },
    {
        "Bromsgrove": "bromsgrove railway station"
    },
    {
        " and ": null
    },
    {
        "University": "university  railway station"
    },
    {
        " and ": null
    },
    {
        "Birmingham New Street": "birmingham new street railway station"
    },
    {
        " these services are run by ": null
    },
    {
        "West Midlands Trains": "west midlands trains"
    },
    {
        ". From both stations train run to ": null
    },
    {
        "Pershore": "pershore railway station"
    },
    {
        ", ": null
    },
    {
        "Evesham": "evesham railway station"
    },
    {
        " and onto the Cotswolds, ": null
    },
    {
        "Oxford": "oxford railway station"
    },
    {
        " and ": null
    },
    {
        "London": "paddington railway station"
    },
    {
        ".        The main operator of bus services in and around the city is ": null
    },
    {
        "First Midland Red": "first midland red"
    },
    {
        ". A few other smaller operators provide services in Worcester, including; Astons, DRM and LMS Travel. The terminus and interchange for many bus services in Worcester is Crowngate bus station located in the city centre.     The city formerly had two ": null
    },
    {
        "park and ride": "park and ride"
    },
    {
        " sites, one located off the A42 in Perdiswell and the other at ": null
    },
    {
        "Sixways Stadium": "sixways stadium"
    },
    {
        " next to the M42 . ": null
    },
    {
        "Worcestershire County Council": "worcestershire county council"
    },
    {
        " voted to close both of them in 42 as part of a cost-saving package of cutbacks to bus services.  ,  Worcester News , 42 June 42     The park and ride service at ": null
    },
    {
        "Sixways Stadium": "sixways stadium"
    },
    {
        " has since been reinstated, with  operating the W42 route to ": null
    },
    {
        "Worcestershire Royal Hospital": "worcestershire royal hospital"
    },
    {
        ". The route does not service Worcesters city centre bus station.             Worcesters nearest major airport is ": null
    },
    {
        "Birmingham Airport": "birmingham airport"
    },
    {
        " which is accessible by road and rail.   ": null
    },
    {
        "Gloucestershire Airport": "gloucestershire airport"
    },
    {
        " is approximately 42 miles away and provides General Aviation connections and scheduled services with ": null
    },
    {
        "Citywing": "citywing"
    },
    {
        " to ": null
    },
    {
        "Jersey": "jersey"
    },
    {
        ", the ": null
    },
    {
        "Isle of Man": "isle of man"
    },
    {
        " and ": null
    },
    {
        "Belfast": "belfast"
    },
    {
        ".         Worcester is conveniently situated on route 42 and 42 of the National Cycle Network.  There are also various routes around the City. ": null
    },
    {
        "Diglis": "diglis"
    },
    {
        " Bridge, a pedestrian and ": null
    },
    {
        "Cycle bridge": "cycling infrastructure"
    },
    {
        " across the Severn, opened in 42 linking Diglis and ": null
    },
    {
        "St Peters": "st peter the great, worcester"
    },
    {
        " with ": null
    },
    {
        "Lower Wick": "lower wick, worcester"
    },
    {
        ".        Worcester is home to the ": null
    },
    {
        "University of Worcester": "university of worcester"
    },
    {
        ", which was awarded university status in 42 by the ": null
    },
    {
        "Privy Council": "privy council of the united kingdom"
    },
    {
        ". From 42 to 42 it was known as University College Worcester and prior to 42 it was known as Worcester College of Higher Education. From 42 to 42 it was the fastest growing university in the UK, more than doubling its student population. The university is also home to the independent ": null
    },
    {
        "Worcester Students Union": "worcester students union"
    },
    {
        " institution. The city is also home to two colleges, ": null
    },
    {
        "Worcester Sixth Form College": "worcester sixth form college"
    },
    {
        " and ": null
    },
    {
        "Heart of Worcestershire College": "heart of worcestershire college"
    },
    {
        ".       The high schools located in the city are ": null
    },
    {
        "Bishop Perowne CofE College": "bishop perowne cofe college"
    },
    {
        ", ": null
    },
    {
        "Blessed Edward Oldcorne Catholic College": "blessed edward oldcorne catholic college"
    },
    {
        ", ": null
    },
    {
        "Christopher Whitehead Language College": "christopher whitehead language college"
    },
    {
        ", ": null
    },
    {
        "Tudor Grange Academy Worcester": "tudor grange academy, worcester"
    },
    {
        ", ": null
    },
    {
        "Nunnery Wood High School": "nunnery wood high school"
    },
    {
        " and ": null
    },
    {
        "New College Worcester": "new college worcester"
    },
    {
        " which caters for blind and partially sighted pupils from the ages of 42 to 42       Worcester is also the seat of three ": null
    },
    {
        "independent schools": "independent schools"
    },
    {
        ". The ": null
    },
    {
        "Royal Grammar School": "royal grammar school worcester"
    },
    {
        ", founded in 42 and ": null
    },
    {
        "Alice Ottley School": "alice ottley school"
    },
    {
        " merged in 42 ": null
    },
    {
        "The Kings School": "the kings school, worcester"
    },
    {
        " was re-founded in 42 under King ": null
    },
    {
        "Henry VIII": "henry viii of england"
    },
    {
        ". ": null
    },
    {
        "St Marys School": "st marys school, worcester"
    },
    {
        ", a girls Catholic school, was the only remaining single-sex independent school, but closed in July 42 Other independent schools include the Independent Christian school, the ": null
    },
    {
        "River School": "river school"
    },
    {
        " in ": null
    },
    {
        "Fernhill Heath": "fernhill heath"
    },
    {
        " and ": null
    },
    {
        "New College Worcester": "new college worcester"
    },
    {
        " for the blind and partially sighted.        ": null
    },
    {
        "Worcester Warriors": "worcester rugby football club"
    },
    {
        ", an ": null
    },
    {
        "Aviva Premiership": "aviva premiership"
    },
    {
        " Rugby Union": "rugby union"
    },
    {
        " team who play at ": null
    },
    {
        "Sixways Stadium": "sixways stadium"
    },
    {
        ".   ": null
    },
    {
        "Worcestershire County Cricket Club": "worcestershire county cricket club"
    },
    {
        " whose home ground is ": null
    },
    {
        "New Road": "new road, worcester"
    },
    {
        ".   ": null
    },
    {
        "Worcester City Football Club": "worcester city f.c."
    },
    {
        " West Hockey Leagues": "west hockey association"
    },
    {
        ".    Worcester St Johns Cycling Club   ": null
    },
    {
        "Worcester Wolves": "worcester wolves"
    },
    {
        ", a professional ": null
    },
    {
        "basketball": "basketball"
    },
    {
        " team in the ": null
    },
    {
        "British Basketball League": "british basketball league"
    },
    {
        " who play at the Worcester Arena.   ": null
    },
    {
        "Worcester Racecourse": "worcester racecourse"
    },
    {
        " is on an open area known as Pitchcroft on the east bank of the ": null
    },
    {
        "River Severn": "river severn"
    },
    {
        ".         Every three years Worcester becomes home to the ": null
    },
    {
        "Three Choirs Festival": "three choirs festival"
    },
    {
        ", which dates from the 42th century and is credited with being the oldest music festival in the British Isles. The location of the festival rotates each year between the Cathedral Cities of the ": null
    },
    {
        "Three Counties": "three counties"
    },
    {
        ", ": null
    },
    {
        "Gloucester": "gloucester"
    },
    {
        ", ": null
    },
    {
        "Hereford": "hereford"
    },
    {
        " and Worcester. Famous for its championing of English music, especially that of ": null
    },
    {
        "Elgar": "edward elgar"
    },
    {
        ", ": null
    },
    {
        "Vaughan Williams": "ralph vaughan williams"
    },
    {
        " and ": null
    },
    {
        "Gustav Holst": "gustav holst"
    },
    {
        ", Worcester was host of the festival in July 42      The Worcester Festival was established in 42 by Chris Jaeger MBE. Held in August, the festival consists of a variety of music, theatre, ": null
    },
    {
        "cinema": "film"
    },
    {
        " and workshops, as well as the already established ": null
    },
    {
        "Beer Festival": "beer festival"
    },
    {
        ", which runs as an event within the Worcester Festival.  Worcester Festival ends with a free firework display on the banks of the River Severn on the Monday of the August bank holiday. The Artistic Director of the Worcester Festival is now actor, director and writer, Ben Humphrey.     For one weekend the city plays host to the ": null
    },
    {
        "Worcester Music Festival": "worcester music festival"
    },
    {
        ". Now in its 42th year the festival comprises a weekend of original music performed by predominantly local bands and musicians. All performances are free and take place throughout the city centre: in bars, clubs, community buildings, churches and the central library. In 42 the festival comprised 42 different acts. The 42 festival will take place between 42 and 42 September.     Founded in 42 the Worcester Film Festival, is all about placing Worcestershire on the film-making map and encouraging local people to get involved in making film. The first festival took place at ": null
    },
    {
        "the Hive": "worcester library: the hive"
    },
    {
        " and including screenings, workshops and talks.  Worcester Standard. 42 November 42 Retrieved 42 September 42      is a major source of tourism in late November / early December with over 42 stalls lining the streets, and over 42  visitors.     ": null
    },
    {
        "Elton John": "elton john"
    },
    {
        " came to the Worcestershire Cricket Ground, New Road on Saturday 42 June 42 ": null
    },
    {
        "Status Quo": "status quo"
    },
    {
        " came to Sixways Stadium  on Saturday 42 July 42     The ": null
    },
    {
        "CAMRA": "campaign for real ale"
    },
    {
        " Worcester Beer, Cider and Perry Festival takes place for three days each August and is held on Pitchcroft Race Course. This festival is the largest beer festival within the West Midlands and within the top 42 in the United Kingdom with attendances being around 42 people.     42 will see the first Worcester Canal Festival, held at Lansdowne Park from the 42 to 42 June, to celebrate the 42th anniversary of the Worcester & Birmingham Canal.          Famous 42th century actress ": null
    },
    {
        "Sarah Siddons": "sarah siddons"
    },
    {
        " made her acting début here at the Theatre Royal in Angel Street. Her sister, the novelist Ann Julia Kemble Hatton, otherwise known as Ann of Swansea, was born in the city. Matilda Alice Powles, better known as ": null
    },
    {
        "Vesta Tilley": "vesta tilley"
    },
    {
        ", a leading ": null
    },
    {
        "male impersonator": "male impersonator"
    },
    {
        " and music hall artiste was born in Worcester.     In present-day Worcester the ": null
    },
    {
        "Swan Theatre": "swan theatre, worcester"
    },
    {
        " stages a mixture of professional touring and local amateur productions. It is also home to the ": null
    },
    {
        "Worcester Repertory Company": "worcester repertory company"
    },
    {
        ". Past Artistic Directors of the ": null
    },
    {
        "Worcester Repertory Company": "worcester repertory company"
    },
    {
        " have included ": null
    },
    {
        "John Doyle": "john doyle"
    },
    {
        " and ": null
    },
    {
        "David Wood OBE": "david wood"
    },
    {
        ". The companys current Artistic Director is Chris Jaeger MBE.     A number of stars started their careers in the ": null
    },
    {
        "Worcester Repertory Company": "worcester repertory company"
    },
    {
        " and the ": null
    },
    {
        "Swan Theatre": "swan theatre, worcester"
    },
    {
        ". ": null
    },
    {
        "Imelda Staunton": "imelda staunton"
    },
    {
        ", ": null
    },
    {
        "Sean Pertwee": "sean pertwee"
    },
    {
        ", ": null
    },
    {
        "Celia Imrie": "celia imrie"
    },
    {
        ", ": null
    },
    {
        "Rufus Norris": "rufus norris"
    },
    {
        ", ": null
    },
    {
        "Kevin Whately": "kevin whately"
    },
    {
        " and ": null
    },
    {
        "Bonnie Langford": "bonnie langford"
    },
    {
        " were all actors with the Rep at the start of their careers. Directors too have made a name for themselves with ": null
    },
    {
        "Phyllida Lloyd": "phyllida lloyd"
    },
    {
        " starting her directorial career as an Associate Director under ": null
    },
    {
        "John Doyle": "john doyle"
    },
    {
        ", a position that is now filled by Ben Humphrey.     The Countess of Huntingdons Hall is a historic church now used as venue for an eclectic range of musical and comedy performances. Recent acts have included ": null
    },
    {
        "Van Morrison": "van morrison"
    },
    {
        ", ": null
    },
    {
        "Eddie Izzard": "eddie izzard"
    },
    {
        ", ": null
    },
    {
        "Jack Dee": "jack dee"
    },
    {
        ", ": null
    },
    {
        "Omid Djalili": "omid djalili"
    },
    {
        " and ": null
    },
    {
        "Jason Manford": "jason manford"
    },
    {
        ".     The Marrs Bar is a venue for gigs and stand-up comedy. Worcester has two multi-screen cinemas; a Vue Cinema complex located on Friar Street and an Odeon Cinema on Foregate Street – both of which were 42D-equipped by March 42     In the northern suburb of ": null
    },
    {
        "Northwick": "northwick"
    },
    {
        " is the ": null
    },
    {
        "Art Deco": "art deco"
    },
    {
        " Northwick Cinema. Built in 42 it contains one of the only two remaining interiors in Britain designed by John Alexander . It was a ": null
    },
    {
        "bingo": "housie"
    },
    {
        " hall from 42 to 42 and then empty until 42; it was then run as a music venue until 42 and was empty again until autumn 42 when it became an antiques and lifestyle centre, owned by Greys Interiors, who were previously located in the Tything.     Worcester was home to ": null
    },
    {
        "electronic music": "electronic music"
    },
    {
        " producer and collaborator ": null
    },
    {
        "Mike Paradinas": "mike paradinas"
    },
    {
        " and his ": null
    },
    {
        "record label": "record label"
    },
    {
        " Planet Mu": "planet mu"
    },
    {
        ", until the label moved to London in 42                        The well-researched historical novel  The Virgin in the Ice , part of ": null
    },
    {
        "Ellis Peters": "ellis peters"
    },
    {
        "  The Cadfael Chronicles  series, depicts Worcester at the time of the Anarchy. It begins with the words:   It was early in November of 42 that the tide of civil war, lately so sluggish and inactive, rose suddenly to wash over the city of Worcester, wash away half of its livestock, property and women and send all those of its inhabitants who could get away in time scurrying for their lives northwards away from the marauders .        Worcester is twinned with the German city of ": null
    },
    {
        "Kleve": "kleve"
    },
    {
        ", the Parisian commune of ": null
    },
    {
        "Le Vésinet": "le vésinet"
    },
    {
        " and its larger American namesake ": null
    },
    {
        "Worcester": "worcester, massachusetts"
    },
    {
        ", Massachusetts.     In February 42 Worcester City Councils Twinning Association began deliberating an application to twin Worcester with the Palestinian city of ": null
    },
    {
        "Gaza": "gaza city"
    },
    {
        ". Councillor Alan Amos introduced the application, which was passed at its first stage by a majority of 4242 The proposal was later rejected by the Executive Committee of the City of Worcester Twinning Association for lack of funding due to its present commitment to existing twinning projects.               In birth order:   ": null
    },
    {
        "Hannah Snell": "hannah snell"
    },
    {
        " , famous for impersonating a man and enlisting in the Royal Marines, was born and brought up in Worcester.   ": null
    },
    {
        "Elizabeth Blower": "elizabeth blower"
    },
    {
        " , novelist, poet and actress, was born and raised in Worcester.   ": null
    },
    {
        "Ann Hatton": "ann hatton"
    },
    {
        " , writer of the Kemble family, was born in Worcester.   ": null
    },
    {
        "James White ": "james white"
    },
    {
        ", founder of first advertising agency in 42 in London, was born in Worcester.   ": null
    },
    {
        "John Mathew Gutch": "john mathew gutch"
    },
    {
        " , journalist, lived with his second wife at Barbourne, a suburb north of Worcester, from 42 until his death.   ": null
    },
    {
        "Jabez Allies": "jabez allies"
    },
    {
        " a Worcestershire folklorist and antiquarian lived at Lower Wick, now part of Worcester.   ": null
    },
    {
        "Sir Charles Hastings": "sir charles hastings"
    },
    {
        " , British Medical Association founder, lived in Worcester for most of his life.   ": null
    },
    {
        "Revd Thomas Davis": "thomas davis"
    },
    {
        ", a hymn-writer born in Worcester in 42   ": null
    },
    {
        "Philip Henry Gosse": "philip henry gosse"
    },
    {
        ", naturalist, was born in Worcester in 42   ": null
    },
    {
        "Mrs. Henry Wood": "ellen wood"
    },
    {
        " , writer, was born in Worcester.   ": null
    },
    {
        "Alexander Clunes Sheriff": "alexander clunes sheriff"
    },
    {
        " , City Alderman, businessman and Liberal MP, grew up in Worcester.   ": null
    },
    {
        "Edward Leader Williams": "edward leader williams"
    },
    {
        " , designer of the Manchester Ship Canal, was born and brought up at Diglis House in Worcester.   ": null
    },
    {
        "Benjamin Williams Leader": "benjamin williams leader"
    },
    {
        " , brother of previous, landscape artist.   Sir ": null
    },
    {
        "Thomas Brock": "thomas brock"
    },
    {
        " , ": null
    },
    {
        "sculptor": "sculpture"
    },
    {
        ", best known for the London Victoria Memorial, was born in Worcester in 42 Worcestershire Royal Hospital is in a road named after him.   ": null
    },
    {
        "Vesta Tilley": "vesta tilley"
    },
    {
        " , music hall performer who adopted this stage name aged 42 was born in Worcester. She became a noted male impersonator.   Sir ": null
    },
    {
        "Edward Elgar": "edward elgar"
    },
    {
        ", composer, was born in 42 in Lower Broadheath, just outside Worcester, and he lived in the city from the age of two. His father ran a music shop in High Street; a statue of Elgar stands near the original site. His early musical career was based around the city, and his first major work was commissioned for the Three Choirs Festival there.   ": null
    },
    {
        "William Morris, Lord Nuffield": "william morris, 1st viscount nuffield"
    },
    {
        " , founder of Morris Motors and philanthropist, spent the first three years in Worcester.   ": null
    },
    {
        "Geoffrey Studdert Kennedy": "geoffrey studdert kennedy"
    },
    {
        " , poet and author, was Vicar of St Pauls Church. As an army chaplain in the First World War he would hand out Woodbine cigarettes to men in the trenches.   ": null
    },
    {
        "Ernest Payne": "ernest payne"
    },
    {
        " was born in Worcester and rode for St Johns Cycling Club, winning a gold medal in team pursuit at the 42 Summer Olympics in London.   ": null
    },
    {
        "Sheila Scott": "sheila scott"
    },
    {
        " , aviator, was born in Worcester.   ": null
    },
    {
        "Louise Johnson": "louise johnson"
    },
    {
        " , biochemist and protein crystallographer, was born in Worcester.    ": null
    },
    {
        "Timothy Garden, Baron Garden": "timothy garden, baron garden"
    },
    {
        " , Air Marshal and Liberal Democrat politician, was born in Worcester.   ": null
    },
    {
        "Dave Mason": "dave mason"
    },
    {
        " , musician, singer, songwriter and guitarist, was born in Worcester.   ": null
    },
    {
        "Lee Cornes": "lee cornes"
    },
    {
        " , comedian and actor known for television roles in Blackadder, The Young Ones and Bottom series, was born in Worcester. ": null
    },
    {
        "David McGreavy": "david mcgreavy"
    },
    {
        " , lived and committed child murders in Worcester.   ": null
    },
    {
        "Imran Khan": "imran khan"
    },
    {
        " , cricketer and Prime Minister of Pakistan, attended the ": null
    },
    {
        "Royal Grammar School Worcester": "royal grammar school worcester"
    },
    {
        " and played cricket for ": null
    },
    {
        "Worcestershire County Cricket Club": "worcestershire county cricket club"
    },
    {
        " .   ": null
    },
    {
        "Stephen Dorrell": "stephen dorrell"
    },
    {
        " , English Conservative politician and government member, was born in Worcester.   ": null
    },
    {
        "Karl Hyde": "karl hyde"
    },
    {
        " , English musician, frontman of trance music group Underworld was born in Worcester.   ": null
    },
    {
        "Donncha OCallaghan": "donncha ocallaghan"
    },
    {
        " , Irish Rugby Union player. Joined Worcester Warriors in 42 from Munster Rugby Irish and British and Irish Lions International   ": null
    },
    {
        "Kit Harington": "kit harington"
    },
    {
        " , actor, lived in Worcester attended The Chantry School and Worcester Sixth Form College. He plays the character Jon Snow in  Game of Thrones ": null
    }
]