[
    {
        "         Worf, son of Mogh  is a ": null
    },
    {
        "fictional character": "Fictional Character"
    },
    {
        " in the  Star Trek  franchise. He appears in the ": null
    },
    {
        "television series": "Television Program"
    },
    {
        "  Star Trek: The Next Generation   and seasons four through seven of  Star Trek: Deep Space Nine   as well as the feature films  Star Trek Generations  ,  Star Trek: First Contact  ,  Star Trek: Insurrection  , and  Star Trek: Nemesis  . Worf is the first ": null
    },
    {
        "Klingon": "Klingon"
    },
    {
        " main character to appear in Star Trek, and has appeared in more Star Trek franchise episodes than any other character. He is portrayed by actor ": null
    },
    {
        "Michael Dorn": "Michael Dorn"
    },
    {
        ".       Initially, Worf was not intended to be a regular character, as Gene Roddenberry wanted to avoid retreads of characters or races featured prominently in the original Star Trek series . Accordingly, the June 1, 1987 cast portrait did not include Worf.  Several tall, slim, black actors auditioned for Worf before Michael Dorn came along, walking into the audition in character and not smiling. Not only did the Worf character become a regular on The Next Generation, he was continued on the Deep Space Nine series for several more years and talk of a spin-off Worf show continued even into the 2010s.       He made his debut in 1987 in ": null
    },
    {
        "Encounter at Farpoint": "Encounter At Farpoint"
    },
    {
        ", and last appeared in character in 2002. Dorn as Worf made 282 on screen appearances, the most appearances of any actor in the Star Trek franchise to-date.        Worfs family ties are slowly revealed across several hundred episodes and the movies. An important aspect to understanding Worf is that he was adopted by Federation parents, so he has both adoptive and biological family. He has a total of two brothers each with a unique backstory, as well as two adoptive human parents, and one son. Important Star Trek episodes for Worf’s family include ": null
    },
    {
        "The Bonding": "The Bonding"
    },
    {
        " , ": null
    },
    {
        "Sins of the Father": "Sins Of The Father"
    },
    {
        " , ": null
    },
    {
        "Family": "Family"
    },
    {
        " , ": null
    },
    {
        "Reunion": "Reunion"
    },
    {
        " , ": null
    },
    {
        "Homeward": "Homeward"
    },
    {
        " , and ": null
    },
    {
        "You Are Cordially Invited": "You Are Cordially Invited"
    },
    {
        " .     The House of Mogh was a family of high social and political rank which was for a time represented on the Klingon High Council. In  Star Trek VI: The Undiscovered Country  , ": null
    },
    {
        "Colonel Worf": "Colonel Worf"
    },
    {
        " appears as the legal advocate of Captain ": null
    },
    {
        "James T. Kirk": "James T. Kirk"
    },
    {
        " and Dr. ": null
    },
    {
        "Leonard McCoy": "Leonard Mccoy"
    },
    {
        " after they are accused of killing Chancellor ": null
    },
    {
        "Gorkon": "Gorkon"
    },
    {
        " of the Klingon High Council. He was also a member of the Klingon delegation at Camp Khitomer. Although not explicitly stated, he was intended to be Worfs grandfather.     Worf has a son named Alexander with a half-human half-Klingon woman named KEhleyr, a character introduced in ": null
    },
    {
        "The Emissary": "The Emissary"
    },
    {
        "“; however, she is later killed in ": null
    },
    {
        "Reunion": "Reunion"
    },
    {
        " , a sequel to that episode and part of the Worf story arc, leaving Worf as a single parent. Alexander has to live aboard Enterprise-D when KEhleyr is killed. After TNG ends, Worf gets moved to the Deep Space Nine space station where he eventually marries the Trill symbiont ": null
    },
    {
        "Jadzia Dax": "Jadzia Dax"
    },
    {
        ".  On DS9 Worf misses the Enterprise-D family that he had, often bemoaning the cut-rate work ethic and unfriendliness on the wayward outpost.     The episode Sins of the Father introduces Worfs long-lost brother Kurn, who is also an orphan of the House of Mogh.  His adoptive parents have another son, Nikolai Rozhenko, whom Worf grew up with. Nikolai and Worf interact in Homeward where it is revealed that Worf will likely have a nephew or niece.     In ": null
    },
    {
        "The Bonding": "The Bonding"
    },
    {
        " Worf adopts an orphan boy into the House of Mogh.  In the first Star Trek episode written by screenwriter ": null
    },
    {
        "Ron Moore": "Ronald D. Moore"
    },
    {
        ", the orphan Jeremy has a special Klingon ceremony to be adopted into Worfs family.           Worf was born in 2340 on Kronos as the son of Mogh. Five years later, his parents moved to the Khitomer colony. Worfs parents were killed during a surprise attack by the Romulans on the Khitomer outpost. The colonys distress call was answered by the Federation starship USS Intrepid. Chief Petty Officer Sergey Rozhenko found Worf in the rubble and took him in after failing to find any living relatives. Rozhenko and his wife Helena raised him on a small farm colony on the planet Gault, a world of about 20,000 inhabitants, almost all of them human. Worf also has a human brother, Nikolai, with whom he often quarreled.  He also spent time on Earth in his parents native city of ": null
    },
    {
        "Minsk": "Minsk"
    },
    {
        ", later recommending it to ": null
    },
    {
        "Miles OBrien": "Miles Obrien"
    },
    {
        " as one of his favorite places on Earth.        Worf did not take the Rozhenkos last name, preferring to be addressed by the Klingon designation Worf, son of Mogh . However, his son ": null
    },
    {
        "Alexander Rozhenko": "Alexander Rozhenko"
    },
    {
        ", who was raised by the Rozhenkos after his mother ": null
    },
    {
        "KEhleyr": "Kehleyr"
    },
    {
        " died, did use their surname. Although Worf was raised by humans, he considered himself a Klingon at heart and studied the ways of his people. As an adult, his mannerisms and personality, as well as his innate sense of honor, became more Klingon than human.     Worfs brother Kurn, barely a year old at the time of the Khitomer attack, had been left behind on the Klingon homeworld  by his parents. Lorgh, a friend to House of Mogh , was charged with the care of the younger son, originally expecting Moghs stay at the Khitomer outpost to be short-term. Lorgh adopted Kurn after the attack, but informed Klingon authorities that he had died with the rest of the family. Kurn was not revealed as being alive until both brothers were adults.     In 2357, Worf entered ": null
    },
    {
        "Starfleet Academy": "Starfleet Academy"
    },
    {
        ". He graduated in 2361 and was commissioned with the rank of Ensign, becoming the first Klingon officer in Starfleet. Although Worf took immense pride and a sense of honor from serving in Starfleet, most other Klingons shunned and belittled his choice of vocation.     In 2359, he became briefly involved with KEhleyr who was the daughter of a Klingon father and a human mother.     The Next Generation   In 2364, Worf was assigned to the ": null
    },
    {
        "USS Enterprise-D": "Uss Enterprise"
    },
    {
        " as relief flight control and tactical officer with the rank of ": null
    },
    {
        "lieutenant junior grade": "Lieutenant Junior Grade"
    },
    {
        " . The next year, he was made Acting Chief of Security following the death of ": null
    },
    {
        "Tasha Yar": "Tasha Yar"
    },
    {
        ", even though he believed that a promotion due to the death of a comrade was not honorable . The next year, he transferred to operations division and was formally made Chief of Security .     In 2365, he renewed his relationship with KEhleyr when she came aboard the Enterprise as a Federation emissary on an urgent mission. He proposed marriage but was rejected .     In 2366, he was promoted to ": null
    },
    {
        "lieutenant": "Lieutenant"
    },
    {
        " . After an accident caused the death of Lt. Marla Astor, Worf brought the orphaned Jeremy Astor into the House of Mogh through the rite of Ruustai .     Worf learned of Kurns existence when Kurn was assigned to the Enterprise as an Exchange Officer. Kurn specifically asked for the Enterprise so he could observe his brother. He then revealed his true identity, informing Worf that the House of Moghs rival Duras accused their father of betraying the Klingon Empire by helping the Romulans attack Khitomer. When they and the Enterprise crew discovered that it was in fact Durass father that betrayed the Empire, Worf, realizing that the powerful House of Duras could not be publicly shamed without throwing the Empire into civil war, accepted a ritual discommendation from the Klingon High Council. While Worf decided to accept this dishonor, it was decided to keep Kurns true identity secret in order to protect his honor .     In 2367, KEhleyr returned with Klingon Chancellor Kmpec who had come to meet with Captain Picard. When she came aboard, Worf learned he had a son named Alexander. She wanted to marry him but Worf refused because he did not want to share his dishonor with her and their son .     After Kmpecs death, she assisted Captain Picard with the rite of succession. KEhleyr was eventually murdered by Duras when she found evidence of his involvement in the effort to discredit Worf . Exercising his right of vengeance, Worf fought and killed Duras with a ": null
    },
    {
        "batleth": "Batleth"
    },
    {
        " in a duel, allowing Durass political opponent Gowron to become chancellor .     A civil war erupted when the Durass son ": null
    },
    {
        "Toral": "List Of Star Trek Characters T"
    },
    {
        " challenged Gowron. Worf believed Gowron was the legitimate ruler and convinced his brother to bring forces loyal to him into battle on Gowrons behalf. Worf resigned from Starfleet to fight for Gowron and served on his brothers ship. Gowron won the war after Starfleet exposed Romulan support for the House of Duras. In appreciation of his support, Chancellor Gowron restored Worfs honor, allowing Kurn a seat on the High Council as the recognized brother and representative of the House of Mogh . Once the war was over, Worf regained his Starfleet commission, recognizing that he did not fully belong to Klingon society .     In 2369 while the Enterprise was at Deep Space Nine, Worf investigated a claim that his father might still be alive in a Romulan prison camp. His father was not there , but a number of Klingons were living there with the Romulans. Unable to return home with honor, as Klingons are supposed to commit suicide rather than be taken prisoner, they stayed and strayed from their way of life. Worfs visit had a profound effect on the children of the prisoners and many chose to leave with him .     Worfs visit to the camp caused him to reconsider his own beliefs. He visited the monastery at Boreth to meditate. One day, a man appeared before him claiming to be Kahless the Unforgettable who had returned to lead the Empire once more. Worf was willing to consider the idea that Kahless was genuine because he believed the Klingons had lost their ways. Gowron was skeptical. He questioned Kahless about details of his memories, which Kahless could not recall, and then challenged Kahless to combat, defeating him easily. The loss forced the clerics to reveal that they had created a clone of Kahless and implanted ancient scriptures of Kahlesss battles as his memories. Despite this, Worf became convinced that the Klingons would make a leap of faith and accept him as the legitimate heir of Kahless. He convinced the Klingons to appoint the new Kahless as Emperor. While real power remained with Gowron as head of government, the Emperor would be the formal head of state and teach the stories of Kahless. Gowron was incited to go along with this arrangement when Worf threatened in private otherwise to oppose him publicly, which Gowron, still not fully in control of the Empire, could not afford. .     Worf avoided romantic attachments with non-Klingons during his first few years on board the ": null
    },
    {
        "Enterprise-D": "Uss Enterprise"
    },
    {
        ". As Worf explained to both ": null
    },
    {
        "Commander Riker": "William Riker"
    },
    {
        " and ": null
    },
    {
        "Guinan": "Guinan"
    },
    {
        ", he felt that non-Klingon females would be too fragile, and that he would have to restrain himself too much. He eventually developed strong feelings for Counselor ": null
    },
    {
        "Deanna Troi": "Deanna Troi"
    },
    {
        ", and explored a relationship with her for a time, which at times strained his relationship with her former romantic interest, Commander Riker. Worf and Troi seemed to end their relationship following the destruction of the Enterprise-D at Veridian III and Worfs reassignment to ": null
    },
    {
        "Deep Space Nine": "Deep Space Nine"
    },
    {
        ".     Deep Space Nine": null
    },
    {
        "lieutenant commander": "Lieutenant Commander"
    },
    {
        " . After the destruction of the Enterprise-D, Worf took an extended leave to evaluate his future. He was at a monastery on the Klingon colony of Boreth when he was ordered to go to Deep Space 9 to advise ": null
    },
    {
        "Captain Sisko": "Benjamin Sisko"
    },
    {
        " when a Klingon fleet massed at the station. When he arrived, he was met by former Enterprise-D crew member and DS9s Chief of Operations, Miles OBrien. .     Worf learned that the Klingons were planning to invade Cardassia because of a coup which they had been led to believe was engineered by the Dominion. Worf reluctantly informed Sisko, knowing this would jeopardize his status in the empire. After the invasion had begun, Gowron traveled to DS9 to ask Worf to join him in battle. Gowron believed the Federation was unworthy of Worfs loyalty because they would not fight the Dominion. Worf felt the war was wrong and he could not support it. Gowron punished him by reinstating Worfs discommendation, but this time executing it to the full degree, by stripping him and his family of his honor, lands, and titles, effectively bringing down the House of Mogh.     Worf submitted his resignation but Sisko rejected it because he still needed him. He had decided to rescue the members of the Cardassian council from certain death at the hands of the Klingons. In doing so, he was able to prove that there was no Dominion involvement by verifying their identities. The Klingons attacked the station in order to capture the council members but withdrew as Starfleet ships approached, fearing a war on two fronts.     At the end of the immediate crisis, Sisko convinced Worf to join the crew as Strategic Operations officer. In this role, he would coordinate all Starfleet activity in the Bajoran sector and act as an ": null
    },
    {
        "executive officer": "Executive Officermilitary"
    },
    {
        " on the ": null
    },
    {
        "USS Defiant": "Uss Defiant"
    },
    {
        ", meaning he had to adjust to the requirements and obligations that came with the red command personnel uniform. For the first months, Worf had difficulties adjusting to life on the station, unintentionally overstepping his boundaries by acting as he did on the Enterprise, putting him for a while at odds with Chief of Security Odo. For Worf, the stations life seemed just too much grey, subsequently requesting to relocate his quarters aboard Defiant.     After the Klingon civil war, Kurn had gained a seat on the High Council. Worfs opposition to the war against Cardassia cost Kurn his seat on the council. Four months later, he arrived at DS9 seeking help from his brother to perform a ritual to die with honor. He felt that the ritual, which involved Worf killing him, was the only way to restore his honor. Initially disregarding orders from Sisko not to carry out the ": null
    },
    {
        "honor killing": "Honor Killing"
    },
    {
        ", Worf failed in his first attempt to perform the ritual and later found he could not bring himself to do so again, as he had taken on a human feature of morality and would consider it murdering his brother. Worf arranged for his brother to have cosmetic surgery and his memory wiped so he could start a new life with no ties to the House of Mogh. Kurn now has the identity of Rodek, who believes he lost his memory after being hit by a plasma discharge . When Rodek sees Worf, he asks him whether he is family. Worf bitterly replies that he has no family.     After a year of war between the Federation and the Klingons, Worf joined a team sent to investigate claims that Gowron was a changeling in disguise. Worf nearly killed Gowron in combat but at the last moment the impostor was revealed to be disguised as Gowrons military adviser General Martok. The discovery helped restore peace between the Federation and the Klingons and to Worf again being shunned by Gowron for not having killed him when he had the chance, reaffirming his dishonor. .     In early 2373, Worf became involved with DS9 science officer ": null
    },
    {
        "Jadzia Dax": "Jadzia Dax"
    },
    {
        ", a Trill woman. She was familiar with Klingon customs due to the experience of the Dax symbionts previous host, Curzon. She was the first non-Klingon that Worf could physically be with in the traditional Klingon way, although it still left bruises, cuts and broken bones .     While on a mission to the ": null
    },
    {
        "Gamma Quadrant": "Gamma Quadrant"
    },
    {
        ", Worf was captured by the Dominion and sent to a ": null
    },
    {
        "JemHadar": "Jemhadar"
    },
    {
        " prison camp where he met the real ": null
    },
    {
        "General Martok": "General Martok"
    },
    {
        " and was reunited with the real ": null
    },
    {
        "Dr. Bashir": "Julian Bashir"
    },
    {
        ", who had both been captured and replaced by changelings. While the prisoners worked to escape, Worf entered a daily round of combat with each of the guards in turn. He earned the respect and admiration of Martok and even of the guards because he would not yield. Once the prisoners escaped, they managed to warn the station about the Bashir-changeling.     Upon their return, Martok was assigned command of the Klingon detachment on Deep Space Nine and command of the IKS Rotarran. Martok asked Worf to be his ": null
    },
    {
        "first officer": "Starfleet Ranks And Insignia"
    },
    {
        ". The ship had suffered many losses to the Dominion, and morale was low. Martoks refusal to engage the enemy, due to his Dominion incarceration, made things worse. Worf challenged him for command, but allowed Martok to win and retain command. This led to Martok regaining his warriors courage and, with renewed vigor, he led the crew to their first victory against the Dominion. Understanding what Worf had done, Martok thanked him for reminding him of his duty as a soldier and offered him a place in his house as his brother. By joining the House of Martok, Worfs status in the empire was restored . Worfs son, Alexander, was also assigned to the Rotarran after joining the ": null
    },
    {
        "Klingon Defense Force": "Klingon Defense Force"
    },
    {
        ". Though Worf was initially estranged by his now adult son, and skeptical of his sons desire to serve the Empire, he eventually reconciled with him, and his son joined the House of Martok as well. Worf continued to serve on the Rotarran after Sisko withdrew from DS9 at the beginning of the Dominion War.     When Sisko eventually returned with a fleet of Federation ships to retake the station, Worf and Martok lobbied Gowron to send Klingon ships to join the battle. The entry of the Klingon ships turned the tide and allowed the Defiant to break through and retake the station .     Having helped liberate the station, Worf and Jadzia decided to get married. The wedding was a traditional Klingon ceremony which included a series of trials on Jadzias part in order to gain the approval of Martoks wife to join the House of Martok. This almost ended in disaster, as the free-spirited Jadzia felt forced into a position rather than taking the matter seriously enough. Eventually, realizing its importance to Worf and counseled by Sisko that she needed to mature, Jadzia yielded and she was allowed to marry Worf. .     In the DS9 episode ": null
    },
    {
        "Change of Heart": "Change Of Heart"
    },
    {
        " , Worf prematurely ended a mission to contact a ": null
    },
    {
        "Cardassian": "Cardassian"
    },
    {
        " informant inside the ": null
    },
    {
        "Dominion": "Dominion"
    },
    {
        " in order to save his injured wife. The informant was subsequently executed by the Dominion, causing Captain Sisko to officially caution that Starfleet might not grant Worf his own command after this incident . However, Sisko added that, had he been forced to choose between his duty and his wife, he would have done the same thing.     By late 2374, Worf and Jadzia were married less than a year when they decided to try to have a child, despite the extreme difficulties posed by the disparate biologies of Trill and Klingons. While Worf was away during a mission, Jadzia visited the Bajoran temple on the station where she was attacked and killed by an alien possessing the body of ": null
    },
    {
        "Gul Dukat": "Dukat"
    },
    {
        ", who had come aboard the station to destroy an Orb of the Prophet.      In 2375, Worf led a mission to destroy a Dominion shipyard. He dedicated this mission to his late wife, in order to ensure her entry into Sto-Vo-kor, the ": null
    },
    {
        "Valhalla": "Valhalla"
    },
    {
        "-like realm of the honored dead, being joined by ": null
    },
    {
        "Quark": "Quark"
    },
    {
        ", Bashir and OBrien .     ": null
    },
    {
        "Julian Bashir": "Julian Bashir"
    },
    {
        " was able to save the ": null
    },
    {
        "Dax symbiont": "Dax"
    },
    {
        ", which was sent back to the Trill homeworld to be rejoined with a new host aboard the USS Destiny. When the symbionts health worsened, the Dax symbiont was implanted into a new host named ": null
    },
    {
        "Ezri Dax": "Ezri Dax"
    },
    {
        ", who was the assistant ships counselor. She had not been trained to be a host, but she was the only available unjoined Trill aboard. Ezri had difficulty making the transition and sought out Ben Sisko on Earth. She helped him on his mission and then returned to DS9 with him. She accepted his request to stay on as station counselor.     Worf avoided Ezri at first, confused about what to do about this new situation. Her quick posting to DS9 led to a number of awkward moments between her and Worf, since the new host carried all the memories of their former hosts but had its own distinct personality, despite their shared past. Also, it was considered ": null
    },
    {
        "taboo": "Taboo"
    },
    {
        " on Trill for new hosts to fraternize with former lovers. After a brief rekindling of their feelings for one another, they decided that things were just too different and, eventually, the two settled into a comfortable friendship, with Ezri eventually becoming romantically involved with Julian Bashir . This allowed Worf to accept his Jadzia to have her place into Sto-Vo-Kor.     In 2375, Worf became concerned with the leadership of Gowron. The entry of the ": null
    },
    {
        "Breen": "Breen"
    },
    {
        " into the war on the side of the Dominion temporarily sidelined the Federation and Romulan fleets, which proved vulnerable to Breen weaponry. This left the Klingons alone to carry on the fight as their ships were not affected in the same manner. Gowron assumed direct command because he feared Martoks growing popularity and devised a plan to discredit Martok. He began ordering Martok on near-suicidal missions against Dominion forces, hoping that a string of defeats would weaken Martoks popularity and discredit him as a military leader. Recognizing that Gowron was jeopardizing the entire war effort for the sake of his personal pride, Worf tried to convince Martok that he should challenge Gowron for the leadership. After Martok refused, Worf challenged Gowron himself, citing his faulty battle planning, his dishonorable conduct in trying to discredit Martok, and poor strategies at the later stages of the Dominion War. After a brief battle, Worf killed Gowron; by right, he was proclaimed the new chancellor of the ": null
    },
    {
        "Klingon High Council": "Klingon High Council"
    },
    {
        ". However, Worf declined in favor of Martok . Ironically, it was again by Worfs hand the next chancellor of the Empire was decided , and the second time he and Gowron dueled, this time finishing Gowron off. As a token of respect, Worf performed the Klingon Death Howl after Gowrons death, essentially forgiving his misdeeds and recognizing a worthy warrior was on his way to Sto-Vo-Kor.     After the conclusion of the Dominion War, Worf was offered the position of the Federation ambassador to ": null
    },
    {
        "QonoS": "Qonos"
    },
    {
        " , as depicted in the Star Trek: Deep Space Nine series finale ": null
    },
    {
        "What You Leave Behind": "What You Leave Behind"
    },
    {
        " .     Worf continued to appear in TNG films which is explained in various ways, such as being rescued from the damaged Defiant during a battle with the Borg  and taking leave that led to him travelling on the Enterprise .  Star Trek: Nemesis  was released after the conclusion of DS9 and Worfs status at this time is unclear. Worf attended the wedding of ": null
    },
    {
        "William Riker": "William Riker"
    },
    {
        " and ": null
    },
    {
        "Deanna Troi": "Deanna Troi"
    },
    {
        " on Earth and travelled to Betazed with the Enterprise crew for the second wedding ceremony when the ship was diverted to investigate positronic signals from a system near the Romulan border.       In 2370 after returning from a tournament, Worf encountered a quantum fissure and began shifting into different realities. In one reality, he became involved with Deanna Troi while recovering from a spinal injury. He asked permission from Commander Riker to court Troi. By the time the events in this episode takes place, he has been married to her for two years. In another reality, Worf is first officer of the Enterprise serving under Capt. Riker who assumed command after Capt. Picard was killed by the Borg. He is married to Deanna Troi and has a daughter Shannara Rozhenko and a son Eric Christopher Rozhenko. However, she doesnt know anything about Alexander .     In an alternate future, Alexander becomes a diplomat instead of a warrior. He wanted to end the feuding among the great houses and declared that the House of Mogh would no longer engage in blood feuds. Worf warned him that this was a show of weakness but Alexander persisted. Shortly after Alexanders decision, he witnesses Worf being killed on the floor of the High Council. Had he become a warrior, he thinks perhaps he could have saved his fathers life. Eventually, he finds a way to travel back in time to try to prevent these events from occurring by convincing his younger self to train to become a warrior while under the assumed name of KMtar, but Worf convinces him to return to the future with assurances that he has already changed his own history .     In an alternate future, Worf had been reluctant to become involved with Troi and her subsequent death led to a rift between Riker and himself as a result. He later served as a member of the Klingon High Council and was governor of the Klingon colony of Hatoria with his fellow Klingons possibly at the brink of war with the Federation after conquering the ": null
    },
    {
        "Romulan Star Empire": "Romulan Star Empire"
    },
    {
        " .     While on a mission in the Gamma Quadrant, the Defiant detects an energy barrier surrounding a planet in a nearby solar system. When they enter the barrier, the ship is damaged and they detect a settlement with 8,000 people who are mostly human. When they investigate, they learn they have been expected. The settlers explain they are the descendants of the Defiant crew. In a couple of days, when the Defiant tries to leave orbit, they will be thrown back in time two centuries and crash land on the planet. Worf learns he married and raised a family. He meets his descendant Brota who leads the Sons of Mogh. The members are descendants of Worf and Jadzia and others who choose to join them. They follow Klingon customs as first taught to them by Worf .     In the mirror universe, Worf leads the Klingon-Cardassian Alliance as Regent. After Terran rebels take over Terok Nor, Worf tries to recapture the station but is defeated by the rebels who have a new ship based on the design of the Defiant from the prime universe. Enraged, Worf claimed he lost only because he had been betrayed, with the Mirror Garak blaming Intendant Kira Nerys as the likely source . Eventually, Worf captured her and Grand Nagus Zek who crossed over to this universe to open new markets. Worf agreed to let Zek go in exchange for a cloaking device, but the device was sabotaged and his ship was disabled, allowing the Terran rebels to capture him .     Webster Webster  had the titular character go into the future to the Enterprise-D bridge where he encountered several unnamed Enterprise crew members and Worf. Worf initially tells Webster he cannot return him to his time due to the Enterprise not being able to escape the gravitational pull of a planet, but eventually they were able to reverse engineer the process that brought Webster to them. Shortly after Webster gets returned, Webster wakes up from what seemed to be a dream. None of the regular cast members of Star Trek TNG were in this episode of Webster.     Ted 2 Ted 2 , Michael Dorn played a character by the name of Rick. This character in the film attended the ": null
    },
    {
        "New York Comic Con": "New York Comic Con"
    },
    {
        " amateurishly dressed as Worf playing on the fact that Dorn was the actor who portrayed Worf.         Worfs character is further developed in non-": null
    },
    {
        "canon": "Star Trek Canon"
    },
    {
        " media.     According to the ": null
    },
    {
        "Pocket Books": "Pocket Books"
    },
    {
        " novels set after the Nemesis, Worf takes over William T. Rikers position of first officer aboard the Enterprise-E. According to  Death in Winter , Worf was to transfer with Riker to the Titan, but after Datas death, Picard asks Worf to stay aboard the Enterprise, and Worf obliges. In early 2380 in Resistance, Starfleet Command approves Picards request to make Worf the permanent first officer, but Worf refuses as he doubts his command skills . Soon afterwards, however, Worf successfully leads the rescue of Picard from another Borg crisis, and is sufficiently convinced to accept the permanent promotion. As of 2385 in the novel miniseries Star Trek: The Fall, Worf continues to remain as first officer of the Enterprise-E. According to the Titan series, he also adopted Datas cat Spot.     Worf had a relationship with Enterprise-E Chief of Security Jasminder Choudhury in the books, until her death in the 2012 Novel The Persistence Of Memory by David Mack.     The Pocket Books series continued in the 2016 trilogy Prey, written by John Jackson Miller. In it, Worf and the cloned Klingon Emperor Kahless are drawn into battle with a group of discommendated Klingons, all disciples of the late Kruge, the villain from the movie Star Trek III: The Search for Spock, being manipulated by Kruges secret heir Korgh. By 2386, Worfs son Alexander is an Ambassador, working alongside Admiral William Riker. Prey: Book One: Hells Heart by John Jackson Miller. 2016. The events of Prey conclude with the last survivors of the discommendated Klingons taking on roles as guardians for a planet whose previous guards were killed as part of the conspiracy, with Kahless joining them to help them learn how to be truly Klingon. As acknowledgement of Worfs role in helping them redeem themselves, the group name the first child born during this crisis after Worf.     IDW Comics took the character in a different direction in its licensed works. In the official comic book prequel to the 2009 movie  Star Trek , Worf is a General in the ": null
    },
    {
        "Klingon Empire": "Klingon Empire"
    },
    {
        " who is dispatched to deal with ": null
    },
    {
        "Romulan": "Romulan"
    },
    {
        " Captain ": null
    },
    {
        "Nero": "Nero"
    },
    {
        " and his significantly altered mining vessel, the Narada. When the Klingon forces suffer a crushing defeat, Worf agrees to Neros demand to board a shuttle and come on board the Narada. Worf takes the opportunity to surprise Nero, cutting into the Naradas hull and fighting his way to the main bridge for a confrontation with Nero. Already prepared for such a tactic, Nero succeeds in surprising Worf by impaling him through the back with a large mechanical tentacle. When the ": null
    },
    {
        "Enterprise-E": "Uss Enterprise"
    },
    {
        " arrives to do battle with the Narada, Nero agrees to beam Worf over if the ship will lower its shields. When Captain ": null
    },
    {
        "Data": "Data"
    },
    {
        " agrees, Worf is beamed back to the ship, giving the Narada time to fire on the Enterprise. The ship suffers heavy damage, but manages to raise its shields in time to prevent a second attack. Nero then leaves the battle to continue his assault on the planet ": null
    },
    {
        "Vulcan": "Vulcan"
    },
    {
        ". Worf is assumed to have survived, but this is never explicitly mentioned in the comic.         Worf is a decidedly popular character among fans.  The episode ": null
    },
    {
        "Heart of Glory": "Heart Of Glory"
    },
    {
        " , which focuses on Worf and his relationship to other Klingons, is credited with planting many seeds for successive Klingon storylines ... and new insights into Klingon culture .      With TNG over in 1995, the writers of DS9 came up with the idea of adding Worf to the cast in response to pressure to boost ratings.  Of Worf, Wolfe says that the studio felt DS9s ratings were sagging at the end of the third season, and he and the other writers were asked to give viewers a new reason to watch. Their answer was to make Worf a part of the cast.     Due to Worfs popularity there was some talk of a Captain Worf series before the franchise went into the Trek re-boots.  The actor was reportedly offered a role as a Worf-ancestor on Star Trek: Discovery but this did not come to fruition.       Screen Rant  has rated the character Worf a number of times, and by several authors, at its site. Author Edward Cambro ranks Worf as the 13th best Star Trek character overall,  and remarks how Worf had to walk the line between two cultures, neither of which entirely understood him . Said cultures being Klingons and human. Then author Sara Schmidt ranks Worf the 7th most attractive person in the Star Trek universe, in between ": null
    },
    {
        "TPol": "Tpol"
    },
    {
        "  and ": null
    },
    {
        "Michael Burnham": "Michael Burnham"
    },
    {
        " ,  and in another article, she goes on to suggest ideas for a Worf spin-off saying a young Worf would be interesting to explore as well as a series about Worfs experiences as a Federation ambassador to QonoS.  Dusty Stowe then ranks the top 8 most powerful characters of Star Trek and places Worf as the most powerful between Spock and Q.       TheWrap  rates Worf as the 9th best character of Star Trek, saying that he started the trend of turning enemies from past series into complex characters who became vital Starfleet crew members despite cultural differences.      ": null
    },
    {
        "SyFy": "Syfy"
    },
    {
        " rated Worf as the 2nd greatest Klingon of the Star Trek franchise. The author explains that Worf is only in second place because he was raised by humans and relies mostly on honor. He goes on to admit, Michael Dorn created a Trek legend here, there can be no doubt.       Den of Geek  places four , squarely Worf-centric episodes, in its list of 25 must-watch Star Trek: The Next Generation episodes which include The Emissary , Sins of the Father , Reunion , Redemption .      Worf is ranked the 13th most important character of Starfleet within the Star Trek science fiction universe by  Wired  magazine, beating out such favorites as ": null
    },
    {
        "Uhura": "Uhura"
    },
    {
        ". To be included in this list, characters must be Starfleet personnel or crew, plus in original media only.       IndieWire  ranks Worf as the 7th best character on Star Trek:The Next Generation  and  CBR  ranks Worf as the 8th best Starfleet character of Star Trek.      ": null
    },
    {
        "Filk": "Filk Music"
    },
    {
        " artists ": null
    },
    {
        "Ookla the Mok": "Ookla The Mok"
    },
    {
        " include a song about Worf entitled Mr. W on their 2003 album Oh Okay LA. The lyrics are a parody on why Worf would not make a good captain, since he is not afraid to die and how not everyone feels the same about that. It even includes a rap from what sounds like Worf himself, toward the end.     Musician ": null
    },
    {
        "Voltaire": "Voltaire"
    },
    {
        " wrote a song called Worfs Revenge for his EP  Banned on Vulcan  whose amusing lyrics details imaginings of Worfs likes and dislikes. In the bands view, Worf hates tribbles and calls Barclay a lowly white Ptak. Ptak was of the Sugg race and dealt in ": null
    },
    {
        "slavery": "Slavery"
    },
    {
        ". The phrase is amusing because it is the opposite of the kind of character Barclay really is.       Some shows have a major or major subplot for the Worf character, the first of these debuted in 1988, ": null
    },
    {
        "Heart of Glory": "Heart Of Glory"
    },
    {
        "  This kicked off a long-running story arc that continued until the end of DS9 in 1999 on television and 2002 on film.     TNG:   ": null
    },
    {
        "Heart of Glory": "Heart Of Glory"
    },
    {
        "   The Emissary": "The Emissary"
    },
    {
        "   Sins of the Father": "Sins Of The Father"
    },
    {
        "   Family": "Family"
    },
    {
        "   Reunion": "Reunion"
    },
    {
        "   Redemption": "Redemption"
    },
    {
        "   Cost of Living": "Cost Of Living"
    },
    {
        "   New Ground": "New Ground"
    },
    {
        "    Ethics": "Ethics"
    },
    {
        "   Birthright": "Birthright"
    },
    {
        "   Rightful Heir": "Rightful Heir"
    },
    {
        "   Parallels": "Parallels"
    },
    {
        "   Firstborn": "Firstborn"
    },
    {
        "   DS9:   ": null
    },
    {
        "The Way of the Warrior": "The Way Of The Warrior"
    },
    {
        "    Sons of Mogh": "Sons Of Mogh"
    },
    {
        "   Looking for parMach in All the Wrong Places": "Looking For Parmach In All The Wrong Places"
    },
    {
        "   Let He Who Is Without Sin...": "Let He Who Is Without Sin..."
    },
    {
        "   Sons and Daughters": "Sons And Daughters"
    },
    {
        "   You Are Cordially Invited": "You Are Cordially Invited"
    },
    {
        "   Change of Heart": "Change Of Heart"
    },
    {
        "   What You Leave Behind": "What You Leave Behind"
    },
    {
        "     Worf also has significant scenes in the four TNG-era theater films, Star Trek": null
    }
]