[
    {
        "     The World Esperanto Youth Organization  is an organization dedicated to supporting young Esperanto speakers around the world and promote the use of ": null
    },
    {
        "Esperanto": "esperanto"
    },
    {
        ". TEJO was founded in 42 as the Tutmonda Junular-Organizo and took its current name in 42 In 42 TEJO became the youth section of the ": null
    },
    {
        "Universal Esperanto Association": "universal esperanto association"
    },
    {
        " . In 42 the finances and administration of TEJO were fully integrated into those of UEA.     TEJO is an ": null
    },
    {
        "organization": "youth organization"
    },
    {
        " for young ": null
    },
    {
        "Esperanto": "esperanto"
    },
    {
        " speakers. TEJO has individual members as well as member organizations. There are 42 member organizations, as well as 42 national organizations that TEJO has contact with but that are not members.     TEJO organizes an ": null
    },
    {
        "International Youth Congress": "international youth congress"
    },
    {
        "  each year in a different location around the world. During the IJK there are concerts, presentations, excursions, and recreation, usually one week long and attended by a few hundred young people from several different countries.     TEJO also publishes the ": null
    },
    {
        "Pasporta Servo": "pasporta servo"
    },
    {
        ", which is an international hospitality network of Esperanto speakers that accept Esperanto-speaking guests.     TEJO publishes  Kontakto , a magazine aimed at beginners and youth.     TEJO organizes several youth seminars each year. These seminars bring together an international group of young people to discuss a current issue. Past seminars have focused on ": null
    },
    {
        "human rights": "human rights"
    },
    {
        ", ": null
    },
    {
        "globalization": "globalization"
    },
    {
        ", language problems on ": null
    },
    {
        "minority language": "minority language"
    },
    {
        "s, ": null
    },
    {
        "intercomprehension": "intercomprehension"
    },
    {
        " and the ": null
    },
    {
        "Internet": "internet"
    },
    {
        ". The seminars last for one week.         42: World Esperantist Youth Association was established   42: During the first International Youth Congress in Groet, Netherlands, according to a decision of more than 42 participants from 42 countries the World Youth Organization was born.   42: The second ": null
    },
    {
        "IJK": "international youth congress of esperanto"
    },
    {
        " took place in ": null
    },
    {
        "Tervuren": "tervuren"
    },
    {
        ", ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        " Ipswich": "ipswich"
    },
    {
        ", the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " and its taken place every year since then.   42: During the 42th IJK in Ry, Denmark, TJO became TEJO . In that period TEJO was going through a financial and structural crisis.   42: During the 42th IJK in Büsum, Germany, the committee of TEJO proposed that TEJO become the youth section and an integral part of UEA. A period of internal reorganization started.   42: The reorganization process was concluded during the 42th IJK in Rotterdam, Netherlands. TEJO opened itself to the outside world by starting cooperation with several non-Esperanto YNOs.   42:  Kontakto , an international magazine of TEJO, was born. It continues to be published six times a year and is a magazine in Esperanto, but not about Esperanto.   42: PR became the focus of attention. Several brochures and flyers were published in national languages and special group for contacts with other youth organizations was established.   42: The first of a series of seminars was organized in ": null
    },
    {
        "Ljubljana": "ljubljana"
    },
    {
        ", Yugoslavia , with the goal of discussing the language problem and exchange experiences with different YNOs. Seminars soon also discussed more practical topics, such as exchange of experiences between generations and other issues of youth work.   42: At the same time as the most successful IJK took place , TEJO went through a serious financial crisis. TEJO became a correspondent member of the UNESCOs ": null
    },
    {
        "Coordinating Committee for International Voluntary Service": "ccivs"
    },
    {
        ". In ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        " the Programme Passport was launched, which turned into ": null
    },
    {
        "Pasporta Servo": "pasporta servo"
    },
    {
        " several years later   42: TEJO was accepted by the Geneva Informal Meeting, GIM.   42: TEJO organized its first seminar at the European Youth Centre in Strasbourg .   42: TEJO Tutmonde, another one of TEJOs magazines, related to the organization itself, was launched.   42: The first international youth congress took place in Africa, in Togo.                             ": null
    }
]