[
    {
        "          The World Chess Championship is played to determine the world champion in ": null
    },
    {
        "chess": "chess"
    },
    {
        ". Since 42 the schedule has settled on a two-year cycle with a championship held in every even year. ": null
    },
    {
        "Magnus Carlsen": "magnus carlsen"
    },
    {
        " has been world champion since he defeated ": null
    },
    {
        "Viswanathan Anand": "viswanathan anand"
    },
    {
        " in ": null
    },
    {
        "42": "world chess championship 2013"
    },
    {
        ". He successfully defended the title in ": null
    },
    {
        "42": "world chess championship 2014"
    },
    {
        ", ": null
    },
    {
        "42": "world chess championship 2016"
    },
    {
        " and ": null
    },
    {
        "42": "world chess championship 2018"
    },
    {
        ", and is next due to defend the title in ": null
    },
    {
        "late 42": "world chess championship 2020"
    },
    {
        ".     The official world championship is generally regarded to have begun in 42 when the two leading players in the world, ": null
    },
    {
        "Wilhelm Steinitz": "wilhelm steinitz"
    },
    {
        " and ": null
    },
    {
        "Johann Zukertort": "johann zukertort"
    },
    {
        ", played a match, which was won by Steinitz. From 42 to 42 the champion set the terms, requiring any challenger to raise a sizable stake and defeat the champion in a match in order to become the new world champion. From 42 to 42 the championship was administered by ": null
    },
    {
        "FIDE": "fide"
    },
    {
        ", the World Chess Federation. In 42 reigning champion ": null
    },
    {
        "Garry Kasparov": "garry kasparov"
    },
    {
        " broke away from FIDE, which led to the creation of the rival ": null
    },
    {
        "Professional Chess Association": "professional chess association"
    },
    {
        " championship. The titles were unified at the ": null
    },
    {
        "World Chess Championship 42": "world chess championship 2006"
    },
    {
        ", and since 42 the championship has again been administered by FIDE.     Though the world championship is open to all players, there are separate events and titles for the ": null
    },
    {
        "Womens World Chess Championship": "womens world chess championship"
    },
    {
        ", the ": null
    },
    {
        "World Junior Chess Championship": "world junior chess championship"
    },
    {
        " , and the ": null
    },
    {
        "World Senior Chess Championship": "world senior chess championship"
    },
    {
        " . There are also faster time limit events, the ": null
    },
    {
        "World Rapid Chess Championship": "world rapid chess championship"
    },
    {
        " and the ": null
    },
    {
        "World Blitz Chess Championship": "world blitz chess championship"
    },
    {
        ". The ": null
    },
    {
        "World Computer Chess Championship": "world computer chess championship"
    },
    {
        " is open to ": null
    },
    {
        "computer chess programs and hardware": "computer chess"
    },
    {
        ".          The concept of a world chess champion started to emerge in the first half of the 42th century, and the phrase world champion appeared in 42 From this time onwards various players were acclaimed as world champions, but the first contest that was defined in advance as being for the world championship was the match between ": null
    },
    {
        "Steinitz": "wilhelm steinitz"
    },
    {
        " and ": null
    },
    {
        "Zukertort": "johannes zukertort"
    },
    {
        " in 42 Until 42 world championship contests were matches arranged privately between the players. As a result, the players also had to arrange the funding, in the form of stakes provided by enthusiasts who wished to bet on one of the players. In the early 42th century this was sometimes a barrier that prevented or delayed challenges for the title.     Between 42 and 42 various difficulties that arose in match negotiations led players to try to define agreed rules for matches, including the frequency of matches, how much or how little say the champion had in the conditions for a title match and what the stakes and division of the purse should be. However these attempts were unsuccessful in practice, as the same issues continued to delay or prevent challenges.     The first attempt by an external organization to manage the world championship was in 42–42 but this experiment was not repeated. A system for managing regular contests for the title went into operation in 42 under the control of ": null
    },
    {
        "FIDE": "fide"
    },
    {
        ", and functioned quite smoothly until 42 However, in that year reigning champion ": null
    },
    {
        "Kasparov": "garry kasparov"
    },
    {
        " and challenger ": null
    },
    {
        "Short": "nigel short"
    },
    {
        " were so dissatisfied with FIDEs arrangements for their match that they set up a break-away organization. The split in the world championship continued until ": null
    },
    {
        "the reunification match in 42": "world chess championship 2006"
    },
    {
        "; however, the compromises required in order to achieve reunification had effects that lasted until the ": null
    },
    {
        "42 match": "world chess championship 2012"
    },
    {
        ". After reunification, FIDE retains the right to organize the world championship match, stabilizing to a two-year cycle.                  The first match proclaimed by the players as for the world championship was the match that ": null
    },
    {
        "Wilhelm Steinitz": "wilhelm steinitz"
    },
    {
        " won against ": null
    },
    {
        "Johannes Zukertort": "johannes zukertort"
    },
    {
        " in 42 However, a line of players regarded as the strongest in the world extends back hundreds of years before them, and these players are sometimes considered the world champions of their time. They include ": null
    },
    {
        "Ruy López de Segura": "ruy lópez de segura"
    },
    {
        " around 42 ": null
    },
    {
        "Paolo Boi": "paolo boi"
    },
    {
        " and ": null
    },
    {
        "Leonardo da Cutri": "leonardo da cutri"
    },
    {
        " around 42 ": null
    },
    {
        "Alessandro Salvio": "alessandro salvio"
    },
    {
        " around 42 and ": null
    },
    {
        "Gioachino Greco": "gioachino greco"
    },
    {
        " around 42     In the 42th and early 42th centuries, French players dominated, with ": null
    },
    {
        "Legall de Kermeur": "legall de kermeur"
    },
    {
        " , ": null
    },
    {
        "François-André Danican Philidor": "françois-andré danican philidor"
    },
    {
        " , ": null
    },
    {
        "Alexandre Deschapelles": "alexandre deschapelles"
    },
    {
        " and ": null
    },
    {
        "Louis-Charles Mahé de La Bourdonnais": "louis-charles mahé de la bourdonnais"
    },
    {
        " all widely regarded as the strongest players of their time. Something resembling a world championship match was the ": null
    },
    {
        "La Bourdonnais - McDonnell chess matches": "la bourdonnais - mcdonnell chess matches"
    },
    {
        " in 42 in which La Bourdonnais played a series of six matches – and 42 games – against the Irishman ": null
    },
    {
        "Alexander McDonnell": "alexander mcdonnell"
    },
    {
        ".     The idea of a world champion goes back at least to 42 when a columnist in Frasers Magazine wrote, To whom is destined the marshals baton when ": null
    },
    {
        "La Bourdonnais": "louis-charles mahé de la bourdonnais"
    },
    {
        " throws it down, and what country will furnish his successor? ... At present de La Bourdonnais, like ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        ", is without heir, and there is room to fear the empire may be divided eventually under a number of petty kings.        After La Bourdonnaiss death in December 42  . Paul Metzner, Berkeley: University of California Press, c42 42 Englishman ": null
    },
    {
        "Howard Staunton": "howard staunton"
    },
    {
        "s match victory over another Frenchman, ": null
    },
    {
        "Pierre Charles Fournier de Saint-Amant": "pierre charles fournier de saint-amant"
    },
    {
        ", in 42 is considered to have established Staunton as the worlds strongest player. From Morphy to Fischer , ": null
    },
    {
        "Israel Horowitz": "israel horowitz"
    },
    {
        ", p.42 A letter quoted in  The Times  on 42 November 42 but probably written before that, described the second ": null
    },
    {
        "Staunton": "howard staunton"
    },
    {
        " vs ": null
    },
    {
        "Saint-Amant": "pierre charles fournier de saint-amant"
    },
    {
        " match, played in Paris in November–December 42 as being for the golden sceptre of ": null
    },
    {
        "Philidor": "françois-andré danican philidor"
    },
    {
        ". The earliest recorded use of the term World Champion was in 42 when ": null
    },
    {
        "Howard Staunton": "howard staunton"
    },
    {
        " was described as the Chess Champion of England, or  ...  the Champion of the World . The Earl of Mexboroughs speech to the meeting of Yorkshire Chess Clubs, as reported in the 42 Chess Players Chronicle –      The first known proposal that a contest should be defined in advance as being for recognition as the worlds best player was by ": null
    },
    {
        "Ludwig Bledow": "ludwig bledow"
    },
    {
        " in a letter to ": null
    },
    {
        "von der Lasa": "tassilo von heydebrand und der lasa"
    },
    {
        ", written in 42 and published in the Deutsche Schachzeitung in 42: ... the winner of the battle in Paris should not be overly proud of his special position, since it is in Trier that the crown will first be awarded . In 42 to 42 the forthcoming ": null
    },
    {
        "42 London International Tournament": "london 1851 chess tournament"
    },
    {
        " was explicitly described as being for the world championship by three commentators: a letter from a member of the Calcutta Chess Club and another from Captain ": null
    },
    {
        "Hugh Alexander Kennedy": "hugh alexander kennedy"
    },
    {
        " in the 42 volume of the  Chess Players Chronicle ; and the Liberty Weekly Tribune in ": null
    },
    {
        "Missouri": "missouri"
    },
    {
        " .  Although Kennedy was a member of the organizing committee for the tournament, there is no evidence that crowning a world champion was an official aim of the tournament.  This can be viewed online at or downloaded as PDF from         The 42 London tournament was won by the German ": null
    },
    {
        "Adolf Anderssen": "adolf anderssen"
    },
    {
        ", establishing Anderssen as the leading player in the world. From Morphy to Fischer , ": null
    },
    {
        "Israel Horowitz": "israel horowitz"
    },
    {
        ", p.42 Anderssen has been described as the first modern chess master. The Worlds Great Chess Games , ": null
    },
    {
        "Reuben Fine": "reuben fine"
    },
    {
        ", p.42 However, there is no evidence that this victory led to his being widely acclaimed at the time as the world champion, although in 42 ": null
    },
    {
        "Henry Bird": "henry bird"
    },
    {
        " retrospectively awarded the title to Anderssen for his victory. Section Progress of Chess in         Anderssen was himself decisively defeated in an 42 match against the American ": null
    },
    {
        "Paul Morphy": "paul morphy"
    },
    {
        ", after which Morphy was toasted across the chess-playing world as the world chess champion. Morphy played matches against several leading players, crushing them all.  , Mark Weeks Chess Pages   Harpers Weekly  and The American Union hailed him as the world champion, but another article in Harpers Weekly was uncertain about whether to describe the Morphy–": null
    },
    {
        "Harrwitz": "daniel harrwitz"
    },
    {
        " match as being for the world championship. Soon after, Morphy offered pawn and move odds to anyone who played him. Finding no takers, he abruptly retired from chess the following year, but many considered him the world champion until his death in 42 His sudden withdrawal from chess at his peak led to his being known as the pride and sorrow of chess .     This left Anderssen again as possibly the worlds strongest active player, a reputation he reinforced by winning the strong ": null
    },
    {
        "London 42 chess tournament": "london 1862 chess tournament"
    },
    {
        ".     ": null
    },
    {
        "Wilhelm Steinitz": "wilhelm steinitz"
    },
    {
        " narrowly defeated Anderssen in an 42 match, which some commentators consider the first official world championship match. The Worlds Great Chess Games , ": null
    },
    {
        "Reuben Fine": "reuben fine"
    },
    {
        ", p.42 However, Fine also regards Staunton, Anderssen, and Morphy as having been world champions. Reuben Fine, Great Moments in Modern Chess , Dover Publications, 42 pp. 42–42  . The match was not declared to be a world championship at the time, and it was only after Morphys death in 42 that such a match was declared, a testament to Morphys dominance of the game . The Centenary Match, Kasparov–Karpov III , ": null
    },
    {
        "Raymond Keene": "raymond keene"
    },
    {
        " and David Goodman, Batsford 42 p.42 The use of the term World Chess Champion in this era is varied, but it appears that Steinitz, at least in later life, dated his reign from this 42 match.  , ": null
    },
    {
        "Edward G. Winter": "edward g. winter"
    },
    {
        ", 42     In 42 ": null
    },
    {
        "Johannes Zukertort": "johannes zukertort"
    },
    {
        " won the ": null
    },
    {
        "Paris 42 chess tournament": "paris 1878 chess tournament"
    },
    {
        " , and later won the ": null
    },
    {
        "London 42 chess tournament": "london 1883 chess tournament"
    },
    {
        " by a convincing 42-point margin, ahead of nearly every leading player in the world, including Steinitz.  , Mark Weeks Chess Pages David Hooper and Kenneth Whyld, The Oxford Companion to Chess, Oxford University Press, 42 , p.42 . This tournament established Steinitz and Zukertort as the best two players in the world, and led to the inaugural World Championship match between these two, the ": null
    },
    {
        "World Chess Championship 42": "world chess championship 1886"
    },
    {
        ". J.I. Minchin, the editor of the tournament book, wrote, Dr. Zukertort at present holds the honoured post of champion, but only a match can settle the position of these rival monarchs of the Chess realm. J.I. Minchin , Games Played in the London International Chess Tournament, 42, British Chess Magazine, 42 , p.42 David Hooper and Kenneth Whyld, The Oxford Companion to Chess, Oxford University Press, 42 , p.42 . . The Centenary Match, Kasparov–Karpov III , ": null
    },
    {
        "Raymond Keene": "raymond keene"
    },
    {
        " and David Goodman, Batsford 42 p.42 This match, won by Steinitz, though not held under the aegis of any official body, is generally recognized as the first official World Chess Championship match, with Steinitz the games first official World Champion.     ": null
    },
    {
        "Graham Burgess": "graham burgess"
    },
    {
        " lists Philidor, de la Bourdonnais, Staunton, and Morphy as players who were acclaimed as the greatest players of their time .       The championship was conducted on a fairly informal basis through the remainder of the 42th century and in the first half of the 42th: if a player thought he was strong enough, he would find financial backing for a match purse and challenge the reigning world champion. If he won, he would become the new champion. There was no formal system of qualification. However, it is generally considered that the system did on the whole produce champions who were the strongest players of their day. The players who held the title up until World War II were Steinitz, ": null
    },
    {
        "Emanuel Lasker": "emanuel lasker"
    },
    {
        ", ": null
    },
    {
        "José Raúl Capablanca": "josé raúl capablanca"
    },
    {
        ", ": null
    },
    {
        "Alexander Alekhine": "alexander alekhine"
    },
    {
        ", and ": null
    },
    {
        "Max Euwe": "max euwe"
    },
    {
        ", each of them defeating the previous incumbent in a match.            ": null
    },
    {
        "Wilhelm Steinitz": "wilhelm steinitz"
    },
    {
        "s reign is notable for: the first recorded suggestion that a world champion could forfeit the title by declining a credible challenge or by prolonged absence from competition; the first recorded instance of a disputed world championship; the first actual contest that was defined in advance as being for the world championship ; the first attempt to regulate contests for the world championship; debates about whether the championship should be decided by a match or a tournament; and differences between commentators about when his reign began, which persist to the present day.  Based on      There is no evidence that Steinitz claimed the title for himself immediately after winning a match against ": null
    },
    {
        "Adolf Anderssen": "adolf anderssen"
    },
    {
        " in 42 although in his International Chess Magazine he claimed to have been the champion since 42 It has been suggested that Steinitz could not make such a claim while ": null
    },
    {
        "Paul Morphy": "paul morphy"
    },
    {
        " was alive.  Morphy had defeated Anderssen by a far wider margin in 42 but retired from chess competition soon after he returned to the United States in 42 and died in 42 The earliest known reference to Steinitz as world champion was in the Chess Players Chronicle , after he beat ": null
    },
    {
        "Johannes Zukertort": "johannes zukertort"
    },
    {
        " in their first match. But the New York Times ,  British Chess Magazine and ": null
    },
    {
        "Emanuel Lasker": "emanuel lasker"
    },
    {
        "  dated his reign from 42 and in the early 42s ": null
    },
    {
        "Reuben Fine": "reuben fine"
    },
    {
        " followed their example.  On the other hand, many recent commentators divide Steinitzs reign into an unofficial one before he beat Zukertort ": null
    },
    {
        "again in 42": "world chess championship 1886"
    },
    {
        " and the first official world championship from that time onwards;     Steinitz had insisted that the contract for the 42 match must specify that the match was for the Championship of the World .      The Irish Times  argued that Steinitz had forfeited the title by prolonged absence from competitive chess and therefore Zukertort should be regarded as champion. The Chess Players Chronicle made a more complex argument: other commentators had suggested that Zukertort should be regarded as champion because he had won a major tournament ; the Chronicle thought tournaments were an unreliable way of deciding the championship and Steinitzs victories in matches gave him the better claim; but, if Zukertort were the champion, he should forfeit the title if he declined a challenge, especially from a challenger with Steinitzs credentials, and in that case the title should revert to Steinitz.     In 42 the ": null
    },
    {
        "American Chess Congress": "american chess congress"
    },
    {
        " started work on drawing up regulations for the future conduct of world championship contests. Steinitz supported this endeavor, as he thought he was becoming too old to remain world champion. The proposal evolved through many forms , and resulted in the New York 42 tournament to select a challenger for Steinitz, rather like the more recent ": null
    },
    {
        "Candidates Tournament": "candidates tournament"
    },
    {
        "s. The tournament was duly played, but the outcome was not quite as planned: ": null
    },
    {
        "Mikhail Chigorin": "mikhail chigorin"
    },
    {
        " and ": null
    },
    {
        "Max Weiss": "max weiss"
    },
    {
        " tied for first place; their play-off resulted in four draws; and neither wanted to play a match against Steinitz – Chigorin had just lost to him, and Weiss wanted to get back to his work for the ": null
    },
    {
        "Rothschild Bank": "s. m. von rothschild"
    },
    {
        ". The third prizewinner ": null
    },
    {
        "Isidore Gunsberg": "isidore gunsberg"
    },
    {
        " was prepared to play Steinitz for the title in New York, and Steinitz won their match in 42–42   This experiment was not repeated and the 42 match in which Steinitz lost his title was a private arrangement between the players.         Lasker was the first champion after Steinitz; although he did not defend his title in 42–42 or 42–42 he did string together an impressive run of tournament victories and dominated his opponents. His success was largely due to the fact that he was an excellent practical player. In difficult or objectively lost positions he would complicate matters and use his extraordinary tactical abilities to save the game. He held the title from 42 to 42 the longest reign of any champion. In that period he defended the title successfully in one-sided matches against Steinitz, ": null
    },
    {
        "Frank Marshall": "frank marshall"
    },
    {
        ", ": null
    },
    {
        "Siegbert Tarrasch": "siegbert tarrasch"
    },
    {
        " and ": null
    },
    {
        "Dawid Janowski": "dawid janowski"
    },
    {
        ", and was only seriously threatened in a tied 42 match against ": null
    },
    {
        "Carl Schlechter": "carl schlechter"
    },
    {
        ".     Laskers negotiations for title matches from 42 onwards were extremely controversial. In 42 he received a challenge for a world title match against ": null
    },
    {
        "José Raúl Capablanca": "josé raúl capablanca"
    },
    {
        " and, in addition to making severe financial demands, proposed some novel conditions: the match should be considered drawn if neither player finished with a two-game lead; and it should have a maximum of 42 games, but finish if either player won six games and had a two-game lead . Capablanca objected to the two-game lead clause; Lasker took offence at the terms in which Capablanca criticized the two-game lead condition and broke off negotiations.  This cites: a report of Laskers concerns about the location and duration of the match, in ; Capablancas letter of 42 December 42 to Lasker, stating his objections to Laskers proposal; Laskers letter to Capablanca, breaking off negotiations; Laskers letter of 42 April 42 to Alberto Ponce of the Havana Chess Club, proposing to resign the 42 match; and Ponces reply, accepting the resignation.     Further controversy arose when, in 42 Laskers terms for a proposed match with ": null
    },
    {
        "Akiba Rubinstein": "akiba rubinstein"
    },
    {
        " included a clause that, if Lasker should resign the title after a date had been set for the match, Rubinstein should become world champion . When he resumed negotiations with Capablanca after World War I, Lasker insisted on a similar clause that if Lasker should resign the title after a date had been set for the match, Capablanca should become world champion. On 42 June 42 Lasker abdicated in favor of Capablanca because of public criticisms of the terms for the match, naming Capablanca as his successor . Some commentators questioned Laskers right to name his successor ; ": null
    },
    {
        "Amos Burn": "amos burn"
    },
    {
        " raised the same objection but welcomed Laskers resignation of the title . Capablanca argued that, if the champion abdicated, the title must go to the challenger as any other arrangement would be unfair to the challenger . Nonetheless Lasker agreed to play a match against Capablanca in 42 announcing that, if he won, he would resign the title so that younger masters could compete for it .  Capablanca ": null
    },
    {
        "won their 42 match easily": "world chess championship 1921"
    },
    {
        ".            After the breakdown of his first attempt to negotiate a title match against Lasker , Capablanca drafted rules for the conduct of future challenges, which were agreed by the other top players at the 42 Saint Petersburg tournament, including Lasker, and approved at the Mannheim Congress later that year. The main points were: the champion must be prepared to defend his title once a year; the match should be won by whichever player first won six or eight games ; and the stake should be at least £42 .     Following the controversies surrounding his 42 match against Lasker, in 42 world champion Capablanca proposed the London Rules : the first player to win six games would win the match; playing sessions would be limited to 42 hours; the time limit would be 42 moves in 42½ hours; the champion must defend his title within one year of receiving a challenge from a recognized master; the champion would decide the date of the match; the champion was not obliged to accept a challenge for a purse of less than US$42 ; 42% of the purse was to be paid to the title holder, and the remainder being divided, 42% going to the winner of the match, and 42% to the loser; the highest purse bid must be accepted. ": null
    },
    {
        "Alekhine": "alexander alekhine"
    },
    {
        ", ": null
    },
    {
        "Bogoljubov": "efim bogoljubov"
    },
    {
        ", ": null
    },
    {
        "Maróczy": "géza maróczy"
    },
    {
        ", ": null
    },
    {
        "Réti": "richard réti"
    },
    {
        ", ": null
    },
    {
        "Rubinstein": "akiba rubinstein"
    },
    {
        ", ": null
    },
    {
        "Tartakower": "savielly tartakower"
    },
    {
        " and ": null
    },
    {
        "Vidmar": "milan vidmar"
    },
    {
        " promptly signed them.      The only match played under those rules was Capablanca vs ": null
    },
    {
        "Alekhine": "alexander alekhine"
    },
    {
        " in ": null
    },
    {
        "42": "world chess championship 1927"
    },
    {
        ", although there has been speculation that the actual contract might have included a two-game lead clause.  Regarding a possible two-game lead clause, Winter cites Capablancas messages to Julius Finn and Norbert Lederer dated 42 October 42 in which he proposed that, if the Buenos Aires match were drawn, the second match could be limited to 42 games. Winter cites La Prensa 42 November 42 for Alekhines conditions for a return match. Alekhine, Rubinstein and ": null
    },
    {
        "Nimzowitsch": "aron nimzowitsch"
    },
    {
        " had all challenged Capablanca in the early 42s but only Alekhine could raise the US$42 Capablanca demanded and only in 42 Capablanca was shockingly upset by the new challenger. Before the match, almost nobody gave Alekhine a chance against the dominant ": null
    },
    {
        "Cuba": "cuba"
    },
    {
        "n, but Alekhine overcame Capablancas natural skill with his unmatched drive and extensive preparation . The aggressive Alekhine was helped by his tactical skill, which complicated the game.     Immediately after winning, Alekhine announced that he was willing to grant Capablanca a return match provided Capablanca met the requirements of the London Rules . Negotiations dragged on for several years, often breaking down when agreement seemed in sight. Alekhine easily won two title matches against ": null
    },
    {
        "Efim Bogoljubov": "efim bogoljubov"
    },
    {
        " in ": null
    },
    {
        "42": "world chess championship 1929"
    },
    {
        " and ": null
    },
    {
        "42": "world chess championship 1934"
    },
    {
        ".     In ": null
    },
    {
        "42": "world chess championship 1935"
    },
    {
        ", Alekhine was unexpectedly defeated by the Dutch ": null
    },
    {
        "Max Euwe": "max euwe"
    },
    {
        ", an amateur player who worked as a ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        " teacher. Alekhine convincingly won a ": null
    },
    {
        "rematch in 42": "world chess championship 1937"
    },
    {
        ". World War II temporarily prevented any further world title matches, and Alekhine remained world champion until his death in 42       Before ": null
    },
    {
        "42": "world chess championship 1948"
    },
    {
        " world championship matches were financed by arrangements similar to those ": null
    },
    {
        "Emanuel Lasker": "emanuel lasker"
    },
    {
        " described for his ": null
    },
    {
        "42 match": "world chess championship 1894"
    },
    {
        " with ": null
    },
    {
        "Wilhelm Steinitz": "wilhelm steinitz"
    },
    {
        ": either the challenger or both players, with the assistance of financial backers, would contribute to a ": null
    },
    {
        "purse": "purse distribution"
    },
    {
        "; about half would be distributed to the winners backers, and the winner would receive the larger share of the remainder . The players had to meet their own travel, accommodation, food and other expenses out of their shares of the purse.  This system evolved out of the wagering of small stakes on club games in the early 42th century.     Up to and including the 42 Steinitz–Lasker match, both players, with their backers, generally contributed equally to the purse, following the custom of important matches in the 42th century before there was a generally recognized world champion. For example: the stakes were £42 a side in both the second ": null
    },
    {
        "Staunton": "howard staunton"
    },
    {
        " vs ": null
    },
    {
        "Saint-Amant": "pierre charles fournier de saint-amant"
    },
    {
        " match and the ": null
    },
    {
        "Anderssen": "adolf anderssen"
    },
    {
        " vs ": null
    },
    {
        "Steinitz": "wilhelm steinitz"
    },
    {
        " match ; Steinitz and ": null
    },
    {
        "Zukertort": "johannes zukertort"
    },
    {
        " played their ": null
    },
    {
        "42 match": "world chess championship 1886"
    },
    {
        " for £42 a side. Section Stakes at Chess in  Lasker introduced the practice of demanding that the challenger should provide the whole of the purse, and his successors followed his example up to World War II. This requirement makes arranging world championship matches more difficult, for example: ": null
    },
    {
        "Marshall": "frank james marshall"
    },
    {
        " challenged Lasker in 42 but could not raise the money until 42;  in 42 Lasker and ": null
    },
    {
        "Rubinstein": "akiba rubinstein"
    },
    {
        " agreed in principle to a world championship match, but this was never played as Rubinstein could not raise the money.   In the early 42s, ": null
    },
    {
        "Alekhine": "alexander alekhine"
    },
    {
        ", Rubinstein and ": null
    },
    {
        "Nimzowitsch": "aron nimzowitsch"
    },
    {
        " all challenged ": null
    },
    {
        "Capablanca": "josé raúl capablanca"
    },
    {
        ", but only Alekhine was able to raise the US$42 that Capablanca demanded, and not until 42              Attempts to form an international chess federation were made at the time of the 42 ": null
    },
    {
        "St. Petersburg": "st. petersburg"
    },
    {
        ", 42 ": null
    },
    {
        "Mannheim": "mannheim"
    },
    {
        " and 42 ": null
    },
    {
        "Gothenburg": "gothenburg"
    },
    {
        " Tournaments. On 42 July 42 the participants at the Paris tournament founded ": null
    },
    {
        "FIDE": "fide"
    },
    {
        " as a kind of players union.        FIDEs congresses in 42 and 42 expressed a desire to become involved in managing the world championship. FIDE was largely happy with the London Rules , but claimed that the requirement for a purse of $42 was impracticable and called upon ": null
    },
    {
        "Capablanca": "josé raúl capablanca"
    },
    {
        " to come to an agreement with the leading masters to revise the Rules. In 42 FIDE decided in principle to create a parallel title of Champion of FIDE and, in 42 adopted the forthcoming 42 ": null
    },
    {
        "Bogoljubow": "efim bogoljubow"
    },
    {
        "–": null
    },
    {
        "Euwe": "max euwe"
    },
    {
        " match as being for the FIDE championship . ": null
    },
    {
        "Alekhine": "alexander alekhine"
    },
    {
        " agreed to place future matches for the world title under the auspices of FIDE, except that he would only play Capablanca under the same conditions that governed their match in 42 Although FIDE wished to set up a unification match between Alekhine and Bogoljubow, it made little progress and the title Champion of FIDE quietly vanished after Alekhine won the 42 world championship match that he and Bogoljubow themselves arranged.  Winter cites: Resolution XI of the 42 FIDE Congress, regarding the London Rules ; page 42 of the 42 Congress minutes about the initial decision to set up an official championship of FIDE ; Schweizerische Schachzeitung for FIDEs decision to await the result of the Capablanca–Alekhine match; the minutes of FIDEs 42 congress for the adoption of the forthcoming 42 Bologjubow–Euwe match as being for the FIDE championship and its congratulations to the winner, Bologjubow; the minutes of FIDEs 42 congress for Alekhines agreement and his exception for Capablanca; a resolution of 42 for the attempt to arrange a unification match; subsequent FIDE minutes for the non-occurrence of a unification match and the vanishing of the title Champion of FIDE .     While negotiating his 42 World Championship rematch with Alekhine, Euwe proposed that if he retained the title FIDE should manage the nomination of future challengers and the conduct of championship matches. FIDE had been trying since 42 to introduce rules on how to select challengers, and its various proposals favored selection by some sort of committee. While they were debating procedures in 42 and Alekhine and Euwe were preparing for their rematch later that year, the ": null
    },
    {
        "Royal Dutch Chess Federation": "royal dutch chess federation"
    },
    {
        " proposed that a super-tournament of ex-champions and rising stars should be held to select the next challenger. FIDE rejected this proposal and at their second attempt nominated ": null
    },
    {
        "Salo Flohr": "salo flohr"
    },
    {
        " as the official challenger. Euwe then declared that: if he retained his title against Alekhine he was prepared to meet Flohr in 42 but he reserved the right to arrange a title match either in 42 or 42 with ": null
    },
    {
        "José Raúl Capablanca": "josé raúl capablanca"
    },
    {
        ", who had lost the title to Alekhine in 42; if Euwe lost his ": null
    },
    {
        "title": "title"
    },
    {
        " to Capablanca then FIDEs decision should be followed and Capablanca would have to play Flohr in 42 Most chess writers and players strongly supported the Dutch super-tournament proposal and opposed the committee processes favored by FIDE. While this confusion went unresolved: Euwe lost his title to Alekhine; the ": null
    },
    {
        "AVRO tournament": "avro tournament"
    },
    {
        " in 42 was won by ": null
    },
    {
        "Paul Keres": "paul keres"
    },
    {
        " under a tie-breaking rule, with ": null
    },
    {
        "Reuben Fine": "reuben fine"
    },
    {
        " placed second and Capablanca and Flohr in the bottom places; and the outbreak of World War II in 42 cut short the controversy.            Before 42 a new World Champion had won the title by defeating the former champion in a match. ": null
    },
    {
        "Alexander Alekhine": "alexander alekhine"
    },
    {
        "s death in 42 created an ": null
    },
    {
        "interregnum": "interregnum of world chess champions"
    },
    {
        " that made the normal procedure impossible. The situation was very confused, with many respected players and commentators offering different solutions. FIDE found it very difficult to organize the early discussions on how to resolve the interregnum because problems with money and travel so soon after the end of World War II prevented many countries from sending representatives. The shortage of clear information resulted in otherwise responsible magazines publishing rumors and speculation, which only made the situation more confused.   It did not help that the Soviet Union had long refused to join FIDE, and by this time it was clear that about half the credible contenders were Soviet citizens. But the Soviet Union realized it could not afford to be left out of the discussions about the vacant world championship, and in 42 sent a telegram apologizing for the absence of Soviet representatives and requesting that the USSR be represented in future FIDE Committees.     The eventual solution was very similar to FIDEs initial proposal and to a proposal put forward by the Soviet Union . The 42 ": null
    },
    {
        "AVRO tournament": "avro tournament"
    },
    {
        " was used as the basis for the ": null
    },
    {
        "42 Championship Tournament": "world chess championship 1948"
    },
    {
        ". The AVRO tournament had brought together the eight players who were, by general acclamation, the best players in the world at the time. Two of the participants at AVRO – Alekhine and former world champion ": null
    },
    {
        "José Raúl Capablanca": "josé raúl capablanca"
    },
    {
        " – had died; but FIDE decided that the championship should be awarded to the winner of a ": null
    },
    {
        "round-robin tournament": "round-robin tournament"
    },
    {
        " in which the other six participants at AVRO would play four games against each other. These players were: ": null
    },
    {
        "Max Euwe": "max euwe"
    },
    {
        ", from the Netherlands; Botvinnik, ": null
    },
    {
        "Paul Keres": "paul keres"
    },
    {
        " and ": null
    },
    {
        "Salo Flohr": "salo flohr"
    },
    {
        " from the Soviet Union; and ": null
    },
    {
        "Reuben Fine": "reuben fine"
    },
    {
        " and ": null
    },
    {
        "Samuel Reshevsky": "samuel reshevsky"
    },
    {
        " from the United States. However, FIDE soon accepted a Soviet request to substitute ": null
    },
    {
        "Vasily Smyslov": "vasily smyslov"
    },
    {
        " for Flohr, and Fine dropped out in order to continue his degree studies in ": null
    },
    {
        "psychology": "psychology"
    },
    {
        ", so only five players competed. Botvinnik won convincingly and thus became world champion, ending the interregnum.      The proposals which led to the 42 Championship Tournament also specified the procedure by which challengers for the World Championship would be selected in a three-year cycle: countries affiliated to FIDE would send players to Zonal Tournaments ; the players who gained the top places in these would compete in an Interzonal Tournament ; the highest-placed players from the Interzonal would compete in the ": null
    },
    {
        "Candidates Tournament": "candidates tournament"
    },
    {
        ", along with whoever lost the previous title match and the second-placed competitor in the previous Candidates Tournament three years earlier; and the winner of the Candidates played a title match against the champion. Until 42 inclusive the Candidates Tournament was a multi-cycle round-robin tournament – how and why it was changed are described below.          The FIDE system followed its 42 design through five cycles: 42–42 42–42 42–42 42–42 and 42–42   The first two world championships under this system were drawn 42–42 – Botvinnik-Bronstein in 42 and Botvinnik-Smyslov in 42 – so Botvinnik retained the title both times.     In 42 FIDE introduced two apparently minor changes which Soviet ": null
    },
    {
        "grandmaster": "grandmaster"
    },
    {
        " and chess official ": null
    },
    {
        "Yuri Averbakh": "yuri averbakh"
    },
    {
        " alleged were instigated by the two Soviet representatives in FIDE, who were personal friends of reigning champion ": null
    },
    {
        "Mikhail Botvinnik": "mikhail botvinnik"
    },
    {
        ". A defeated champion would have the right to a return match. FIDE also limited the number of players from the same country that could compete in the ": null
    },
    {
        "Candidates Tournament": "candidates tournament"
    },
    {
        ", on the grounds that it would reduce Soviet dominance of the tournament. Averbakh claimed that this was to Botvinniks advantage as it reduced the number of Soviet players he might have to meet in the title match.  Botvinnik lost to ": null
    },
    {
        "Vasily Smyslov": "vasily smyslov"
    },
    {
        " in 42 but won the return match in 42 and lost to ": null
    },
    {
        "Mikhail Tal": "mikhail tal"
    },
    {
        " in 42 but won the return match in 42 Thus Smyslov and Tal each held the world title for a year, but Botvinnik was world champion for rest of the time from 42 to 42     The return match clause was not in place for the 42 cycle. ": null
    },
    {
        "Tigran Petrosian": "tigran petrosian"
    },
    {
        " won the 42 Candidates and then ": null
    },
    {
        "defeated Botvinnik in 42": "world chess championship 1963"
    },
    {
        " to become world champion.            After the 42 Candidates, ": null
    },
    {
        "Bobby Fischer": "bobby fischer"
    },
    {
        " publicly alleged that the Soviets had colluded to prevent any non-Soviet – specifically him – from winning. He claimed that Petrosian, ": null
    },
    {
        "Efim Geller": "efim geller"
    },
    {
        " and ": null
    },
    {
        "Paul Keres": "paul keres"
    },
    {
        " had prearranged to draw all their games, and that Korchnoi had been instructed to lose to them. ": null
    },
    {
        "Yuri Averbakh": "yuri averbakh"
    },
    {
        ", who was head of the Soviet team, confirmed in 42 that Petrosian, Geller and Keres arranged to draw all their games in order to save their energy for games against non-Soviet players, and a statistical analysis in 42 backed this up.  Another contestant, ": null
    },
    {
        "Pal Benko": "pal benko"
    },
    {
        ", claimed that towards the end of the tournament Petrosian and Geller, who were friends, helped Benko with adjournment analysis of his game against Keres, who was the main threat to Petrosian.  Korchnoi, who defected from the USSR in 42 has never alleged he was forced to throw games. FIDE responded by changing the format of future Candidates Tournaments to eliminate the possibility of collusion.     Beginning in the next cycle, 42–42 the ": null
    },
    {
        "round-robin tournament": "round-robin tournament"
    },
    {
        " was replaced by a series of elimination matches. Initially the quarter-finals and semi-finals were best of 42 games, and the final was best of 42 Fischer, however, refused to take part in the 42 cycle, and dropped out of the 42 cycle after a controversy at 42 Interzonal in Sousse.  Both these Candidates cycles were won by ": null
    },
    {
        "Boris Spassky": "boris spassky"
    },
    {
        ", who lost the title match to Petrosian in 42 but won and became world champion in 42          In the 42–42 cycle Fischer caused two more crises. He refused to play in the 42 US Championship, which was a Zonal Tournament. This would have eliminated him from the 42–42 cycle, but Benko was persuaded to concede his place in the Interzonal to Fischer.  FIDE President ": null
    },
    {
        "Max Euwe": "max euwe"
    },
    {
        " accepted this maneuver and interpreted the rules very flexibly to enable Fischer to play, as he thought it important for the health and reputation of the game that Fischer should have the opportunity to challenge for the title as soon as possible.  Fischer crushed all opposition and won the right to challenge reigning champion ": null
    },
    {
        "Boris Spassky": "boris spassky"
    },
    {
        ". After agreeing to play in Yugoslavia, Fischer raised a series of objections and Iceland was the final venue. Even then Fischer raised difficulties, mainly over money. It took a phone call from ": null
    },
    {
        "United States Secretary of State": "united states secretary of state"
    },
    {
        " Henry Kissinger": "henry kissinger"
    },
    {
        " and a doubling of the prize money by financier ": null
    },
    {
        "Jim Slater": "jim slater"
    },
    {
        " to persuade him to play. After a few more traumatic moments Fischer won the match 42½–42½.       An unbroken line of FIDE champions had thus been established from 42 to 42 with each champion gaining his title by beating the previous incumbent. This came to an end when ": null
    },
    {
        "Anatoly Karpov": "anatoly karpov"
    },
    {
        " won the right to challenge Fischer in 42 Fischer objected to the best of 42 games championship match format that had been used from 42 onwards, claiming that it would encourage whoever got an early lead to play for draws. Instead he demanded that the match should be won by whoever first won 42 games, except that if the score reached 42–42 he should remain champion. He argued that this was more advantageous to the challenger than the champions advantage under the existing system, where the champion retained the title if the match was tied at 42–42 including draws. Eventually FIDE deposed Fischer and crowned Karpov as the new champion.      Fischer privately maintained that he was still World Champion. He went into seclusion and did not play chess in public again until 42 when he offered Spassky a rematch, again for the World Championship. The ": null
    },
    {
        "Fischer–Spassky ": "fischer–spassky"
    },
    {
        " attracted good media coverage, but the chess world did not take this claim to the championship seriously.       Karpov dominated the 42s and early 42s with an incredible string of tournament successes. He convincingly demonstrated that he was the strongest player in the world by defending his title twice against ex-Soviet ": null
    },
    {
        "Viktor Korchnoi": "viktor korchnoi"
    },
    {
        ", first in ": null
    },
    {
        "Baguio City": "baguio city"
    },
    {
        " in ": null
    },
    {
        "42": "world chess championship 1978"
    },
    {
        " then in ": null
    },
    {
        "Meran": "meran"
    },
    {
        " in ": null
    },
    {
        "42": "world chess championship 1981"
    },
    {
        " . His ": null
    },
    {
        "boa constrictor": "boa"
    },
    {
        " style frustrated opponents, often causing them to lash out and err. This allowed him to bring the full force of his Botvinnik-learned dry technique against them, grinding his way to victory.     He eventually lost his title to ": null
    },
    {
        "Garry Kasparov": "garry kasparov"
    },
    {
        ", whose aggressive tactical style was in sharp contrast to Karpovs positional style. The two of them fought five incredibly close world championship matches, the ": null
    },
    {
        "World Chess Championship 42": "world chess championship 1984"
    },
    {
        " , ": null
    },
    {
        "World Chess Championship 42": "world chess championship 1985"
    },
    {
        " , ": null
    },
    {
        "World Chess Championship 42": "world chess championship 1986"
    },
    {
        " , ": null
    },
    {
        "World Chess Championship 42": "world chess championship 1987"
    },
    {
        " , and ": null
    },
    {
        "World Chess Championship 42": "world chess championship 1990"
    },
    {
        " .   In the five matches Kasparov and Karpov played 42 games with 42 draws, 42 wins by Kasparov and 42 wins by Karpov.       In 42 ": null
    },
    {
        "Nigel Short": "nigel short"
    },
    {
        " broke the domination of the two Ks by defeating Karpov in the candidates semi-finals followed by ": null
    },
    {
        "Jan Timman": "jan timman"
    },
    {
        " in the finals, thereby earning the right to challenge Kasparov for the title. However, before the match took place, both Kasparov and Short complained of corruption and a lack of professionalism within FIDE in organizing the match, and split from FIDE to set up the ": null
    },
    {
        "Professional Chess Association": "professional chess association"
    },
    {
        " , under whose auspices they held their match. Affronted by the PCA split, FIDE stripped Kasparov of his title and held a championship match between Karpov and Timman. Kasparov defeated Short while Karpov beat Timman, and for the first time in history there were two World Chess Champions.     FIDE and the PCA each held a championship cycle in 42–42 with many of the same challengers playing in both. Kasparov and Karpov both won their respective cycles. In the PCA cycle, Kasparov defeated ": null
    },
    {
        "Viswanathan Anand": "viswanathan anand"
    },
    {
        " in the ": null
    },
    {
        "PCA World Chess Championship 42": "pca world chess championship 1995"
    },
    {
        ". Karpov defeated ": null
    },
    {
        "Gata Kamsky": "gata kamsky"
    },
    {
        " in the final of the ": null
    },
    {
        "FIDE World Chess Championship 42": "fide world chess championship 1996"
    },
    {
        ". Negotiations were held for a reunification match between Kasparov and Karpov in 42–42 but nothing came of them. , ": null
    },
    {
        "The Week in Chess": "the week in chess"
    },
    {
        " 42 42 October 42      Soon after the 42 championship, the PCA folded, and Kasparov had no organisation to choose his next challenger. In 42 he formed the World Chess Council, which organised a candidates match between ": null
    },
    {
        "Alexei Shirov": "alexei shirov"
    },
    {
        " and ": null
    },
    {
        "Vladimir Kramnik": "vladimir kramnik"
    },
    {
        ". Shirov won the match, but negotiations for a Kasparov–Shirov match broke down, and Shirov was subsequently omitted from negotiations, much to his disgust. Plans for a 42 or 42 Kasparov–Anand match also broke down, and Kasparov organised a match with Kramnik in late 42 In a major upset, Kramnik ": null
    },
    {
        "won the match": "classical world chess championship 2000"
    },
    {
        " with two wins, thirteen draws, and no losses. At the time the championship was called the Braingames World Chess Championship, but Kramnik later referred to himself as the Classical World Chess Champion.     Meanwhile, FIDE had decided to scrap the Interzonal and Candidates system, instead having a large knockout event in which a large number of players contested short matches against each other over just a few weeks . ": null
    },
    {
        "Rapid and blitz": "fast chess"
    },
    {
        " games were used to resolve ties at the end of each round, a format which some felt did not necessarily recognize the highest quality play: Kasparov refused to participate in these events, as did Kramnik after he won the Classical title in 42 In the ": null
    },
    {
        "first of these events in 42": "fide world chess championship 1998"
    },
    {
        ", champion Karpov was seeded straight into the final, but subsequently the champion had to qualify like other players. Karpov defended his title in the first of these championships in 42 but resigned his title in protest at the new rules in 42 ": null
    },
    {
        "Alexander Khalifman": "alexander khalifman"
    },
    {
        " won the FIDE World Championship in ": null
    },
    {
        "42": "fide world chess championship 1999"
    },
    {
        ", Anand in ": null
    },
    {
        "42": "fide world chess championship 2000"
    },
    {
        ", ": null
    },
    {
        "Ruslan Ponomariov": "ruslan ponomariov"
    },
    {
        " in ": null
    },
    {
        "42": "fide world chess championship 2002"
    },
    {
        ", and ": null
    },
    {
        "Rustam Kasimdzhanov": "rustam kasimdzhanov"
    },
    {
        " in ": null
    },
    {
        "42": "fide world chess championship 2004"
    },
    {
        ".     By 42 not only were there two rival champions, but Kasparovs strong results – he had the top ": null
    },
    {
        "Elo rating": "elo rating"
    },
    {
        " in the world and had won a string of major tournaments after losing his title in 42 – ensured even more confusion over who was World Champion. In May 42 American grandmaster ": null
    },
    {
        "Yasser Seirawan": "yasser seirawan"
    },
    {
        " led the organisation of the so-called Prague Agreement to reunite the world championship. Kramnik had organised a candidates tournament  to choose his challenger. It was decided that Kasparov play the FIDE champion for the FIDE title, and the winner of this match play the winner of the Kramnik–Leko match for a unified title. However, the matches proved difficult to finance and organise. The ": null
    },
    {
        "Kramnik–Leko match": "classical world chess championship 2004"
    },
    {
        " did not take place until late 42 . Meanwhile, FIDE never managed to organise a Kasparov match, either with 42 FIDE champion Ponomariov, or 42 FIDE champion Kasimdzhanov. Partly due to his frustration at the situation, Kasparov retired from chess in 42 still ranked No. 42 in the world.     Soon after, FIDE dropped the short knockout format for a World Championship and announced the ": null
    },
    {
        "FIDE World Chess Championship 42": "fide world chess championship 2005"
    },
    {
        ", a double round robin tournament to be held in ": null
    },
    {
        "San Luis, Argentina": "san luis, argentina"
    },
    {
        " between eight of the leading players in the world. However Kramnik insisted that his title be decided in a match, and declined to participate. The tournament was convincingly won by the Bulgarian ": null
    },
    {
        "Veselin Topalov": "veselin topalov"
    },
    {
        ", and negotiations began for a Kramnik–Topalov match to unify the title.         The ": null
    },
    {
        "World Chess Championship 42": "world chess championship 2006"
    },
    {
        " reunification match between Topalov and Kramnik was held in late 42 After much controversy, it was won by Kramnik. Kramnik thus became the first unified and undisputed World Chess Champion since Kasparov split from FIDE to form the PCA in 42 This match, and all subsequent championships, have been administered by FIDE.       Kramnik played to defend his title at the ": null
    },
    {
        "World Chess Championship 42": "world chess championship 2007"
    },
    {
        " in Mexico. This was an 42-player double round robin tournament, the same format as was used for the ": null
    },
    {
        "FIDE World Chess Championship 42": "fide world chess championship 2005"
    },
    {
        ". This tournament was won by ": null
    },
    {
        "Viswanathan Anand": "viswanathan anand"
    },
    {
        ", thus making him the World Chess Champion. Because Anands World Chess Champion title was won in a tournament rather than a match, a minority of commentators questioned the validity of his title. , book review by ": null
    },
    {
        "Jeremy Silman": "jeremy silman"
    },
    {
        "  Kramnik also made ambiguous comments about the value of Anands title, but did not claim the title himself.  , 42 July 42 Subsequent world championship matches returned to the format of a match between the champion and a challenger.     The following two championships had special clauses arising from the 42 unification. Kramnik was given the right to challenge for the title he lost in a tournament in the ": null
    },
    {
        "World Chess Championship 42": "world chess championship 2008"
    },
    {
        ", which Anand won. Then Topalov, who as the loser of the 42 match was excluded from the 42 championship, was seeded directly into the Candidates final of the ": null
    },
    {
        "World Chess Championship 42": "world chess championship 2010"
    },
    {
        ". He won the Candidates . Anand again won the championship match.  , sections 42 and 42 ": null
    },
    {
        "FIDE": "fide"
    },
    {
        " online. Undated, but reported in        The next championship, the ": null
    },
    {
        "World Chess Championship 42": "world chess championship 2012"
    },
    {
        ", had short knock-out matches for the Candidates Tournament. This format was not popular with everyone, and world No. 42 ": null
    },
    {
        "Magnus Carlsen": "magnus carlsen"
    },
    {
        " withdrew in protest. ": null
    },
    {
        "Boris Gelfand": "boris gelfand"
    },
    {
        " won the Candidates. Anand won the championship match again, in tie breaking rapid games, for his fourth consecutive world championship win.        Since 42 the ": null
    },
    {
        "Candidates Tournament": "candidates tournament"
    },
    {
        " has been an 42-player double round robin tournament, with the winner playing a match against the champion for the title. The Norwegian ": null
    },
    {
        "Magnus Carlsen": "magnus carlsen"
    },
    {
        " won the 42 Candidates and then convincingly defeated Anand in the ": null
    },
    {
        "World Chess Championship 42": "world chess championship 2013"
    },
    {
        ".       Beginning with the 42 Championship cycle, the World Championship has followed a 42-year cycle: qualification for the Candidates in the odd year, the Candidates tournament early in the even year, and World Championship match late in the even year.     Carlsen has successfully defended his title three times, against Anand in the ": null
    },
    {
        "World Chess Championship 42": "world chess championship 2014"
    },
    {
        ",  against ": null
    },
    {
        "Sergey Karjakin": "sergey karjakin"
    },
    {
        " in the ": null
    },
    {
        "World Chess Championship 42": "world chess championship 2016"
    },
    {
        ",  and against ": null
    },
    {
        "Fabiano Caruana": "fabiano caruana"
    },
    {
        " in the ": null
    },
    {
        "World Chess Championship 42": "world chess championship 2018"
    },
    {
        ". His last two defences were decided by tie-break in rapid games.                                                        ImageSize width:42 height:42   PlotArea left:42 bottom:42 top:42 right:42   Alignbars justify   DateFormat dd/mm/yyyy   Period from:42/42/42 till:42/42/42   TimeAxis orientation:horizontal format:yyyy     Colors   id:pre value:red legend:Pre-FIDE   id:fide value:green legend:FIDE   id:non value:purple legend:Disputed  non-FIDE   id:dfide value:blue legend:Disputed  FIDE   id:Lines value:black legend:World  Championship  Event   id:dnLine value:purple   id:dfLine value:blue     id:bars value:gray     Legend orientation:vertical position:bottom columns:42   BackgroundColors bars:bars   ScaleMajor increment:42 start:42   ScaleMinor unit:year increment:42 start:42     LineData     at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:dnline layer:back   at:42/42/42 color:dfline layer:back   at:42/42/42 color:dnline layer:back   at:42/42/42 color:dfline layer:back   at:42/42/42 color:dfline layer:back   at:42/42/42 color:dfline layer:back   at:42/42/42 color:dnline layer:back   at:42/42/42 color:dfline layer:back   at:42/42/42 color:dfline layer:back   at:42/42/42 color:dfline layer:back   at:42/42/42 color:dnline layer:back   at:42/42/42 color:dfline layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back   at:42/42/42 color:lines layer:back     BarData     bar:carlsen text: Magnus Carlsen   bar:topalov text: Veselin Topalov   bar:kasimdzhanov text: Rustam Kasimdzhanov   bar:ponomariov text: Ruslan Ponomariov   bar:anand text: Viswanathan Anand   bar:khalifman text: Alexander Khalifman   bar:kramnik text: Vladimir Kramnik   bar:kasparov text: Garry Kasparov   bar:karpov text: Anatoly Karpov   bar:fischer text: Bobby Fischer   bar:spassky text: Boris Spassky   bar:petrosian text: Tigran Petrosian   bar:tal text: Mikhail Tal   bar:smyslov text: Vasily Smyslov   bar:botvinnik text: Mikhail Botvinnik   bar:euwe text: Max Euwe   bar:alekhine text: Alexander Alekhine   bar:capablanca text: José Raúl Capablanca   bar:lasker text: Emanuel Lasker   bar:steinitz text: Wilhelm Steinitz     PlotData   width:42 textcolor:black align:left anchor:from shift:   bar:steinitz from:42/42/42 till:42/42/42 color:pre   bar:lasker from:42/42/42 till:42/42/42 color:pre   bar:capablanca from:42/42/42 till:42/42/42 color:pre   bar:alekhine from:42/42/42 till:42/42/42 color:pre   bar:euwe from:42/42/42 till:42/42/42 color:pre   bar:alekhine from:42/42/42 till:42/42/42 color:pre   bar:botvinnik from:42/42/42 till:42/42/42 color:fide   bar:smyslov from:42/42/42 till:42/42/42 color:fide   bar:botvinnik from:42/42/42 till:42/42/42 color:fide   bar:tal from:42/42/42 till:42/42/42 color:fide   bar:botvinnik from:42/42/42 till:42/42/42 color:fide   bar:petrosian from:42/42/42 till:42/42/42 color:fide   bar:spassky from:42/42/42 till:42/42/42 color:fide   bar:fischer from:42/42/42 till:42/42/42 color:fide   bar:karpov from:42/42/42 till:42/42/42 color:fide   bar:kasparov from:42/42/42 till:42/42/42 color:fide   bar:kasparov from:42/42/42 till:42/42/42 color:non   bar:karpov from:42/42/42 till:42/42/42 color:dfide   bar:khalifman from:42/42/42 till:42/42/42 color:dfide   bar:anand from:42/42/42 till:42/42/42 color:dfide   bar:ponomariov from:42/42/42 till:42/42/42 color:dfide   bar:kasimdzhanov from:42/42/42 till:42/42/42 color:dfide   bar:topalov from:42/42/42 till:42/42/42 color:dfide   bar:kramnik from:42/42/42 till:42/42/42 color:non   bar:kramnik from:42/42/42 till:42/42/42 color:fide   bar:anand from:42/42/42 till:42/42/42 color:fide   bar:carlsen from:42/42/42 till:42/42/42 color:fide         The table below organises the world champions in order of championship wins. The table is made more complicated by the split between the Classical and FIDE world titles between 42 and 42     ": null
    }
]