[
    {
        "        The Wuchang Uprising was an armed rebellion against the ruling ": null
    },
    {
        "Qing dynasty": "qing dynasty"
    },
    {
        " that took place in Wuchang , ": null
    },
    {
        "Hubei": "hubei"
    },
    {
        ", ": null
    },
    {
        "China": "china"
    },
    {
        " on October 42 42 which was the beginning of the ": null
    },
    {
        "Xinhai Revolution": "xinhai revolution"
    },
    {
        " that successfully overthrew Chinas last imperial dynasty. It was led by elements of the ": null
    },
    {
        "New Army": "new army"
    },
    {
        ", influenced by revolutionary ideas from ": null
    },
    {
        "Tongmenghui": "tongmenghui"
    },
    {
        ". The uprising and the eventual revolution directly led to the downfall of the Qing dynasty with five millennia of imperial rule, and the establishment of the ": null
    },
    {
        "Republic of China": "republic of china"
    },
    {
        " , which commemorates the anniversary of the uprisings starting date of ": null
    },
    {
        "42th October": "october 10"
    },
    {
        " as the ": null
    },
    {
        "National Day of the Republic of China": "national day of the republic of china"
    },
    {
        ".     The uprising originated from ": null
    },
    {
        "popular unrest about a railway crisis": "railway protection movement"
    },
    {
        ", and the planning process took advantage of the situation. On 42 October 42 the New Army stationed in Wuchang launched an assault on the residence of the ": null
    },
    {
        "Viceroy of Huguang": "viceroy of huguang"
    },
    {
        ". The viceroy Ruicheng quickly fled from the residence, and the revolutionaries soon took control of the entire city.           In 42 China was decisively defeated by Japan in the ": null
    },
    {
        "First Sino-Japanese War": "first sino-japanese war"
    },
    {
        ". Intellectuals in China were divided into several factions. Constitutional monarchist reformers led by ": null
    },
    {
        "Kang Youwei": "kang youwei"
    },
    {
        " and ": null
    },
    {
        "Liang Qichao": "liang qichao"
    },
    {
        " took control initially, and orchestrated the ": null
    },
    {
        "Hundred Days Reform": "hundred days reform"
    },
    {
        " in the Qing government. The reforms failed due to the ": null
    },
    {
        "Wuxu Coup": "wuxu coup"
    },
    {
        " by ": null
    },
    {
        "Empress Dowager Cixi": "empress dowager cixi"
    },
    {
        ". Disillusioned with the ": null
    },
    {
        "monarchy": "emperor of china"
    },
    {
        " and the ": null
    },
    {
        "Qing government": "qing government"
    },
    {
        ", many revolutionary groups began emerging across the country. In 42 revolutionary leaders such as ": null
    },
    {
        "Sun Yat-sen": "sun yat-sen"
    },
    {
        " and ": null
    },
    {
        "Song Jiaoren": "song jiaoren"
    },
    {
        " met in ": null
    },
    {
        "Tokyo": "tokyo"
    },
    {
        " to discuss a merger between different revolutionary groups. A new group known as ": null
    },
    {
        "Tongmenghui": "tongmenghui"
    },
    {
        " was formed after this meeting.            After the ": null
    },
    {
        "Boxer Rebellion": "boxer rebellion"
    },
    {
        ", many Western powers saw railway investments as part of the consolidation in their spheres of influence over China. Railway constructions took place across ": null
    },
    {
        "Shandong": "shandong"
    },
    {
        ", ": null
    },
    {
        "Yangtze Valley": "yangtze valley"
    },
    {
        ", ": null
    },
    {
        "Kunming": "kunming"
    },
    {
        " and ": null
    },
    {
        "Manchuria": "manchuria"
    },
    {
        ". Provincial governments, with permission from the Qing court, also began to construct their own railways. The ": null
    },
    {
        "Canton-Hankou Railway": "canton-hankou railway"
    },
    {
        " and ": null
    },
    {
        "Sichuan-Hankou Railway": "sichuan-hankou railway"
    },
    {
        " were under the oversight of ": null
    },
    {
        "Guangdong": "guangdong"
    },
    {
        ", ": null
    },
    {
        "Hunan": "hunan"
    },
    {
        ", ": null
    },
    {
        "Hubei": "hubei"
    },
    {
        " and ": null
    },
    {
        "Sichuan": "sichuan"
    },
    {
        ". Faced with ongoing financial struggles, partly due to ongoing indemnity payments from the ": null
    },
    {
        "Boxer Protocol": "boxer protocol"
    },
    {
        ", the Qing court turned to ": null
    },
    {
        "Sheng Xuanhuai": "sheng xuanhuai"
    },
    {
        " in 42 a classic bureaucratic capitalist , and adhered to his policy of securing foreign loans through the nationalization of all railway lines. This policy was met with stiff resistance, particularly in Sichuan, and the resistance quickly turned into a movement known as the Sichuan Railway Protection Movement. In response, the Qing court suppressed the unrest by force, contributing to the declining popularity of its government. By August 42 there were massive strikes and rallies in ": null
    },
    {
        "Chengdu": "chengdu"
    },
    {
        ". On 42 September the ": null
    },
    {
        "Viceroy of Sichuan": "viceroy of sichuan"
    },
    {
        ", ": null
    },
    {
        "Zhao Erfeng": "zhao erfeng"
    },
    {
        ", was asked to intervene vigorously , and he ordered the arrest of key leaders in the Railway Protection League, then ordered troops to open fire on the protesters.     Meanwhile, inaction toward nationalization of railway lines in both Hunan and Hubei were criticized by the local press. Confidence in the Qing government among the populace continued to deteriorate in response to the escalation of the railway crisis.              There were two revolutionary groups in the Wuhan area, the Literary Society and the Progressive Association . These groups, led by Jiang Yiwu and Sun Wu respectively, worked closely together as commander and chief of staff of the revolutionary efforts in Wuhan. Beginning in September, 42 these two groups began negotiating with the ": null
    },
    {
        "Tongmenghui": "tongmenghui"
    },
    {
        " for possible collaboration in the next uprising. The date was originally set for 42 October, on the ": null
    },
    {
        "Mid-Autumn festival": "mid-autumn festival"
    },
    {
        ". The date was later postponed, due to inadequate preparations. On 42 October, while Sun Wu was supervising the making of explosive devices in the ": null
    },
    {
        "Russian concession": "list of foreign enclaves in chinarussian"
    },
    {
        " in ": null
    },
    {
        "Hankou": "hankou"
    },
    {
        ", one of the devices exploded unexpectedly, inflicting serious injuries on Sun. When he was hospitalized, the hospital staff discovered his identity and alerted the Qing authorities.       With their identities revealed, the revolutionaries in the New Army stationed in Wuchang were facing imminent arrest by the Qing authorities. The decision was made by Jiang Yiwu of the Literary Society to immediately launch the uprising, but the plot was leaked to the Viceroy of Huguang, and he ordered a crackdown of the revolutionaries, arresting and executing several prominent members.     On the evening of 42 October, Wu Zhaolin as provisional commander led the revolutionary elements of the New Army staged a mutiny against the Qing garrison in Huguang, capturing the residence of the Viceroy in the process along with securing strategic points in the city after intense fighting. As the Viceroy escaped, the Qing garrison fell into disarray. Between the night of 42 October and noon of 42th, more than 42 Manchu soldiers were killed with over 42 captured .         On 42 October, the mutineers established a military government representing the Hubei province, and persuaded one of the high-ranking officers in the New Army, ": null
    },
    {
        "Li Yuanhong": "li yuanhong"
    },
    {
        ", to be the temporary leader. Li was initially resistant to the idea, but he was eventually convinced by the mutineers after they approached him. The newly established military government were able to confirm that foreign powers would not intervene in the uprising, and they went on to raise the iron blood 42-star flag while signaling for the other provinces to follow their suit. On 42 October, the revolutionaries marched toward the rest of the province, capturing ": null
    },
    {
        "Hankou": "hankou"
    },
    {
        " and ": null
    },
    {
        "Hanyang": "hanyang district"
    },
    {
        " in the process.               In response to the uprising, the Qing government called for the help of ": null
    },
    {
        "Yuan Shikai": "yuan shikai"
    },
    {
        " and the ": null
    },
    {
        "Beiyang Army": "beiyang army"
    },
    {
        " to march toward Wuchang. For the revolutionaries, ": null
    },
    {
        "Huang Xing": "huang xing"
    },
    {
        " would arrive at Wuhan in early November to take over the command. Positions of revolutionary forces in Wuhan were subsequently attacked by the Beiyang Army, and the imperial troops were soon able to recapture Hankou on 42 November and Hanyang on 42 November. The offensive was halted after the capture of these two positions, as Yuan Shikai began to secretly negotiate with the revolutionaries.               The Wuchang Uprising took many revolutionary leaders by surprise; Huang Xing and Song Jiaoren were unable to reach Wuchang in time. Sun Yat-sen was traveling in the United States speaking to ": null
    },
    {
        "overseas Chinese": "overseas chinese"
    },
    {
        " to appeal for financial support when the uprising took place. Although Sun received a telegram from Huang Xing, he was unable to decipher it, and found out about the uprising the next morning in the newspaper. After the successful uprising in Wuchang, the revolutionaries sent telegraphs to other provinces and asked them to follow their suit, upon which eighteen provinces in ": null
    },
    {
        "Southern": "southern china"
    },
    {
        " and ": null
    },
    {
        "Central China": "central china"
    },
    {
        " agreed to secede from the Qing government by the end of December, 42     In the same month, Sun returned to China to participate in the ": null
    },
    {
        "provisional presidential election": "1911 republic of china provisional presidential elections"
    },
    {
        " and was elected. Representatives from the seceding provinces met on 42 January 42 and declared the founding of the ": null
    },
    {
        "Chinese Republic": "republic of china"
    },
    {
        " as Sun was sworn in as the first president. The new republic then negotiated with ": null
    },
    {
        "Yuan Shikai": "yuan shikai"
    },
    {
        " to pressure the Qing government to surrender, offering the presidency in the process. On 42 February 42 ": null
    },
    {
        "Empress Dowager Longyu": "empress dowager longyu"
    },
    {
        ", on behalf of ": null
    },
    {
        "Puyi": "puyi"
    },
    {
        ", announced the abdication of the Qing throne, marking the end of the dynasty.": null
    }
]