[
    {
        "         X-Men are a team of fictional ": null
    },
    {
        "superhero": "superhero"
    },
    {
        "es appearing in ": null
    },
    {
        "American comic book": "american comic book"
    },
    {
        "s published by ": null
    },
    {
        "Marvel Comics": "marvel comics"
    },
    {
        ". Created by artist/co-writer ": null
    },
    {
        "Jack Kirby": "jack kirby"
    },
    {
        " and writer ": null
    },
    {
        "Stan Lee": "stan lee"
    },
    {
        ", the characters first appeared in ": null
    },
    {
        "The X-Men": "uncanny x-men"
    },
    {
        " 42 and formed one of the most recognizable and successful franchises of Marvel Comics, appearing in numerous books, ": null
    },
    {
        "television shows": "x-men in television"
    },
    {
        ", ": null
    },
    {
        "films": "x-men"
    },
    {
        ", and ": null
    },
    {
        "video games": "list of x-men video games"
    },
    {
        ".     Most of the X-Men are ": null
    },
    {
        "mutants": "mutant"
    },
    {
        ", a subspecies of humans who are born with superhuman abilities activated by the X-Gene . The X-Men fight for peace and equality between normal humans and mutants in a world where anti-mutant bigotry is fierce and widespread. They are led by Charles Xavier, also known as ": null
    },
    {
        "Professor X": "professor x"
    },
    {
        ", a powerful mutant telepath who can control and read minds. Their archenemy is ": null
    },
    {
        "Magneto": "magneto"
    },
    {
        ", a powerful mutant with the ability to manipulate and control magnetic fields who leads the ": null
    },
    {
        "Brotherhood of Mutants": "brotherhood of mutants"
    },
    {
        ". Both have opposing views and philosophies regarding the relationship between mutants and humans. While the former works towards peace and understanding between mutants and humans, the latter views humans as a threat and believes in taking an aggressive approach against them, though he has found himself working alongside the X-Men from time to time.     Professor X is the founder of Xaviers School for Gifted Youngsters at a location commonly called the ": null
    },
    {
        "X-Mansion": "x-mansion"
    },
    {
        ", which recruits mutants from around the world to teach them how to use their powers and coexist with humanity. Located in ": null
    },
    {
        "Salem Center": "north salem, new york"
    },
    {
        " in ": null
    },
    {
        "Westchester County, New York": "westchester county, new york"
    },
    {
        ", the X-Mansion is the home and training site of the X-Men. The founding five members of the X-Men who appear in  The X-Men  42 are ": null
    },
    {
        "Angel-Archangel": "warren worthington iii"
    },
    {
        ", ": null
    },
    {
        "Beast": "beast"
    },
    {
        ", ": null
    },
    {
        "Cyclops": "cyclops"
    },
    {
        ", ": null
    },
    {
        "Iceman": "iceman"
    },
    {
        ", and ": null
    },
    {
        "Jean Grey": "jean grey"
    },
    {
        " ; ": null
    },
    {
        "Professor X": "professor x"
    },
    {
        " and ": null
    },
    {
        "Magneto": "magneto"
    },
    {
        " also made their first appearances in  The X-Men  42 and later on new members such as ": null
    },
    {
        "Havok": "havok"
    },
    {
        ", ": null
    },
    {
        "Polaris": "polaris"
    },
    {
        ", ": null
    },
    {
        "Mimic": "mimic"
    },
    {
        " and ": null
    },
    {
        "Changeling": "changeling"
    },
    {
        " joined though only the former two managed to become a regular recurring staple of the team lineup. Eventually more well known X-Men included ": null
    },
    {
        "Wolverine": "wolverine"
    },
    {
        ", ": null
    },
    {
        "Storm": "storm"
    },
    {
        ", ": null
    },
    {
        "Rogue": "rogue"
    },
    {
        ", ": null
    },
    {
        "Gambit": "gambit"
    },
    {
        ", ": null
    },
    {
        "Jubilee": "jubilee"
    },
    {
        ", ": null
    },
    {
        "Nightcrawler": "nightcrawler"
    },
    {
        ", ": null
    },
    {
        "Colossus": "colossus"
    },
    {
        ", ": null
    },
    {
        "Kitty Pryde/Shadowcat": "kitty pryde"
    },
    {
        ", ": null
    },
    {
        "Psylocke": "psylocke"
    },
    {
        " and ": null
    },
    {
        "Bishop": "bishop"
    },
    {
        ". Since then, dozens of mutants from various countries and diverse backgrounds, and even a number of non-mutants, have held membership as X-Men.     The X-Men has appeared in a wide variety of media outside of comic books, including a number of different animated television series and direct-to-video films. Most notably, the superhero team has been the predominant focus of the ": null
    },
    {
        "X-Men film series": "x-men"
    },
    {
        " with each film drawing influences from the comic book storylines.       In 42 with the success of ": null
    },
    {
        "Spider-Man": "spider-man"
    },
    {
        ", ": null
    },
    {
        "the Hulk": "hulk"
    },
    {
        ", ": null
    },
    {
        "Thor": "thor"
    },
    {
        ", ": null
    },
    {
        "Iron Man": "iron man"
    },
    {
        ", and ": null
    },
    {
        "the Fantastic Four": "fantastic four"
    },
    {
        ", co-creator ": null
    },
    {
        "Stan Lee": "stan lee"
    },
    {
        " wanted to create another group of superheroes but did not want to have to explain how they got their powers. In 42 Lee recalled, I couldnt have everybody bitten by a radioactive spider or exposed to a gamma ray explosion. And I took the cowardly way out. I said to myself, Why dont I just say theyre ": null
    },
    {
        "mutants": "mutant"
    },
    {
        "? They were born that way.      In a 42 interview, Kirby said:     The X-Men, I did the natural thing there. What would you do with mutants who were just plain boys and girls and certainly not dangerous? You school them. You develop their skills. So I gave them a teacher, Professor X. Of course, it was the natural thing to do, instead of disorienting or alienating people who were different from us, I made the X-Men part of the human race, which they were. Possibly, radiation, if it is beneficial, may create mutants thatll save us instead of doing us harm. I felt that if we train the mutants our way, theyll help us – and not only help us, but achieve a measure of growth in their own sense. And so, we could all live together. Conversations With The Comic Book Creators , Leonard Pitts, 42 published on the :Kirby Effect: The Journal of the Kirby Museum , 42 August 42     Lee devised the series title after Marvel publisher ": null
    },
    {
        "Martin Goodman": "martin goodman"
    },
    {
        " turned down the initial name, The Mutants, stating that readers would not know what a mutant was.      Within the ": null
    },
    {
        "Marvel Universe": "marvel universe"
    },
    {
        ", the X-Men are widely regarded to have been named after ": null
    },
    {
        "Professor X": "professor x"
    },
    {
        "avier himself. The original explanation for the name, as provided by Xavier in The X-Men 42 , is that mutants possess an extra power ... one which ordinary humans do not!! That is why I call my students ... X-Men, for EX-tra power! X-Men 42            Early X-Men issues introduced the original team composed of ": null
    },
    {
        "Cyclops": "cyclops"
    },
    {
        ", ": null
    },
    {
        "Marvel Girl": "jean grey"
    },
    {
        ", ": null
    },
    {
        "Beast": "beast"
    },
    {
        ", ": null
    },
    {
        "Angel": "warren worthington iii"
    },
    {
        ", and ": null
    },
    {
        "Iceman": "iceman"
    },
    {
        ", along with their archenemy ": null
    },
    {
        "Magneto": "magneto"
    },
    {
        " and his ": null
    },
    {
        "Brotherhood of Evil Mutants": "brotherhood of mutants"
    },
    {
        " featuring ": null
    },
    {
        "Mastermind": "mastermind"
    },
    {
        ", ": null
    },
    {
        "Quicksilver": "quicksilver"
    },
    {
        ", ": null
    },
    {
        "Scarlet Witch": "scarlet witch"
    },
    {
        ", and ": null
    },
    {
        "Toad": "toad"
    },
    {
        ". The comic focused on a common human theme of good versus evil and later included storylines and themes about ": null
    },
    {
        "prejudice": "prejudice"
    },
    {
        " and ": null
    },
    {
        "racism": "racism"
    },
    {
        ", all of which have persisted throughout the series in one form or another. The evil side in the fight was shown in human form and under some sympathetic beginnings via Magneto, a character who was later revealed to have survived Nazi concentration camps only to pursue a hatred for normal humanity. His key followers, Quicksilver and the Scarlet Witch, were ": null
    },
    {
        "Romani": "romani people"
    },
    {
        ". Only one new member of the X-Men was added, ": null
    },
    {
        "Mimic": "mimic"
    },
    {
        "/Calvin Rankin, X-Men 42 but soon left due to his temporary loss of power. X-Men 42     The title lagged in sales behind Marvels other comic franchises. In 42 writer ": null
    },
    {
        "Roy Thomas": "roy thomas"
    },
    {
        " and illustrator ": null
    },
    {
        "Neal Adams": "neal adams"
    },
    {
        " rejuvenated the comic book and gave regular roles to two recently introduced characters: ": null
    },
    {
        "Havok": "havok"
    },
    {
        "/Alex Summers and Lorna Dane, later called ": null
    },
    {
        "Polaris": "polaris"
    },
    {
        " . However, these later X-Men issues failed to attract sales and Marvel stopped producing new stories with issue 42 later reprinting a number of the older comics as issues 42–42              In  Giant-Size X-Men  42 , writer ": null
    },
    {
        "Len Wein": "len wein"
    },
    {
        " and artist ": null
    },
    {
        "Dave Cockrum": "dave cockrum"
    },
    {
        " introduced a new team that starred in a revival of The X-Men, beginning with ": null
    },
    {
        "issue 42": "uncanny x-men 94"
    },
    {
        ". This new team replaced the previous members with the exception of Cyclops, who remained. This team differed greatly from the original. Unlike in the early issues of the original series, the new team was not made up of teenagers and they also had a more diverse background. Each was from a different country with varying cultural and philosophical beliefs, and all were already well-versed in using their mutant powers, several being experienced in combat. Another major difference is that unlike the original X-Men who were ": null
    },
    {
        "White Anglo-Saxon Protestants": "white anglo-saxon protestants"
    },
    {
        " with the exception of the half-": null
    },
    {
        "Irish": "irish american"
    },
    {
        "/half-": null
    },
    {
        "Jewish": "jewish-americans"
    },
    {
        " Iceman": "iceman"
    },
    {
        " the All-New, All-Different X-Men team was composed of a ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        "/": null
    },
    {
        "Russian": "russia"
    },
    {
        " atheist, a ": null
    },
    {
        "German": "germany"
    },
    {
        " blue demon-like creature, a female ": null
    },
    {
        "African": "african diaspora"
    },
    {
        " Kenyan-American": "kenyan-american"
    },
    {
        " woman, an ": null
    },
    {
        "Irish": "ireland"
    },
    {
        " Catholic": "catholicism"
    },
    {
        ", an ": null
    },
    {
        "Apache": "apache"
    },
    {
        " Native American": "indigenous peoples of the americas"
    },
    {
        ", a ": null
    },
    {
        "Japanese": "japan"
    },
    {
        " male and a ": null
    },
    {
        "Canadian": "canada"
    },
    {
        " agent as its members.     The all-new, all-different X-Men Giant-Size X-Men 42 were led by Cyclops, from the original team, and consisted of the newly created ": null
    },
    {
        "Colossus": "colossus"
    },
    {
        " , ": null
    },
    {
        "Nightcrawler": "nightcrawler"
    },
    {
        " , ": null
    },
    {
        "Storm": "storm"
    },
    {
        " , and ": null
    },
    {
        "Thunderbird": "thunderbird"
    },
    {
        " , and three previously introduced characters: ": null
    },
    {
        "Banshee": "banshee"
    },
    {
        " , ": null
    },
    {
        "Sunfire": "sunfire"
    },
    {
        " , and ": null
    },
    {
        "Wolverine": "wolverine"
    },
    {
        " . Wolverine eventually became the ": null
    },
    {
        "breakout character": "breakout character"
    },
    {
        " on the team and, in terms of comic sales and appearances, the most popular X-Men character even getting his own ": null
    },
    {
        "solo title": "wolverine"
    },
    {
        ". However, this team would not remain whole for long as Sunfire quit immediately and never really accepted the other members, and Thunderbird would die in the very next mission. Filling in the vacancy, a revamped ": null
    },
    {
        "Jean Grey": "jean grey"
    },
    {
        " soon rejoined the X-Men under her new persona of Phoenix . Angel, Beast, Iceman, ": null
    },
    {
        "Havok": "havok"
    },
    {
        ", and ": null
    },
    {
        "Polaris": "polaris"
    },
    {
        " also made significant guest appearances.     The revived series was illustrated by Cockrum, and later by ": null
    },
    {
        "John Byrne": "john byrne"
    },
    {
        ", and written by ": null
    },
    {
        "Chris Claremont": "chris claremont"
    },
    {
        ". Claremont became the series longest-running contributor.  The run met with critical acclaim and produced such landmark storylines as the death of Thunderbird, the emergence of Phoenix, the saga of the ": null
    },
    {
        "Starjammers": "starjammers"
    },
    {
        " and the MKraan Crystal, the introduction of ": null
    },
    {
        "Alpha Flight": "alpha flight"
    },
    {
        " and the ": null
    },
    {
        "Proteus": "proteus"
    },
    {
        " saga.  Other characters introduced during this time include ": null
    },
    {
        "Amanda Sefton": "amanda sefton"
    },
    {
        ", ": null
    },
    {
        "Mystique": "mystique"
    },
    {
        ", and ": null
    },
    {
        "Moira MacTaggert": "moira mactaggert"
    },
    {
        ", with her genetic research facility on ": null
    },
    {
        "Muir Island": "muir island"
    },
    {
        ".     The 42s began with the comics best-known story arc, the ": null
    },
    {
        "Dark Phoenix Saga": "the dark phoenix saga"
    },
    {
        ", which saw Phoenix manipulated by the illusionist Mastermind and becoming corrupted with an overwhelming lust for power and destruction as the evil Dark Phoenix. Other important storylines included  Days of Future Past , the saga of ": null
    },
    {
        "Deathbird": "deathbird"
    },
    {
        " and the ": null
    },
    {
        "Brood": "brood"
    },
    {
        ", the discovery of the Morlocks, the invasion of the Dire Wraiths and The Trial of Magneto, as well as  X-Men: God Loves, Man Kills , the partial inspiration for the 42 movie  X42: X-Men United .         By the early 42s, X-Men was Marvels top-selling comic title. Its sales were such that distributors and retailers began using an X-Men index , rating each comic book publication by how many orders it garnered compared to that months issue of X-Men.  The growing popularity of Uncanny X-Men and the rise of comic book specialty stores led to the introduction of a number of ongoing spin-off series nicknamed X-Books. The first of these was  The New Mutants , soon followed by  Alpha Flight ,  X-Factor ,  Excalibur , and a solo  Wolverine  title. When Claremont conceived a story arc, the  Mutant Massacre , which was too long to run in the monthly X-Men, editor ": null
    },
    {
        "Louise Simonson": "louise simonson"
    },
    {
        " decided to have it overlap into several X-Books. The story was a major financial success,  and when the later  Fall of the Mutants  was similarly successful, the marketing department declared that the X-Men lineup would hold such ": null
    },
    {
        "crossovers": "fictional crossover"
    },
    {
        " annually.      Throughout the decade, Uncanny X-Men was written solely by Chris Claremont, and illustrated for long runs by John Byrne, Dave Cockrum, ": null
    },
    {
        "Paul Smith": "paul smith"
    },
    {
        ", ": null
    },
    {
        "John Romita, Jr.": "john romita, jr."
    },
    {
        ", and ": null
    },
    {
        "Marc Silvestri": "marc silvestri"
    },
    {
        ". Additions to the X-Men during this time were ": null
    },
    {
        "Kitty Pryde/Shadowcat": "kitty pryde"
    },
    {
        ", ": null
    },
    {
        "Rogue": "rogue"
    },
    {
        ", ": null
    },
    {
        "Rachel Summers": "rachel summers"
    },
    {
        "/Phoenix, ": null
    },
    {
        "Psylocke": "psylocke"
    },
    {
        ", ": null
    },
    {
        "Dazzler": "dazzler"
    },
    {
        ", ": null
    },
    {
        "Longshot": "longshot"
    },
    {
        ", ": null
    },
    {
        "Jubilee": "jubilee"
    },
    {
        ", ": null
    },
    {
        "Forge": "forge"
    },
    {
        " and ": null
    },
    {
        "Gambit": "gambit"
    },
    {
        ". In a controversial move, Professor X relocated to outer space to be with ": null
    },
    {
        "Lilandra Neramani": "lilandra neramani"
    },
    {
        ", Majestrix of the ": null
    },
    {
        "Shiar": "shiar"
    },
    {
        " Empire, in 42 Magneto then joined the X-Men in Xaviers place and became the director of the New Mutants. This period also included the emergence of the ": null
    },
    {
        "Hellfire Club": "hellfire club"
    },
    {
        ", the arrival of the mysterious ": null
    },
    {
        "Madelyne Pryor": "madelyne pryor"
    },
    {
        ", and the villains ": null
    },
    {
        "Apocalypse": "apocalypse"
    },
    {
        ", ": null
    },
    {
        "Mister Sinister": "mister sinister"
    },
    {
        ", ": null
    },
    {
        "Mojo": "mojo"
    },
    {
        ", and ": null
    },
    {
        "Sabretooth": "sabretooth"
    },
    {
        ".            In 42 Marvel revised the entire lineup of X-Men comic book titles, centered on the launch of a second X-Men series, simply titled  X-Men . With the return of Xavier and the original X-Men to the team, the roster was split into two strike forces: Cyclopss Blue Team  and Storms Gold Team .     The first issues of the second X-Men series were written by Claremont and drawn and co-plotted by ": null
    },
    {
        "Jim Lee": "jim lee"
    },
    {
        ". Retailers pre-ordered over 42 million copies of issue 42 generating and selling nearly $42 million ,  making it, according to ": null
    },
    {
        "Guinness Book of World Records": "guinness book of world records"
    },
    {
        ", the best-selling comic book of all-time. Guinness presented honors to Claremont at the 42 ": null
    },
    {
        "San Diego Comic-Con": "san diego comic-con"
    },
    {
        ". Morse, Ben .  , ": null
    },
    {
        "Marvel.com": "marvel.com"
    },
    {
        ". Johnson, Rich. . ": null
    },
    {
        "Bleeding Cool": "bleeding cool"
    },
    {
        ". July 42 42 Cantor, Michael ; ": null
    },
    {
        "Schreiber, Liev": "schreiber, liev"
    },
    {
        " Superheroes: A Never-Ending Battle. ": null
    },
    {
        "PBS": "pbs"
    },
    {
        ". October 42 42     Another new X-book released at the time was  X-Force , featuring the characters from  The New Mutants , led by ": null
    },
    {
        "Cable": "cable"
    },
    {
        "; it was written by ": null
    },
    {
        "Rob Liefeld": "rob liefeld"
    },
    {
        " and ": null
    },
    {
        "Fabian Nicieza": "fabian nicieza"
    },
    {
        ". Internal friction soon split the X-books creative teams. In a controversial move, X-Men editor ": null
    },
    {
        "Bob Harras": "bob harras"
    },
    {
        " sided with Lee  over Claremont in a dispute over plotting. Claremont left after only three issues of X-Men, ending his 42-year run as X-Men writer.  Marvel replaced Claremont briefly with ": null
    },
    {
        "John Byrne": "john byrne"
    },
    {
        ", who scripted both books for a few issues. Byrne was then replaced by Nicieza and ": null
    },
    {
        "Scott Lobdell": "scott lobdell"
    },
    {
        ", who would take over the majority of writing duties for the X-Men until Lees own departure months later when he and several other popular artists  would leave Marvel to form ": null
    },
    {
        "Image Comics": "image comics"
    },
    {
        ". Jim Lees X-Men designs would be the basis for much of the  X-Men  animated series and action figure line as well as several Capcom video games.     The 42s saw an even greater number of X-books with numerous ongoing series and miniseries running concurrently. X-book crossovers continued to run annually, with ": null
    },
    {
        "The X-Tinction Agenda": "x-men: x-tinction agenda"
    },
    {
        " in 42 ": null
    },
    {
        "The Muir Island Saga": "muir island saga"
    },
    {
        " in 42 ": null
    },
    {
        "X-Cutioners Song": "x-cutioners song"
    },
    {
        " in 42 ": null
    },
    {
        "Fatal Attractions": "fatal attractions"
    },
    {
        " in 42 ": null
    },
    {
        "Phalanx Covenant": "phalanx covenant"
    },
    {
        " in 42 ": null
    },
    {
        "Legion Quest": "legion quest"
    },
    {
        " / ": null
    },
    {
        "Age of Apocalypse": "age of apocalypse"
    },
    {
        " in 42 ": null
    },
    {
        "Onslaught": "onslaught"
    },
    {
        " in 42 and ": null
    },
    {
        "Operation: Zero Tolerance": "operation: zero tolerance"
    },
    {
        " in 42 Though the frequent crossovers were criticized by fans as well as editorial and creative staff for being artificially regular, disruptive to the direction of the individual series, and having far less lasting impact than promised, they continued to be financially successful.     There were many new popular additions to the X-Men in the 42s, including ": null
    },
    {
        "Gambit": "gambit"
    },
    {
        ", ": null
    },
    {
        "Cable": "cable"
    },
    {
        ", and ": null
    },
    {
        "Bishop": "bishop"
    },
    {
        ". Gambit became one of the most popular X-Men, rivaling even ": null
    },
    {
        "Wolverine": "wolverine"
    },
    {
        " in size of fanbase after his debut in Uncanny X-Men 42 . Many of the later additions to the team came and went, such as ": null
    },
    {
        "Joseph": "joseph"
    },
    {
        ", ": null
    },
    {
        "Maggott": "maggott"
    },
    {
        ", ": null
    },
    {
        "Marrow": "marrow"
    },
    {
        ", ": null
    },
    {
        "Cecilia Reyes": "cecilia reyes"
    },
    {
        ", and a new ": null
    },
    {
        "Thunderbird": "neal shaara"
    },
    {
        ". Xaviers ": null
    },
    {
        "New Mutants": "new mutantsnew mutants vol. 1"
    },
    {
        " grew up and became  X-Force , and the next generation of students began with  Generation X , featuring Jubilee and other teenage mutants led and schooled by ": null
    },
    {
        "Banshee": "banshee"
    },
    {
        " and ex-villainess ": null
    },
    {
        "Emma Frost": "emma frost"
    },
    {
        " at her Massachusetts Academy. In 42  Excalibur  and  X-Factor  ended and the latter was replaced with  Mutant X , starring ": null
    },
    {
        "Havok": "havok"
    },
    {
        " stranded in a ": null
    },
    {
        "parallel universe": "parallel universe"
    },
    {
        ". Marvel launched a number of solo series, including  Deadpool ,  Cable ,  Bishop ,  X-Man , and  Gambit , but few of the series would survive the decade.          In 42 Claremont returned to Marvel and was put back on the primary X-Men titles during the ": null
    },
    {
        "Revolution": "revolution"
    },
    {
        " revamp. He was later removed from the titles in 42 and created his spin-off series,  X-Treme X-Men . X-Men had its title changed to  New X-Men  and writer ": null
    },
    {
        "Grant Morrison": "grant morrison"
    },
    {
        " took over. The book is often referred to as the Morrison-era, due to the drastic changes he made, beginning with ": null
    },
    {
        "E Is For Extinction": "e is for extinction"
    },
    {
        " , where a new villain, ": null
    },
    {
        "Cassandra Nova": "cassandra nova"
    },
    {
        ", destroys ": null
    },
    {
        "Genosha": "genosha"
    },
    {
        ", killing sixteen million mutants. Morrison also brought reformed ex-villain ": null
    },
    {
        "Emma Frost": "emma frost"
    },
    {
        " into the primary X-Men team, and opened the doors of the school by having Xavier out himself to the public about being a mutant. The bright spandex costumes that had become iconic over the previous decades were replaced by black leather street clothes reminiscent of the uniforms of the X-Men films. Morrison also introduced ": null
    },
    {
        "Xorn": "xorn"
    },
    {
        ", who would figure prominently in the climax of his run.  Ultimate X-Men  set in Marvels revised imprint was also launched, while ": null
    },
    {
        "Chuck Austen": "chuck austen"
    },
    {
        " began his controversial run on  Uncanny X-Men .     Several short-lived spin-offs and miniseries started featuring several X-Men in solo series, such as Emma Frost, ": null
    },
    {
        "Mystique": "mystique"
    },
    {
        " and Nightcrawler. Another series,  Exiles , started at the same time and concluded in December 42 which led to New Exiles in January 42 written by Claremont.     Notable additions to the X-Men have been Emma Frost, ": null
    },
    {
        "Danielle Moonstar": "danielle moonstar"
    },
    {
        ", ": null
    },
    {
        "Husk": "husk"
    },
    {
        " and ": null
    },
    {
        "Northstar": "northstar"
    },
    {
        " while former villain ": null
    },
    {
        "Juggernaut": "juggernaut"
    },
    {
        " became member of the X-Men. Notable story arcs of this era are ": null
    },
    {
        "E Is For Extinction": "e is for extinction"
    },
    {
        " , ": null
    },
    {
        "Planet X": "planet x"
    },
    {
        " and ": null
    },
    {
        "Here Comes Tomorrow": "here comes tomorrow"
    },
    {
        " .     X-Men   ": null
    },
    {
        "New X-Men": "new x-men"
    },
    {
        "   Uncanny X-Men": "uncanny x-men"
    },
    {
        " X-Treme X-Men": "x-treme x-men"
    },
    {
        " New Mutants": "new mutants"
    },
    {
        " vol 42          X-Men ReLoad was the name given by Marvel Comics to their May 42 revamp of the X-Men titles with new looks for the characters and fresh plot points. The revamp was prompted by Grant Morrisons departure from New X-Men. As a result of the revamp, Chris Claremont moved from writing X-Treme X-Men to writing Uncanny X-Men, with Alan Davis doing the art. Chuck Austen moved from writing Uncanny X-Men to New X-Men, which returned to its old name of simply X-Men, with Salvador Larroca, who had been working with him on Uncanny X-Men doing the art. Finally, ": null
    },
    {
        "Joss Whedon": "joss whedon"
    },
    {
        " entered as the writer of the new title  Astonishing X-Men , with ": null
    },
    {
        "John Cassaday": "john cassaday"
    },
    {
        " as artist. X-Treme X-Men was cancelled. Also, the X-Men returned to more traditional costumes, as opposed to the black leather uniforms from the movies.  New X-Men: Academy X  was also launched focusing on the lives of the new young mutants at the Institute. This period included the resurrections of Colossus and Psylocke, a new death for Jean Grey, who later returned temporarily in the  X-Men: Phoenix - Endsong , as well as Emma Frost becoming the new headmistress of the Institute. The Institute, formerly ran as a school , served as a safe haven to mutants who are still powered.     Several short-lived spin-offs and miniseries started featuring several X-Men in solo series, such as Gambit and Rogue. Cable and Deadpools books were merged into one book,  Cable & Deadpool .     Notable additions to the X-Men have been ": null
    },
    {
        "Armor": "armor"
    },
    {
        ", ": null
    },
    {
        "Pixie": "pixie"
    },
    {
        " and ": null
    },
    {
        "Warpath": "warpath"
    },
    {
        ", while former villains such as ": null
    },
    {
        "Lady Mastermind": "lady mastermind"
    },
    {
        ", ": null
    },
    {
        "Mystique": "mystique"
    },
    {
        ", and ": null
    },
    {
        "Sabretooth": "sabretooth"
    },
    {
        " became members of the X-Men. Notable story arcs of this decade are ": null
    },
    {
        "Gifted": "gifted"
    },
    {
        " , ": null
    },
    {
        "House of M": "house of m"
    },
    {
        " , ": null
    },
    {
        "Deadly Genesis": "x-men: deadly genesis"
    },
    {
        " and ": null
    },
    {
        "Endangered Species": "x-men: endangered species"
    },
    {
        " .     X-Men   ": null
    },
    {
        "Astonishing X-Men": "astonishing x-men"
    },
    {
        "   Uncanny X-Men": "uncanny x-men"
    },
    {
        " X-Men": "x-men legacy"
    },
    {
        " New X-Men": "new x-men"
    },
    {
        "          In 42 the ": null
    },
    {
        "Messiah Complex": "x-men: messiah complex"
    },
    {
        " storyline saw the destruction of the Xavier Institute and the disbanding of the X-Men. It spun the new volumes of  X-Force , following the team led by Wolverine, and Cable, following Cables attempts at protecting ": null
    },
    {
        "Hope Summers": "hope summers"
    },
    {
        ". X-Men was renamed into X-Men: Legacy which focused on Professor X, Rogue and Gambit. Under Cyclopss leadership, the X-Men later reformed in Uncanny X-Men 42 with their new base located in San Francisco.      In 42  Messiah War  written by ": null
    },
    {
        "Craig Kyle": "craig kyle"
    },
    {
        " and ": null
    },
    {
        "Chris Yost": "chris yost"
    },
    {
        " served as the second part in the trilogy  was released.  Utopia  written by Matt Fraction, was a crossover of ": null
    },
    {
        "Dark Avengers": "dark avengers"
    },
    {
        " and Uncanny X-Men that served as a part of the ": null
    },
    {
        "Dark Reign": "dark reign"
    },
    {
        " storyline. A new  New Mutants  volume written by Zeb Wells, which featured the more prominent members of the original team reunited, was launched. Magneto joined the X-Men during the ": null
    },
    {
        "Nation X": "nation x"
    },
    {
        " storyline to the dismay of other members of the X-Men, such as Beast, who left the team. Uncanny X-Men 42 Magneto began to work with Namor to transform Utopia into a homeland for both mutants and Atlanteans. Uncanny X-Men 42 After the conclusion of Utopia, ": null
    },
    {
        "Rogue": "rogue"
    },
    {
        " became the main character of X-Men: Legacy.   In 42 ": null
    },
    {
        "Second Coming": "x-men: second coming"
    },
    {
        " concluded the plot threads on Messiah Complex and Messiah War.     Notable additions to the X-Men have been ": null
    },
    {
        "Pixie": "pixie"
    },
    {
        ", ": null
    },
    {
        "Karma": "karma"
    },
    {
        ", ": null
    },
    {
        "Sunspot": "sunspot"
    },
    {
        ", ": null
    },
    {
        "Magma": "magma"
    },
    {
        ", ": null
    },
    {
        "Magik": "magik"
    },
    {
        ", ": null
    },
    {
        "Namor": "namor"
    },
    {
        ", ": null
    },
    {
        "Domino": "domino"
    },
    {
        ", ": null
    },
    {
        "Boom Boom": "tabitha smith"
    },
    {
        ", ": null
    },
    {
        "Fantomex": "fantomex"
    },
    {
        " and ": null
    },
    {
        "X42": "x-23"
    },
    {
        ". Other notable story arcs of this era are ": null
    },
    {
        "Divided We Stand": "x-men: divided we stand"
    },
    {
        " , ": null
    },
    {
        "Manifest Destiny": "x-men: manifest destiny"
    },
    {
        " , ": null
    },
    {
        "X-Infernus": "x-infernus"
    },
    {
        " , ": null
    },
    {
        "Utopia": "utopia"
    },
    {
        " , ": null
    },
    {
        "Nation X": "nation x"
    },
    {
        " and ": null
    },
    {
        "Necrosha": "necrosha"
    },
    {
        " . The X-Men were also involved in the ": null
    },
    {
        "Secret Invasion": "secret invasion"
    },
    {
        " storyline     X-Men   ": null
    },
    {
        "Uncanny X-Men": "uncanny x-men"
    },
    {
        "   X-Men Legacy": "x-men legacy"
    },
    {
        " Astonishing X-Men": "astonishing x-men"
    },
    {
        " Young X-Men": "young x-men"
    },
    {
        " Generation Hope": "hope summers"
    },
    {
        "             In 42 the aftermath of the ": null
    },
    {
        "X-Men: Schism": "x-men: schism"
    },
    {
        " led to the fallout between Wolverine and Cyclops. During ": null
    },
    {
        "Regenesis": "x-men: regenesis"
    },
    {
        ", Wolverine team was featured in a new flagship series titled  Wolverine and the X-Men , Wolverine rebuilt the original X-Mansion and named it the ": null
    },
    {
        "Jean Grey School for Higher Learning": "x-mansion"
    },
    {
        ". Meanwhile, Uncanny X-Men relaunched for the first time ever and served as the flagship title for Cyclops Team. In 42 ": null
    },
    {
        "Avengers vs. X-Men": "avengers vs. x-men"
    },
    {
        " served as a closure to House of M and Decimation story lines. It featured the death of Professor X and reappearance of new mutants.       Notable additions to the X-Men have been Warbird and ": null
    },
    {
        "Blink": "blink"
    },
    {
        ". Notable story of this era was ": null
    },
    {
        "Avengers vs. X-Men": "avengers vs. x-men"
    },
    {
        "     Cyclops X-Men   ": null
    },
    {
        "Uncanny X-Men": "uncanny x-men"
    },
    {
        " vol 42   ": null
    },
    {
        "X-Men": "x-men"
    },
    {
        " vol 42   ": null
    },
    {
        "New Mutants": "new mutants"
    },
    {
        " vol 42   Wolverines X-Men   ": null
    },
    {
        "Wolverine and the X-Men": "wolverine and the x-men"
    },
    {
        "   X-Men Legacy": "x-men legacy"
    },
    {
        " Astonishing X-Men": "astonishing x-men"
    },
    {
        "       In 42 as part of the ": null
    },
    {
        "Marvel NOW!": "marvel now!"
    },
    {
        " relaunch, all X-Men titles  were canceled, including Uncanny X-Men, X-Men: Legacy,  X-Men  and  New Mutants . New flagship title  All-New X-Men  was launched which featured the original five X-Men members who were brought to the present day by Beast and were made a separate team lead eventually by Kitty. The relaunched Uncanny X-Men featured Cyclops, his team and the new mutants, taking up residency in the ": null
    },
    {
        "Weapon X": "weapon x"
    },
    {
        " facility, which they have rebuilt into a school — the New Charles Xavier School for Mutants. An all female book titled simply X-Men was also launched. During ": null
    },
    {
        "All-New Marvel Now!": "marvel now!all-new marvel now!"
    },
    {
        ", Astonishing X-Men was cancelled and in its place another flagship title  Amazing X-Men  was launched which featured the return of Nightcrawler and became flagship title of Wolverines team. Also, Wolverine and the X-Men was relaunched and turned into mutants-in-training book. In 42 for the 42th anniversary of the X-Men, ": null
    },
    {
        "Battle of the Atom": "battle of the atom"
    },
    {
        " was published which involved members of both X-Men schools trying to decide what to do about the time-displaced original X-Men. In 42 Wolverine was killed off in the ": null
    },
    {
        "Death of Wolverine": "death of wolverine"
    },
    {
        " story arc.     Notable additions to the X-Men have been ": null
    },
    {
        "Firestar": "firestar"
    },
    {
        " and ": null
    },
    {
        "M": "m"
    },
    {
        ". Notable story arcs of this era are ": null
    },
    {
        "Battle of the Atom": "battle of the atom"
    },
    {
        " , ": null
    },
    {
        "Death of Wolverine": "death of wolverine"
    },
    {
        " , ": null
    },
    {
        "AXIS": "axis"
    },
    {
        " and ": null
    },
    {
        "The Black Vortex": "the black vortex"
    },
    {
        " .     Cyclops X-Men   ": null
    },
    {
        "All-New X-Men": "all-new x-men"
    },
    {
        "   Uncanny X-Men": "uncanny x-men"
    },
    {
        " vol 42   Wolverines X-Men   ": null
    },
    {
        "Amazing X-Men": "amazing x-men"
    },
    {
        "   X-Men": "x-men"
    },
    {
        " vol 42   X-Men in Training   ": null
    },
    {
        "Wolverine and the X-Men": "wolverine and the x-men"
    },
    {
        "          In 42 as part of ": null
    },
    {
        "All-New, All-Different Marvel": "all-new, all-different marvel"
    },
    {
        " , three team books were launched: the second volume of All-New X-Men, the fourth volume of Uncanny X-Men and  Extraordinary X-Men .  X42 took on the mantle of Wolverine and got a new solo series and ": null
    },
    {
        "Old Man Logan": "old man logan"
    },
    {
        " also received a new ongoing series. During this period, the mutants dealt with the threat of the ": null
    },
    {
        "Terrigen": "terrigen mist"
    },
    {
        " cloud that circulated the world and appeared to be toxic to them, placing the X-Men at odds with the ": null
    },
    {
        "Inhumans": "inhumans"
    },
    {
        ". The X-Men also dealt with Apocalypse resurfacing, and the truth of what happened between Cyclops and the Inhumans that led to his death. Storms team resided in ": null
    },
    {
        "Limbo": "limbo"
    },
    {
        " and worked to bring mutants to safety away from the Terrigen. Magnetos team took on a more militant approach. Beast worked alongside the Inhumans to attempt to find a way to alter the state of the Terrigen, but later discovered that it couldnt be altered and would have rendered Earth toxic for mutants. This revelation caused the X-Men to declare war against the Inhumans.     Notable story arcs of this era are Apocalypse Wars , ": null
    },
    {
        "Death of X": "death of x"
    },
    {
        " and ": null
    },
    {
        "Inhumans vs. X-Men": "inhumans vs. x-men"
    },
    {
        " .     X-Men   ": null
    },
    {
        "Extraordinary X-Men": "extraordinary x-men"
    },
    {
        "   Uncanny X-Men": "uncanny x-men"
    },
    {
        " vol 42   ": null
    },
    {
        "All-New X-Men": "all-new x-men"
    },
    {
        " vol 42          In 42 the  ResurrXion  lineup was launched with X-Men: Prime. It introduced new titles;  X-Men Blue ,  X-Men Gold ,  Weapon X , new volumes of  Astonishing X-Men  and  Generation X  and new solo series for Cable, Jean Grey, and Iceman. With the Terrigen gone, the X-Men vacated Limbo and moved to ": null
    },
    {
        "Central Park": "central park, new york"
    },
    {
        " where they returned to their heroic roots instead of constantly living in fear for their survival. Other notable changes include Kitty Pryde as the new leader of the X-Men, the time-displaced X-Men working with Magneto, Old Man Logan turning Weapon X into a black ops team, and mutant characters crossing over from ": null
    },
    {
        "Earth42": "ultimate marvel"
    },
    {
        " to the Earth42 universe. Early 42 saw the Phoenix Force returning to earth and mysteriously resurrecting the original Jean Grey. A new series featuring the original Jean leading a team of X-Men called  X-Men Red  was released later that same month. Rogue and Gambits relationship became a focal point during the  Rogue & Gambit  miniseries and again in the Till Death Do Us Part story arc in X-Men Gold, which saw the two finally tie the knot, and once more during the Mr. & Mrs. X miniseries, which saw the new couple attempt to take their honeymoon but end up involved in an intergalactic conspiracy. Other noteworthy plot points included Wolverines return coinciding with the arrival of a mysterious new villain named Persephone, Psylockes return to her original body, Magnetos steady return to villainy, and the time-displaced X-Men facing the consequences of their presence in the 42 timeline, and the return of Cyclops. 42 saw a new volume of Uncanny X-Men released beginning with a 42-part weekly story arc.     Mainly Charles Xavier, Cyclops, Wolverine and Jean were resurrected and time displaced X-Men returned to their original timeline during the Extermination event.     Notable additions to the X-Men have been ": null
    },
    {
        "Wolfsbane": "wolfsbane"
    },
    {
        " and ": null
    },
    {
        "Multiple Man": "jamie madrox"
    },
    {
        ". Notable story arcs of this decade are Phoenix Resurrection: The Return of Jean Grey , Extermination , ": null
    },
    {
        "Hunt for Wolverine": "hunt for wolverine"
    },
    {
        " , ": null
    },
    {
        "Return of Wolverine": "return of wolverine"
    },
    {
        " and X-Men: Disassembled .     X-Men   ": null
    },
    {
        "X-Men Gold": "x-men gold"
    },
    {
        "   X-Men Red": "x-men red"
    },
    {
        " Astonishing X-Men": "astonishing x-men"
    },
    {
        " vol 42   ": null
    },
    {
        "X-Men Blue": "x-men blue"
    },
    {
        " Generation X": "generation x"
    },
    {
        " vol 42       On May 42 42 Marvel announced they will cancel all the X-Men titles and relaunch the entire lineup. ": null
    },
    {
        "Jonathan Hickman": "jonathan hickman"
    },
    {
        " will have full creative control and will start with two rotating bi-weekly six-issue limited series called ": null
    },
    {
        "House of X and Powers of X": "house of x and powers of x"
    },
    {
        ". After the 42 issues are released Hickman will pen the flagship title and several new and traditional titles will be released.  It was subsequently announced in July 42 at ": null
    },
    {
        "San Diego Comic-Con": "san diego comic-con"
    },
    {
        " that there would be six new X-titles as part of Marvels ": null
    },
    {
        "Dawn of X": "dawn of x"
    },
    {
        " campaign.       X-Men  – the flagship title of the X-titles starring a team lead by ": null
    },
    {
        "Cyclops": "cyclops"
    },
    {
        " consisting of Summers family members ": null
    },
    {
        "Jean Grey": "jean grey"
    },
    {
        ", ": null
    },
    {
        "Cable": "cable"
    },
    {
        ", ": null
    },
    {
        "Rachel Summers": "rachel summers"
    },
    {
        ", ": null
    },
    {
        "Havok": "havok"
    },
    {
        ", ": null
    },
    {
        "Corsair": "corsair"
    },
    {
        ", ": null
    },
    {
        "Vulcan": "vulcan"
    },
    {
        " and frenemy ": null
    },
    {
        "Wolverine": "wolverine"
    },
    {
        ".    Marauders  – a rebranding of the supervillain team featuring ": null
    },
    {
        "Kitty Pryde": "kitty pryde"
    },
    {
        " , ": null
    },
    {
        "Storm": "storm"
    },
    {
        ", ": null
    },
    {
        "Iceman": "iceman"
    },
    {
        ", ": null
    },
    {
        "Bishop": "bishop"
    },
    {
        ", ": null
    },
    {
        "Pyro": "pyro"
    },
    {
        " and ": null
    },
    {
        "Emma Frost": "emma frost"
    },
    {
        " as pirates who travel the world via ship to protect mutantkind.    Excalibur  – a title starring ": null
    },
    {
        "Betsy Braddock": "betsy braddock"
    },
    {
        ", who takes over the mantle of ": null
    },
    {
        "Captain Britain": "captain britain"
    },
    {
        " from her brother ": null
    },
    {
        "Brian Braddock": "brian braddock"
    },
    {
        ", alongside ": null
    },
    {
        "Rogue": "rogue"
    },
    {
        ", ": null
    },
    {
        "Gambit": "gambit"
    },
    {
        ", ": null
    },
    {
        "Jubilee": "jubilee"
    },
    {
        ", ": null
    },
    {
        "Rictor": "rictor"
    },
    {
        " and ": null
    },
    {
        "Apocalypse": "apocalypse"
    },
    {
        ".    New Mutants  – spacefaring title featuring a team lead by ": null
    },
    {
        "Magik": "magik"
    },
    {
        " with a roster including ": null
    },
    {
        "Sunspot": "sunspot"
    },
    {
        ", ": null
    },
    {
        "Wolfsbane": "wolfsbane"
    },
    {
        ", ": null
    },
    {
        "Mirage": "mirage"
    },
    {
        ", ": null
    },
    {
        "Karma": "karma"
    },
    {
        ", ": null
    },
    {
        "Cypher": "cypher"
    },
    {
        ", ": null
    },
    {
        "Mondo": "mondo"
    },
    {
        " and ": null
    },
    {
        "Chamber": "chamber"
    },
    {
        ". The comic will also co-star the ": null
    },
    {
        "Starjammers": "starjammers"
    },
    {
        ".    Fallen Angels  – a revival of the 42 title, this incarnation stars ": null
    },
    {
        "Kwannon": "kwannon"
    },
    {
        " who recruits ": null
    },
    {
        "Cable": "cable"
    },
    {
        " and ": null
    },
    {
        "X42": "x-23"
    },
    {
        " for a personal mission which could jeapordize all of mutantkind.    X-Force  – featuring the mutant black-ops team which will consist of ": null
    },
    {
        "Beast": "beast"
    },
    {
        ", ": null
    },
    {
        "Jean Grey": "jean grey"
    },
    {
        ", ": null
    },
    {
        "Sage": "sage"
    },
    {
        ", ": null
    },
    {
        "Domino": "domino"
    },
    {
        ", ": null
    },
    {
        "Wolverine": "wolverine"
    },
    {
        ", ": null
    },
    {
        "Colossus": "colossus"
    },
    {
        " and ": null
    },
    {
        "Kid Omega": "kid omega"
    },
    {
        ".   Wolverine - featuring the titular mutant of the same name.   X-Corp - TBA   Untitled Moira MacTaggert series - featuring the titular character.   X-Men/Fantastic Four - focusing on ": null
    },
    {
        "Franklin Richards": "franklin richards"
    },
    {
        " of the ": null
    },
    {
        "Fantastic Four": "fantastic four"
    },
    {
        " being offered to join the X-Men nation of Krakoa.   Giant-Size X-Men: Jean Grey and Emma Frost - featuring the titular telepathic mutants.       The X-Men use many recurring plot-devices and motifs for their various story arcs over the years that have become commonplace within the X-Men canon.       Many of the X-Mens stories delve into ": null
    },
    {
        "time travel": "time travel"
    },
    {
        " either in the sense of the team traveling through time on a mission, villains traveling through time to alter history, or certain characters traveling from the past or future in order to join the present team. Story arcs and spin-offs that are notable for using this plot device include  Days of Future Past ,  Messiah Complex ,  All-New X-Men ,  Messiah War , and  Battle of the Atom . Characters who are related to time travel include: Apocalypse, Bishop, Cable, ": null
    },
    {
        "Old Man Logan": "old man logan"
    },
    {
        ", Prestige, Hope Summers, ": null
    },
    {
        "Tempus": "tempus eva bell"
    },
    {
        ", and ": null
    },
    {
        "Stryfe": "stryfe"
    },
    {
        ".  A major notable period in the X-Mens history began in 42s  All-New X-Men  when ": null
    },
    {
        "Beast": "beast"
    },
    {
        " used time-travel to bring the original five 42s X-Men into the present. These time-displaced characters subsequently starred in their own title  X-Men Blue  before returning to their original timeline in 42s Extermination event.       One of the most recurring plot devices used in the X-Men franchise is death and resurrection, mostly in the sense of Jean Grey and her bond with the Phoenix. Though not as iconic as Jean and the Phoenix, many other X-Men characters have died and come back to life on occasion. Death and resurrection has become such a common occurrence in the X-books that the characters have mentioned on numerous occasions that theyre not strangers to death or have made comments that death doesnt always have a lasting effect on them . ": null
    },
    {
        "X-Necrosha": "x-necrosha"
    },
    {
        " is a particular story arc that sees ": null
    },
    {
        "Selene": "selene"
    },
    {
        " temporarily reanimate many of the X-Mens dead allies and enemies in order for her to achieve godhood.         Many of the characters deal with the topic of fate. In particular, ": null
    },
    {
        "Destiny": "destiny"
    },
    {
        "s abilities of precognition have affected certain plot points in the X-Mens history long after she was killed off due to both the X-Men and their enemies constantly searching for her missing diaries that foretell certain futures. The topic of fate takes center stage yet again in a story arc called The Extremists involving attacks against the ": null
    },
    {
        "Morlocks": "morlocks"
    },
    {
        " due to one of them seeing a dark future for their people. Uncanny X-Men Vol. 42 4242 Some characters believe they already know their own fates, such as Apocalypse believing he is fated to rule the mutants or Magneto believing he is fated to lead the mutants to rise up against humans. Other characters such as Jean, Prestige, ": null
    },
    {
        "Evan Sabanur": "apocalypse evan sabahnur"
    },
    {
        ", Hope Summers, and ": null
    },
    {
        "Warren Worthington III": "warren worthington iii"
    },
    {
        " have all been wary of their fates and have all taken measures to alter their futures.       ": null
    },
    {
        "Space travel": "spacefaring"
    },
    {
        " has been a common staple in the X-Men books beginning with the Phoenix and Dark Phoenix sagas. Since then space has been involved in many stories involving the X-Mens allies and occasional rivals the ": null
    },
    {
        "Shiar": "shiar"
    },
    {
        " along with stories involving the Phoenix Force. Space has been the setting for many stories involving the likes of ": null
    },
    {
        "The Brood": "brood"
    },
    {
        ", such as the story arc where the villainous species was first introduced. Uncanny X-Men Vol. 42 4242 Through space noteworthy characters like The ": null
    },
    {
        "Starjammers": "starjammers"
    },
    {
        " and ": null
    },
    {
        "Vulcan": "vulcan"
    },
    {
        " were introduced. Space Travel played a major role in ": null
    },
    {
        "Joss Whedons": "joss whedon"
    },
    {
        " run on ": null
    },
    {
        "Astonishing X-Men": "astonishing x-men"
    },
    {
        " via the introduction of ": null
    },
    {
        "S.W.O.R.D.": "s.w.o.r.d."
    },
    {
        " and especially in one of the final story arcs under his authorship called Unstoppable . Astonishing X-Men Vol. 42 4242 Giant Sized Astonishing X-Men 42 Other notable story arcs involving space included ": null
    },
    {
        "X-Men: The End": "x-men: the end"
    },
    {
        " , Rise and Fall of the Shiar Empire , ": null
    },
    {
        "X-Men: Kingbreaker": "x-men: kingbreaker"
    },
    {
        " , ": null
    },
    {
        "War of Kings": "war of kings"
    },
    {
        " , and ": null
    },
    {
        "The Black Vortex": "the black vortex"
    },
    {
        " .       The topic of sanity has been addressed in many of the major heroes and villains of X-Men. Most famously this is addressed in Jean Grey when she gains near omnipotence through the Phoenix and ": null
    },
    {
        "Professor Xavier": "professor xavier"
    },
    {
        " after he violently uses his powers against Magneto, unintentionally creating Onslaught. Mystiques sanity wavers throughout the franchise as her constant transformations causes more and more of her mind to fracture. Uncanny X-Men vol. 42 4242 Uncanny X-Men vol. 42 42 Ever since swapping bodies with ": null
    },
    {
        "Revanche": "revanche"
    },
    {
        ", Psylocke has occasionally struggled to maintain her sanity due to her more aggressive nature and new powers. The character Deadpool is famous for his blatant lack of sanity. After Magneto stripped Wolverine of his metal bones, Wolverine began to become increasingly feral throughout most of the mid to late 42s X-Men comics. The nature of Rogues powers affecting her sanity due to her retaining the memories of others has been a central plot device on many occasions, most famously retaining ": null
    },
    {
        "Ms. Marvels": "carol danvers"
    },
    {
        " psyche throughout most of the 42s. Most recently Emma Frosts sanity has become fractured ever since Cyclops died in her arms, causing her to declare war against Inhumans. Death of X 4242 Other characters who have had issues with sanity include Cyclops, Sabretooth, ": null
    },
    {
        "Magik": "magik"
    },
    {
        ", ": null
    },
    {
        "Quentin Quire": "quentin quire"
    },
    {
        ", X42 and Prestige.       In the Marvel Universe, mutant rights is one of the hot controversial political topics and is something that is addressed numerous times in the X-books as a plot device. While some politicians like ": null
    },
    {
        "Valerie Cooper": "valerie cooper"
    },
    {
        " have legitimately tried to help the X-Men, most have made it their mission to discredit the X-Men in order to eliminate mutants once and for all. Senator ": null
    },
    {
        "Robert Kelly": "robert kelly"
    },
    {
        " began his platform on a strong outspoken anti-mutant sentiment until he changed his mind after being rescued by mutants later on in his career. When Sabretooths human son ": null
    },
    {
        "Graydon Creed": "graydon creed"
    },
    {
        " ran for office, the X-Men sent in ": null
    },
    {
        "Cannonball": "cannonball"
    },
    {
        " and Iceman to discreetly join his campaign team and find anything on his anti-mutant agenda. This continued until it boiled to a head when his assassination led to ": null
    },
    {
        "Operation: Zero Tolerance": "operation: zero tolerance"
    },
    {
        ". Some of the issues presented in the comics serve as allegory to modern issues in the real world, such as Lydia Nance suggesting mass mutant deportation. X-Men Gold 4242           The X-Men exist in the ": null
    },
    {
        "Marvel Universe": "marvel universe"
    },
    {
        " along with other characters featured in Marvel Comics series and often interact with them. The X-Men/mutant corner of the Marvel Universe has been informally called X-Universe . For instance, ": null
    },
    {
        "Wolverine": "wolverine"
    },
    {
        " was originally an antagonist to ": null
    },
    {
        "the Hulk": "hulk"
    },
    {
        " before joining the X-Men and has ties to other heroes such as ": null
    },
    {
        "Captain America": "captain america"
    },
    {
        ", ": null
    },
    {
        "Black Widow": "black widow"
    },
    {
        ", ": null
    },
    {
        "the Thing": "thing"
    },
    {
        ", ": null
    },
    {
        "Captain Marvel ": "carol danvers"
    },
    {
        ", ": null
    },
    {
        "Elektra": "elektra"
    },
    {
        " and ": null
    },
    {
        "Spider-Man": "spider-man"
    },
    {
        ". ": null
    },
    {
        "Quicksilver": "quicksilver"
    },
    {
        " and ": null
    },
    {
        "Scarlet Witch": "scarlet witch"
    },
    {
        " are former ": null
    },
    {
        "Brotherhood of Mutants": "brotherhood of mutants"
    },
    {
        " members who joined the ": null
    },
    {
        "Avengers": "avengers"
    },
    {
        ", as have other X-Men characters such as ": null
    },
    {
        "Beast": "beast"
    },
    {
        ". ": null
    },
    {
        "Rogue": "rogue"
    },
    {
        " got her powers via absorbing Captain Marvel and the latter has also interacted with the X-Men. ": null
    },
    {
        "Kitty Pryde/Shadowcat": "kitty pryde"
    },
    {
        " has been part of the ": null
    },
    {
        "Guardians of the Galaxy": "guardians of the galaxy"
    },
    {
        " and dated ": null
    },
    {
        "Star-Lord": "star-lord"
    },
    {
        ", she also served as a mentor to ": null
    },
    {
        "Franklin Richards": "franklin richards"
    },
    {
        " the mutant son of ": null
    },
    {
        "Mister Fantastic": "mister fantastic"
    },
    {
        " and ": null
    },
    {
        "Invisible Woman": "invisible woman"
    },
    {
        " of the ": null
    },
    {
        "Fantastic Four": "fantastic four"
    },
    {
        ". ": null
    },
    {
        "Storm": "storm"
    },
    {
        " was once the Queen of ": null
    },
    {
        "Wakanda": "wakanda"
    },
    {
        " and the wife of ": null
    },
    {
        "Black Panther": "black panther"
    },
    {
        ", as well as a temporary member of the Fantastic Four. ": null
    },
    {
        "Rachel Summers": "rachel summers"
    },
    {
        " was the girlfriend of Franklin Richards. ": null
    },
    {
        "Iceman": "iceman"
    },
    {
        " and ": null
    },
    {
        "Angel": "angel"
    },
    {
        " have also joined ": null
    },
    {
        "the original Champions": "champions"
    },
    {
        " alongside Black Widow, ": null
    },
    {
        "Ghost Rider": "ghost rider"
    },
    {
        " and ": null
    },
    {
        "Hercules": "hercules"
    },
    {
        " as well as having frequent partnerships with ": null
    },
    {
        "Firestar": "firestar"
    },
    {
        " and Spider-Man as The Amazing Friends . ": null
    },
    {
        "Sabretooth": "sabretooth"
    },
    {
        " was originally a villain of ": null
    },
    {
        "Iron Fist": "iron fist"
    },
    {
        " before becoming Wolverines archenemesis. And both the X-Men and the Avengers formed a team called ": null
    },
    {
        "Uncanny Avengers": "uncanny avengers"
    },
    {
        " after ": null
    },
    {
        "a conflict over the Phoenix Force": "avengers vs x-men"
    },
    {
        ". The global nature of the mutant concept means the scale of stories can be highly varied. The X-Mens enemies range from mutant thieves to galactic threats.     Historically, the X-Men have been based in the ": null
    },
    {
        "Xavier Institute of Gifted Youngsters/X-Mansion": "x-mansion"
    },
    {
        " located in ": null
    },
    {
        "Salem Center": "north salem, new york"
    },
    {
        ", ": null
    },
    {
        "Westchester County, New York": "westchester county, new york"
    },
    {
        ", and are often portrayed as a family. The Xaviers School for Gifted Youngsters/X-Mansion is often depicted with three floors and two underground levels. To the outside world, it acted as a higher learning institute until the 42s, when Xavier was publicly exposed as a mutant at which point it became a known mutant ": null
    },
    {
        "boarding school": "boarding school"
    },
    {
        ". Xavier funds a corporation aimed at reaching mutants worldwide, though it ceased to exist following the 42 Decimation storyline. The X-Men benefit from advanced technology such as Xavier tracking down mutants with a device called ": null
    },
    {
        "Cerebro": "cerebro"
    },
    {
        " which amplifies his powers; the X-Men train within the ": null
    },
    {
        "Danger Room": "danger room"
    },
    {
        ", first depicted as a room full of weapons and booby traps, now as generating holographic simulations; and the X-Men travel in their ": null
    },
    {
        "Blackbird jet": "blackbird"
    },
    {
        ".       The X-Men introduced several fictional locations which are regarded as important within the shared universe in which Marvel Comics characters exist:     ": null
    },
    {
        "Asteroid M": "asteroid m"
    },
    {
        ", an asteroid made by Magneto, a mutant utopia and training facility off of the Earths surface.   Avalon, Magnetos ": null
    },
    {
        "space station": "space station"
    },
    {
        " that served as the primary base for him and his Acolytes to create a mutants-only safe haven after Magneto drastically reverted to his villainous ways.   ": null
    },
    {
        "Genosha": "genosha"
    },
    {
        ", an island near Madagascar and a longtime ": null
    },
    {
        "apartheid": "crime of apartheid"
    },
    {
        " regime against mutants. The U.N. gave control to Magneto until the E Is for Extinction story saw Genosha destroyed via mass ": null
    },
    {
        "genocide": "genocide"
    },
    {
        ".   ": null
    },
    {
        "Limbo": "limbo"
    },
    {
        ", a hellish dimension heavily populated by demons. Whoever possesses the Soulsword bears control over and can draw power from Limbo. In ": null
    },
    {
        "Extraordinary X-Men": "extraordinary x-men"
    },
    {
        " the X-Men made Limbo their home after Terrigen started making earth uninhabitable for mutants.   ": null
    },
    {
        "Madripoor": "madripoor"
    },
    {
        ", an island in ": null
    },
    {
        "South East Asia": "south east asia"
    },
    {
        ", near Singapore. Its location is shown to be in the southern portion of the ": null
    },
    {
        "Strait of Malacca": "strait of malacca"
    },
    {
        ", south west of Singapore.   Mojoverse, an alternate dimension ruled by the tyrant ": null
    },
    {
        "Mojo": "mojo"
    },
    {
        " focused on creating violent ": null
    },
    {
        "reality entertainment": "reality television"
    },
    {
        " usually featuring captive mutants   ": null
    },
    {
        "Murderworld": "murderworld"
    },
    {
        ", fictional twisted amusement park designed by the Marvel supervillain known as Arcade.   ": null
    },
    {
        "Muir Island": "muir island"
    },
    {
        ", a remote island off the coast of ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ". This is primarily known in the X-Men universe as the home of ": null
    },
    {
        "Moira MacTaggert": "moira mactaggert"
    },
    {
        "s laboratory.   ": null
    },
    {
        "Mutant Town": "mutant town"
    },
    {
        " , an area in ": null
    },
    {
        "Alphabet City, Manhattan": "alphabet city, manhattan"
    },
    {
        ", populated largely by mutants and beset by poverty and crime.   New Tien, a mutant-run region on the west coast of the United States where mutants outnumber humans. It was created after ": null
    },
    {
        "Hydra took over the United States": "secret empire"
    },
    {
        ". Emma Frost secretly leads New Tien by telepathically possessing New Tiens ": null
    },
    {
        "puppet ruler": "puppet ruler"
    },
    {
        " Xorn.   ": null
    },
    {
        "Savage Land": "savage land"
    },
    {
        ", a preserved location in ": null
    },
    {
        "Antarctica": "antarctica"
    },
    {
        " which is home to a number of extinct species, most notably ": null
    },
    {
        "dinosaur": "dinosaur"
    },
    {
        "s, and strange tribes.   ": null
    },
    {
        "Shiar throneworld Chandilar": "shiar"
    },
    {
        ", the home world of the X-Mens occasional ": null
    },
    {
        "extraterrestrial": "wikt:extraterrestrial"
    },
    {
        " allies The Shiar.   ": null
    },
    {
        "Utopia": "asteroid mfifth version.2futopia"
    },
    {
        ", Cyclops had Asteroid M raised from the Pacific Ocean off the coast of the San Francisco as a response to the rise of anti-mutant sentiment to form a mutant nation.        Age of Apocalypse  – In a world where Professor X is killed before he can form the X-Men, Magneto leads the X-Men in a dystopian world ruled by Apocalypse. Created and reverted via time travel.    Age of X  - a world in which anti-mutant sentiment became even worse due to a series of events and thus led to the United States government hunting down mutants with Sentinels and leading to The Decimation which severely reduced the mutant population and Magneto leads the mutants who are based in Fortress X.    Days of Future Past  – ": null
    },
    {
        "Sentinels": "sentinel"
    },
    {
        " have either killed or placed into concentration camps almost all mutants. Prevented by the time-traveling Kate Pryde/Widget .    House of M  – Reality is altered by ": null
    },
    {
        "Scarlet Witch": "scarlet witch"
    },
    {
        ", with her father Magneto as the ruler of Genosha and in which mutants are the dominant group with humans as second-class citizens. 42s crossover event, it concludes with a reversion to the normal Marvel Universe, albeit with most mutants ": null
    },
    {
        "depowered": "decimation"
    },
    {
        ".    Marvel 42  – Mutants are known as the Witchbreed in this alternate reality set during the time of ": null
    },
    {
        "The Inquisition": "inquisition"
    },
    {
        ". Carlos Javier creates a school for the children of gentlefolk to serve as a safe haven and training ground.   ": null
    },
    {
        "Marvel 42": "marvel 2099"
    },
    {
        " – Set in a dystopian world with new characters looking to the original X-Men as history, becoming ": null
    },
    {
        "X-Men 42": "x-men 2099"
    },
    {
        " and ": null
    },
    {
        "X-Nation 42": "x-nation 2099"
    },
    {
        ".    Marvel Noir  - The X-Men of this reality are a group of delinquent teenagers led by Charles Xavier who believes that sociopathy is the next step in human evolution.    Mutant X  – Set in a world where Scott Summers was captured along with his parents by the Shiar and only Alex escaped, allowing him to be the eventual leader of this Universes X-Men . The Mutant X universe reimagines ": null
    },
    {
        "Mr. Fantastic": "mister fantastic"
    },
    {
        ", ": null
    },
    {
        "Nick Fury": "nick fury"
    },
    {
        ", and Professor X as villains and ": null
    },
    {
        "Doctor Doom": "doctor doom"
    },
    {
        " and Apocalypse as heroes.    MC42  - In this alternate future, ": null
    },
    {
        "Jubilee": "jubilee"
    },
    {
        " forms the X-People in response to anti-mutant sentiment. Members include Angry Eagle, Simian, Spanner, Torque, ": null
    },
    {
        "Push": "nancy lu"
    },
    {
        ", ": null
    },
    {
        "Bluestreak": "bluestreak"
    },
    {
        ", ": null
    },
    {
        "J42": "j2"
    },
    {
        ", and ": null
    },
    {
        "Wild Thing": "wild thing"
    },
    {
        ".  All-New X-Men  vol. 42 42 by ": null
    },
    {
        "Brian Michael Bendis": "brian michael bendis"
    },
    {
        " and ": null
    },
    {
        "Stuart Immonen": "stuart immonen"
    },
    {
        ", and brought to the present with time travel. They were kept as regular characters, as Bendis intended to explore their reactions to the fate of their adult selves. Truitt, Brian . .  USA Today . The team was the main focus of the  Battle of the Atom  crossover, some months later. Bendis also used them for crossovers with the ": null
    },
    {
        "Guardians of the Galaxy": "guardians of the galaxy"
    },
    {
        " and ": null
    },
    {
        "Miles Morales": "miles morales"
    },
    {
        ", that he also wrote.  This was one of the few crossovers between the ": null
    },
    {
        "Marvel Universe": "marvel universe"
    },
    {
        " and the ": null
    },
    {
        "Ultimate Marvel": "ultimate marvel"
    },
    {
        " universe; Bendis preferred to write them sparingly.  All-New X-Men has a vol. 42 in 42 by ": null
    },
    {
        "Dennis Hopeless": "dennis hopeless"
    },
    {
        " and ": null
    },
    {
        "Mark Bagley": "mark bagley"
    },
    {
        ".  The comic was cancelled after the end of the  Inhumans vs. X-Men  crossover, and the team was now published in the  X-Men Blue  comic. The teenager Jean also got a solo series after the end of  ResurrXion , by Hopeless and Victor Ibanez, that explored her relation with the ": null
    },
    {
        "Phoenix Force": "phoenix force"
    },
    {
        ".  The teenager Cyclops joins the ": null
    },
    {
        "Champions": "champions"
    },
    {
        ", a comic book focused on teenager heroes but unrelated to the X-Men mythos.  They guest-starred in the  Venom  comic, in the Poison-X arc. The story took the villains from the  Venomverse  arc and led to the Venomized crossover.  The team will be featured in the Extermination crossover.     Ruins  - Although the actual X-Men dont appear alternate versions of its members and villains are shown to have suffered under horrific circumstances. Charles Xavier is a tyrannical ": null
    },
    {
        "President of the United States": "president of the united states"
    },
    {
        ", Jean Grey is a ": null
    },
    {
        "prostitute": "prostitution"
    },
    {
        ", Magneto and Mystique die, Wolverine suffers from poisoning from his adamantium skeleton, Emma Frost heads the Church of the Next Generation and forces children of her followers to undergo surgery, Cyclops as well as Nightcrawler and Kitty Pryde are imprisoned at a Texas jail and Sabretooth is part of a fascist cannibalistic militia based in Oklahoma alongside Bucky Barnes and Jack Monroe.    Ultimate X-Men  – Set in the reimagined ": null
    },
    {
        "Ultimate Marvel": "ultimate marvel"
    },
    {
        " universe. The X-Men are younger, wear black and gold uniforms and supernatural/cosmic elements are downplayed. Additionally Colossus is gay unlike his main universe counterpart, Magneto is not a Holocaust survivor and is more villainous, mutants were created by the Super-Soldier Serum, Cable is Wolverine and Kitty Pryde/Shadowcat dated Spider-Man.    X-Men Forever  – An alternate continuity diverging from X-Men, vol. 42 42 continuing as though writer Chris Claremont had never left writing the series.     X-Men Noir  – Set in the 42s, with the X-Men as a mysterious criminal gang and the Brotherhood as a secret society of corrupt cops.    X-Men: The End  – A possible ending to the X-Mens early 42 status quo.    X-Men 42  – Follows Secret Wars , the X-Men of the 42 TV Series, received their own comic book series.        The conflict between mutants and normal humans is often compared to real-world conflicts experienced by minority groups in ": null
    },
    {
        "America": "america"
    },
    {
        " such as ": null
    },
    {
        "African Americans": "african americans"
    },
    {
        ", various religious or non-religious groups,    It has been remarked that attitudes towards mutants do not make sense in the context of the Marvel Universe, since non-mutants with similar powers are rarely regarded with fear; X-Men editor ": null
    },
    {
        "Ann Nocenti": "ann nocenti"
    },
    {
        " remarked that I think thats literary, really - because there is no difference between Colossus and ": null
    },
    {
        "the Torch": "human torch"
    },
    {
        ". If a guy comes into my office in flames, or a guy comes into my office and turns to steel, Im going to have the same reaction. It doesnt really matter that I know their origins. ... as a book, The X-Men has always represented something different - their powers arrive at puberty, making them analogous to the changes you go through at adolescence - whether theyre special, or out of control, or setting you apart - the misfit identity theme.  Also on an individual level, a number of X-Men serve a ": null
    },
    {
        "metaphor": "metaphor"
    },
    {
        "ical function as their powers illustrate points about the nature of the outsider.       Racism : Although this was not initially the case, ": null
    },
    {
        "Professor X": "professor x"
    },
    {
        " has come to be compared to ": null
    },
    {
        "civil rights": "civil rights"
    },
    {
        " leader ": null
    },
    {
        "Martin Luther King, Jr.": "martin luther king, jr."
    },
    {
        " and ": null
    },
    {
        "Magneto": "magneto"
    },
    {
        " to the more militant ": null
    },
    {
        "Malcolm X": "malcolm x"
    },
    {
        ".    The X-Mens purpose is sometimes referred to as achieving Xaviers dream , perhaps a reference to Kings historic ": null
    },
    {
        "I Have a Dream": "i have a dream"
    },
    {
        " speech.   X-Men comic books have often portrayed mutants as victims of ": null
    },
    {
        "mob violence": "riot"
    },
    {
        ", evoking images of the ": null
    },
    {
        "lynching": "lynching"
    },
    {
        " of African Americans in the age before the ": null
    },
    {
        "civil rights movement": "civil rights movement"
    },
    {
        ".  Sentinels and anti-mutant hate groups such as ": null
    },
    {
        "Friends of Humanity": "friends of humanity"
    },
    {
        ", Humanitys Last Stand, the ": null
    },
    {
        "Church of Humanity": "church of humanity"
    },
    {
        ", and ": null
    },
    {
        "Strykers": "william stryker"
    },
    {
        " Purifiers": "purifiers"
    },
    {
        " are thought to often represent oppressive forces like the ": null
    },
    {
        "Ku Klux Klan": "ku klux klan"
    },
    {
        " giving a form to denial of civil rights and amendments.  In the 42s, the comic featured a plot involving the fictional island nation of ": null
    },
    {
        "Genosha": "genosha"
    },
    {
        ", where mutants are segregated and enslaved by an ": null
    },
    {
        "apartheid": "crime of apartheid"
    },
    {
        " state. This is widely interpreted as a reference to the situation in ": null
    },
    {
        "South Africa": "apartheid in south africa"
    },
    {
        " at the time.     Anti-Semitism : Explicitly referenced in recent decades is the comparison between antimutant sentiment and anti-Semitism. Magneto, a ": null
    },
    {
        "Holocaust": "the holocaust"
    },
    {
        " survivor, sees the situation of mutants as similar to those of Jews in ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ".  At one point he even utters the words never again in a 42 episode of the X-Men animated series. The mutant slave labor camps on the island of ": null
    },
    {
        "Genosha": "genosha"
    },
    {
        ", in which numbers were burned into mutants foreheads, show much in common with ": null
    },
    {
        "Nazi concentration camps": "nazi concentration camps"
    },
    {
        ",   as do the internment camps of the classic ": null
    },
    {
        "Days of Future Past": "days of future past"
    },
    {
        " storyline.  In the third X-Men film, when asked by Callisto: If youre so proud of being a mutant, then wheres your mark? Magneto shows his concentration camp tattoo, while mentioning that he will never let another needle touch his skin. In the prequel film  X-Men: First Class , a fourteen-year-old Magneto suffers ": null
    },
    {
        "Nazi human experimentation": "nazi human experimentation"
    },
    {
        " during his time in the camps and witnesses his mothers death by gunshot.    Diversity : Characters within the X-Men mythos hail from a wide variety of nationalities. These characters also reflect religious, ethnic or sexual minorities. Examples include Kitty Pryde/Shadowcat, Magneto and ": null
    },
    {
        "Sabra": "sabra"
    },
    {
        " who are ": null
    },
    {
        "of Jewish descent": "jewz"
    },
    {
        ". ": null
    },
    {
        "Dust": "dust"
    },
    {
        " and ": null
    },
    {
        "M": "m"
    },
    {
        " who are ": null
    },
    {
        "Muslim": "muslim"
    },
    {
        ", ": null
    },
    {
        "Nightcrawler": "nightcrawler"
    },
    {
        " who is a devout ": null
    },
    {
        "Catholic": "catholic"
    },
    {
        ". ": null
    },
    {
        "Neal Shaara/Thunderbird": "neal shaara"
    },
    {
        " who is ": null
    },
    {
        "Hindu": "hinduism"
    },
    {
        ". Jubilee is ": null
    },
    {
        "Chinese American": "chinese american"
    },
    {
        ", ": null
    },
    {
        "Gambit": "gambit"
    },
    {
        " is born to ": null
    },
    {
        "Cajun": "cajun"
    },
    {
        " parents from ": null
    },
    {
        "New Orleans, Louisiana": "new orleans, louisiana"
    },
    {
        " and ": null
    },
    {
        "Rogue": "rogue"
    },
    {
        " is from Caledecott County, ": null
    },
    {
        "Mississippi": "mississippi"
    },
    {
        " both of whom are ": null
    },
    {
        "Southerners": "white southerners"
    },
    {
        ". Warpath along with his deceased brother the first Thunderbird are ": null
    },
    {
        "Native Americans of Apache descent": "apache"
    },
    {
        ". ": null
    },
    {
        "Storm": "storm"
    },
    {
        " represents two aspects of the African diaspora as her father was ": null
    },
    {
        "African American": "african american"
    },
    {
        " and her mother was ": null
    },
    {
        "Kenyan": "kenyan"
    },
    {
        ". ": null
    },
    {
        "Karma": "karma"
    },
    {
        " was portrayed as a devout Catholic from ": null
    },
    {
        "Vietnam": "vietnam"
    },
    {
        ", who regularly attended Mass and confession when she was introduced as a founding member of ": null
    },
    {
        "the New Mutants": "new mutants"
    },
    {
        ". Marvel Graphic Novel 42 This team also included ": null
    },
    {
        "Wolfsbane": "wolfsbane"
    },
    {
        " , ": null
    },
    {
        "Danielle Moonstar": "danielle moonstar"
    },
    {
        " , ": null
    },
    {
        "Cannonball": "cannonball"
    },
    {
        ", and was later joined by ": null
    },
    {
        "Magma": "magma"
    },
    {
        " . Different nationalities included Wolverine, ": null
    },
    {
        "Aurora": "aurora"
    },
    {
        ", ": null
    },
    {
        "Northstar": "northstar"
    },
    {
        ", Deadpool and ": null
    },
    {
        "Transonic": "transonic"
    },
    {
        " from ": null
    },
    {
        "Canada": "canada"
    },
    {
        "; Colossus and Magik from ": null
    },
    {
        "Russia": "russia"
    },
    {
        "; Banshee and ": null
    },
    {
        "Siryn": "siryn"
    },
    {
        " from ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        "; Dust from ": null
    },
    {
        "Afghanistan": "afghanistan"
    },
    {
        "; Psylocke, Wolfsbane and ": null
    },
    {
        "Chamber": "chamber"
    },
    {
        " from the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        "; Sunfire, ": null
    },
    {
        "Armor": "armor"
    },
    {
        ", ": null
    },
    {
        "Surge": "surge"
    },
    {
        " and ": null
    },
    {
        "Zero": "kenji uedo"
    },
    {
        " from ": null
    },
    {
        "Japan": "japan"
    },
    {
        "; Sunspot from ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        "; M from ": null
    },
    {
        "Monaco": "monaco"
    },
    {
        "; Nightcrawler from ": null
    },
    {
        "Germany": "germany"
    },
    {
        "; Sabra from ": null
    },
    {
        "Israel": "israel"
    },
    {
        "; ": null
    },
    {
        "Omega Sentinel": "karima shapandar"
    },
    {
        ", Neal Shaara, ": null
    },
    {
        "Kavita Rao": "kavita rao"
    },
    {
        " and ": null
    },
    {
        "Indra": "indra"
    },
    {
        " from ": null
    },
    {
        "India": "india"
    },
    {
        "; ": null
    },
    {
        "Velocidad": "velocidad"
    },
    {
        " from ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        "; ": null
    },
    {
        "Oya": "oya"
    },
    {
        " from ": null
    },
    {
        "Nigeria": "nigeria"
    },
    {
        "; ": null
    },
    {
        "Primal": "primal"
    },
    {
        " from ": null
    },
    {
        "Ukraine": "ukraine"
    },
    {
        "; etc.      LGBT themes : Some commentators have noted the similarities between the struggles of mutants and the ": null
    },
    {
        "LGBT": "lgbt social movements"
    },
    {
        " community, noting the onset of special powers around ": null
    },
    {
        "puberty": "puberty"
    },
    {
        " and the parallels between being ": null
    },
    {
        "closeted": "closeted"
    },
    {
        " and the mutants concealment of their powers.  In the comics series, gay and ": null
    },
    {
        "bisexual": "bisexuality"
    },
    {
        " characters include ": null
    },
    {
        "Anole": "anole"
    },
    {
        ", ": null
    },
    {
        "Bling!": "bling"
    },
    {
        ", Destiny, Karma, Mystique, Psylocke, ": null
    },
    {
        "Courier": "courier"
    },
    {
        ", ": null
    },
    {
        "Northstar": "northstar"
    },
    {
        " , ": null
    },
    {
        "Graymalkin": "graymalkin"
    },
    {
        ", ": null
    },
    {
        "Rictor": "rictor"
    },
    {
        ", ": null
    },
    {
        "Shatterstar": "shatterstar"
    },
    {
        ", Shade, the ": null
    },
    {
        "Ultimate version": "ultimate colossus"
    },
    {
        " of Colossus and later after revealing that he is a mutant; the comics version of the character was then revealed to be gay in 42 ": null
    },
    {
        "Transgender": "transgender"
    },
    {
        " issues also come up with shapechangers like Mystique, ": null
    },
    {
        "Copycat": "copycat"
    },
    {
        ", and Courier who can change gender at will. It has been said that the comic books and the X-Men animated series delved into the AIDS epidemic with a long-running plot line about the ": null
    },
    {
        "Legacy Virus": "legacy virus"
    },
    {
        ", a seemingly incurable disease thought at first to attack only mutants .  In the film  X-Men: First Class , ": null
    },
    {
        "Hank McCoy": "beast"
    },
    {
        " is asked by his CIA boss why he never disclosed his mutant identity, and his response was  you didnt ask, I didnt tell .  Communism and socialism : Occasionally, undercurrents of the real-life ": null
    },
    {
        "Red Scare": "red scare"
    },
    {
        " are present or the events of the Red Scare in history are alluded to. Senator Robert Kellys proposal of a ": null
    },
    {
        "Mutant Registration Act": "registration acts mutant registration act"
    },
    {
        " is similar to the efforts of ": null
    },
    {
        "United States Congress": "united states congress"
    },
    {
        " to try to ban ": null
    },
    {
        "communism": "communism"
    },
    {
        " in the United States. In the 42  X-Men  film, Kelly exclaims, We must know who these mutants are and what they can do, even brandishing a list of known mutants .     Religion : Religion is an integral part of several X-Men storylines. It is presented as both a positive and negative force, sometimes in the same story. The comics explore ": null
    },
    {
        "religious fundamentalism": "religious fundamentalism"
    },
    {
        " through the person of William Stryker and his Purifiers, an antimutant group that emerged in the 42 graphic novel  God Loves, Man Kills . The Purifiers believe that mutants are not human beings but children of the devil, and have attempted to exterminate them several times, most recently in the Childhoods End storyline. By contrast, religion is also central to the lives of several X-Men, such as Nightcrawler, a devout ": null
    },
    {
        "Catholic": "catholic"
    },
    {
        ", and ": null
    },
    {
        "Dust": "dust"
    },
    {
        ", a devout ": null
    },
    {
        "Sunni Muslim": "sunni muslim"
    },
    {
        " who wears an Islamic ": null
    },
    {
        "niqāb": "niqāb"
    },
    {
        ".    Subculture : In some cases, the mutants of the X-Men universe sought to create a subculture of the typical mutant society portrayed. The Morlocks, though mutants like those attending Xaviers school, hide away from society within the tunnels of New York. These Morlock tunnels serve as the backdrop for several X-Men stories, most notably The Mutant Massacre  crossover. This band of mutants illustrates another dimension to the comic, that of a group that further needs to isolate itself because society wont accept it.   In ": null
    },
    {
        "Grant Morrison": "grant morrison"
    },
    {
        "s stories of the early 42s, mutants are portrayed as a distinct subculture with mutant bands, mutant use of code-names as their primary form of self-identity , and a popular mutant fashion designer who created outfits tailored to mutant ": null
    },
    {
        "physiology": "physiology"
    },
    {
        ". The series  District X  takes place in an area of New York City called Mutant Town. These instances can also serve as analogies for the way that minority groups establish subcultures and neighborhoods of their own that distinguish them from the broader general culture. Director ": null
    },
    {
        "Bryan Singer": "bryan singer"
    },
    {
        " has remarked that the X-Men franchise has served as a metaphor for acceptance of all people for their special and unique gifts. The mutant condition that is often kept secret from the world can be analogous to feelings of difference and fear usually developed in everyone during adolescence.  Genocide : Genocide and its psychological after-effects, primarily ": null
    },
    {
        "survivor guilt": "survivor guilt"
    },
    {
        ", are recurring elements in some of the most significant X-Men story arcs. Magneto was a survivor of ": null
    },
    {
        "The Holocaust": "the holocaust"
    },
    {
        " and witnessed the genocide of his people, severely scarring him emotionally and leaving him with a strong distrust of humanity. Because of this he constantly toes the line between ally and enemy of the X-Men. The iconic ": null
    },
    {
        "Days of Future Past": "days of future past"
    },
    {
        " story line saw an alternate future where Sentinels committed genocide on most of the worlds mutants. Uncanny X-Men Vol. 42 4242 In Rachel Summers original timeline, she was captured by humans and turned into a hound used to hunt down other mutants in order to capture and kill them, leaving her extremely traumatized by the experience and knowledge that she unwittingly assisted in the genocide of her own people. Bishops childhood consisted of him being trapped in a mutant concentration camp, leaving him so emotionally scarred as an adult that upon returning to the past he was prepared to ": null
    },
    {
        "kill a baby who might have caused his future": "x-men: messiah complex"
    },
    {
        ". When ": null
    },
    {
        "Cassandra Nova": "cassandra nova"
    },
    {
        " committed genocide on Genosha, the event left both ": null
    },
    {
        "Emma Frost": "emma frost"
    },
    {
        " New X-Men 4242 and ": null
    },
    {
        "Polaris": "polaris"
    },
    {
        " New X-Men 42 Uncanny X-Men 4242 traumatized by survivors guilt as they were amongst the limited few survivors. While taking some time off in Germany, Nightcrawler witnessed the genocide of numerous mutants. The event left him as an emotional shell of who he used to be because of the trauma of what he witnessed until he had psychic therapy with Jean to help him cope. Extraordinary X-Men 42 Other characters who have either committed or have survived genocide include Mystique, Callisto , Apocalypse, Onslaught, Bastion , Mister Sinister , Hope Summers, Cable, and the Phoenix Force .       The insecurity and anxieties in Marvels early 42s comic books such as ": null
    },
    {
        "The Fantastic Four": "fantastic four"
    },
    {
        ", ": null
    },
    {
        "The Amazing Spider-Man": "the amazing spider-man"
    },
    {
        ", ": null
    },
    {
        "The Incredible Hulk": "the incredible hulk"
    },
    {
        ", and X-Men ushered in a new type of superhero, very different from the certain and all-powerful superheroes before them, and changed the publics perception of superheroes.             The X-Men team has featured in multiple forms of media including a ": null
    },
    {
        "live-action film series": "x-men"
    },
    {
        ", ": null
    },
    {
        "multiple animated shows": "x-men in television"
    },
    {
        ", live-action shows, ": null
    },
    {
        "multiple video games": "list of x-men video games"
    },
    {
        ", numerous ": null
    },
    {
        "novel": "novel"
    },
    {
        "s, ": null
    },
    {
        "motion comic": "motion comic"
    },
    {
        "s, ": null
    },
    {
        "soundtrack": "soundtrack"
    },
    {
        "s, ": null
    },
    {
        "action figure": "action figure"
    },
    {
        "s, and ": null
    },
    {
        "clothing": "clothing"
    }
]