[
    {
        "Xmucane  and Xpiacoc , alternatively Xumucane and Ixpiyacoc, are the names of the divine grandparents of ": null
    },
    {
        "Maya mythology": "maya mythology"
    },
    {
        " of the ": null
    },
    {
        "Kʼicheʼ people": "kʼicheʼ people"
    },
    {
        " and the daykeepers of the  Popol Vuh . They are considered to be the oldest of all the ": null
    },
    {
        "gods": "deity"
    },
    {
        " of the Kʼicheʼ pantheon and are identified by a number of names throughout the text, reflecting their multiple roles throughout the Mayan creation myth. They are usually mentioned together, although Xmucane seems to be alone during most of the interactions with the ": null
    },
    {
        "Maya Hero Twins": "maya hero twins"
    },
    {
        ", when she is referred to as simply grandmother .     The pair were invoked during the creation of the world in which the Maya gods were attempting to create humanity. Xmucane and Xpiacoc ground the ": null
    },
    {
        "maize": "maize"
    },
    {
        " that was used in part of the failed attempt, although the beings created were described as being simply ": null
    },
    {
        "mannequin": "mannequin"
    },
    {
        "s and not real people. These two are also invoked, often by other powerful deities, for their powers in divination and matchmaking.     Xmucane herself also plays an integral role in the development of the Maya Hero Twins. She was at first wary of them and their mother, ": null
    },
    {
        "Xquic": "xquic"
    },
    {
        ", and ordered them out of her house when they were yet infants, but she would come to accept them almost as her own sons, raising and caring for them. Xmucane is considered by some to be the ": null
    },
    {
        "goddess": "goddess"
    },
    {
        " associated with the waxing ": null
    },
    {
        "moon": "moon"
    },
    {
        ", contrasting to the hypothetical role of her daughter-in-law as the waning moon.                     ": null
    }
]