[
    {
        "Yazdegerd I, also spelled Yazdgerd I and Yazdgird I , was ": null
    },
    {
        "Sasanian": "sasanian empire"
    },
    {
        " King of Kings": "king of kings"
    },
    {
        " of ": null
    },
    {
        "Iran": "iran"
    },
    {
        " from 42 to 42 A son of ": null
    },
    {
        "Shapur III": "shapur iii"
    },
    {
        " , he succeeded his brother ": null
    },
    {
        "Bahram IV": "bahram iv"
    },
    {
        "  after Bahrams assassination.     Yazdegerd Is largely-uneventful reign is seen in Sasanian history as a period of renewal. Although he was periodically known as the Sinner in native sources, Yazdegerd was more competent than his recent predecessors. He enjoyed cordial relations with the ": null
    },
    {
        "Eastern Roman Empire": "eastern roman empire"
    },
    {
        " and was entrusted with the guardianship of the Roman prince, ": null
    },
    {
        "Theodosius": "theodosius ii"
    },
    {
        ", by Theodosius father ": null
    },
    {
        "Arcadius": "arcadius"
    },
    {
        ". Yazdegerd I is known for his friendly relations with the ": null
    },
    {
        "Jews": "persian jews"
    },
    {
        " and ": null
    },
    {
        "Christians": "christianity in iran"
    },
    {
        " of the ": null
    },
    {
        "Church of the East": "church of the east"
    },
    {
        ", which he acknowledged in 42 Because of this, he was praised by Jews and Christians as the new ": null
    },
    {
        "Cyrus the Great": "cyrus the great"
    },
    {
        " .     The kings religious, peaceful policies were disliked by the nobility and ": null
    },
    {
        "Zoroastrian": "zoroastrian"
    },
    {
        " clergy, whose power and influence he strove to curb. This eventually backfired, and Yazdegerd I met his end at the hands of the nobility in the remote northeast. The nobles then sought to stop Yazdegerds sons from the ascending the throne; his eldest son, ": null
    },
    {
        "Shapur IV": "shapur iv"
    },
    {
        ", was quickly killed after his accession and replaced with ": null
    },
    {
        "Khosrow": "khosrow"
    },
    {
        ". Another son, ": null
    },
    {
        "Bahram V": "bahram v"
    },
    {
        ", hurried to the Sasanian capital of ": null
    },
    {
        "Ctesiphon": "ctesiphon"
    },
    {
        " with an ": null
    },
    {
        "Arab": "arabs"
    },
    {
        " army and pressured the nobility to acknowledge him as ": null
    },
    {
        "shah": "shah"
    },
    {
        ".       The name Yazdegerd is a combination of the ": null
    },
    {
        "Old Iranian": "iranian languagesold iranian"
    },
    {
        " yazad yazata and -karta – God-made , comparable to the Iranian Bagkart and ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " Theoktistos. It is known in other languages as Yazdekert ; Yazd erd ; Yazdegerd, Izdegerd and Yazdeger ; Yazdkert ; Izdeger and Azger ; Yazdeijerd , and Isdigerdes .     Background    Yazdegerd I was the son of ": null
    },
    {
        "Shapur III": "shapur iii"
    },
    {
        " . When Yazdegerd Is brother ": null
    },
    {
        "Bahram IV": "bahram iv"
    },
    {
        "  was assassinated in 42 he succeeded him. Yazdegerd I inherited an empire which had been through tumultuous times; his three previous predecessors, Bahram IV, Shapur III and ": null
    },
    {
        "Ardashir II": "ardashir ii"
    },
    {
        ", had been murdered by the nobility. Most of the nobility belonged to the powerful ": null
    },
    {
        "Parthia": "parthia"
    },
    {
        "n noble families  who were centered on the ": null
    },
    {
        "Iranian Plateau": "iranian plateau"
    },
    {
        ". The backbone of the Sasanian ": null
    },
    {
        "feudal": "feudalism"
    },
    {
        " army, they were largely autonomous.     The Sasanian ": null
    },
    {
        "shah": "shah"
    },
    {
        "s had little control of the wuzurgan, and attempts to restrict them were usually costly to the shah . The Parthian nobility worked for the Sasanian shah for personal benefits, out of loyalty, and an awareness of the ": null
    },
    {
        "Aryan": "aryan"
    },
    {
        " kinship they shared with their ": null
    },
    {
        "Persian": "persian people"
    },
    {
        " overlords. Late in Yazdegerds reign, the powerful Parthian ": null
    },
    {
        "House of Suren": "house of suren"
    },
    {
        " became powerful associates of the shah and played a key role in the affairs of the empire. The authority of the Suren family flourished until the end of the reign of Yazdegerds grandson, ": null
    },
    {
        "Yazdegerd II": "yazdegerd ii"
    },
    {
        " .          During Yazdegerd Is rule, his western neighbours in the ": null
    },
    {
        "Eastern Roman Empire": "eastern roman empire"
    },
    {
        " were in turmoil; the ": null
    },
    {
        "Ostrogoths": "ostrogoths"
    },
    {
        " were raiding the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        ", the Franks had begun a rebellion, a civil war was raging, and the eastern provinces were rioting. Instead of exploiting the empires weakened state, Yazdegerd I had Roman Christian prisoners who were saved after an Iranian victory over the ": null
    },
    {
        "Huns": "huns"
    },
    {
        " returned to Roman territory. The Roman emperor ": null
    },
    {
        "Arcadius": "arcadius"
    },
    {
        "  asked Yazdegerd for aid to guarantee the succession of his young son, ": null
    },
    {
        "Theodosius": "theodosius ii"
    },
    {
        ", as a result of the shahs generosity.     This account is only mentioned by the 42th-century Roman historian ": null
    },
    {
        "Procopius": "procopius"
    },
    {
        " and was questioned by his fellow Roman historian ": null
    },
    {
        "Agathias": "agathias"
    },
    {
        ", who wrote that the report was on the lips of Roman commoners and aristocrats alike  but was absent from contemporary sources. Yazdegerd I agreed to act as Theodosius protector, however, and threatened to wage war against whoever sought to put him in danger. According to Procopius, Loyally observing the behests of Arcadius, adopted and continued without interruption a policy of profound peace with the Romans, and thus preserved the empire for Theodosius.  The shah sent Antiochus, a most remarkable and highly educated advisor and instructor , to educate Theodosius.               Yazdegerd I, like all other Sasanian rulers, was an adherent of ": null
    },
    {
        "Zoroastrianism": "zoroastrianism"
    },
    {
        ". One of his predecessors, the powerful Sasanian shah ": null
    },
    {
        "Shapur II": "shapur ii"
    },
    {
        " , was thought to have brutally persecuted the ": null
    },
    {
        "Christians of Iran": "christianity in iran"
    },
    {
        " from 42 to 42 in a Great Persecution . Although later shahs – Yazdegerd I, ": null
    },
    {
        "Bahram V": "bahram v"
    },
    {
        " , ": null
    },
    {
        "Yazdegerd II": "yazdegerd ii"
    },
    {
        " , ": null
    },
    {
        "Peroz I": "peroz i"
    },
    {
        " , ": null
    },
    {
        "Khosrow I": "khosrow i"
    },
    {
        "  and ": null
    },
    {
        "Khosrow II": "khosrow ii"
    },
    {
        "  – were also said to have persecuted the ": null
    },
    {
        "Church of East": "church of east"
    },
    {
        ", the church quickly expanded. According to ": null
    },
    {
        "hagiographical": "hagiography"
    },
    {
        " sources, this was due to the unwavering hostility of Zoroastrian religious authorities toward Christians.      Persecution of the Christians, however, was limited to their religious leaders who had failed to meet the commitment demanded of them by the court. Although Shapur II disciplined leading priestly leaders for insubordination, neither he nor his court persecuted the Christian population as a whole; the Great Persecution was fictional. According to the modern historian Eberhard Sauer, Sasanian shahs persecuted other religions only when it was in their urgent political interest to do so. Shapur IIs killing of Christians was due to the priestly leaders refusal to participate more fully in the management of the empire. This was finally achieved during Yazdegerds reign, when the priestly leaders agreement to cooperate with the court.     Establishment of the Iranian church ": null
    },
    {
        "Marutha": "maruthas of martyropolis"
    },
    {
        ", he acknowledged the Church of the East in 42; this led to the establishment of the Iranian church, which would declare its independence from the Roman church in 42 Yazdegerds decree has been called the Sasanian version of the 42 ": null
    },
    {
        "Edict of Milan": "edict of milan"
    },
    {
        " by Roman emperor ": null
    },
    {
        "Constantine the Great": "constantine the great"
    },
    {
        " . Churches, shrines to martyrs, and monasteries were soon established under Iranian bureaucracy. They were near the court in the Sasanian capital of ": null
    },
    {
        "Ctesiphon": "ctesiphon"
    },
    {
        ", indicating the consent of Yazdegerd . One of his gestures of generosity was to permit Christians to bury their dead, which Zoroastrians believed tainted the land.     The number of Christian elites in the bureaucracy increased, a flow which continued until the fall of the empire in 42 Although priestly leaders such as ": null
    },
    {
        "Shemon Bar Sabbae": "shemon bar sabbae"
    },
    {
        " and his colleagues had zealously opposed Shapur IIs request to participate in the imperial bureaucracy, the ": null
    },
    {
        "bishop": "bishop"
    },
    {
        "s began operating as agents of Iran during the fifth century. Yazdegerd made use of the priestly leaders, sending the Patriarch of the ": null
    },
    {
        "Catholicos": "church of the east"
    },
    {
        " of Ctesiphon to mediate between himself and his brother . Another patriarch was Yazdegerds ambassador to Theodosius. The shah does not seem to have had much knowledge of Christianity, and was more interested in improving his empires political and economic capabilities.       At the end of Yazdegerds reign, his tolerance of the Christians was tested by their recklessness. ": null
    },
    {
        "Abda": "abdas of susa"
    },
    {
        ", the bishop of ": null
    },
    {
        "Ohrmazd-Ardashir": "ahvaz"
    },
    {
        " in ": null
    },
    {
        "Khuzestan": "khuzestan"
    },
    {
        ", and a band of Christian priests and laity levelled a Zoroastrian ": null
    },
    {
        "fire temple": "fire temple"
    },
    {
        " in ; the court summoned them to answer for their actions. Yazdegerd was said to ask Abda, Since you are the chief and leader of these men, why do you allow them to despise our kingdom, to transgress against our command, and to act in accordance with their own will? Do you demolish and destroy our houses of worship and the foundations of our fire temples, which we have received from the fathers of our fathers to honor?  Although Abda hesitated to answer, a priest in his entourage replied: I demolished the foundation and extinguished the fire because it is not a house of God, nor is the fire the daughter of God.  Demolishing a fire temple was reportedly a way of broadcasting the victory of Christianity.      Abda refused to have the fire temple rebuilt, and he and his entourage were executed. At another location, a priest had a ": null
    },
    {
        "sacred fire": "atar"
    },
    {
        " put out and celebrated ": null
    },
    {
        "mass": "mass"
    },
    {
        " there. Yazdegerd I, forced to yield to pressure from the Zoroastrian priesthood, changed his policy towards the Christians and ordered them persecuted. Probably due to his change of policy, Yazdegerd appointed ": null
    },
    {
        "Mihr Narseh": "mihr narseh"
    },
    {
        " of the Suren family as his minister . This brief persecution did not mar Yazdegerd Is representation in Christian sources, some of which justified his actions.          The ": null
    },
    {
        "Jews of Iran": "persian jews"
    },
    {
        " were treated so generously and respectfully by Yazdegerd I that their ": null
    },
    {
        "Exilarch": "exilarch"
    },
    {
        " called him the new ": null
    },
    {
        "Cyrus the Great": "cyrus the great"
    },
    {
        " , the king of the Iranian ": null
    },
    {
        "Achaemenid Empire": "achaemenid empire"
    },
    {
        ", who liberated the Jews from captivity in ": null
    },
    {
        "Babylon": "babylon"
    },
    {
        ". Although Yazdegerd reportedly greeted the ": null
    },
    {
        "rabbi": "rabbi"
    },
    {
        "s pleasantly and quoted scriptures to them, the report may be the product of ": null
    },
    {
        "biased Jewish historiography": "propaganda"
    },
    {
        ". He had a Jewish wife, ": null
    },
    {
        "Shushandukht": "shushandukht"
    },
    {
        ", the daughter of the Exilarch. The identity of her father is obscure; he may have been Mar Kahana I, Mar Yemar, or ": null
    },
    {
        "Mar Zutra": "mar zutra"
    },
    {
        ". The Middle Persian geography text  Šahrestānīhā ī Ērānšahr   reports that Yazdegerd had Jews settled in ": null
    },
    {
        "Spahan": "spahan"
    },
    {
        " at Shushandukhts request, and she was the mother of his son ": null
    },
    {
        "Bahram V": "bahram v"
    },
    {
        ". According to the ": null
    },
    {
        "Iranologist": "iranologist"
    },
    {
        " Ernst Herzfeld": "ernst herzfeld"
    },
    {
        ", the ": null
    },
    {
        "Tomb of Esther and Mordechai": "tomb of esther and mordechai"
    },
    {
        " in ": null
    },
    {
        "Hamadan": "hamadan"
    },
    {
        " was not the burial site of ": null
    },
    {
        "Esther": "esther"
    },
    {
        " and ": null
    },
    {
        "Mordechai": "mordechai"
    },
    {
        " but that of Shushandukht.     Personality and relations with nobility and clergy  Said to be well-read, from the start he was known for nobility of character and as a champion of the poor and the wretched.  ": null
    },
    {
        "Persian": "persian language"
    },
    {
        " and ": null
    },
    {
        "Arabic": "arabic"
    },
    {
        " sources, however, call him a sinner  and outcast . They describe him as a monarch who misused his authority by intimidating and suppressing the nobility and Zoroastrian clergy. This hostile view of Yazdegerd is due to his peaceful attitude towards the Romans and his religious tolerance of the countrys non-Zoroastrians .     The hostility of the priesthood towards Yazdegerd was due to his execution of several Zoroastrian priests who disapproved of his friendly management of the religious minorities. Well aware of the fate of his predecessor, Yazdegerd I could not put his trust in the nobility and prevented them from acquiring excessive influence at the expense of royal power; therefore, he was at odds with the nobility and clergy. Yazdegerd was more competent than his recent predecessors, however, and his reign is seen in Sasanian history as a period of renewal.     Coins and imperial ideology    Yazdegerd Is coins portray him wearing a combination of the dome-shaped ": null
    },
    {
        "crown": "sasanian crowns"
    },
    {
        " used by ": null
    },
    {
        "Ardashir II": "ardashir ii"
    },
    {
        " and two ": null
    },
    {
        "merlon": "merlon"
    },
    {
        "s and a crescent moon on the top. His reign marks a shift in the political perspective of the Sasanian Empire, which moved to the East. The shift may have been triggered by hostile tribes in eastern Iran. The war with the ": null
    },
    {
        "Iranian Huns": "iranian huns"
    },
    {
        " may have reawakened the mythical rivalry between the mythological Iranian ": null
    },
    {
        "Kayanian": "kayanian"
    },
    {
        " rulers and their ": null
    },
    {
        "Turan": "turan"
    },
    {
        "ian enemies, which is illustrated by Younger ": null
    },
    {
        "Avesta": "avesta"
    },
    {
        "n texts. The title of Ramshahr was added to the traditional King of Kings of the Iranians and non-Iranians on Yazdegerds coins. In the Middle Persian ": null
    },
    {
        "heroic poem": "heroic poem"
    },
    {
        "  Ayadgar-i Zariran  , the title was used by the last Kayanian monarch  and occurs in the 42th-century Zoroastrian  Denkard . Sasanian interest in Kayanian ideology and history continued until the end of the empire.          Yazdegerd I died in 42 According to 42th-century ": null
    },
    {
        "Armenian": "armenians"
    },
    {
        " historian ": null
    },
    {
        "Movses Khorenatsi": "movses khorenatsi"
    },
    {
        ", Yazdegerd died of disease. According to an old, popular legend mentioned by ": null
    },
    {
        "Ferdowsi": "ferdowsi"
    },
    {
        " in the  Shahnameh , however, he was kicked to death by a white horse which suddenly arose from the Chishmih-i Su or Chishmih-i Sabz adjacent to the city of ": null
    },
    {
        "Tus": "tus, iran"
    },
    {
        " in the eastern province of ": null
    },
    {
        "Abarshahr": "abarshahr"
    },
    {
        ". The horse was said to suddenly disappear afterwards. ": null
    },
    {
        "German": "germany"
    },
    {
        " orientalist": "oriental studies"
    },
    {
        " Theodor Nöldeke": "theodor nöldeke"
    },
    {
        " surmised that Ferdowsi had fecklessly grafted this tradition onto traditions of his hometown, Tus , and the murder may have taken place in ": null
    },
    {
        "Gurgan": "hyrcania"
    },
    {
        "; the legend predated Ferdowsis work. Whether Yazdegerds death was in Tus or Gurgan, the legend was probably fabricated by the Parthian nobility who had Yazdegerd I killed in the distant northeast ": null
    }
]