[
    {
        "   Yazdegerd II , was the sixteenth ": null
    },
    {
        "Sasanian": "sasanian empire"
    },
    {
        " king  of ": null
    },
    {
        "Iran": "iran"
    },
    {
        ". He was the successor and son of ": null
    },
    {
        "Bahram V": "bahram v"
    },
    {
        "  and reigned from 42 to 42 His reign was marked by wars against the ": null
    },
    {
        "Eastern Roman Empire": "eastern roman empire"
    },
    {
        " in the west and the ": null
    },
    {
        "Hephthalites": "hephthalites"
    },
    {
        " in the east, as well as by his efforts and attempts to strengthen royal centralisation in the bureaucracy by imposing ": null
    },
    {
        "Zoroastrianism": "zoroastrianism"
    },
    {
        " on the non-Zoroastrians within the country, namely the ": null
    },
    {
        "Christians": "christians"
    },
    {
        ". His death led to a dynastic struggle between his two sons ": null
    },
    {
        "Hormizd III": "hormizd iii"
    },
    {
        " and ": null
    },
    {
        "Peroz I": "peroz i"
    },
    {
        " for the throne, with the latter emerging victorious.     Yazdegerd II was the first Sasanian ruler to assume the title of kay, which evidently associates him and the dynasty to the mythical ": null
    },
    {
        "Kayanian dynasty": "kayanian dynasty"
    },
    {
        " commemorated in the ": null
    },
    {
        "Avesta": "avesta"
    },
    {
        ".       The name of Yazdegerd is a combination of the ": null
    },
    {
        "Old Iranian": "iranian languagesold iranian"
    },
    {
        " yazad yazata- divine being and -karta made , and thus stands for God-made , comparable to Iranian Bagkart and ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " Theoktistos. The name of Yazdegerd is known in other languages as; ": null
    },
    {
        "Pahlavi": "middle persian"
    },
    {
        " Yazdekert; ": null
    },
    {
        "New Persian": "new persian"
    },
    {
        " Yazdgerd; ": null
    },
    {
        "Syriac": "syriac language"
    },
    {
        " Yazdegerd, Izdegerd, and Yazdeger; ": null
    },
    {
        "Armenian": "armenian language"
    },
    {
        " Yazdkert; ": null
    },
    {
        "Talmudic": "talmudic"
    },
    {
        " Izdeger and Azger; ": null
    },
    {
        "Arabic": "arabic"
    },
    {
        " Yazdeijerd; Greek Isdigerdes.          In 42 shah ": null
    },
    {
        "Bahram V": "bahram v"
    },
    {
        "  died, and was succeeded by Yazdegerd II. His western neighbours, the ": null
    },
    {
        "Romans": "roman empire"
    },
    {
        ", had since their peace treaty with Iran in 42 agreed that both empires were obligated to cooperate in the defense of the ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        " against nomadic attacks. The Romans helped in the defense of the Caucasus by paying the Iranians roughly 42 lbs of gold at irregular intervals. While the Romans saw this payment as political subsidies, the Iranians saw it as tribute, which proved that Rome was the deputy of Iran. The Roman emperor ": null
    },
    {
        "Theodosius II": "theodosius ii"
    },
    {
        "s unwillingness to continue the payment made Yazdegerd II ": null
    },
    {
        "declare war": "byzantine–sasanian war of 440"
    },
    {
        " against the Romans, which had ultimately little success for either side.     The Romans were invaded in their southern provinces by the ": null
    },
    {
        "Vandals": "vandals"
    },
    {
        ", causing Theodosius II to ask for peace and send his commander, ": null
    },
    {
        "Anatolius": "anatolius"
    },
    {
        ", personally to Yazdegerd IIs camp. In the ensuing negotiations in 42 both empires promised not to build any new fortifications in ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        " and that the Sasanian Empire would get some payment in order to protect the Caucasus from incursions. Shortly after his peace treaty with the Romans, Yazdegerd II moved towards the important Sasanian province of ": null
    },
    {
        "Armenia": "sasanian armenia"
    },
    {
        " and defeated the Armenians, capturing nobles, priests, and troops; and sending them to the eastern Sasanian provinces to protect the borders from ": null
    },
    {
        "Hephthalite": "hephthalite"
    },
    {
        " attacks. In the 42s, Yazdegerd II had a mudbrick defensive system ": null
    },
    {
        "constructed": "fortifications of derbent"
    },
    {
        " at ": null
    },
    {
        "Derbent": "derbent"
    },
    {
        " to fend off incursions from the north.     In 42 Yazdegerd II moved his court to ": null
    },
    {
        "Nishapur": "nishapur"
    },
    {
        " in ": null
    },
    {
        "Khorasan": "greater khorasan"
    },
    {
        " to face the threat from the Hephthalites and left his minister  ": null
    },
    {
        "Mihr Narseh": "mihr narseh"
    },
    {
        " in charge of the Sasanian Empire. He spent many years at war against the Hephthalites. According to the  Šahrestānīhā ī Ērānšahr  , Yazdegerd II fortified the city of ": null
    },
    {
        "Damghan": "damghan"
    },
    {
        " and turned it into a strong border post against the Hephthalites. It was sometime during this period that Yazdegerd II created the province of  Eran-Khwarrah-Yazdegerd  , which was in the northern part of the ": null
    },
    {
        "Gurgan": "hyrcania"
    },
    {
        " province. After he managed to secure the eastern portion of his empire against the Hephthalite incursions, Yazdegerd II shifted his focus on Armenia and ": null
    },
    {
        "Caucasian Albania": "albania"
    },
    {
        " to defend the Caucasus with the Romans against the increasing ": null
    },
    {
        "Hun": "huns"
    },
    {
        " threat.          The policies of Yazdegerd II have been the matter of discussion; ": null
    },
    {
        "Arabic": "arabic"
    },
    {
        " and ": null
    },
    {
        "Persian": "persian language"
    },
    {
        " sources emphasize his personal ": null
    },
    {
        "piety": "piety"
    },
    {
        " and hostility towards the aristocracy, whilst ": null
    },
    {
        "Armenian": "armenian language"
    },
    {
        " and ": null
    },
    {
        "Syriac": "syriac language"
    },
    {
        " sources describe him as a religious fanatic. The latter aspect is often stressed in modern historiography. The unsteadiness of the empire was ever increasing under Yazdegerd II, who had an uneasy relationship with the aristocracy and was facing a great challenge by the Hephthalites in the east. At the beginning of Yazdegerd IIs reign, he suffered several defeats at the hands of the Hephthalites, for which he put the blame on the Christians, due to much of his cavalry consisting of ": null
    },
    {
        "Iberians": "georgians"
    },
    {
        " and ": null
    },
    {
        "Armenians": "armenians"
    },
    {
        ". Persecutions of Christians first started in 42 with the Christian nobles of ": null
    },
    {
        "Karkh": "karkh"
    },
    {
        " inn Mesopotamia. He later shifted his focus towards the Christian aristocracy of ": null
    },
    {
        "Iberia": "sasanian iberia"
    },
    {
        " and Armenia. Yazdegerd IIs persecutions of non-Zoroastrians generally seem to have been limited, with the aristocracy being the primary target. Indeed, Zoroastrian aristocrats were also targeted by Yazdegerd II, who had the advantage of entry to the court dismantled and castrated men in his field armies to generate ": null
    },
    {
        "eunuch": "eunuch"
    },
    {
        "s more dutiful to him than to their own families.     Yazdegerd II had originally continued his fathers policies of appeasing the magnates. However, after some time, he turned away from them and started a policy of his own. When the magnates told him that his new policies had offended the people, he disagreed, saying that: it is not correct for you to presume that the ways in which my father behaved towards you, maintaining you close to him, and bestowing upon you all that bounty, are incumbent upon all the kings that come after him ... each age has its own customs.  Yazdegerd II, however, was still fully aware of the longstanding conflict between the crown and the nobility and priesthood, which had culminated in the murder of several Sasanian monarchs.      Yazdegerd IIs primary goal throughout his reign was thus to combat the internal and external issues posing a danger to country by strengthening the royal centralisation of the bureaucracy, which demanded the cooperation of the aristocracy. The justification behind this is later apparent when Yazdegerd II appointed Adhur-Hormizd as the new governor  of Armenia in 42 putting an end to the persecution of non-Zoroastrians in Armenia and allowing religious freedom in the country. This would have been an unlikely decision to have been made by a religious fanatic. Indeed, according to the modern historian Scott McDonough, the Zoroastrian faith was perhaps a test of personal loyalty for Yazdegerd II. However, Yazdegerd IIs policy of integrating the Christian nobility into the bureaucracy still had problematic consequences; before the appointment of Adhur-Hormizd, Armenia had been plunged into a major rebellion. The cause of the rebellion was the attempt of ": null
    },
    {
        "Mihr Narseh": "mihr narseh"
    },
    {
        " to impose the ": null
    },
    {
        "Zurvanite": "zurvanism"
    },
    {
        " variant of Zoroastrianism in Armenia. His intentions differed from those of Yazdegerd II. As a result, many of the Armenian nobles rallied under ": null
    },
    {
        "Vardan Mamikonian": "vardan mamikonian"
    },
    {
        ", the supreme commander  of Armenia. The Armenian rebels tried to appeal to the Romans for help, but to no avail. Meanwhile, another faction of Armenians, led by the marzban ": null
    },
    {
        "Vasak Siwni": "vasak siwni"
    },
    {
        " allied themselves with the Sasanians.     On 42 June 42 the Sasanian and rebel forces ": null
    },
    {
        "clashed at Avarayr": "battle of avarayr"
    },
    {
        ", with the Sasanians emerging victorious. Nine generals, including Vardan Mamikonian, were killed, with a large number of the Armenian nobles and soldiers meeting the same fate. The Sasanians, however, had also suffered heavy losses due to the resolute struggle by the Armenian rebels. Although Yazdegerd II put an end to the persecutions in the country afterwards, tensions continued until 42 when a kinsman of Vardan Mamikonian, ": null
    },
    {
        "Vard Mamikonian": "vard mamikonian"
    },
    {
        ", was appointed marzban by Yazdegerd IIs grandson, ": null
    },
    {
        "Kavad I": "kavad i"
    },
    {
        " .     ": null
    },
    {
        "Jews": "jews"
    },
    {
        " were also the subject of persecution under Yazdegerd II; he is said to have issued decrees prohibiting them from observing the ": null
    },
    {
        "Sabbath": "shabbat"
    },
    {
        " openly, and ordered executions of several Jewish leaders. This resulted in the Jewish community of ": null
    },
    {
        "Spahan": "spahan"
    },
    {
        " publicly retaliating by flaying two Zoroastrian priests alive, leading in turn to more persecutions against the Jews.       Yazdegerd II was an astute and well-read ruler whose motto was Question, examine, see. Let us choose and hold that which is best.  He is generally praised in Persian sources, and is described as a compassionate and benevolent ruler. He is commended for abandoning his fathers overindulgence in hunting, feasting, and having long audience sessions. According to the medieval historians ": null
    },
    {
        "Ibn al-Balkhi": "ibn al-balkhi"
    },
    {
        " and ": null
    },
    {
        "Hamza al-Isfahani": "hamza al-isfahani"
    },
    {
        ", he was known as Yazdegerd the Gentle . However, the favorable account of Yazdegerd II is due to his policy of persecuting non-Zoroastrians within the empire, which appeased the Iranian aristocracy and especially the Zoroastrian priesthood, which sought to use the Sasanian Empire to impose their authority over the religious and cultural life of its people. This is the opposite of the policy of his grandfather and namesake, ": null
    },
    {
        "Yazdegerd I": "yazdegerd i"
    },
    {
        " , who is the subject of hostility in Persian sources due to his tolerant policy towards his non-Zoroastrian subjects, and his refusal to comply with the demands of the aristocracy and priesthood.          The reign of Yazdegerd II marks the start of a new inscription on the ": null
    },
    {
        "Sasanian coins": "sasanian coinage"
    },
    {
        "; mzdysn bgy kdy , which displays his fondness of the legendary ": null
    },
    {
        "Avesta": "avesta"
    },
    {
        "n dynasty, the ": null
    },
    {
        "Kayanians": "kayanian dynasty"
    },
    {
        ". This is due to a shift in the political perspective of the Sasanian Empire−originally disposed towards the West, was now changed to the East. This shift, which had already started under Yazdegerd I and Bahram V, reached its zenith under Yazdegerd II. It may have been triggered due to the advent of hostile tribes on the eastern front of Iran. The war against the Hephthalites may have awakened the mythical rivalry existing between the Iranian Kayanian rulers and their ": null
    },
    {
        "Turan": "turan"
    },
    {
        "ian enemies, which is demonstrated in the ": null
    },
    {
        "Younger Avesta": "younger avesta"
    },
    {
        ". It may have thus been as a result of the conflict between Iran and its eastern enemies, that resulted in the adoption of the title of kay, used by the very same Iranian mythical kings in their war against the Turanians in the East.      Likewise, it was most likely during this period that legendary and epic texts were collected by the Sasanians, including the legend of the Iranian hero-king ": null
    },
    {
        "Fereydun": "fereydun"
    },
    {
        " , who split up his kingdom among his three sons; his eldest son ": null
    },
    {
        "Salm": "salm"
    },
    {
        " receiving the empire of the West, Rome; the second eldest ": null
    },
    {
        "Tur": "tur"
    },
    {
        " receiving the empire of the East, Turan; and the youngest ": null
    },
    {
        "Iraj": "iraj"
    },
    {
        " receiving the heartland of the empire, Iran. Accordingly, influenced by the texts about the Kayanians, Yazdegerd II may believed to be the heir of the Fereydun and Iraj, thus possibly deeming not only Roman domains in West as belonging to Iran, but also the eastern domains of the Hephthalites. Thus the Sasanians may have sought to symbolically assert their rights over those lands by assuming the Kayanian title of kay.     A new design also appeared on the reverse of the Sasanian coins, where the traditional ": null
    },
    {
        "fire altar": "fire altar"
    },
    {
        " flanked by two attendants, now imitates them in a more venerated manner. This presumably further demonstrates Yazdegerd IIs fealty to Zoroastrianism. The provinces of ": null
    },
    {
        "Asoristan": "asoristan"
    },
    {
        " and ": null
    },
    {
        "Khuzestan": "khuzestan"
    },
    {
        " provided the most mints for Yazdegerd II in the west, whilst the provinces of ": null
    },
    {
        "Gurgan": "hyrcania"
    },
    {
        " and ": null
    },
    {
        "Marw": "margiana"
    },
    {
        " provided the most in the east, undoubtly to support the Sasanians in their wars on the two fronts.       Yazdegerd II died in 42; his eldest son ": null
    },
    {
        "Hormizd III": "hormizd iii"
    },
    {
        " ascended the throne at ": null
    },
    {
        "Ray": "ray, iran"
    },
    {
        ". His younger son ": null
    },
    {
        "Peroz I": "peroz i"
    },
    {
        ", with the support of the powerful ": null
    },
    {
        "Mihranid": "house of mihran"
    },
    {
        " magnate ": null
    },
    {
        "Raham Mihran": "raham mihran"
    },
    {
        ", fled to the northeastern part of the empire and began raising an army in order to claim the throne for himself. The empire thus fell into a dynastic struggle and became divided. The mother of the two brothers, ": null
    },
    {
        "Denag": "denag"
    },
    {
        ", temporarily ruled as regent of the empire from its capital, ": null
    },
    {
        "Ctesiphon": "ctesiphon"
    },
    {
        ". ": null
    },
    {
        "Denag": "denag"
    },
    {
        ", an Iranian princess, possibly from the royal Sasanian family.       ": null
    },
    {
        "Hormizd III": "hormizd iii"
    },
    {
        ", seventeenth shah of the Sasanian Empire .   ": null
    },
    {
        "Peroz I": "peroz i"
    },
    {
        ", eighteenth shah of the Sasanian Empire .   ": null
    },
    {
        "Zarir": "zarir"
    },
    {
        ", Sasanian prince, who tried to claim the throne by rebelling in 42   ": null
    },
    {
        "Balash": "balash"
    },
    {
        ", nineteenth shah of the Sasanian Empire .       ": null
    }
]