[
    {
        "      Yazdegerd III , was the last ": null
    },
    {
        "Sasanian": "sasanian empire"
    },
    {
        " King of Kings": "king of kings"
    },
    {
        " of ": null
    },
    {
        "Iran": "iran"
    },
    {
        " from 42 to 42 His father was ": null
    },
    {
        "Shahriyar": "shahriyar"
    },
    {
        " and his grandfather was ": null
    },
    {
        "Khosrow II": "khosrow ii"
    },
    {
        ".     Ascending the throne at the age of merely eight, the young shah lacked authority and reigned as ": null
    },
    {
        "figurehead": "figurehead"
    },
    {
        ", whilst real power was in the hands of the army commanders, courtiers, and powerful members of the aristocracy, who were fighting amongst themselves and wiping out each other. The Sasanian Empire was falling apart swiftly due to internal conflicts, and was at the same time also invaded on all fronts−by the ": null
    },
    {
        "Turks": "turkic khaganate"
    },
    {
        " in the east, and ": null
    },
    {
        "Khazars": "khazars"
    },
    {
        " in the west. It was, however, the Arabs, united under the banner of Islam, who dealt the deadly blow to the empire. Yazdegerd was unable to contain the ": null
    },
    {
        "Arab invasion of Iran": "muslim conquest of persia"
    },
    {
        ", and spent most of reign fleeing from one province to another, in hopes of raising an army to repel the Arabs, which ultimately proved unsuccessful, with Yazdegerd meeting his end at hands of a miller near ": null
    },
    {
        "Marw": "merv"
    },
    {
        " in 42 thus marking an end to the last pre-Islamic Iranian empire after more than 42 years of rule.       The name of Yazdegerd is a combination of the ": null
    },
    {
        "Old Iranian": "iranian languagesold iranian"
    },
    {
        " yazad yazata- divine being and -karta made , and thus stands for God-made , comparable to Iranian Bagkart and ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " Theoktistos. The name of Yazdegerd is known in other languages as; ": null
    },
    {
        "Pahlavi": "middle persian"
    },
    {
        " Yazdekert; ": null
    },
    {
        "New Persian": "new persian"
    },
    {
        " Yazdgerd; ": null
    },
    {
        "Syriac": "syriac language"
    },
    {
        " Yazdegerd, Izdegerd, and Yazdeger; ": null
    },
    {
        "Armenian": "armenian language"
    },
    {
        " Yazdkert; ": null
    },
    {
        "Talmudic": "talmudic"
    },
    {
        " Izdeger and Azger; ": null
    },
    {
        "Arabic": "arabic"
    },
    {
        " Yazdeijerd; Greek Isdigerdes.       Yazdegerd was the son of prince ": null
    },
    {
        "Shahriyar": "shahriyar"
    },
    {
        " and the grandson of the last prominent shah of Iran, ": null
    },
    {
        "Khosrow II": "khosrow ii"
    },
    {
        " , who was in 42 overthrown and executed by his own son ": null
    },
    {
        "Kavad II": "kavad ii"
    },
    {
        ", who proceeded to have all his brothers and half-brothers executed, including Shahriyar. This dealt a heavy blow to the empire, which it would never recover from. Furthermore, the fall of Khosrow II also culminated in a ": null
    },
    {
        "civil war lasting four years": "sasanian civil war of 628–632"
    },
    {
        ", with the most powerful members of the nobility gaining full autonomy and starting to create their own government. The hostilities between the Persian  and ": null
    },
    {
        "Parthia": "parthia"
    },
    {
        "n  noble-families were also resumed, which split up the wealth of the nation. A few months later, a ": null
    },
    {
        "devastating plague": "plague of sheroe"
    },
    {
        " swept through the western Sasanian provinces, killing half of its population including Kavad II.     He was succeeded by his eight-year-old son ": null
    },
    {
        "Ardashir III": "ardashir iii"
    },
    {
        ", who was killed two years later by the distinguished Sasanian general ": null
    },
    {
        "Shahrbaraz": "shahrbaraz"
    },
    {
        ", who was in turn murdered forty days later in a coup by the Pahlav leader ": null
    },
    {
        "Farrukh Hormizd": "farrukh hormizd"
    },
    {
        ", who installed the daughter of Khosrow II, ": null
    },
    {
        "Boran": "boran"
    },
    {
        ", on the throne. She was deposed a year later, and a succession of rulers followed one another, until Boran was sovereign once more in 42 only to be killed the following year, seemingly by the Parsig leader ": null
    },
    {
        "Piruz Khosrow": "piruz khosrow"
    },
    {
        ". The most powerful magnates in the empire, ": null
    },
    {
        "Rostam Farrokhzad": "rostam farrokhzad"
    },
    {
        " and Piruz Khosrow, now threatened by their own men, eventually agreed to work together, and installed Yazdegerd III on the throne, thus putting an end to the civil war. He was crowned in the ": null
    },
    {
        "Anahid fire-temple": "anahid fire-temple"
    },
    {
        " in ": null
    },
    {
        "Istakhr": "istakhr"
    },
    {
        ", where he had been hiding during the civil war. The temple was the very place where the first Sasanian shah ": null
    },
    {
        "Ardashir I": "ardashir i"
    },
    {
        "  had coronated himself, indicating that the reason behind Yazdegerds coronation at the same place was due to hopes for a rejuvenation of the empire. He was almost the last living member of the ": null
    },
    {
        "House of Sasan": "house of sasan"
    },
    {
        ". Most scholars agree that Yazdegerd was eight years old at his coronation.            Yazdegerd, however, did not have the authority required to bring stability to his extensive empire, which was swiftly falling apart due to ceaseless internal conflicts between the army commanders, courtiers, and powerful members of the aristocracy, who were fighting amongst themselves and wiping out each other. Many of the governors of the empire had proclaimed independence and carved out their own kingdom. The governors of the provinces of ": null
    },
    {
        "Mazun": "mazun"
    },
    {
        " and ": null
    },
    {
        "Yemen": "sasanian yemen"
    },
    {
        " had already asserted their independence during the civil war of 42–42 thus resulting in the disintregation of Sasanian rule in the ": null
    },
    {
        "Arabian peninsula": "arabian peninsula"
    },
    {
        ", which was uniting under the banner of ": null
    },
    {
        "Islam": "islam"
    },
    {
        ".     The empire was starting to look more like the Parthian feudal system before the fall of the ": null
    },
    {
        "Arsacid Empire": "parthian empire"
    },
    {
        ". Yazdegerd, although being acknowledged as the rightful monarch by both the Parsig and Pahlav factions, does not seem to have held sway over all of his empire. Indeed, during the first years of his rule coins were only minted in ": null
    },
    {
        "Pars": "pars"
    },
    {
        ", ": null
    },
    {
        "Sakastan": "sakastan"
    },
    {
        ", and ": null
    },
    {
        "Khuzestan": "khuzestan province"
    },
    {
        ", approximately corresponding to the regions of the southwest  and southeast , where the Parsig was based. The Pahlav, who were mainly based in the northern portion of the empire, refused to mint coins of him. Even in the south Yazdegerds rule was not seemingly secure; a Sasanian claimant to the throne, ": null
    },
    {
        "Khosrow IV": "khosrow iv"
    },
    {
        ", minted coins at ": null
    },
    {
        "Susa": "susa"
    },
    {
        " in Khuzestan around this time, which he would do till 42     The empire was also at the same time invaded on all fronts; by the ": null
    },
    {
        "Turks": "turkic khaganate"
    },
    {
        " in the east, and by ": null
    },
    {
        "Khazars": "khazars"
    },
    {
        " in the west, who raided ": null
    },
    {
        "Armenia": "sasanian armenia"
    },
    {
        " and ": null
    },
    {
        "Adurbadagan": "adurbadagan"
    },
    {
        ". The Sasanian army had been heavily weakened due to the ": null
    },
    {
        "war with the Byzantines": "byzantine–sasanian war of 602–628"
    },
    {
        " and internal conflict. The circumstances were so chaotic, and the condition of the nation so alarming, that the Persians openly spoke of the immanent downfall of their empire, and saw its portents in natural calamities.           Yazdegerd later negotiated with fourteen Arab negotiators, and asked them about the reasons for their aggressive behavior towards his Empire. One of the fourteen Arabs shortly replied, ": null
    },
    {
        "Allah": "allah"
    },
    {
        " commanded us, by the mouth of His Prophet, to extend the dominion of Islam over all nations.  In May, the Muslims defeated a Sasanian force under the ": null
    },
    {
        "Azadbeh": "azadbeh"
    },
    {
        " near the important strategic Sasanian city of ": null
    },
    {
        "Hira": "al-hira"
    },
    {
        ", which was shortly afterwards occupied. After the fall of Hira, Yazdegerd began to pay greater attention to the Muslims; ": null
    },
    {
        "Rostam Farrokhzad": "rostam farrokhzad"
    },
    {
        " sent an army under the Persian military officer ": null
    },
    {
        "Bahman Jadhuyih": "bahman jadhuyih"
    },
    {
        " and the ": null
    },
    {
        "Armenian": "armenians"
    },
    {
        " military officer ": null
    },
    {
        "Jalinus": "jalinus"
    },
    {
        " against the Muslims. Rostam is known to have told Bahman secretly that: if Jalinus returns to the like of his defeat, then cut off his head.  The Sasanian army managed to defeat the Muslims at the ": null
    },
    {
        "Battle of the Bridge": "battle of the bridge"
    },
    {
        ".     In 42 Yazdegerd III ordered ": null
    },
    {
        "Rostam Farrokhzad": "rostam farrokhzad"
    },
    {
        " to subdue the invading Arabs and then told him: Today you are the man among the Iranians. You see that the people of Iran have not faced a situation like this since the family of ": null
    },
    {
        "Ardashir I": "ardashir i"
    },
    {
        " assumed power.  Envoys then came to Yazdegerd III asking him to consider the dismissal of Rostam in order to replace him with someone around whom the people would rally.     Yazdegerd III asked Rostam for an assessment of the Arab forces since they had camped at Qadisiyyah. ": null
    },
    {
        "Rostam Farrokhzad": "rostam farrokhzad"
    },
    {
        " stated that the Arabs were a pack of wolves, falling upon unsuspecting shepherds and annihilating them.  Yazdegerd III responds to Rostam by saying,           However, the Sasanian army suffered a crushing defeat at the ": null
    },
    {
        "battle of al-Qadisiyyah": "battle of al-qadisiyyah"
    },
    {
        ", with Rostam, Bahman, Jalinus and two Armenian princes named Grigor II Novirak and ": null
    },
    {
        "Mushegh III Mamikonian": "mushegh iii mamikonian"
    },
    {
        " being killed during the battle. The Arabs then marched towards the Sasanian capital of ": null
    },
    {
        "Ctesiphon": "ctesiphon"
    },
    {
        " without meeting any resistance. Yazdegerd took his treasury, and along with 42 of his servants fled to ": null
    },
    {
        "Hulwan": "hulwan"
    },
    {
        " in ": null
    },
    {
        "Media": "media"
    },
    {
        ", leaving Rostam Farrokhzads brother ": null
    },
    {
        "Farrukhzad": "farrukhzad"
    },
    {
        " in charge of Ctesiphon. Farrukhzad, however, did not attempt any resistance and also went to Hulwan. The Arabs subsequently reached Ctesiphon, ": null
    },
    {
        "besieged": "siege of ctesiphon"
    },
    {
        " the western parts of the city, and soon occupied all of it.  The Iranian defeat at battle of al-Qadisiyyah has often been described as a turning point in the Arab invasion of Iran. However, in reality, it was far from it. The battle served as a wake-up call for the Iranian armies, who became conscious that persistent factionalism could result in their inevitable destruction. Al-Tabari emphasizes this, stating that after the fall of Ctesiphon the people... were about to go their separate ways, they started to incite one another: If you disperse now, you will never get together again; this is a spot that sends us in different directions.      In April 42 the Arabs defeated another Sasanian army at the ": null
    },
    {
        "Battle of Jalula": "battle of jalula"
    },
    {
        ". After this defeat, Yazdegerd fled deeper into Media. He subsequently raised a new army and send it to ": null
    },
    {
        "Nahavand": "nahavand"
    },
    {
        " to retake ": null
    },
    {
        "Ctesiphon": "ctesiphon"
    },
    {
        " and prevent any further Muslim advances. The army that Yazdegerd sent seemed such a serious threat that it led ": null
    },
    {
        "Umar": "umar"
    },
    {
        " to combine the Arab forces of ": null
    },
    {
        "Kufa": "kufa"
    },
    {
        " and ": null
    },
    {
        "Basra": "basra"
    },
    {
        " under ": null
    },
    {
        "Al-Numan ibn Muqrin": "al-numan ibn muqrin"
    },
    {
        " and send them against the Sasanians with reinforcements from ": null
    },
    {
        "Syria": "syria"
    },
    {
        " and ": null
    },
    {
        "Oman": "oman"
    },
    {
        ". The battle is said to have lasted several days. It resulted in major losses on both sides, including the death of ": null
    },
    {
        "al-Numan ibn Muqrin": "al-numan ibn muqrin"
    },
    {
        " and the Iranian generals ": null
    },
    {
        "Mardanshah": "mardanshah"
    },
    {
        " and ": null
    },
    {
        "Piruz Khosrow": "piruz khosrow"
    },
    {
        ". The ": null
    },
    {
        "battle of Nahavand": "battle of nahavand"
    },
    {
        " in 42 was the second military disaster for the Sasanians after the battle of al-Qadisiyyah.       After the Sasanian disaster, Yazdegerd fled to ": null
    },
    {
        "Isfahan": "isfahan"
    },
    {
        ", and raised a small army under a certain military officer named Siyah, who had lost his property to the Arabs. However, Siyah and the rest of the army mutinied against Yazdegerd, and agreed to help the Arabs in return for places to live. Meanwhile, Yazdegerd had arrived in ": null
    },
    {
        "Estakhr": "estakhr"
    },
    {
        ", where he tried organizing a base for resistance in the province of ": null
    },
    {
        "Pars": "pars province"
    },
    {
        ". However, in 42 ": null
    },
    {
        "Abdullah ibn Aamir": "abdullah ibn aamir"
    },
    {
        ", the governor of ": null
    },
    {
        "Basra": "basra"
    },
    {
        ", invaded Pars and put an end to the Persian resistance. Estakhr was made into ruins after the battle and a force of 42 defenders including many Persian nobles were killed. After the Arab conquest of Pars, Yazdegerd fled to ": null
    },
    {
        "Kirman": "kirman"
    },
    {
        " while being pursued by an Arab force. Yazdegerd managed to flee from the Arab force in a snowstorm at Bimand.     After arriving at Kirman, Yazdegerd became unfriendly with the  marzban   of Kirman, and then left Kirman for ": null
    },
    {
        "Sakastan": "sakastan"
    },
    {
        ". Another Basran army later arrived which defeated and killed the marzban of Kirman in a bloody fight. When Yazdegerd arrived at Sakastan he lost the support of the governor of Sakastan by demanding tax from him. Yazdegerd then headed for ": null
    },
    {
        "Merv": "merv"
    },
    {
        " to join the leader of the ": null
    },
    {
        "Turks": "turkic people"
    },
    {
        ". However, when he arrived in ": null
    },
    {
        "Khorasan": "greater khorasan"
    },
    {
        " the inhabitants did not agree with Yazdegerds decision to continue waging war and told him that it was better if he made peace with the Arabs; Yazdegerd, however, refused. Sakastan was later taken by the Arab forces after a bloody fight around 42–42 Yazdegerd was also supported by the ": null
    },
    {
        "Principality of Chaghaniyan": "principality of chaghaniyan"
    },
    {
        ", which sent him troops to aid him against the Arabs. When Yazdegerd arrived in ": null
    },
    {
        "Marw": "merv"
    },
    {
        "  he demanded tax from the marzban of Marw, losing also his support and making him ally with Nezak Tarkan, the Hephthalite ruler of ": null
    },
    {
        "Badghis": "badghis province"
    },
    {
        ", who helped him defeat Yazdegerd and his followers.       After his defeat, Yazdegerd sought refuge at a miller near Marw, who, however, murdered him in 42 According to Kia, the miller had reportedly killed Yazdegerd in order to obtain his jewelry, whilst ": null
    },
    {
        "the Cambridge History of Iran": "the cambridge history of iran"
    },
    {
        " states that the miller was sent by ": null
    },
    {
        "Mahoe Suri": "mahoe suri"
    },
    {
        ". Regardless, the death of Yazdegerd marked the end of the Sasanian Empire, and made it less difficult for the Arabs to conquer the rest of Iran. All of Khorasan was soon conquered by the Arabs, who would use it as a base to ": null
    },
    {
        "attack Transoxiana": "muslim conquest of transoxiana"
    },
    {
        ". The death of Yazdegerd thus marked the end of the last pre-Islamic Iranian empire after more than 42 years of rule. An empire–which had a generation earlier briefly conquered ": null
    },
    {
        "Egypt": "sasanian conquest of egypt"
    },
    {
        " and ": null
    },
    {
        "Asia Minor": "shahins invasion of asia minor"
    },
    {
        ", even ": null
    },
    {
        "reaching as a far as Constantinople": "siege of constantinople"
    },
    {
        ", fell to a force of lightly equipped Arabs that were used to skirmishes and desert warfare. The heavy Sasanian cavalry was too sluggish and systematized to contain them; employed light-armed Arab or East Iranian mercenaries from Khorasan and Transoxiana would have been much more successful.     Yazdegerd was according to tradition buried by Christian monks in a tall tomb that was situated in a garden decorated with silk and musk. The monks cursed Mahoe and made a hymn to Yazdegerd, mourning the fall of a combative king and the house of ": null
    },
    {
        "Ardashir I": "ardashir i"
    },
    {
        ".  Whether this event was factual or not, it emphasizes that the Christians of the empire remained loyal to the Zoroastrian Sasanians, even possibly more than the Iranian nobles who had deserted Yazdegerd. Indeed, there were close links between the late Sasanian rulers and Christians, whose conditions had greatly improved compared to that of the early Sasanian era. Yazdegerds wife was according to folklore a Christian, whilst his son and heir, ": null
    },
    {
        "Peroz III": "peroz iii"
    },
    {
        " was seemingly an adherent of Christianity, and even had a church built in ": null
    },
    {
        "Tang China": "tang dynasty"
    },
    {
        ", where he had taken refuge. Yazdegerd became remembered in history as a martyred prince; many rulers and officers would later claim being an descendant of him in Islamic Iran.            The ": null
    },
    {
        "Zoroastrian religious calendar": "zoroastrian calendar"
    },
    {
        ", which is still in use today, uses the ": null
    },
    {
        "regnal year": "regnal year"
    },
    {
        " of Yazdegerd III as its base year,  and its ": null
    },
    {
        "calendar era": "calendar era"
    },
    {
        " is accompanied by a Y.Z. suffix. Magians took Yazdegerd IIIs death as the end of the millennium of ": null
    },
    {
        "Zoroaster": "zoroaster"
    },
    {
        " and the beginning of the millennium of ": null
    },
    {
        "Oshedar": "oshedar"
    },
    {
        ".": null
    }
]