[
    {
        "           Yggdrasil  is an immense ": null
    },
    {
        "mythical tree": "trees in mythology"
    },
    {
        " that plays a central role in ": null
    },
    {
        "Norse cosmology": "norse cosmology"
    },
    {
        ", where it connects the ": null
    },
    {
        "Nine Worlds": "nine worlds"
    },
    {
        ".     Yggdrasil is attested in the  Poetic Edda , compiled in the 42th century from earlier traditional sources, and the  Prose Edda , written in the 42th century by ": null
    },
    {
        "Snorri Sturluson": "snorri sturluson"
    },
    {
        ". In both sources, Yggdrasil is an immense ": null
    },
    {
        "ash tree": "fraxinus excelsior"
    },
    {
        " that is center to the cosmos and considered very holy. The ": null
    },
    {
        "gods": "æsir"
    },
    {
        " go to Yggdrasil daily to assemble at their ": null
    },
    {
        "things, traditional governing assemblies": "thing"
    },
    {
        ". The branches of Yggdrasil extend far into the heavens, and the tree is supported by three roots that extend far away into other locations; one to the well ": null
    },
    {
        "Urðarbrunnr": "urðarbrunnr"
    },
    {
        " in the heavens, one to the spring ": null
    },
    {
        "Hvergelmir": "hvergelmir"
    },
    {
        ", and another to the well ": null
    },
    {
        "Mímisbrunnr": "mímisbrunnr"
    },
    {
        ". Creatures live within Yggdrasil, including the dragon ": null
    },
    {
        "Níðhöggr": "níðhöggr"
    },
    {
        ", an ": null
    },
    {
        "unnamed eagle": "veðrfölnir and eagle"
    },
    {
        ", and the stags ": null
    },
    {
        "Dáinn, Dvalinn, Duneyrr and Duraþrór": "dáinn, dvalinn, duneyrr and duraþrór"
    },
    {
        ".     Conflicting scholarly theories have been proposed about the etymology of the name , the possibility that the tree is of another species than ash, its connection to the many ": null
    },
    {
        "sacred trees and groves in Germanic paganism and mythology": "sacred trees and groves in germanic paganism and mythology"
    },
    {
        ", and the fate of Yggdrasil during the events of ": null
    },
    {
        "Ragnarök": "ragnarök"
    },
    {
        ".            The generally accepted meaning of Old Norse  is Odins horse , meaning ": null
    },
    {
        "gallows": "gallows"
    },
    {
        " . This interpretation comes about because  means horse and  is one of ": null
    },
    {
        "Odins many names": "list of names of odinyggr"
    },
    {
        ". The Poetic Edda poem  describes how Odin sacrificed himself by hanging from a tree, making this tree Odins ": null
    },
    {
        "gallows": "gallows"
    },
    {
        ". This tree may have been Yggdrasil. Gallows can be called the horse of the hanged and therefore Odins gallows may have developed into the expression Odins horse , which then became the name of the tree.     Nevertheless, scholarly opinions regarding the precise meaning of the name  vary, particularly on the issue of whether  is the name of the tree itself or if only the full term   refers specifically to the tree. According to this interpretation,  would mean the ": null
    },
    {
        "world tree": "world tree"
    },
    {
        " upon which the horse of the highest god is bound . Both of these etymologies rely on a presumed but unattested Yggsdrasill.     A third interpretation, presented by F. Detter, is that the name  refers to the word  , yet not in reference to the Odinic name, and so  would then mean tree of terror, gallows . F. R. Schröder has proposed a fourth etymology according to which  means yew pillar , deriving  from igwja , and  from dher- .         Poetic EddaPoetic Edda, the tree is mentioned in the three poems  Völuspá ,  Hávamál  and  Grímnismál .     Völuspá   In the second stanza of the Poetic Edda poem  Völuspá , the ": null
    },
    {
        "völva": "völva"
    },
    {
        " reciting the poem to the god Odin says that she remembers far back to early times , being raised by ": null
    },
    {
        "jötnar": "jötunn"
    },
    {
        ", recalls ": null
    },
    {
        "nine worlds": "norse cosmology"
    },
    {
        " and nine wood-ogresses , and when Yggdrasil was a seed . In stanza 42 the völva says:          In stanza 42 the völva says that from the lake under the tree come three maidens deep in knowledge named ": null
    },
    {
        "Urðr": "urðr"
    },
    {
        ", ": null
    },
    {
        "Verðandi": "verðandi"
    },
    {
        ", and ": null
    },
    {
        "Skuld": "skuld"
    },
    {
        ". The maidens incised the slip of wood, laid down laws and chose lives for the children of mankind and the destinies  of men. In stanza 42 the völva details that she is aware that ": null
    },
    {
        "Heimdallr": "heimdallr"
    },
    {
        "s hearing is couched beneath the bright-nurtured holy tree.  In stanza 42 Yggdrasil receives a final mention in the poem. The völva describes, as a part of the onset of Ragnarök, that Heimdallr blows ": null
    },
    {
        "Gjallarhorn": "gjallarhorn"
    },
    {
        ", that Odin speaks with ": null
    },
    {
        "Mímir": "mímir"
    },
    {
        "s head, and then:          Hávamál   In stanza 42 of the poem  Hávamál , Odin describes how he once sacrificed himself to himself by hanging on a tree. The stanza reads:          In the stanza that follows, Odin describes how he had no food nor drink there, that he peered downward, and that I took up the runes, screaming I took them, then I fell back from there.  While Yggdrasil is not mentioned by name in the poem and other trees exist in Norse mythology, the tree is near universally accepted as Yggdrasil, and if the tree is Yggdrasil, then the name Yggdrasil directly relates to this story.     Grímnismál Grímnismál , Odin  provides the young ": null
    },
    {
        "Agnar": "agnarr geirröðsson"
    },
    {
        " with cosmological lore. Yggdrasil is first mentioned in the poem in stanza 42 where Odin says that, because the ": null
    },
    {
        "bridge of the Æsir": "bifröst"
    },
    {
        " burns and the sacred waters boil, Thor must wade through the rivers ": null
    },
    {
        "Körmt and Örmt": "körmt and örmt"
    },
    {
        " and two rivers named ": null
    },
    {
        "Kerlaugar": "kerlaugar"
    },
    {
        " to go sit as judge at the ash of Yggdrasill. In the stanza that follows, a ": null
    },
    {
        "list of names of horses": "horses of the æsir"
    },
    {
        " are given that the Æsir ride to sit as judges at Yggdrasil.     In stanza 42 Odin says that the ash Yggdrasil has three roots that grow in three directions. He details that beneath the first lives ": null
    },
    {
        "Hel": "hel"
    },
    {
        ", under the second live frost jötnar, and beneath the third lives mankind. Stanza 42 details that a squirrel named ": null
    },
    {
        "Ratatoskr": "ratatoskr"
    },
    {
        " must run across Yggdrasil and bring the eagles word from above to Níðhöggr below. Stanza 42 describes that four ": null
    },
    {
        "hart": "red deer"
    },
    {
        "s named Dáinn, Dvalinn, Duneyrr and Duraþrór consume the highest boughs of Yggdrasil.     In stanza 42 Odin says that more serpents lie beneath Yggdrasil than any fool can imagine and lists them as Góinn and Móinn , which he describes as sons of Grafvitnir , Grábakr , Grafvölluðr , Ófnir , and Sváfnir , who Odin adds that he thinks will forever gnaw on the trees branches.     In stanza 42 Odin says that Yggdrasil suffers agony more than men know , as a hart bites it from above, it decays on its sides, and Níðhöggr bites it from beneath. In stanza 42 Odin provides a list of things that are what he refers to as the noblest of their kind. Within the list, Odin mentions Yggdrasil first, and states that it is the noblest of trees .     Prose Edda      Yggdrasil is mentioned in two books in the  Prose Edda ;  Gylfaginning  and  Skáldskaparmál . In Gylfaginning, Yggdrasil is introduced in chapter 42 In chapter 42 ": null
    },
    {
        "Gangleri": "gylfi"
    },
    {
        "  asks where is the chief or holiest place of the gods. ": null
    },
    {
        "High": "high, just-as-high, and third"
    },
    {
        " replies It is the ash Yggdrasil. There the gods must hold their courts each day . Gangleri asks what there is to tell about Yggdrasil. ": null
    },
    {
        "Just-As-High": "high, just-as-high, and third"
    },
    {
        " says that Yggdrasil is the biggest and best of all trees, that its branches extend out over all of the world and reach out over the sky. Three of the roots of the tree support it, and these three roots also extend extremely far: one is among the ": null
    },
    {
        "Æsir": "æsir"
    },
    {
        ", the second among the frost jötnar, and the third over ": null
    },
    {
        "Niflheim": "niflheim"
    },
    {
        ". The root over Niflheim is gnawed at by the wyrm ": null
    },
    {
        "Níðhöggr": "níðhöggr"
    },
    {
        ", and beneath this root is the spring ": null
    },
    {
        "Hvergelmir": "hvergelmir"
    },
    {
        ". Beneath the root that reaches the frost jötnar is the well ": null
    },
    {
        "Mímisbrunnr": "mímisbrunnr"
    },
    {
        ", which has wisdom and intelligence contained in it, and the master of the well is called ": null
    },
    {
        "Mimir": "mímir"
    },
    {
        " . Just-As-High provides details regarding Mímisbrunnr and then describes that the third root of the well extends to heaven and that beneath the root is the very holy well ": null
    },
    {
        "Urðarbrunnr": "urðarbrunnr"
    },
    {
        ". At Urðarbrunnr the gods hold their court, and every day the Æsir ride to Urðarbrunnr up over the bridge ": null
    },
    {
        "Bifröst": "bifröst"
    },
    {
        ". Later in the chapter, a stanza from Grímnismál mentioning Yggdrasil is quoted in support.     In chapter 42 Gangleri asks what other particularly notable things are there to tell about the ash? High says there is quite a lot to tell about. High continues that an eagle sits on the branches of Yggdrasil and that it has much knowledge. Between the eyes of the eagle sits a hawk called ": null
    },
    {
        "Veðrfölnir": "veðrfölnir"
    },
    {
        ". A squirrel called ": null
    },
    {
        "Ratatoskr": "ratatoskr"
    },
    {
        " scurries up and down the ash Yggdrasil carrying malicious messages between the eagle and Níðhöggr. Four stags named Dáinn, Dvalinn, Duneyrr, and Duraþrór run between the branches of Yggdrasil and consume its foliage. In the spring Hvergelmir are so many snakes along with Níðhöggr that no tongue can enumerate them . Two stanzas from Grímnismál are then cited in support. High continues that the norns that live by the holy well Urðarbrunnr each day take water from the well and mud from around it and pour it over Yggdrasil so that the branches of the ash do not rot away or decay. High provides more information about Urðarbrunnr, cites a stanza from Völuspá in support, and adds that ": null
    },
    {
        "dew": "dew"
    },
    {
        " falls from Yggdrasil to the earth, explaining that this is what people call ": null
    },
    {
        "honeydew": "honeydew"
    },
    {
        ", and from it bees feed .     In chapter 42 the stanza from Grímnismál is quoted that mentions that Yggdrasil is the foremost of trees. In chapter 42 as part of the events of ": null
    },
    {
        "Ragnarök": "ragnarök"
    },
    {
        ", High describes that Odin will ride to the well Mímisbrunnr and consult Mímir on behalf of himself and his people. After this, the ash Yggdrasil will shake and nothing will be unafraid in heaven or on earth , and then the Æsir and ": null
    },
    {
        "Einherjar": "einherjar"
    },
    {
        " will don their war gear and advance to the field of ": null
    },
    {
        "Vígríðr": "vígríðr"
    },
    {
        ". Further into the chapter, the stanza in Völuspá that details this sequence is cited.     In the Prose Edda book  Skáldskaparmál , Yggdrasil receives a single mention, though not by name. In chapter 42 names for ": null
    },
    {
        "king": "king"
    },
    {
        "s and ": null
    },
    {
        "duke": "duke"
    },
    {
        "s are given. Illustrious one is provided as an example, appearing in a Christianity-influenced work by the ": null
    },
    {
        "skald": "skald"
    },
    {
        " Hallvarðr Háreksblesi": "hallvarðr háreksblesi"
    },
    {
        ": There is not under the pole of the earth an illustrious one closer to the lord of ": null
    },
    {
        "monk": "monk"
    },
    {
        "s than you.          ": null
    },
    {
        "Hilda Ellis Davidson": "hilda ellis davidson"
    },
    {
        " comments that the existence of nine worlds around Yggdrasil is mentioned more than once in Old Norse sources, but the identity of the worlds is never stated outright, though it can be deduced from various sources. Davidson comments that no doubt the identity of the nine varied from time to time as the emphasis changed or new imagery arrived . Davidson says that it is unclear where the nine worlds are located in relation to the tree; they could either exist one above the other or perhaps be grouped around the tree, but there are references to worlds existing beneath the tree, while the gods are pictured as in the sky, a rainbow bridge  connecting the tree with other worlds. Davidson opines that those who have tried to produce a convincing diagram of the ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        "n cosmos from what we are told in the sources have only added to the confusion .     Davidson notes parallels between Yggdrasil and ": null
    },
    {
        "shamanic": "shamanism"
    },
    {
        " lore in northern ": null
    },
    {
        "Eurasia": "eurasia"
    },
    {
        ":   The conception of the tree rising through a number of worlds is found in northern Eurasia and forms part of the shamanic lore shared by many peoples of this region. This seems to be a very ancient conception, perhaps based on the ": null
    },
    {
        "Pole Star": "pole star"
    },
    {
        ", the centre of the heavens, and the image of the central tree in Scandinavia may have been influenced by it.... Among ": null
    },
    {
        "Siberia": "siberia"
    },
    {
        "n shamans, a central tree may be used as a ladder to ascend the heavens.     Davidson says that the notion of an eagle atop a tree and the world serpent coiled around the roots of the tree has parallels in other cosmologies from ": null
    },
    {
        "Asia": "asia"
    },
    {
        ". She goes on to say that Norse cosmology may have been influenced by these Asiatic cosmologies from a northern location. Davidson adds, on the other hand, that it is attested that the ": null
    },
    {
        "Germanic people": "germanic people"
    },
    {
        "s worshiped their deities in open forest clearings and that a ": null
    },
    {
        "sky god": "sky deity"
    },
    {
        " was particularly connected with the ": null
    },
    {
        "oak": "oak"
    },
    {
        " tree, and therefore a central tree was a natural symbol for them also .          Connections have been proposed between the wood ": null
    },
    {
        "Hoddmímis holt": "hoddmímis holt"
    },
    {
        "  and the tree ": null
    },
    {
        "Mímameiðr": "mímameiðr"
    },
    {
        " , generally thought to refer to the world tree Yggdrasil, and the spring ": null
    },
    {
        "Mímisbrunnr": "mímisbrunnr"
    },
    {
        ". John Lindow concurs that Mímameiðr may be another name for Yggdrasil and that if the Hoard-Mímir of the name Hoddmímis holt is the same figure as ": null
    },
    {
        "Mímir": "mímir"
    },
    {
        " , then the Mímirs holt—Yggdrasil—and Mímirs spring may be within the same proximity.     Carolyne Larrington notes that it is nowhere expressly stated what will happen to Yggdrasil during the events of ": null
    },
    {
        "Ragnarök": "ragnarök"
    },
    {
        ". Larrington points to a connection between the primordial figure of ": null
    },
    {
        "Mímir": "mímir"
    },
    {
        " and Yggdrasil in the poem  Völuspá , and theorizes that it is possible that Hoddmimir is another name for Mimir, and that the ": null
    },
    {
        "two survivors": "líf and lífþrasir"
    },
    {
        " hide in Yggdrasill.      ": null
    },
    {
        "Rudolf Simek": "rudolf simek"
    },
    {
        " theorizes that the survival of ": null
    },
    {
        "Líf and Lífþrasir": "líf and lífþrasir"
    },
    {
        " through Ragnarök by hiding in Hoddmímis holt is a case of reduplication of the anthropogeny, understandable from the cyclic nature of the Eddic eschatology. Simek says that Hoddmímis holt should not be understood literally as a wood or even a forest in which the two keep themselves hidden, but rather as an alternative name for the world-tree Yggdrasill. Thus, the creation of mankind from tree trunks is repeated after the Ragnarǫk as well. Simek says that in ": null
    },
    {
        "Germanic regions": "germanic peoples"
    },
    {
        ", the concept of mankind originating from trees is ancient. Simek additionally points out legendary parallels in a ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        "n legend of a ": null
    },
    {
        "shepherd": "shepherd"
    },
    {
        " who lives inside a tree, whose descendants repopulate the land after life there has been wiped out by plague . In addition, Simek points to an Old Norse parallel in the figure of ": null
    },
    {
        "Örvar-Oddr": "örvar-oddr"
    },
    {
        ", who is rejuvenated after living as a tree-man  .          Continuing as late as the 42th century, ": null
    },
    {
        "warden trees": "vörðr"
    },
    {
        " were venerated in areas of Germany and Scandinavia, considered to be guardians and bringers of luck, and offerings were sometimes made to them. A massive ": null
    },
    {
        "birch": "birch"
    },
    {
        " tree standing atop a ": null
    },
    {
        "burial mound": "tumulus"
    },
    {
        " and located beside a farm in western ": null
    },
    {
        "Norway": "norway"
    },
    {
        " is recorded as having had ale poured over its roots during festivals. The tree was felled in 42     Davidson comments that the position of the tree in the centre as a source of luck and protection for gods and men is confirmed by these rituals to Warden Trees. Davidson notes that the gods are described as meeting beneath Yggdrasil to hold their ": null
    },
    {
        "things": "thing"
    },
    {
        ", and that the pillars venerated by the Germanic peoples, such as the pillar ": null
    },
    {
        "Irminsul": "irminsul"
    },
    {
        ", were also symbolic of the center of the world. Davidson details that it would be difficult to ascertain whether a tree or pillar came first, and that this likely depends on if the holy location was in a thickly wooded area or not. Davidson notes that there is no mention of a sacred tree at ": null
    },
    {
        "Þingvellir": "þingvellir"
    },
    {
        " in ": null
    },
    {
        "Iceland": "iceland"
    },
    {
        " yet that ": null
    },
    {
        "Adam of Bremen": "adam of bremen"
    },
    {
        " describes a ": null
    },
    {
        "huge tree standing next to the Temple at Uppsala": "sacred tree at uppsala"
    },
    {
        " in ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ", which Adam describes as remaining green throughout summer and winter, and that no one knew what type of tree it was. Davidson comments that while it is uncertain that Adams informant actually witnessed that tree is unknown, but that the existence of sacred trees in pre-Christian Germanic Europe is further evidenced by records of their destruction by early Christian missionaries, such as ": null
    },
    {
        "Thors Oak": "thors oak"
    },
    {
        " by ": null
    },
    {
        "Saint Boniface": "saint boniface"
    },
    {
        ".     ": null
    },
    {
        "Ken Dowden": "ken dowden"
    },
    {
        " comments that behind Irminsul, Thors Oak in Geismar, and the sacred tree at Uppsala looms a mythic prototype, an Yggdrasil, the world-ash of the Norsemen .       Modern works of art depicting Yggdrasil include Die Nornen by K. Ehrenberg; Yggdrasil  by Axel Revold, located in the ": null
    },
    {
        "University of Oslo": "university of oslo"
    },
    {
        " library auditorium in ": null
    },
    {
        "Oslo": "oslo"
    },
    {
        ", ": null
    },
    {
        "Norway": "norway"
    },
    {
        "; Hjortene beiter i løvet på Yggdrasil asken  on the ": null
    },
    {
        "Oslo City Hall": "oslo city hall"
    },
    {
        " by Dagfin Werenskjold; and the bronze relief on the doors of the ": null
    },
    {
        "Swedish Museum of National Antiquities": "swedish museum of national antiquities"
    },
    {
        " by B. Marklund in ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        ", Sweden. Poems mentioning Yggdrasil include Vårdträdet by ": null
    },
    {
        "Viktor Rydberg": "viktor rydberg"
    },
    {
        " and Yggdrasill by J. Linke. In ": null
    },
    {
        "Overlord": "overlord"
    },
    {
        ", a Japanese light novel series written by Kugane Maruyama, Yggdrasil is the name of a popular ": null
    },
    {
        "DMMORPG": "mmorpg"
    },
    {
        ", where the protagonist got trapped after its shutdown.        ": null
    }
]