[
    {
        "            Ying Wa College  is a ": null
    },
    {
        "direct subsidised": "direct subsidy scheme"
    },
    {
        " boys secondary school in ": null
    },
    {
        "Kowloon": "kowloon, hong kong"
    },
    {
        ", Hong Kong. It was established in ": null
    },
    {
        "Malacca": "malacca"
    },
    {
        " in 42 by the first ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " missionary to China, ": null
    },
    {
        "Rev. Robert Morrison": "robert morrison"
    },
    {
        ". In 42 the college was moved to Hong Kong. Being the only school with over 42 years of history, it is the oldest school in Hong Kong.     The College Deed, signed in 42 stated that the objective of the school was the reciprocal cultivation of English and Chinese literature as well as the diffusion of Christianity . These aims remain today in the context of a very different world.                       ": null
    },
    {
        "Rev. Robert Morrison": "robert morrison"
    },
    {
        " of the ": null
    },
    {
        "London Missionary Society": "london missionary society"
    },
    {
        " arrived at China in 42 to begin his work of evangelisation. He planned to establish a school that would allow Western missionaries to learn Oriental cultures and languages. He also hoped that the school would play a role on introducing the East to the West and vice versa; in other words, to mediate between the two civilisations, and thus to prepare the way for the quiet and peaceful dissemination of Christian thought in China. With the help of ": null
    },
    {
        "Rev. William Milne": "william milne"
    },
    {
        " who joined Morrison in 42 the Anglo-Chinese College was established in 42 in ": null
    },
    {
        "Malacca": "malacca"
    },
    {
        ". Milne was appointed the first Headmaster.       Apart from its work as a school, the college also trained evangelists and pastors. Amongst them, former student Rev. Hoh Fuk Tong  was made pastor in 42 He preached in ": null
    },
    {
        "Foshan": "foshan"
    },
    {
        " and ": null
    },
    {
        "Canton": "guangzhou"
    },
    {
        " to his fellow Chinese people. ": null
    },
    {
        "Liang Fa": "liang fa"
    },
    {
        " , who was a craftsman in the printing centre of the college, also heeded the call to preach Gospel. A printing press was set up within the school premises to publish translated Bible and other religious publications.        In 42 noted sinologist ": null
    },
    {
        "Rev. James Legge": "james legge"
    },
    {
        " became headmaster. Two years later, Hong Kong was ceded to the ": null
    },
    {
        "United Kingdom": "united kingdom of great britain and ireland"
    },
    {
        " under the ": null
    },
    {
        "Treaty of Nanking": "treaty of nanking"
    },
    {
        ". The ": null
    },
    {
        "London Missionary Society": "london missionary society"
    },
    {
        " thus decided to move the college to Hong Kong in 42 The school building was situated at the junction of ": null
    },
    {
        "Staunton Street": "staunton street"
    },
    {
        " and ": null
    },
    {
        "Aberdeen Street": "aberdeen street"
    },
    {
        ". At that time, Christian churches had not yet been officially established. Thus the college was used as a religious centre where Christians assembled to worship. Since the London Missionary Society deemed that the college should focus more on the training of evangelists after the relocation, The college was renamed The Theological Seminary of the London Missionary Society in China. When Legge returned to Britain in 42 he brought with him three of his Chinese students. Legge and the students were received by ": null
    },
    {
        "Queen Victoria": "queen victoria"
    },
    {
        ".     Another important task of the College was printing the Bible and other religious publications with its own printing press. In 42 the first Chinese newspaper, ": null
    },
    {
        "Chinese Serial": "chinese serial"
    },
    {
        ", was published by the colleges printing press.     Legge held his headship until he was appointed by the Hong Kong Government in 42 to help prepare for the opening of ": null
    },
    {
        "Queens College": "queens college, hong kong"
    },
    {
        ". Due to the lack of a successor as well as political instability, the college ceased to operate at the end of 42 and teaching ended in 42 But the printing press continued its work until 42 when it was sold to ": null
    },
    {
        "Wang Tao": "wang tao"
    },
    {
        " and ": null
    },
    {
        "Wong Shing": "wong shing"
    },
    {
        ".       In 42 the elders of the To Tsai Church together with Rev. Cheung Chuk Ling, Rev. W. T. Pearce and Rev. H. R. Wells revived the college so that the training of the sons of church members might be carried on. In 42 the ": null
    },
    {
        "London Missionary Society": "london missionary society"
    },
    {
        " responded to the appeal of the To Tsai Church. Rev. Arnold Hughes was sent to Hong Kong to assume headship, and the college was re-opened as a middle school in 42 in rented premises, first at 42 ": null
    },
    {
        "Caine Road": "caine road"
    },
    {
        ", later at 42 ": null
    },
    {
        "Caine Road": "caine road"
    },
    {
        ", and finally at 42 ": null
    },
    {
        "Bonham Road": "bonham road"
    },
    {
        " .     The college grappled with many financial problems and it was at this time that help was received from the China Congregational Church. Financial assistance was also received from the Government.     In 42 Hughes was called up for service in the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ". Rev. W. T. Pearce became Acting Headmaster until Hughes returned after the war. The college suffered a great loss in 42 when Hughes became ill and died in Japan while on his way back to England on sick leave. In that year, the ": null
    },
    {
        "London Missionary Society": "london missionary society"
    },
    {
        " transferred Rev. L. G. Phillips from ": null
    },
    {
        "Amoy": "xiamen"
    },
    {
        " to Hong Kong. He served as Headmaster for over two years.     With Phillipss departure in 42 and troubles in connection with the premises at 42 ": null
    },
    {
        "Bonham Road": "bonham road"
    },
    {
        ", the college entered another difficult period. The premises were rented from the government who now wanted to auction them off. The School Committee requested to be allowed to buy the property but there aroused a dispute with the ": null
    },
    {
        "Rhenish Mission": "rhenish missionary society"
    },
    {
        " even though the rental had originally been undertaken with a view to protecting the property and preserving it for the German mission. The committee contemplated closing the school, but eventually, the dispute was resolved and the college continued its operation under the headship of Richard Shum       ": null
    }
]