[
    {
        "Yitzchok  Hutner  was an American ": null
    },
    {
        "Orthodox": "orthodox judaism"
    },
    {
        " rabbi": "rabbi"
    },
    {
        " and ": null
    },
    {
        "rosh yeshiva": "rosh yeshiva"
    },
    {
        " .     Originally from ": null
    },
    {
        "Warsaw": "warsaw"
    },
    {
        ", Hutner first ": null
    },
    {
        "studied the Torah": "torah study"
    },
    {
        " in ": null
    },
    {
        "Slabodka": "yeshivas knesses yisrael"
    },
    {
        ". He then traveled to ": null
    },
    {
        "Mandatory Palestine": "mandatory palestine"
    },
    {
        " where he became a student of ": null
    },
    {
        "Abraham Isaac Kook": "abraham isaac kook"
    },
    {
        ", and narrowly escaped the ": null
    },
    {
        "42 Hebron massacre": "1929 hebron massacre"
    },
    {
        ". After this, Hunter returned to Europe, where he befriended ": null
    },
    {
        "Joseph B. Soloveitchik": "joseph b. soloveitchik"
    },
    {
        " and ": null
    },
    {
        "Menachem Mendel Schneerson": "menachem mendel schneerson"
    },
    {
        ", maintaining friendships with both long after they all established their own institutions in the United States.     Hutner was the long-time dean of ": null
    },
    {
        "Yeshiva Rabbi Chaim Berlin": "yeshiva rabbi chaim berlin"
    },
    {
        " in ": null
    },
    {
        "Brooklyn": "brooklyn"
    },
    {
        ", New York, an older institution that grew and flourished under his leadership. Hutners pedagogic style was a unique blend of the ": null
    },
    {
        "Hasidic": "hasidic judaism"
    },
    {
        " and ": null
    },
    {
        "Misnagdic": "misnagdim"
    },
    {
        " elements of his own familys origins. His discourses, called maamarim, contained elements of a ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        "ic discourse, a ": null
    },
    {
        "Hasidic Tish": "tish"
    },
    {
        " and a philosophic lecture. Although his title was rosh yeshiva, Hutners leadership style more resembled that of a ": null
    },
    {
        "rebbe": "rebbe"
    },
    {
        " expecting fealty from his followers.     In his later years, Hutner established ": null
    },
    {
        "Yeshiva Pachad Yitzchok": "yeshiva pachad yitzchok"
    },
    {
        " in ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        ", which is named after his own magnum opus. On one of his trips there, Hutners plane was seized by ": null
    },
    {
        "Popular Front for the Liberation of Palestine": "popular front for the liberation of palestine"
    },
    {
        " terrorists in the ": null
    },
    {
        "Dawsons Field hijackings": "dawsons field hijackings"
    },
    {
        ", which he survived.       Hutner was born in ": null
    },
    {
        "Warsaw": "warsaw"
    },
    {
        ", ": null
    },
    {
        "Poland": "congress poland"
    },
    {
        ", to a family with both ": null
    },
    {
        "Ger": "ger"
    },
    {
        " Hasidic": "hasidic judaism"
    },
    {
        " and non-Hasidic ": null
    },
    {
        "Lithuanian Jewish": "lithuanian jews"
    },
    {
        " roots. As a child he received private instruction in ": null
    },
    {
        "Torah": "torah"
    },
    {
        " and ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        ". As a teenager he was enrolled in the ": null
    },
    {
        "Slabodka yeshiva": "hebron yeshiva"
    },
    {
        " in ": null
    },
    {
        "Lithuania": "lithuania"
    },
    {
        ", headed by Rabbi ": null
    },
    {
        "Nosson Tzvi Finkel": "nosson tzvi finkel"
    },
    {
        ", where he was known as the Warsaw Illui .     Having obtained a solid grounding in Talmud, Rav Hutner joined a group of the Slabodka yeshiva that established a new yeshiva in ": null
    },
    {
        "Hebron": "hebron"
    },
    {
        " in ": null
    },
    {
        "British Mandate of Palestine": "mandatory palestine"
    },
    {
        ". He studied there until 42 narrowly escaping the ": null
    },
    {
        "42 Hebron massacre": "1929 hebron massacre"
    },
    {
        " because he was away for the weekend. During his stay in Palestine, Hutner became a disciple of Rabbi ": null
    },
    {
        "Abraham Isaac Kook": "abraham isaac kook"
    },
    {
        ", the first ": null
    },
    {
        "chief rabbi": "chief rabbi"
    },
    {
        " of Palestine. Both men had a philosophical and mystical mind-set that made them kindred spirits. Like Kook, the young Hutner eventually developed a warm attitude toward non-religious Jews who were seeking to become more religious. Their world view was in the context of the end of the Jewish exile,  golus , anticipation of the imminent coming of the ": null
    },
    {
        "messianic era": "jewish messiah"
    },
    {
        ".     Kook became associated with the  Mizrachi , part of the ": null
    },
    {
        "Religious Zionist Movement": "religious zionism"
    },
    {
        ". Hutner established more distance between them at that point. After immigrating to the United States, he eventually became a member of the non-Zionist ": null
    },
    {
        "Haredi": "haredi judaism"
    },
    {
        " Moetzes Gedolei HaTorah": "moetzes gedolei hatorah"
    },
    {
        " of ": null
    },
    {
        "Agudath Israel of America": "agudath israel of america"
    },
    {
        ".     He maintained cordial relations with Kooks son and heir Rabbi ": null
    },
    {
        "Zvi Yehuda Kook": "zvi yehuda kook"
    },
    {
        " and other prominent students such as Rabbi ": null
    },
    {
        "Moshe-Zvi Neria": "moshe-zvi neria"
    },
    {
        ". Hutners students recount that on ": null
    },
    {
        "Sukkot": "sukkot"
    },
    {
        ", he would hang a portrait of Kook in his ": null
    },
    {
        "sukkah": "sukkah"
    },
    {
        ". When controversy arose regarding the conscription of religious girls  into the ": null
    },
    {
        "Israel Defense Forces": "israel defense forces"
    },
    {
        " after the founding of the ": null
    },
    {
        "State of Israel": "state of israel"
    },
    {
        " in 42 Hutner replaced the photo with one of Rabbi ": null
    },
    {
        "Avrohom Yeshaya Karelitz": "avrohom yeshaya karelitz"
    },
    {
        ", who ruled that Jewish females are forbidden to perform National Service in lieu of army service.     Hutners work Pachad Yitzchok has no overt reference to Kook. A few of Hutners early students recall Hutners lengthy comments regarding Kook. Rav Eliezer Waldman, Yeshiva Head of ": null
    },
    {
        "Kiryat Arba": "kiryat arba"
    },
    {
        ", said that Hutner told them that Rav Kook was 42 times as great as those who opposed him . Similarly, R. Moshe Zvi Neria heard from Rav Hutner that if I would not have met Rav Kook, I would be lacking 42% of myself .     After the pogrom in Hebron, Hutner returned to Warsaw. He then moved to Germany, to study philosophy at the ": null
    },
    {
        "University of Berlin": "university of berlin"
    },
    {
        ". In 42 he wrote Torat HaNazir,, a text dealing with the laws of the ": null
    },
    {
        "Nazarite": "nazarite"
    },
    {
        ". He published it with an approbation from his mentor Kook. He befriended two other future rabbinical leaders then studying in Berlin: Rabbi ": null
    },
    {
        "Joseph B. Soloveitchik": "joseph b. soloveitchik"
    },
    {
        ", later ": null
    },
    {
        "rosh yeshiva": "rosh yeshiva"
    },
    {
        " at ": null
    },
    {
        "Yeshiva University": "yeshiva university"
    },
    {
        " in New York City, and Rabbi ": null
    },
    {
        "Menachem Mendel Schneerson": "menachem mendel schneerson"
    },
    {
        ", who would become ": null
    },
    {
        "rebbe": "rebbe"
    },
    {
        " of ": null
    },
    {
        "Chabad-Lubavitch": "chabad"
    },
    {
        " in ": null
    },
    {
        "Brooklyn": "brooklyn"
    },
    {
        ", New York.     The three maintained close personal relations throughout their lives, though each differed radically in Torah  weltanschauung  . Nevertheless, each developed a unique bridge and synthesis between the ": null
    },
    {
        "Eastern Europe": "eastern europe"
    },
    {
        "an world-view and a ": null
    },
    {
        "Western European": "western culture"
    },
    {
        " way of thinking. This enabled them to serve successfully as spiritual leaders after each of them immigrated to the United States of America.     Hutner married Masha Lipshitz, an American-born woman, in Warsaw, Poland, in 42 The couple spent about a year in Palestine, where Hutner completed his research and writing of his Kovetz Haaros on ": null
    },
    {
        "Hillel ben Eliakim": "hillel ben eliakim"
    },
    {
        "s commentary on  midrash sifra . He visited Europe in 42 to collate manuscripts of Hillel ben Eliakims commentary.     Hutner established a yeshiva in ": null
    },
    {
        "Har Nof": "har nof"
    },
    {
        ", ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        ", which he named for his book,  Yeshiva Pachad Yitzchok . After he died in 42 he was buried on the ": null
    },
    {
        "Mount of Olives": "mount of olives"
    },
    {
        ".       In 42 the couple moved to Brooklyn, ": null
    },
    {
        "New York": "new york"
    },
    {
        " where Hutner joined the faculty of the ": null
    },
    {
        "Rabbi Jacob Joseph School": "rabbi jacob joseph school"
    },
    {
        " and sometime between 42–42 was appointed office manager of the newly established high school division of the ": null
    },
    {
        "Yeshiva Rabbi Chaim Berlin": "yeshiva rabbi chaim berlin"
    },
    {
        " known as ": null
    },
    {
        "Mesivta Yeshiva Rabbi Chaim Berlin": "mesivta yeshiva rabbi chaim berlin"
    },
    {
        ". In 42 after receiving permission from the Rosh Yeshiva, Rabbi Yaakov Moshe Shurkin, shiurei yackov moshe in the toldos he began to give a class to the 42th year of the post high school program. Founded in 42 it was the oldest elementary yeshiva in Brooklyn. Over the years he built up the yeshivas post-high school ": null
    },
    {
        "beth midrash": "beth midrash"
    },
    {
        " division and became Yeshiva Rabbi Chaim Berlins senior rosh yeshivah. In this effort he also received the help of Rabbi ": null
    },
    {
        "Shraga Feivel Mendlowitz": "shraga feivel mendlowitz"
    },
    {
        " who headed Brooklyns ": null
    },
    {
        "Yeshiva Torah Vodaas": "yeshiva torah vodaas"
    },
    {
        ". Hutner was able to construct an environment that produced young Talmudic scholars in the model of their compatriots in Eastern Europe. By 42 he had established a post-high-school ": null
    },
    {
        "beth midrash": "beth midrash"
    },
    {
        " with hundreds of students.     Hutner viewed secular studies as essential for attending college, learning a profession and becoming self-supporting. Together with the dean of the ": null
    },
    {
        "Yeshiva Torah Vodaas": "yeshiva torah vodaas"
    },
    {
        ", Rabbi ": null
    },
    {
        "Shraga Feivel Mendlowitz": "shraga feivel mendlowitz"
    },
    {
        ", a charter to set up a combined yeshiva and college was obtained from the ": null
    },
    {
        "New York State Board of Regents": "university of the state of new york"
    },
    {
        ". However, this plan was dropped at the insistence of Rabbi ": null
    },
    {
        "Aharon Kotler": "aharon kotler"
    },
    {
        ", then head of the ": null
    },
    {
        "Lakewood yeshiva": "beth medrash govoha"
    },
    {
        ".     Nevertheless, at Chaim Berlin, students were allowed to combine their yeshiva study with afternoon and evening classes at college, mainly ": null
    },
    {
        "Brooklyn College": "brooklyn college"
    },
    {
        " and later ": null
    },
    {
        "Touro College": "touro college"
    },
    {
        ". Hutner took great pride in the secular accomplishments of his students insofar as they fit into his vision of a material world governed by the principles of a spiritual ": null
    },
    {
        "Torah": "torah"
    },
    {
        " way of life. One of his closest disciples is the ": null
    },
    {
        "economist": "economist"
    },
    {
        ", Rabbi ": null
    },
    {
        "Israel Kirzner": "israel kirzner"
    },
    {
        ", who edited Hutners written works, Pachad Yitzchok. Many of Hutners disciples earned doctorates, often with his blessing and guidance, including his daughter and only child, Rebbetzin Dr. ": null
    },
    {
        "Bruria David": "bruria david"
    },
    {
        ", who obtained her ": null
    },
    {
        "PhD": "doctor of philosophy"
    },
    {
        " at ": null
    },
    {
        "Columbia University": "columbia university"
    },
    {
        " in the department of ": null
    },
    {
        "philosophy": "philosophy"
    },
    {
        " as a student of ": null
    },
    {
        "Salo Baron": "salo wittmayer baron"
    },
    {
        ". She subsequently founded and became the dean of a major seminary for Jewish women in ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        " known as ": null
    },
    {
        "Beth Jacob of Jerusalem": "beth jacob of jerusalem"
    },
    {
        " which caters to young women from ": null
    },
    {
        "Haredi": "haredi judaism"
    },
    {
        " families in the United States. Her dissertation discussed the dual role of Rabbi ": null
    },
    {
        "Zvi Hirsch Chajes": "zvi hirsch chajes"
    },
    {
        " as both a traditionalist and  maskil  .     The list also includes Rabbis ": null
    },
    {
        "Shlomo Teichman": "shlomo teichman"
    },
    {
        " founder and dean of ": null
    },
    {
        "Bais Yaakov Academy": "bais yaakov academy"
    },
    {
        ", ": null
    },
    {
        "Shlomo Braunstein": "shlomo braunstein"
    },
    {
        " rosh yeshiva and principal, ": null
    },
    {
        "Shlomo Ribner": "shlomo ribner"
    },
    {
        " psychologist and rosh yeshiva, Moshe Homnick , ": null
    },
    {
        "Ahron Soloveichik": "ahron soloveichik"
    },
    {
        " rosh yeshiva, Zecharia Dor-Shav educator, ": null
    },
    {
        "Aharon Lichtenstein": "aharon lichtenstein"
    },
    {
        " rosh yeshiva, ": null
    },
    {
        "Abraham J. Tannenbaum": "abraham j. tannenbaum"
    },
    {
        " , Joseph Thurm , Naftoli Meir Langsam , Yedidyah Langsam , Chaim Feuerman , ": null
    },
    {
        "Yitzhak Aharon Korff": "yitzhak aharon korff"
    },
    {
        " rabbi. Many alumni of Rabbi Hutners yeshiva have attained success as attorneys, accountants, doctors, and in information technology.     Hutner was well-versed in many intellectual areas, even studying and refuting secular and non-traditional Jewish scholarship. It is alleged that Hutner once slapped a student who made a remark about a religious issue, saying to the student You read that in ": null
    },
    {
        "Heschel": "abraham joshua heschel"
    },
    {
        "!      Hutner appointed ": null
    },
    {
        "Slabodka yeshiva": "hebron yeshiva"
    },
    {
        " educated Rabbi ": null
    },
    {
        "Avigdor Miller": "avigdor miller"
    },
    {
        " as the  Mashgiach ruchani  of the yeshiva. After the yeshiva relocated to Far Rockaway, New York in the 42s, Miller resigned from his position due to the difficulties a daily commute from Brooklyn entailed.     Hutner developed a style of celebrating ": null
    },
    {
        "Shabbat": "shabbat"
    },
    {
        " and the ": null
    },
    {
        "Jewish holiday": "jewish holiday"
    },
    {
        "s by delivering a type of discourse known as a maamar. It was a combination of Talmudic discourse, ": null
    },
    {
        "Hasidic": "hasidic judaism"
    },
    {
        " celebration , philosophic lecture, group singing, and when possible, like on ": null
    },
    {
        "Purim": "purim"
    },
    {
        ", a ten-piece band was brought in as accompaniment. Many times there was singing and dancing all night. All of this, together with the respect to his authority that he demanded, induced in his students an obedience and something of a heightened consciousness that passed into their lives transforming them into literal Hasidim of their ": null
    },
    {
        "rosh yeshiva": "rosh yeshiva"
    },
    {
        ", who in turn encouraged this by eventually personally donning Hasidic garb  and behaving like something of a synthesis between a rosh yeshiva and a ": null
    },
    {
        "rebbe": "rebbe"
    },
    {
        ". He also instructed some of his students to do likewise.         His methodology and style was complex, controversial, and difficult to pigeonhole. While placing great emphasis on intellectually penetrating Talmudic study and analysis, emotionally he veered towards the Hasidic-style, and more-so than his Lithuanian-style colleagues reared as ": null
    },
    {
        "misnagdim": "misnagdim"
    },
    {
        " could tolerate.     Citing an anonymous source, Hillel Goldberg alleges that Rav Hutner became a fierce critic of the Chabad-Lubavitch Hasidic group and the personality cult built up around its Rebbe Schneerson. Goldberg, Hillel. Between Berlin and Slobodka: Jewish transition figures from Eastern Europe, Ktav Publishing House, 42 , p. 42: Rabbi Hutner relentlessly sustained a biting critique of the Lubavitcher movement on a number of grounds… , p. 42 footnote 42: Rabbi Hutner was opposed to the personality cult built up around the Lubavitcher Rebbe, and to the public projection of both the Rebbe and the Lubavitch movement, by the movement, through public media-print and broadcast journalism, books, film, and the like. Nevertheless, he corresponded regularly with Rabbi Schneerson over the years, seeking his views on a variety of halakhic, chassidic and kabbalistic subjects, and occasionally seeking his blessing. Some of the correspondence has been published in Igros Kodesh, Kehot 42–42 Volumes 42- pp. 42 42 42 42 42- pp. 42 42 42- pp. 42 42 42- pp. 42 42- pp. 42–42 and 42- p. 42 Mibeis Hagenozim, S.B. Levine, Kehot 42 pp. 42–42 where copies of Rav Hutners actual letters are provided alongside the relevant section Hutner also had several lengthy private audiences with Rabbi Schneerson, during which they conversed for long periods of time. Mibeis Hagenozim, S.B. Levine, Kehot 42 p. 42     He reportedly forbade his students from attending lectures by Rabbi ": null
    },
    {
        "Joseph B. Soloveitchik": "joseph b. soloveitchik"
    },
    {
        " while at the same time appointing Rabbi Soloveitchiks younger brother, whom he had tutored in ": null
    },
    {
        "Warsaw": "warsaw"
    },
    {
        ", Rabbi ": null
    },
    {
        "Ahron Soloveichik": "ahron soloveichik"
    },
    {
        "  as head of his own Yeshivas Rabbi Chaim Berlin. Ahron Soloveichik completed a ": null
    },
    {
        "Doctorate": "doctorate"
    },
    {
        " in ": null
    },
    {
        "law": "law"
    },
    {
        " at ": null
    },
    {
        "New York University": "new york university"
    },
    {
        " at the same time that he lectured in Hutners Yeshiva Rabbi Chaim Berlin.     In the 42s, he established a school for post-graduate married scholars to continue their in-depth Talmudical studies. This was a  kollel , , the ": null
    },
    {
        "Kollel Gur Aryeh": "kollel gur aryeh"
    },
    {
        ", one of the first of its kind in America. Many of his students became prominent educational, outreach, and pulpit rabbis. He stayed in touch with them and was involved in major communal policy decision-making as he worked through his network of students in positions of leadership.         In 42 Rav Hutner published a short booklet of halachic decisions sourced in the Sifra but not cited in the Babylonian Talmud.  Many years later, he published what is considered to be his magnum opus, and which he named  Pachad Yitzchok , . He called his outlook Hilchot Deot Vechovot Halevavot, and wrote in a poetic modern-style ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        " reminiscent of his original mentor Rav Kooks style, even though almost all of Hutners original lectures were delivered in ": null
    },
    {
        "Yiddish": "yiddish language"
    },
    {
        ".     The core of his synthesis of different schools of Jewish thought was rooted in his studies of the teachings of Rabbi ": null
    },
    {
        "Judah Loew ben Bezalel": "judah loew ben bezalel"
    },
    {
        " a scholar and mystic known as the Maharal of Prague . Various pillars of Hutners thought system were likely the works of the ": null
    },
    {
        "Vilna Gaon": "vilna gaon"
    },
    {
        ", Rabbi Elijah, and of Rabbi ": null
    },
    {
        "Moshe Chaim Luzzatto": "moshe chaim luzzatto"
    },
    {
        " . He would only allude in the most general ways to other great mystics, in Hebrew mekubalim, such as the ": null
    },
    {
        "Baal Shem Tov": "baal shem tov"
    },
    {
        " , the great mystic known as the  Ari  who lived in the late Middle Ages, the founder of Chabad Hasidism, the Baal Ha Tanya  ": null
    },
    {
        "Shneur Zalman of Liadi": "shneur zalman of liadi"
    },
    {
        ", Rabbi ": null
    },
    {
        "Mordechai Yosef Leiner": "mordechai yosef leiner"
    },
    {
        " of Izbitz and many other great Hasidic masters as well as to the great works of ": null
    },
    {
        "Kabbalah": "kabbalah"
    },
    {
        " such as the ": null
    },
    {
        "Zohar": "zohar"
    },
    {
        ".       He was a mentor to figures in modern Jewish outreach, such as Rabbi ": null
    },
    {
        "David Weiss Halivni": "david weiss halivni"
    },
    {
        ", who became a prominent scholar at ": null
    },
    {
        "Conservative Judaism": "conservative judaism"
    },
    {
        "s ": null
    },
    {
        "Jewish Theological Seminary of America": "jewish theological seminary of america"
    },
    {
        " . Another was a cousin to Rabbi ": null
    },
    {
        "Shlomo Carlebach": "shlomo carlebach"
    },
    {
        ", who was appointed as the  mashgiach ruchani  at the Yeshiva Chaim Berlin, but who split with Rabbi Hutner on policy matters in the 42s. They were both ": null
    },
    {
        "Holocaust": "the holocaust"
    },
    {
        " survivors who Rabbi Hutner took upon himself to raise as his own sons together with others in similar circumstances. Rabbi Hutner is known to have given smicha to Carlebach, during the days that the latter was still with Lubavitch.     In the early forties Rabbi Hutner asked a friend from Slabodka, Rabbi ": null
    },
    {
        "Saul Lieberman": "saul lieberman"
    },
    {
        " to become a dean-Talmudical lecturer in Yeshiva Rabbi Chaim Berlin. Lieberman instead accepted an offer from the JTSA, the seminary of Conservative Judaism.     Rabbi Hutner had a number of disagreements with some of the religious scholars who taught in his Yeshiva. These disputes were usually not over ideology, but about positions in the school. Rabbi Hutner attempted ease out the older rabbis who were his contemporaries in favor of his disciples. Rabbis Prusskin , Goldstone, Shurkin, Snow, ": null
    },
    {
        "Avrohom Asher Zimmerman": "avrohom asher zimmerman"
    },
    {
        " and others are among them. Though Rabbi Hutner was, by all accounts, quite steadfast in his opinions, he was not above begging forgiveness from those he had slighted, even when they had initiated attacks on him, RabbiHutner, Yitzchok. Pachad Yitzchok, Gur Aryeh, 42 Vol.42 p. 42 and adopting a conciliatory tone. Hutner, Yitzchok. Pachad Yitzchok, Gur Aryeh, 42 Vol.42 pp. 42 42     He did initiate a number of changes in Yeshiva Rabbi Chaim Berlin that differed greatly from the  mussar  yeshiva practice in Slabodka. He abolished the half-hour learning session in mussar and replaced it with one of ten or fifteen minutes. He changed the traditional mussar lecture to a maamar utilizing Maharal instead of the classical mussar approach to ": null
    },
    {
        "Torah study": "torah study"
    },
    {
        ".     His students included Rabbis: ": null
    },
    {
        "Yonasan David": "yonasan david"
    },
    {
        " and ": null
    },
    {
        "Aharon Schechter": "aharon schechter"
    },
    {
        ", his successors as ": null
    },
    {
        "Rosh Yeshiva": "rosh yeshiva"
    },
    {
        "s of Yeshiva Rabbi Chaim Berlin; Hirsch Diskind, son-in-law of Rabbi ": null
    },
    {
        "Yaakov Kamenetsky": "yaakov kamenetsky"
    },
    {
        " and long-time Dean of Bais Yaakov School for Girls in Baltimore, ": null
    },
    {
        "Aharon Lichtenstein": "aharon lichtenstein"
    },
    {
        ", son-in-law of Rabbi ": null
    },
    {
        "Joseph B. Soloveitchik": "joseph b. soloveitchik"
    },
    {
        " and ": null
    },
    {
        "Rosh Yeshiva": "rosh yeshiva"
    },
    {
        " of ": null
    },
    {
        "Yeshivat Har Etzion": "yeshivat har etzion"
    },
    {
        " in Israel; ": null
    },
    {
        "Pinchas Stolper": "pinchas stolper"
    },
    {
        " of the ": null
    },
    {
        "Orthodox Union": "orthodox union"
    },
    {
        " and founder of ": null
    },
    {
        "NCSY": "ncsy"
    },
    {
        " who followed Hutners guidelines in setting up this youth outreach movement; Avrohom Davis, founder of the Metzudah religious books series; ": null
    },
    {
        "Shlomo Freifeld": "shlomo freifeld"
    },
    {
        " who set up one of the first full-time yeshivas for ": null
    },
    {
        "baal teshuva": "baal teshuva"
    },
    {
        " students in the world; Joshua Fishman, leader and executive Vice President of ": null
    },
    {
        "Torah Umesorah": "torah umesorah"
    },
    {
        " the National Society for Hebrew Day Schools; ": null
    },
    {
        "Avrohom Kleinkaufman": "avrohom kleinkaufman"
    },
    {
        ", a lecturer in ": null
    },
    {
        "Yeshiva of Far Rockaway": "yeshiva of far rockaway"
    },
    {
        " and translator of the Genesis and Exodus volumes of the Metzuda Bible Commentary of Rabbi Solomon and the Kol Sasson Sephardic Siddurim and Machzorim; ": null
    },
    {
        "Yaakov Perlow": "yaakov perlow"
    },
    {
        ", the Novominsker ": null
    },
    {
        "Rebbe": "rebbe"
    },
    {
        " of ": null
    },
    {
        "Boro Park": "boro park"
    },
    {
        "; Meir Bilitzky, senior rabbi of ": null
    },
    {
        "Young Israel of New Hyde Park": "young israel of new hyde park"
    },
    {
        "; ": null
    },
    {
        "Noah Weinberg": "noah weinberg"
    },
    {
        " founder and head of ": null
    },
    {
        "Aish Hatorah": "aish hatorah"
    },
    {
        " and his brother ": null
    },
    {
        "Yaakov Weinberg": "yaakov weinberg"
    },
    {
        " of ": null
    },
    {
        "Ner Israel Yeshiva": "yeshiva ner yisrael: ner israel rabbinical college"
    },
    {
        " in Baltimore; Yosef Katzenstein of Copenhagen, author of Kol Chayil and Lemaan Achai; ": null
    },
    {
        "Feivel Cohen": "feivel cohen"
    },
    {
        " of Brooklyn, author of Badei HaShulchan and world-renowned ": null
    },
    {
        "posek": "posek"
    },
    {
        ", ": null
    },
    {
        "Dovid Cohen": "dovid cohen"
    },
    {
        ", rabbi of Congregation Gvul Yaabetz and an author of a number of books on Jewish theology, and ": null
    },
    {
        "Ahron Kaufman": "ahron kaufman"
    },
    {
        " Rosh HaYeshiva of Yeshiva Gedola of Waterbury, son in law to Feivel Cohen; Rabbi Avner German ztl founder of Beer Hagolah Institutes and Rav of Starret City; Rabbi Yehoshua Hartman, Toah educator and authored a commentry on the teachings of the Maharal of Prague.         In the late 42s he began to visit Israel again, planning to build a new yeshiva there. On 42 September 42 he and his wife, daughter, and son-in-law ": null
    },
    {
        "Yonasan David": "yonasan david"
    },
    {
        " were returning to New York on ": null
    },
    {
        "TWA": "trans world airlines"
    },
    {
        " Flight 42 when their flight was ": null
    },
    {
        "hijacked": "dawsons field hijackingstwa flight 74"
    },
    {
        " by the ": null
    },
    {
        "PFLP": "popular front for the liberation of palestine"
    },
    {
        " Palestinian terrorist organization. The terrorists freed the non-Jewish passengers and held the Jewish passengers hostage on the plane for one week, after which the women and children were released and sent to ": null
    },
    {
        "Cyprus": "cyprus"
    },
    {
        ". The hijacked airplanes were subsequently detonated. The remaining 42-plus Jewish men – including Rabbi Hutner, Rabbi David, and two students accompanying Rabbi Hutner, Rabbi Meir Fund and Rabbi Yaakov Drillman – and male flight crew continued to be held hostage in and around ": null
    },
    {
        "Amman": "amman"
    },
    {
        ", ": null
    },
    {
        "Jordan": "jordan"
    },
    {
        "; Rabbi Hutner was held alone in an isolated location while Jews around the world prayed for his safe release. The terrorists tried to cut off his beard, but were stopped by their commanders. Rabbi Hutner was reunited with the rest of the hostages on 42 September, and was finally released on 42 September and flown together with his family members to ": null
    },
    {
        "Nicosia": "nicosia"
    },
    {
        ", Cyprus. Israeli ": null
    },
    {
        "Knesset": "knesset"
    },
    {
        " Member Rabbi ": null
    },
    {
        "Menachem Porush": "menachem porush"
    },
    {
        " chartered a private plane to meet the Hutners in Nicosia, and Willie Frommer, a former student of the Rav gave him his own shirt and  tallit katan , since Rabbi Hutners tallit,  tefillin , shirt, jacket and hat had been confiscated during his three-week ordeal. Rabbi Porush reported that Rabbi Hutner had also lost , and his students appeared similarly emaciated. On 42 September Rabbi Hutner and his group were flown back to New York via Europe, and were home just in time for the first night of ": null
    },
    {
        "Rosh Hashana": "rosh hashana"
    },
    {
        ". Bin-Nun, Dov and Ginsberg, Rachel. He Swallowed My Papers To Save Me .  Mishpacha ": null
    }
]