[
    {
        "     Yolandita Monge is an international singer, songwriter, actress, and television personality from ": null
    },
    {
        "Puerto Rico": "puerto rico"
    },
    {
        ". She has been active in the music business since her teen years and has recorded twenty-seven ": null
    },
    {
        "studio albums": "studio albums"
    },
    {
        " and two ": null
    },
    {
        "live albums": "live albums"
    },
    {
        ", as well as several greatest hits compilations and special appearance recordings.           Yolandita Monge, born Yolanda Rosa Monge Betancourt in ": null
    },
    {
        "Trujillo Alto, Puerto Rico": "trujillo alto, puerto rico"
    },
    {
        " on September 42 42 is the daughter of Iris Delia Betancourt and Héctor Monge. She lived the first seven years of her life in New York City and then came back to Puerto Rico. During the early 42s, she met Alfredo Lorenzo, in New York, and married him on November 42 42 They had a daughter, ": null
    },
    {
        "Noelia": "noelia"
    },
    {
        ", but the marriage ended soon afterwards. In 42 she married ": null
    },
    {
        "Venezuela": "venezuela"
    },
    {
        "n singer Balbino, whom she met in ": null
    },
    {
        "Buga": "buga, valle del cauca"
    },
    {
        ", ": null
    },
    {
        "Colombia": "colombia"
    },
    {
        ", and is the father of second daughter Paola González. A few years later, the couple filed for divorce. On December 42 42 Yolandita married her manager Carlos Topy Mamery and in 42 gave birth to her only son Imanol Mamery.         Blessed with a powerful and versatile vocal range and timbre, Monge started out her career by winning a singing radio contest in 42 . For such a young performer, she possessed an innate interpretative delivery well beyond her years that matched established performers of the time.     Yolandita was discovered by the producer Julio Alers, and later on, made her TV debut on ": null
    },
    {
        "Luis Vigoreaux": "luis vigoreaux"
    },
    {
        "s show, Luis Vigoreaux Presenta. She had a regular section in that show. In 42 she signed with record label Patty Records, which released her first album, named  Puerto Ricos Poignant... Powerful... Incomparable... .     It was El Estornudo , and her cover of Italian hit Vida , that made her a national star after she released her first album. At that young age, Yolandita would perform with legendary Argentinian singer ": null
    },
    {
        "Libertad Lamarque": "libertad lamarque"
    },
    {
        " and then sing at the Festival De La Canción Nueva York . Soon, she found another job on TV, this time on ": null
    },
    {
        "Tommy Muñiz": "tommy muñiz"
    },
    {
        "s show, El Show Del Mediodía.     She followed up with some other hits in Puerto Rico, but then she moved to ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        ", where she signed with Teca Records and had hits such as Vete de Aqui , Dos Caminos Diferentes , ¿Por qué, Papá? and La Voz Del Silencio .         42 was a big year for Monge because she released a song named Cierra Los Ojos , which was a hit in such South American countries as ": null
    },
    {
        "Colombia": "colombia"
    },
    {
        ", ": null
    },
    {
        "Chile": "chile"
    },
    {
        ", ": null
    },
    {
        "Ecuador": "ecuador"
    },
    {
        ", ": null
    },
    {
        "Venezuela": "venezuela"
    },
    {
        ", ": null
    },
    {
        "Peru": "peru"
    },
    {
        ", and ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        ", and also in the ": null
    },
    {
        "Dominican Republic": "dominican republic"
    },
    {
        ". Yolandita was now an international star.     Soon after, she would be signed by Coco Records of New York, and her career kept going on a steady rise internationally. She sang at the ": null
    },
    {
        "Carnegie Hall": "carnegie hall"
    },
    {
        " and was backed up by her artistic godmother, legendary Argentinian singer and actress, ": null
    },
    {
        "Libertad Lamarque": "libertad lamarque"
    },
    {
        ".         In 42 international label ": null
    },
    {
        "CBS Records International": "sony music entertainment"
    },
    {
        ", , signed her up into their line-up. Tanto Amor composed by ": null
    },
    {
        "Lou Briel": "lou briel"
    },
    {
        ", was the first hit song of that album named  Fantasia  produced by Pepe Luis Soto. She then released another album  Historia de Amour  which included many top hits. In 42 she won the Buga Festival, in ": null
    },
    {
        "Buga": "buga, valle del cauca"
    },
    {
        ", ": null
    },
    {
        "Colombia": "colombia"
    },
    {
        " with a song that she wrote her self called Sí . Her next release in 42 ": null
    },
    {
        "Sueños": "sueños"
    },
    {
        ", continued her ascent as one of the most important and best selling female singers in Puerto Rico. This album marked a radical change in sound and image for Monge, moving towards the Latin pop tendencies of the time while keeping her interpretative delivery.     Monge continued her winning stride in the middle 42s, when she released what possibly is one of her greatest album ever:  Luz de Luna  . This album included her classics Te Veo Pasar , Señor Del Pasado , and El Poder del Amor , which was a cover of the popular song ": null
    },
    {
        "The Power of Love": "the power of love"
    },
    {
        " . With this album, she became the first Puerto Rican female singer to earn a ": null
    },
    {
        "gold record": "music recording sales certification"
    },
    {
        ".     She followed up that album with the equally successful  Laberinto de Amor  , which earned her another gold album and later went platinum. The album was nominated for a ": null
    },
    {
        "Grammy Award": "grammy award"
    },
    {
        ", years before the Latin Grammy was created. In this album, she sang a Spanish version of On My Own which is a song from the soundtrack of the famous Broadway musical  Les Misérables . Yolandita was a household name. This album earned her a Grammy nomination in the Best Latin Pop artist category. With this nomination she became the first Puerto Rican female singer to be nominated to the ": null
    },
    {
        "Grammy Music Awards": "grammy awards"
    },
    {
        ", joined by fellow Puerto Rican singer ": null
    },
    {
        "Lunna": "lunna"
    },
    {
        ", as well in the same category. The album also went gold in many countries including the United States.     In 42 she achieved multi platinum level sales with her album,  Vivencias . Yolandita considers this album the best and most important album of her career. This release included such songs as: Acariciame and Este Amor Que Hay Que Callar composed for her by the Spanish singer and author ": null
    },
    {
        "Braulio": "braulio"
    },
    {
        ". She became the first Puerto Rican singer to win a gold album record, a ": null
    },
    {
        "platinum record": "platinum record"
    },
    {
        " and a double platinum.     Yolandita was claimed by the Americas music magazine  Billboard  in 42 as The best-selling Latin artist of the year due to being the first Puerto Rican female artist to sell millions of records. She also was claimed by the international music press as The most important Latin singer of the decade . ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " traveled all the way to Puerto Rico to interview Yolandita because they consider her the most relevant artist of the Latin music industry and she was even compared with ": null
    },
    {
        "Madonna": "madonna"
    },
    {
        ". In the interview the reporter said: Yolandita has no plans to make the crossover, so Madonna can relax.         After the huge success of  Vivencias , she changed gears in terms of music style and released  Portfolio  in the summer of 42 with the help of Venezuelan singer ": null
    },
    {
        "Ricardo Montaner": "ricardo montaner"
    },
    {
        " which was one of the producers and songwriters. With Portfolio, she performed nine sold-out concerts at Puerto Ricos Centro de Bellas Artes , and at the Madison Square Garden. During her performances at the Centro de Bellas Artes, Yolandita became the first Latin performer, and one of the earliest recording artists, to use a wireless headset microphone, allowing her to dance while she sang.      After more than ten years at Sony Latin, Yolandita signed a multimillion-dollar recording contract with ": null
    },
    {
        "WEA-Latina": "wea latina"
    },
    {
        ", the first for a female pop artist in Puerto Rico. The first release was  Cara de Ángel , the follow up to  Portfolio . It contains the radio hits Sobreviviré , Viviré Sin Tí , and Entrega Total . In May 42 for the Cara de Angel Tour , Yolandita established a new record at the Performing Arts Center of Puerto Rico , becoming the biggest singer selling out all the concerts, without courtesy tickets, up to 42 concerts of the same tour, breaking her own record. Also in 42 Yolandita was invited by Spanish Tenor, ": null
    },
    {
        "Plácido Domingo": "plácido domingo"
    },
    {
        ", to be part of a Special Tribute to the artist ": null
    },
    {
        "Goya": "goya"
    },
    {
        ", the tribute was a special-release album. Yolandita also released her first Christmas album in 42 titled  Mi Mejor Regalo .     In 42 she became the first Puerto Rican female to land a commercial deal with ": null
    },
    {
        "Pepe Jeans": "pepe jeans"
    },
    {
        " London and also for Diet ": null
    },
    {
        "Pepsi": "pepsi"
    },
    {
        ". During that year, Monge released ": null
    },
    {
        "Fiebre de Luna": "fiebre de luna"
    },
    {
        ", along with a change of image. The hit album included compositions from Las Diego and produced the hit singles A Pesar del Tiempo and Como Puedes . She teamed with singer Ricardo Montaner to do a concert and they earned a ": null
    },
    {
        "Guinness World Records": "guinness world records"
    },
    {
        " as becoming the first singers to perform 42 concerts in 42 different cities - all in the same day. This could be done, using air transportation by helicopter. It was called: El Suceso .     In 42 Yolandita released the self-titled Yolandita, along with another change in image with long hair and a belly ring. Right after, Monge relocated to Colombia to act in ": null
    },
    {
        "telenovela": "telenovela"
    },
    {
        " alongside Puerto Rican actor ": null
    },
    {
        "Osvaldo Ríos": "osvaldo ríos"
    },
    {
        ". Yolandita was honored in 42 by the Puerto Rican Senate for her long career as a singer and actress. She also earned two of the most prestigious awards of the Latin music industry, Premios Lo Nuestro and Premios Tu Música. Also in 42 she participated in the annual music video special, produced by Banco Popular de Puerto Rico, dedicated to ": null
    },
    {
        "Pedro Flores": "pedro flores"
    },
    {
        ", which usually includes only the most important and international singers the island has to offer.     In 42 Yolandita released  Mi Encuentro , which included ": null
    },
    {
        "bomba": "bomba"
    },
    {
        " and ": null
    },
    {
        "plena": "plena"
    },
    {
        ", a Puerto Rican rhythm. The album was a hit and cemented the singers ability to tacke any kind of music. The singer returned with another change of image and to her signature strong ballads with the album  Siento  in early 42 The album was certified gold and included the hits Dime , Arriesgaré la Piel and Mala Sangre .         In late 42 Yolandita released her second live album  Yolandita En Vivo  recorded at Centro de Bellas Artes of Puerto Rico. It included many of her early hits and the duet Sobrevivire with her second daughter Paola González.     Yolandita took some time off and returned with  Sexto Sentido  in 42 which included a collaboration with her eldest daughter and singer ": null
    },
    {
        "Noelia": "noelia"
    },
    {
        ". This album was produced by Colombian producer ": null
    },
    {
        "Kike Santander": "kike santander"
    },
    {
        " and was certified gold. After that, the singer took a lengthy hiatus from recording to pursue other acting opportunities.     In 42 she conducted her TV show for ": null
    },
    {
        "Telemundo": "telemundo"
    },
    {
        " called De Mujeres . In this variety show she performed comedy skits and interviewed both local and international stars. She also sang with ": null
    },
    {
        "Julieta Venegas": "julieta venegas"
    },
    {
        ", ": null
    },
    {
        "Luis Fonsi": "luis fonsi"
    },
    {
        ", ": null
    },
    {
        "Lucecita Benítez": "lucecita benítez"
    },
    {
        ", ": null
    },
    {
        "Víctor Manuelle": "víctor manuelle"
    },
    {
        ", ": null
    },
    {
        "Chucho Avellanet": "chucho avellanet"
    },
    {
        ", ": null
    },
    {
        "Gilberto Santa Rosa": "gilberto santa rosa"
    },
    {
        ", ": null
    },
    {
        "La India": "la india"
    },
    {
        ", ": null
    },
    {
        "Gisselle": "gisselle"
    },
    {
        ", ": null
    },
    {
        "Lissette": "lissette"
    },
    {
        ", ": null
    },
    {
        "Tito Nieves": "tito nieves"
    },
    {
        ", ": null
    },
    {
        "Dagmar": "dagmar"
    },
    {
        ", ": null
    },
    {
        "Andy Montañez": "andy montañez"
    },
    {
        ", ": null
    },
    {
        "Danny Rivera": "danny rivera"
    },
    {
        ", and many more. These performances were once-in-a-lifetime duets that graced Puerto Ricos silver screen and kept the captive audience that followed the show wanting more.     After five years of not releasing a new album, Monge released on June 42 42 her album  Demasiado Fuerte . It debuted number one in Billboard Latin Pop Albums making her return to music one of the greatest comebacks ever seen in the Latin Market. The album was produced by José Luis Pagán and Jorge Luis Piloto. Also, the album included the hits Y Todavia and the title track, Demasiado Fuerte , both of which were remixed in ": null
    },
    {
        "reggaeton": "reggaeton"
    },
    {
        " style and became hits in the urban radio stations in Puerto Rico and the Latin communities in United States. In November 42 Yolandita returned to Centro de Bellas Artes with five sold-out concerts in support of the  Demasiado Fuerte  album. The singer received the best reviews of her career with those performances, which included duets with guest ": null
    },
    {
        "Glenn Monroig": "glenn monroig"
    },
    {
        ".     On October 42 42 Monge debuted the single ": null
    },
    {
        "Mala": "mala"
    },
    {
        " .  Immediately, on November 42 42 Yolandita released the album  Mala , produced once again by José Luis Pagán and following the same musical and lyrical style as her previous  Demasiado Fuerte . This album contains the song Oportunidad Perdida featuring ": null
    },
    {
        "Víctor Manuelle": "víctor manuelle"
    },
    {
        ", which was re-recorded with Anthony Ríos in bachata style. Also, the song ": null
    },
    {
        "Mala": "mala"
    },
    {
        " was remixed in ": null
    },
    {
        "reggaeton": "reggaeton"
    },
    {
        " style featuring Ivy Queen and in salsa style featuring La India. The song Una y Otra Vez was remixed in ": null
    },
    {
        "reggaeton": "reggaeton"
    },
    {
        " style featuring Divino.     After the success of those radio remixes, Yolandita recorded a remix single with ": null
    },
    {
        "reggaeton": "reggaeton"
    },
    {
        " artist ": null
    },
    {
        "Tito el Bambino": "tito el bambino"
    },
    {
        " called El Amor , which used her same-titled smash hit from the 42s to his version. The song made it to the 42 spot in the ": null
    },
    {
        "Hot Latin Songs": "hot latin songs"
    },
    {
        " Billboard Chart.     On September 42 42 Yolandita debuted at Coliseo de Puerto Rico in the concert 42 Años de Vivencias, celebrating the twenty year anniversary of the release of her iconic album  Vivencias . She performed the vast majority of her hits of the 42s, 42s, and 42s, as well as her current repertoire. Soon after, Yolandita returned to Centro de Bellas Artes in April 42 for a once-in-a-lifetime sold-out concert accompanied by the Philharmonic Orchestra of Puerto Rico, as part of the thirty year anniversary celebration of the venue. All the songs were deconstructed and performed acoustically.     During 42 Yolandita was one of three judges in Idol Puerto Rico, along with her husband ": null
    },
    {
        "Carlos Topy Mamery": "carlos mamery"
    },
    {
        " and ": null
    },
    {
        "Ricardo Montaner": "ricardo montaner"
    },
    {
        " during the second season of the program.     On November 42 42 Yolandita released her new album ": null
    },
    {
        "Más Para Dar": "más para dar"
    },
    {
        ", with lyrics written by herself and José Luis Pagán. The album was produced by José Luis Pagán and it follows the same musical and lyrical style as her previous records. Yolandita returned to Coliseo de Puerto Rico for the Más Para Dar Tour on March 42 42 Beginning in the Dominican Republic, this concert tour visited cities in the United States, Puerto Rico and Latin America. In the concerts at Santo Domingo, Yolandita shared the stage with Danny Rivera.     On December 42 42 her husband and manager of more than twenty years, ": null
    },
    {
        "Carlos Topy Mamery": "carlos mamery"
    },
    {
        ", died of a massive heart attack. The funeral was held on December 42 42 alongside hundreds of fans, friends and family members. After that tragedy, Yolandita retired from public view for the following months of 42     On September 42 42 Yolandita returned to the concert stage after nine months of mourning at Coliseo de Puerto Rico for Latidos de mi Corazón , a tribute to her late husband ": null
    },
    {
        "Carlos Topy Mamery": "carlos mamery"
    },
    {
        ". She performed some of her hits and her new digital single ": null
    },
    {
        "Sin Tí": "sin tí"
    },
    {
        ", a song written by Las Diego, as well as other love songs from other artists. Her children, Imanol and Paola, joined her on stage for two songs, as well as some relatives of the Mamery and Monge families for the encore. On May 42 42 she presented the concert Latidos de mi Corazón at the Lehman Center for the Performing Arts in New York for her many fans there.     Yolandita recorded a jazz version of the Latin American standard Cuando Vuelva A Tu Lado for Humberto Ramírezs new album Bohemia Jazz, released on January 42 42 The album contains other songs performed by Nydia Caro, Chucho Avellanet, Dagmar, Michelle Brava, Andy Montañez and Carola Ausbury. The singer was one of many artists that performed at the Fiestas de la Calle San Sebastián in San Juan, Puerto Rico in 42 42 & 42     On May 42 42 & 42 42 Yolandita teamed for the first time with ": null
    },
    {
        "Lissette Alvarez": "lissette alvarez"
    },
    {
        " for a three sold-out performances at Centro de Bellas Artes of ": null
    },
    {
        "Caguas": "caguas"
    },
    {
        " for the concert Emociones . She sang her most beloved hits along with duets with ": null
    },
    {
        "Lissette Alvarez": "lissette alvarez"
    },
    {
        ". The singers performed together the hits Hoy Vine Con Ella , Cantaré , El Amor and Gracias a la Vida , as well as sharing a medley of both their greatest hits.     The singer remains active throughout the year performing in concerts and festivals in Puerto Rico and other Latin American countries.       Monge has had a very distinguished acting career, shes acted in more than ten Spanish soap operas, as well as various theatre plays and TV shows. Among the telenovelas, she acted in: Vida , , La Mentira , Poquita Cosa , Escándalo  , and ": null
    },
    {
        "Ave de Paso": "ave de paso"
    },
    {
        " , where she played the main role, and sang the theme song: Nunca Te Diré Adiós , composed for her by ": null
    },
    {
        "Lou Briel": "lou briel"
    },
    {
        ". This song was a big hit in 42 and it was included in a Special Edition Album: Yolandita Monge Live from New York. She also acted in the original version of the Colombian mega-hit soap opera,  La Viuda de Blanco  along with ": null
    },
    {
        "Osvaldo Ríos": "osvaldo ríos"
    },
    {
        ", ": null
    },
    {
        "Maria Helena Doehring": "maria helena doehring"
    },
    {
        ", ": null
    },
    {
        "Jorge Enrique Abello": "jorge enrique abello"
    },
    {
        " and Danilo Santos. From 42 & ndash;42 this soap opera was translated in more than 42 languages. Her theatrical debut was in La Visita de la Bestia, which is a Spanish version of  Extremities , and she got good reviews from the press by playing the very dramatic main role. She also earned international recognition playing the Greek-soprano, ": null
    },
    {
        "Maria Callas": "maria callas"
    },
    {
        ", in the Spanish version of the ": null
    },
    {
        "Tony Award": "tony award"
    },
    {
        " winner play  Master Class  in 42 for the Latin community in the United States and Latin America. Yolandita made all the critics bow when they saw her rendition of the late-diva. A year later she landed the lead female role in the musical La Verdadera Historia de Pedro Navaja , opposite ": null
    },
    {
        "Gilberto Santa Rosa": "gilberto santa rosa"
    },
    {
        ". For her performance as Diana la Maromera , in this musical, she got good reviews. In 42 Monge headlined the TV movie Ocho años de Dolor , where she played a woman kidnnaped by the famous Puerto Rican serial killer and fugitive of the law ": null
    },
    {
        "Toño Bicicleta": "toño bicicleta"
    },
    {
        ". Yolanditas most recent acting role was in the Puerto Rican movie Mujeres sin Hombres , in 42 She joined ": null
    },
    {
        "Sully Diaz": "sully diaz"
    },
    {
        " and ": null
    },
    {
        "Claribel Medina": "claribel medina"
    },
    {
        " in this story about 42 women and the revenge of men. After that in 42 Yolandita starred in the first episode of the Telemundo TV Series called  Extremos . In it she played the roles of twin sister. The reviews of Yolanditas acting role were good in this dramatic role. The critics indicated that ...When it comes to acting, Yolandita can be intense and excellent as she is as a singer... . Most recently, in 42 she joined the cast of Malas and in 42 she performed alongside other actresses in  The Vagina Monologues .       Here is a partial list of Yolanditas awards, honors and recognitions over the years.      42: Buga Song Festival - Won for the song Si.   42: The first Puerto Rican female singer to earn a ": null
    },
    {
        "Gold record": "music recording sales certification"
    },
    {
        ".   42: Nomination. ": null
    },
    {
        "Grammy Award for Best Latin Pop Album": "grammy award for best latin pop album"
    },
    {
        " for  Laberinto de Amor .   42: The best-selling Latin artist of the year, according to ": null
    },
    {
        "Billboard Magazine": "billboard magazine"
    },
    {
        ".   42: Nomination for ": null
    },
    {
        "Premio Lo Nuestro": "premio lo nuestro"
    },
    {
        " Best Female Ballad/Pop Singer   42: Paoli Award for Best Video of The Year for the video clip Por ti.   42: The first Puerto Rican female singer to earn a ": null
    },
    {
        "Platinum record": "platinum record"
    },
    {
        ".   42: The first artist selling out all the concerts, up to 42 concerts of the same tour.   42: ": null
    },
    {
        "ACE Awards": "ace awards"
    },
    {
        " - Special Award.   42: ": null
    },
    {
        "Guinness World Record": "guinness world record"
    },
    {
        " - The first singer to perform 42 concerts in 42 different cities in the same day.   42: The Puerto Rican Senate Special Honor for her long career as a singer and actress.   42: Tu Musica Award - Projection in abroad.   42: Quijote Award for Best Musical Transmission .   42: Cassandra International Award.   42: A Star in the Boulevard of Stars in ": null
    },
    {
        "Santo Domingo": "santo domingo"
    },
    {
        ".   42: Tu Musica Awards - Best Ballad Record by a female singer .   42: An Award for her Trajectory as an Actress from The PR Government Florida District.   42 Dance Show of the Year: Yolandita Monge Sexto Sentido Concert.   42 Our pride Award - Institute of New York City.   42 Puerto Rican Pride Honor - 42st anniversary of Comité Puertorriqueño – a Puerto Rican heritage organization   42 Nomination. Spanish ": null
    },
    {
        "GLAAD Media Awards": "glaad media awards"
    },
    {
        " for Outstanding Music Artist.   42 Nomination. ": null
    },
    {
        "Billboard Latin Music Awards": "billboard latin music awards"
    },
    {
        " for Best Latin Pop Female Album for Demasiado Fuerte.   42 Finalist. Special Tu Mundo Award in ": null
    },
    {
        "Billboard Latin Music Awards": "billboard latin music awards"
    },
    {
        "          ": null
    }
]