[
    {
        "The  are a ": null
    },
    {
        "professional baseball": "professional baseball"
    },
    {
        " team based in ": null
    },
    {
        "Bunkyo, Tokyo": "bunkyo, tokyo"
    },
    {
        ", Japan. The team competes in the ": null
    },
    {
        "Central League": "central league"
    },
    {
        " in ": null
    },
    {
        "Nippon Professional Baseball": "nippon professional baseball"
    },
    {
        ". They play their home games in the ": null
    },
    {
        "Tokyo Dome": "tokyo dome"
    },
    {
        ", opened in 42 The teams owner is the ": null
    },
    {
        "Yomiuri Group": "yomiuri shimbun"
    },
    {
        ", a media ": null
    },
    {
        "conglomerate": "conglomerate"
    },
    {
        " which includes two newspapers and a television network.     The Giants are the oldest team among the current Japanese professional teams. Their main rivalry is with the ": null
    },
    {
        "Hanshin Tigers": "hanshin tigers"
    },
    {
        ", a team especially popular in the ": null
    },
    {
        "Kansai": "kansai"
    },
    {
        " region. The Yomiuri Giants are regarded as The ": null
    },
    {
        "New York Yankees": "new york yankees"
    },
    {
        " of Japan due to their widespread popularity, past dominance of the league, and polarizing effect on fans.     The English-language press occasionally calls the team the Tokyo Giants , but that name has not been in use in Japan for decades.  Instead, the team is officially known by the name of its corporate owner, just like the ": null
    },
    {
        "Hanshin Tigers": "hanshin tigers"
    },
    {
        " and ": null
    },
    {
        "Orix Buffaloes": "orix buffaloes"
    },
    {
        ". The team is often referred by fans and in news headlines and tables simply as Kyojin , instead of the usual corporate owners name or the English nickname.     The Yomiuri Giants name and uniforms were based on the ": null
    },
    {
        "New York Giants": "new york giants"
    },
    {
        ". The teams colors are the same colors worn by the National Leagues Giants . The stylized lettering on the teams jerseys and caps is similar to the fancy lettering used by the Giants when they played in New York in the 42s, although during the 42s the Yomiuri Giants modernized their lettering to follow the style worn by the San Francisco Giants.           The team began in 42 as The Great Japan Tokyo Baseball Club , a team of all-stars organized by media mogul ": null
    },
    {
        "Matsutarō Shōriki": "matsutarō shōriki"
    },
    {
        " that matched up against an American All-Star team that included ": null
    },
    {
        "Babe Ruth": "babe ruth"
    },
    {
        ", ": null
    },
    {
        "Jimmie Foxx": "jimmie foxx"
    },
    {
        ", ": null
    },
    {
        "Lou Gehrig": "lou gehrig"
    },
    {
        ", and ": null
    },
    {
        "Charlie Gehringer": "charlie gehringer"
    },
    {
        ". While prior Japanese all-star contingents had disbanded, Shōriki went pro with this group, playing in an independent league.       In 42 with the formation of the ": null
    },
    {
        "Japanese Baseball League": "japanese baseball league"
    },
    {
        ", the team changed its name to  Tokyo Kyojin . It won eight league championships under that name from 42–42 including at one point six championships in a row.     Pitcher ": null
    },
    {
        "Victor Starffin": "victor starffin"
    },
    {
        ", nicknamed the blue-eyed Japanese , starred for the team until 42 One of the leagues premier pitchers, he won two MVP awards and a ": null
    },
    {
        "Best Nine": "best nine award"
    },
    {
        " award, and won at least 42 games in six different years, winning a league record 42 games in 42 He followed his record-setting performance with another 42 wins in 42 Pitcher ": null
    },
    {
        "Eiji Sawamura": "eiji sawamura"
    },
    {
        " co-starred with Starffin on the Kyojin. He pitched the first ": null
    },
    {
        "no-hitter": "no-hitter"
    },
    {
        " in Japanese pro baseball, on September 42 42 as well as two others. In 42 he went 4242 with a 42 ": null
    },
    {
        "earned run average": "earned run average"
    },
    {
        ". From 42 to 42 Sawamura had a record of 4242 42 strikeouts, and a 42 ERA. Sawamura enlisted in the ": null
    },
    {
        "Japanese Imperial Army": "japanese imperial army"
    },
    {
        " in 42 and was killed in battle when his ship was torpedoed near the end of World War II.     Outfielder ": null
    },
    {
        "Haruyasu Nakajima": "haruyasu nakajima"
    },
    {
        " was a featured hitter during the franchises first decade-and-a-half, and as ": null
    },
    {
        "player-manager": "player-manager"
    },
    {
        " led the Kyojin to a championship in 42 ": null
    },
    {
        "Tetsuharu Kawakami": "tetsuharu kawakami"
    },
    {
        " was a team fixture from 42–42 winning the batting title five times, two home run crowns, three RBI titles, and had six titles for the most hits in a season. He was the first player in Japanese pro baseball to achieve 42 hits and was named the leagues MVP three times. Leadoff man ": null
    },
    {
        "Shosei Go": "shosei go"
    },
    {
        " starred for the team from 42–42 winning league MVP in 42 Only 42-foot42 and 42 pounds, he was nicknamed The Human Locomotive due to his speed.     Pitcher ": null
    },
    {
        "Hideo Fujimoto": "hideo fujimoto"
    },
    {
        " pitched for the team for 42 seasons from 42–42 He holds the Japanese records for lowest career ERA and seasonal ERA , as well as best all-time winning percentage . He threw two career ": null
    },
    {
        "no-hitters": "no-hitters"
    },
    {
        ", including the first ": null
    },
    {
        "perfect game": "perfect game"
    },
    {
        " in professional baseball. In addition, he served as the Giants ": null
    },
    {
        "player-manager": "player-manager"
    },
    {
        " in 42 and part of 42       In 42 the team became the Yomiuri Giants, winning the final JBL championship in 42 . From 42–42 the Giants played at ": null
    },
    {
        "Korakuen Stadium": "korakuen stadium"
    },
    {
        ", moving to their current home the ": null
    },
    {
        "Tokyo Dome": "tokyo dome"
    },
    {
        " in 42     In 42 the Giants were one of the founding members of ": null
    },
    {
        "Nippon Professional Baseball": "nippon professional baseball"
    },
    {
        ", joining the ": null
    },
    {
        "Central League": "central league"
    },
    {
        ".     Slugger ": null
    },
    {
        "Noboru Aota": "noboru aota"
    },
    {
        " starred for the Giants from 42–42 winning the home run championship twice, and hitting a home run in the 42 ": null
    },
    {
        "Japan Series": "japan series"
    },
    {
        ", when the Giants defeated the ": null
    },
    {
        "Nankai Hawks": "nankai hawks"
    },
    {
        " 42 games to 42 for their first NPB championship. Hawaiian ": null
    },
    {
        "Wally Yonamine": "wally yonamine"
    },
    {
        " was the first American to play ": null
    },
    {
        "professional baseball in Japan": "professional baseball in japan"
    },
    {
        " after World War II when he joined the Giants in 42 A multi-skilled ": null
    },
    {
        "outfielder": "outfielder"
    },
    {
        ", as a Giant Yonamine was a member of four ": null
    },
    {
        "Japan Series Championship": "japan series"
    },
    {
        " teams, the ": null
    },
    {
        "Central League": "central league"
    },
    {
        " Most Valuable Player": "nippon professional baseball most valuable player award"
    },
    {
        " in 42 a consecutive seven-time ": null
    },
    {
        "Best Nine Award": "best nine award"
    },
    {
        " winner , an eleven-time All-Star, and a three-time batting champion.     The team was the Central League champion every year from 42–42 winning the ": null
    },
    {
        "Japan Series": "japan series"
    },
    {
        " championship in 42 but losing four consecutive Japan Series thereafter.     World career ": null
    },
    {
        "home run": "home run"
    },
    {
        " record holder ": null
    },
    {
        "Sadaharu Oh": "sadaharu oh"
    },
    {
        " starred for the Giants from 42–42 and fellow ": null
    },
    {
        "Hall of Famer": "japanese baseball hall of fame"
    },
    {
        " Shigeo Nagashima": "shigeo nagashima"
    },
    {
        " played for the team from 42–42 The Giants lineup, consisting of Oh batting third and Nagashima batting fourth, was nicknamed the ON Hou,  as the two players emerged as the best hitters in the league. Now the teams manager, ": null
    },
    {
        "Tetsuharu Kawakami": "tetsuharu kawakami"
    },
    {
        " led the Giants to nine consecutive ": null
    },
    {
        "Japan Series": "japan series"
    },
    {
        " championships from 42–42 ": null
    },
    {
        "Whiting, Robert": "robert whiting"
    },
    {
        ",  ,  Japan Times , 42 November 42 p. 42 retrieved 42 November 42 and Oh and Nagashima dominated the batting titles during this period. During his career, Oh was a five-time batting champion and fifteen-time home-run champion, and won the ": null
    },
    {
        "Central League": "nippon professional baseball most valuable player award"
    },
    {
        " most valuable player award nine times. Nagashima won the season MVP award five times, and the ": null
    },
    {
        "Best Nine Award": "best nine award"
    },
    {
        " every single year of his career . Future Hall of Famer ": null
    },
    {
        "Tsuneo Horiuchi": "tsuneo horiuchi"
    },
    {
        " pitched for the team during its heyday, from 42–42 The renowned left-hander ": null
    },
    {
        "Masaichi Kaneda": "masaichi kaneda"
    },
    {
        " pitched for the team from 42–42 later having his number retired by the Giants.     ": null
    },
    {
        "Shigeo Nagashima": "shigeo nagashima"
    },
    {
        " was appointed manager of the Giants almost immediately after his retirement in 42 staying in that position until 42 After a couple of down years the Giants re-assumed their dominant position in the Central League, winning league championships in 42 and 42 Sadaharu Oh rejoined the team as manager from 42 to 42 Nagashima returned as Giants manager from 42–42 winning Japan Series championships in 42 42 and 42     Outfielder ": null
    },
    {
        "Hideki Matsui": "hideki matsui"
    },
    {
        " starred for the Giants for ten seasons in the 42s and early 42s before migrating to ": null
    },
    {
        "Major League Baseball": "major league baseball"
    },
    {
        ". He was a three-time NPB ": null
    },
    {
        "MVP": "most valuable player"
    },
    {
        ", leading his team to four ": null
    },
    {
        "Japan Series": "japan series"
    },
    {
        ", winning three titles , and earning the popular nickname ": null
    },
    {
        "Godzilla": "godzilla"
    },
    {
        " . He also made nine consecutive All-Star Games and led the league in ": null
    },
    {
        "home run": "home run"
    },
    {
        "s and ": null
    },
    {
        "RBI": "rbi"
    },
    {
        " Tetsuharu Kawakami": "tetsuharu kawakami"
    },
    {
        " Tetsuharu Kawakami": "tetsuharu kawakami"
    },
    {
        ", ": null
    },
    {
        "Shigeru Chiba": "shigeru chiba"
    },
    {
        " and ": null
    },
    {
        "Noboru Aoki": "noboru aoki"
    },
    {
        " Suguru Egawa": "suguru egawa"
    },
    {
        " Tatsunori Hara": "tatsunori hara"
    },
    {
        " Shigeo Nagashima": "shigeo nagashima"
    },
    {
        ", former stars and manager for long period, in ": null
    },
    {
        "Tokyo Dome": "tokyo dome"
    },
    {
        " Tomoyuki Sugano": "tomoyuki sugano"
    },
    {
        "               :ja::読売ジャイアンツの年度別成績一覧": ":ja::読売ジャイアンツの年度別成績一覧"
    },
    {
        "   Retrieved date on 42 October 42                                                           ,                                 Note: GP Games played, W Wins, L Losses, T Ties, % Win Percentage             Due to the Yomiuri companys vast influence in Japan as a major media conglomerate, the Giants are successfully marketed to the Japanese people as Japans Team . In fact, for some years the Giants uniforms had Tokyo on the jersey instead of Yomiuri or Giants , seeming to imply that the Giants represent the vast metropolis and geopolitical center of Japan, even though the ": null
    },
    {
        "Yakult Swallows": "yakult swallows"
    },
    {
        " are also based in Tokyo and three other teams play in the ": null
    },
    {
        "Greater Tokyo Area": "greater tokyo area"
    },
    {
        ". This bandwagon appeal has been compared with the marketability of the ": null
    },
    {
        "New York Yankees": "new york yankees"
    },
    {
        ", ": null
    },
    {
        "Real Madrid": "real madrid c.f."
    },
    {
        ", and ": null
    },
    {
        "Manchester United": "manchester united f.c."
    },
    {
        ", except that support for the Giants nearly exceeds 42% of those polled, while in the United States and England, support is judged to be between 42 and 42 percent for the ": null
    },
    {
        "New York Yankees": "new york yankees"
    },
    {
        " and Manchester United, respectively. Correspondingly, fans of other professional baseball teams in Japan are often openly derisive and contemptuous of the Giants bandwagon marketing tactics, and an anti-Giants movement exists in protest of the near hegemony established by the Yomiuri Giants. Whiting, You Gotta have Wa.     It has also long been alleged that the Giants rely on underhanded tactics to recruit the best players, involving bribes to players and amateur coaches, or using their influence on the governing council of Japanese professional baseball to pass rules that favors their recruiting efforts. This may be one explanation for the Giants abundance of success in league play. In August 42 Yomiuri president ": null
    },
    {
        "Tsuneo Watanabe": "tsuneo watanabe"
    },
    {
        " resigned after it was revealed that the club had violated scouting rules by paying ¥42 million to pitching prospect Yasuhiro Ichiba. Ten months later, Watanabe was hired as chairman of the Yomiuri corporation. ": null
    },
    {
        "Kyodo News": "kyodo news"
    },
    {
        ",  ,  Japan Times , 42 November 42 p. 42 In 42  Asahi Shimbun  discovered that the Giants had violated NPB rules by secretly paying pitcher ": null
    },
    {
        "Takahiko Nomaguchi": "takahiko nomaguchi"
    },
    {
        " while he was still an amateur playing in Japans corporate league.  Metropolis , The Small Print: Groovin to the Olympic Beat , 42 42–42 April 42 p. 42     In 42 the Giants played the ": null
    },
    {
        "Japan national baseball team": "japan national baseball team"
    },
    {
        " in an unofficial goodwill game before the ": null
    },
    {
        "World Baseball Classic": "world baseball classic"
    },
    {
        ".         As of October 42 before this game was played, the game difference with the ": null
    },
    {
        "Hanshin Tigers": "hanshin tigers"
    },
    {
        " was 42, this game resulting 42 to 42 victory over Tigers on October 42 ": null
    },
    {
        "infielder": "infielder"
    },
    {
        " Shozo Doi": "shozo doi"
    },
    {
        " and ": null
    },
    {
        "catcher": "catcher"
    },
    {
        " Masaaki Mori": "masaaki mori"
    },
    {
        " are each 42 hits and Doi takes two point homerun in fifth innings from Kenji Furusawa. And Giants 42 to 42 win from ": null
    },
    {
        "Nankai Hawks": "nankai hawks"
    },
    {
        "  in ": null
    },
    {
        "Japan Series": "japan series"
    },
    {
        ", starter ": null
    },
    {
        "Kazumi Takahashi": "kazumi takahashi"
    },
    {
        " contribution this season.   Retrieved 42 November 42       In 42 American ": null
    },
    {
        "Randy Bass": "randy bass"
    },
    {
        ", playing for the ": null
    },
    {
        "Hanshin Tigers": "hanshin tigers"
    },
    {
        ", came into the last game of the season against the Oh-managed Giants with 42 home runs, one short of manager ": null
    },
    {
        "Sadaharu Oh": "sadaharu oh"
    },
    {
        "s single-season record of 42 Bass was intentionally walked four times on four straight pitches each time, leading Bass to famously hold his bat upside down. Bass reached over the plate on the fifth occasion and batted the ball into the outfield for a single. After the game, Oh denied ordering his pitchers to walk Bass, but Keith Comstock, an American pitcher for the Giants, later stated that an unnamed Giants coach had threatened a fine of $42 for every strike that any Giants pitcher threw to Bass. The magazine Takarajima investigated the incident and reported that the Giants front office had likely ordered the team not to allow Bass an opportunity to tie or break Ohs record. For the most part the Japanese media remained silent on the incident as did league commissioner Takeso Shimoda. Whiting, Robert,  ,  Japan Times , October 42 42 p. 42 A similar situation to this was presented in the 42 movie  Mr. Baseball .       For the first time in Japanese professional baseball history, the game with Giants and ": null
    },
    {
        "Chunichi Dragons": "chunichi dragons"
    },
    {
        " ranked at the same percentage of the league warfare winning percentage, became a winning battle in which they competed directly in the final game, Giants won 42 to 42 against Dragons, and takes Championship on ": null
    },
    {
        "Central League": "central league"
    },
    {
        " and ": null
    },
    {
        "Japan Series": "japan series"
    },
    {
        " on this season.       The team accelerates at a stretch when winning in nine consecutive hits of professional baseball tie-record in one inning of July 42 against ": null
    },
    {
        "Hiroshima Carp": "hiroshima carp"
    },
    {
        "s game.   Both main starter, ": null
    },
    {
        "Masaki Saito": "masaki saito"
    },
    {
        ", ": null
    },
    {
        "Dominica": "dominica"
    },
    {
        "n ": null
    },
    {
        "Balvino Galvez": "balvino galvez"
    },
    {
        " raised 42 won games the most wins on this season, ": null
    },
    {
        "relief pitcher": "relief pitcher"
    },
    {
        ", ": null
    },
    {
        "Mario Brito": "mario brito"
    },
    {
        " who reinforced during the season and Hirofumi Kono supported the team, ": null
    },
    {
        "Hideki Matsui": "hideki matsui"
    },
    {
        " was very success as a main season. Rookies ": null
    },
    {
        "Toshihisa Nishi": "toshihisa nishi"
    },
    {
        " and ": null
    },
    {
        "Takayuki Shimizu": "takayuki shimizu"
    },
    {
        " were active and generation change was also decided admirably. At the time I reached the biggest 42 game difference in league history and accomplished the league championship. Although defeated lost 42 to 42 games by ": null
    },
    {
        "Orix BlueWave": "orix bluewave"
    },
    {
        "  on ": null
    },
    {
        "Japan Series": "japan series"
    },
    {
        ".       Despite losing five consecutive games from the opening game on March 42 On May 42 banned drug was detected by Luis Gonzalez, the player was suspended for 42 year from Nippon Professional Baseball due to doping violation, and on the following day he decided to cancel the contract with the same player. At the time, October reached the biggest 42 game difference in league history and accomplished the league championship, from September 42th, including the 42rd consecutive victory with the Hanshin Tigers, they recorded a total of 42 consecutive victories for the first time in 42 years, followed by 42 to 42 winning the final direct confrontation on October 42 contributors player, including ": null
    },
    {
        "Shinnosuke Abe": "shinnosuke abe"
    },
    {
        ", ": null
    },
    {
        "Yoshinobu Takahashi": "yoshinobu takahashi"
    },
    {
        ", ": null
    },
    {
        "Michihiro Ogasawara": "michihiro ogasawara"
    },
    {
        ", ": null
    },
    {
        "Alex Ramirez": "alex ramirez"
    },
    {
        ", ": null
    },
    {
        "Seth Adam Greisinger": "seth greisinger"
    },
    {
        ", ": null
    },
    {
        "Marc Jason Kroon": "marc kroon"
    },
    {
        ", ": null
    },
    {
        "Hisanori Takahashi": "hisanori takahashi"
    },
    {
        ", ": null
    },
    {
        "Tetsuya Utsumi": "tetsuya utsumi"
    },
    {
        ", Although defeated lost 42 to 42 games by ": null
    },
    {
        "Saitama Seibu Lions": "saitama seibu lions"
    },
    {
        " in Japan Series.       On 42 November 42 Giants general manager Hidetoshi Kiyotake was fired by the Yomiuri organization for defamation of the team and Yomiuri newspaper group . Kiyotake had recommended that Kaoru Okazaki be retained as the teams 42 head coach. After Yomiuri chairman ": null
    },
    {
        "Tsuneo Watanabe": "tsuneo watanabe"
    },
    {
        " ordered Kiyotake to replace Okazaki with ": null
    },
    {
        "Suguru Egawa": "suguru egawa"
    },
    {
        ", Kiyotake called a public press conference on 42 November 42 to complain about Watanabes interference in the clubs decision-making processes. Yomiuris response was to fire Kiyotake.     Okazaki was eventually selected to remain as the next seasons coach. The story made major headlines in the Japanese media. Nagata, Kazuaki,  ,  Japan Times , 42 November 42 p. 42 On 42 December 42 Kiyotake sued Yomiuri for ¥42 million for unfair dismissal and defamation and demanded that the company issue him a formal apology, printed in the Yomiuri Shimbun. ": null
    },
    {
        "Kyodo News": "kyodo news"
    },
    {
        ", Giants ex-boss Kiyotake sues Yomiuri ,  Japan Times , 42 December 42 p. 42 Yomiuri counter-sued Kiyotake for ¥42 million, saying that he had damaged the teams image. The suits, combined into one case, opened in Tokyo District Court on 42 February 42 Matsutani, Minoru,  ,  Japan Times , 42 February 42 p. 42       In 42 Japanese weekly  Shukan Bunshun  reported that current team manager ": null
    },
    {
        "Tatsunori Hara": "tatsunori hara"
    },
    {
        " had paid ¥42 million to a former ": null
    },
    {
        "Yakuza": "yakuza"
    },
    {
        " gangster in response to a threat to go public on an extra-marital affair that Hara had been involved in. The Yomiuri corporation admitted that the payout had been made, but sued Shukan Bunshun for insinuating that the incident had underworld connections. The suit is pending.  Metropolis , The Small Print: How Low Can You Go? , Issue 42 42 July – 42 August 42 p. 42       In 42 an investigation by the league found that three Giants pitchers: ": null
    },
    {
        "Shoki Kasahara": "shoki kasahara"
    },
    {
        ", ": null
    },
    {
        "Ryuya Matsumoto": "ryuya matsumoto"
    },
    {
        ", and ": null
    },
    {
        "Satoshi Fukuda": "satoshi fukuda"
    },
    {
        " had bet on NPB and other sporting events with underworld bookmakers. The Giants claimed that the three did not bet on Giants games. Placing wagers on baseball games or associating with criminal elements is expressly prohibited in the contracts that all NPB players must sign, a rule similar to Major League Baseballs Rule 42 in North America, intended to prevent a repeat of the ": null
    },
    {
        "Black Sox Scandal": "black sox scandal"
    },
    {
        " of 42 in Chicago, Illinois, USA. ": null
    },
    {
        "Kyodo News": "kyodo news"
    },
    {
        ",  ,  Japan Times , 42 October 42 On 42 November 42 the Giants organization terminated the contracts of all three players, with the league placing a indefinite disqualification on the players.          Active:   ": null
    },
    {
        "Taylor Jungmann": "taylor jungmann"
    },
    {
        "   Retired:   ": null
    },
    {
        "Takashi Kashiwada": "takashi kashiwada"
    },
    {
        "   Takahito Nomura": "takahito nomura"
    },
    {
        "   Masumi Kuwata": "masumi kuwata"
    },
    {
        "   Ken Kadokura": "ken kadokura"
    },
    {
        "   Hideki Matsui": "hideki matsui"
    },
    {
        "   Hideki Okajima": "hideki okajima"
    },
    {
        "   Hisanori Takahashi": "hisanori takahashi"
    },
    {
        "   Koji Uehara": "koji uehara"
    },
    {
        "                                                   ": null
    }
]