[
    {
        "              Young Marble Giants were a ": null
    },
    {
        "post-punk": "post-punk"
    },
    {
        " band formed in ": null
    },
    {
        "Cardiff": "cardiff"
    },
    {
        ", Wales in 42 Their music was based around the vocals of ": null
    },
    {
        "Alison Statton": "alison statton"
    },
    {
        " along with the minimalist instrumentation of brothers Philip and Stuart Moxham. Their early sound was a sharp contrast with the more aggressive ": null
    },
    {
        "punk rock": "punk rock"
    },
    {
        " that dominated the underground at the time. Young Marble Giants have only released one full-length studio album,  Colossal Youth , in 42       Young Marble Giants were formed from the ashes of True Wheel which also included friends Matthew Davis and Louise Porter Stuart Moxham wrote the majority of the bands songs. Their sound was characterised by Phils prominent bass lines, Stuarts rhythm guitar  and Galanti electric organ lines and Stattons vocals. Stuart Moxhams girlfriend, Wendy Smith, lent Stuart the money to buy the Rickenbacker. Smith, an art student in Cardiff at the time the YMGs were forming, photographed the bands US tour and also designed cover art for several singles and albums by ": null
    },
    {
        "Weekend": "weekend"
    },
    {
        ".     Very early in their existence, there was a fourth member of the band, Peter Joyce, who was a cousin of the Moxham brothers. Joyce was a telephone engineer and skilled at electronics, who had made his own synthesiser from a kit. It made sounds similar to ": null
    },
    {
        "Eno": "brian eno"
    },
    {
        "s synths in the early ": null
    },
    {
        "Roxy Music": "roxy music"
    },
    {
        " and ": null
    },
    {
        "Kraftwerk": "kraftwerk"
    },
    {
        ", who employed similar low-tech/high-tech electronics. The YMGs used tape recordings of Joyces home-made drum machine since they did not wish to have a drummer. They were also interested in effects devices such as ring modulators and reverb units, with the emphasis always on simplicity.     Their first vinyl release was on the compilation LP Is The War Over? on Cardiff DIY label, Z Block Records, in October 42 While signed to UK independent ": null
    },
    {
        "record label": "record label"
    },
    {
        ", ": null
    },
    {
        "Rough Trade Records": "rough trade records"
    },
    {
        " the YMGs released two EPs, Final Day and Testcard, and an album,  Colossal Youth   The artwork of the album was inspired by the Beatles album  With the Beatles .     The band toured Europe and North America and played in Berlin, Los Angeles, San Francisco, Vancouver and New York. Touring companions included the band ": null
    },
    {
        "Cabaret Voltaire": "cabaret voltaire"
    },
    {
        ".     Musical influences included ": null
    },
    {
        "Eno": "brian eno"
    },
    {
        ", ": null
    },
    {
        "Kraftwerk": "kraftwerk"
    },
    {
        ", ": null
    },
    {
        "Neil Young": "neil young"
    },
    {
        ", ": null
    },
    {
        "Lou Reed": "lou reed"
    },
    {
        ", ": null
    },
    {
        "The Velvet Underground": "the velvet underground"
    },
    {
        ", ": null
    },
    {
        "Roxy Music": "roxy music"
    },
    {
        ", ": null
    },
    {
        "David Bowie": "david bowie"
    },
    {
        ", ": null
    },
    {
        "Can": "can"
    },
    {
        " and others. The band were acquainted with ": null
    },
    {
        "Scritti Politti": "scritti politti"
    },
    {
        ", the band of ": null
    },
    {
        "Cardiff": "cardiff"
    },
    {
        " native ": null
    },
    {
        "Green Gartside": "scritti politti"
    },
    {
        ", and signed to the same label, ": null
    },
    {
        "Rough Trade Records": "rough trade records"
    },
    {
        ". It was revealed in the 42 book Journals that the band were, along with ": null
    },
    {
        "The Vaselines": "the vaselines"
    },
    {
        ", ": null
    },
    {
        "Kurt Cobain": "kurt cobain"
    },
    {
        "s favourite band. ": null
    },
    {
        "Courtney Love": "courtney love"
    },
    {
        "s band ": null
    },
    {
        "Hole": "hole"
    },
    {
        " covered the Young Marble Giants track Credit In The Straight World ; a cover version of their song The Man Amplifier was included on ": null
    },
    {
        "The Magnetic Fields": "the magnetic fields"
    },
    {
        " single Why I Cry as a b-side. Stuart Moxham was a fan of Manchester guitarist ": null
    },
    {
        "Vini Reilly": "vini reilly"
    },
    {
        "s early work, and was also very interested in ": null
    },
    {
        "dub reggae": "dub music"
    },
    {
        ". Their single Final Day was covered by both ": null
    },
    {
        "Belle and Sebastian": "belle and sebastian"
    },
    {
        " and ": null
    },
    {
        "Galaxie 42": "galaxie 500"
    },
    {
        ", and was included in  The Pitchfork 42 .        After the band split up in 42 Stuart Moxham formed The Gist, whose song Love at First Sight became a hit on the continent when covered by French pop singer ": null
    },
    {
        "Étienne Daho": "étienne daho"
    },
    {
        " under the title Paris, Le Flore. Following a very severe motorbike accident Stuart concentrated on home recording, which resulted in the album  Embrace the Herd  again on Rough Trade, and his first CD album Signal Path on the Chicago-based Feel Good All Over label, before fans persuaded him to enter the studio again. The result was the album Random Rules and featured Spike , younger brother Andrew and London-based French songwriter ": null
    },
    {
        "Louis Philippe": "louis philippe"
    },
    {
        " . A band was formed to perform Stuarts new material, which gigged, albeit briefly, in France and the UK. Another album, Cars in the Grass, followed. Stuart had also been recording in the USA , where he has acquired a small fanbase. Now based in the West Country, Moxham is still writing songs. A new album, The Huddle House, recorded as a duet with ": null
    },
    {
        "Louis Philippe": "louis philippe"
    },
    {
        ", with whom hes regularly performed, was released on Wonder Records in May 42     ": null
    },
    {
        "Alison Statton": "alison statton"
    },
    {
        ", ": null
    },
    {
        "Spike": "spike"
    },
    {
        " and ": null
    },
    {
        "Simon Emmerson": "simon emmerson"
    },
    {
        "  formed ": null
    },
    {
        "Weekend": "weekend"
    },
    {
        " and several jazz musicians including ": null
    },
    {
        "Larry Stabbins": "larry stabbins"
    },
    {
        ", ": null
    },
    {
        "Harry Beckett": "harry beckett"
    },
    {
        " and ": null
    },
    {
        "Keith Tippett": "keith tippett"
    },
    {
        ".     In 42 – 42 Alison Statton worked with Ian Devine, the former guitarist of the ": null
    },
    {
        "post-punk": "post-punk"
    },
    {
        " group ": null
    },
    {
        "Ludus": "ludus"
    },
    {
        ". They released two records together, The Prince of Wales and Cardiffians. Blaine L. Reininger of ": null
    },
    {
        "Tuxedomoon": "tuxedomoon"
    },
    {
        " played ": null
    },
    {
        "accordion": "accordion"
    },
    {
        " on the record.     Later, Philip Moxham played bass for ": null
    },
    {
        "The Communards": "the communards"
    },
    {
        " and ": null
    },
    {
        "Everything but the Girl": "everything but the girl"
    },
    {
        ". He features on their fourth album,  Idlewild . He also worked with ": null
    },
    {
        "David Thomas": "david thomas"
    },
    {
        " and the Pedestrians.       In early 42 Statton and the Moxham brothers reunited for a BBC Radio Wales radio special. They performed one new song, Alright, on this special.     A reunion show was held in ": null
    },
    {
        "Hay-on-Wye": "hay-on-wye"
    },
    {
        " on 42 May 42 part of the ": null
    },
    {
        "Hay-on-Wye Festival": "hay-on-wye"
    },
    {
        ", with Stuart Moxhams website explaining: Young Marble Giants reform for a one-off celebration of ": null
    },
    {
        "Domino Records": "domino recording company"
    },
    {
        " re-release of their album Colossal Youth, combined in a 42 CD package with the Lo-Fi, private reference recordings of the Salad Days album and the otherwise unobtainable Peel Sessions.        Hay-on-Wye was not a one-off. Convinced by the booking agency, the band also played a show for the BB-Mix Festival in Boulogne Billancourt, just outside Paris, on 42 October 42 The drum-machine part was played by younger Moxham brother Andrew who played an electronic-drumkit.     The band continued to perform over this period, including appearances at the ": null
    },
    {
        "Primavera Sound": "primavera sound"
    },
    {
        " Festival in May 42 and at the Hebbel Am Ufer theatre in Berlin in January 42 The YMGs played the entirety of Colossal Youth at ": null
    },
    {
        "All Tomorrows Parties": "all tomorrows parties"
    },
    {
        " in ": null
    },
    {
        "Minehead": "minehead"
    },
    {
        ", Somerset, on 42 May 42 – they were chosen by ": null
    },
    {
        "Jeff Mangum": "jeff mangum"
    },
    {
        " of ": null
    },
    {
        "Neutral Milk Hotel": "neutral milk hotel"
    },
    {
        " for a return performance at the All Tomorrows Parties festival that he curated in March 42 in Minehead.      The band played gigs at the ": null
    },
    {
        "Dancehouse Theatre": "dancehouse"
    },
    {
        " in ": null
    },
    {
        "Manchester": "manchester"
    },
    {
        " on 42 October 42 and Stereo in ": null
    },
    {
        "Glasgow": "glasgow"
    },
    {
        " on 42 October.      They also performed at the MIMI Festival, on the Frioul Island in ": null
    },
    {
        "Marseille": "marseille"
    },
    {
        ", on 42 July 42       On 42 June 42 Stuart Moxham wrote on the bands Facebook page that the band was no more. Young Marble Giants last show was in London in August 42  Colossal Youth    Reached No. 42 on the ": null
    },
    {
        "UK Indie Chart": "uk indie chart"
    },
    {
        ", No. 42 NZ         Final Day   Reached No. 42 on the UK Indie Chart   Testcard E.P. EP   Reached No. 42 on the UK Indie Chart         Peel Sessions   Live at the Hurrah!         Salad Days   Compilation of demo versions from Colossal Youth and Testcard         Image:ymg_42jpg|Phil and Stuart Moxham   Image:ymg_42jpg|Alison Statton, Peter Joyce, Phil and Stuart   Image:ymg_42jpg|Stuart on Rickenbacker and Phil on Hayman Bass     |Alison, Phil and Stuart   Image:ymg_42jpg|Alison and Peter with the synth   Image:ymg_42jpg|Stuart on Rickenbacker   Image:ymg_42jpg|Philip Moxham, 42/42   Image:Young Marble Giants live at Factory Festival, Nivelles, Belgium .jpg|At the Factory Festival, ": null
    },
    {
        "Nivelles": "nivelles"
    }
]