[
    {
        "      Young and Innocent  is a 1937 British ": null
    },
    {
        "crime": "crime film"
    },
    {
        " thriller film": "thriller film"
    },
    {
        " directed by ": null
    },
    {
        "Alfred Hitchcock": "alfred hitchcock"
    },
    {
        " and starring ": null
    },
    {
        "Nova Pilbeam": "nova pilbeam"
    },
    {
        " and ": null
    },
    {
        "Derrick De Marney": "derrick de marney"
    },
    {
        ". Based on the 1936 novel  A Shilling for Candles  by ": null
    },
    {
        "Josephine Tey": "josephine tey"
    },
    {
        ", the film is about a young man on the run from a murder charge who enlists the help of a woman who must put herself at risk for his cause. It is notable for an elaborately staged ": null
    },
    {
        "crane shot": "crane shot"
    },
    {
        " Hitchcock devised towards the end of the film, which identifies the real murderer.       On a stormy night, at a retreat on the English coast, Christine Clay , a successful actress, argues passionately with her jealous ex-husband Guy . Not accepting her ": null
    },
    {
        "Reno divorce": "nevadadivorce"
    },
    {
        " as valid, he accuses her of having an affair. Finally, she slaps him and he leaves the room. While they had been arguing, his eyes twitched violently; they continue to do so when, once outside, he turns angrily to look at the closed door behind him.     The next morning, Robert Tisdall  happens to be walking along the seaside when Christines dead body washes ashore. He recognizes her, and runs for help. Two young women arrive just in time to see him racing away from the corpse. The police quickly decide that Tisdall is the only suspect. Christine was strangled with the belt from a raincoat; his raincoat is missing and he says it was recently stolen. He admits knowing the victim from three years ago when he sold her a story, but the authorities assume the two have been having an affair. When they learn that she has left him money in her will , they feel they have hit upon motive and Tisdall is arrested.     Scotland Yard detectives grill him all night. The next morning, he faints and is revived with the aid of Erica Burgoyne , daughter of the local police Chief Constable. Tisdall is assigned an incompetent ": null
    },
    {
        "barrister": "barrister"
    },
    {
        ", and is taken into court for his formal arraignment. Doubting if his innocence will ever be established, he takes advantage of overcrowding in the courthouse to escape, wearing the barristers eyeglasses as a disguise. He gets away by riding on the ": null
    },
    {
        "running board": "running board"
    },
    {
        " of Ericas ": null
    },
    {
        "Morris car": "morris motors"
    },
    {
        ", revealing himself to her after the car runs out of petrol.     He helps push the car to a filling station, pays for petrol, and convinces her to give him a ride. Though she is initially fearful and unsure about her passenger, Erica eventually becomes convinced of his innocence and chooses to help him in any way that she can. They are eventually spotted together, forcing both to stay on the run from the police. Tisdall tries to prove his innocence by tracking down the stolen coat: if it still has its belt, the one found next to Christines body must not be his.     The duo succeed in tracing Tisdalls coat to Old Will , a homeless, but sociable, china-mender. But Will was not the thief; he was given the coat by a man with twitchy eyes. And when Will received the coat, its belt was missing.     Separated from the group, Erica is taken in by the police. Upon realizing that his daughter has fully allied herself with a murder suspect , her father chooses to resign his position as Chief Constable rather than arrest her for assisting a felon. Tisdall sneaks into their house to see her, intending to surrender next, but she mentions that the coat had a box of matches from the Grand Hotel in a pocket. Tisdall has never been there: perhaps the murderer has a connection to the hotel.     Erica and Will go to the hotel together, hoping to find him. In a memorably long, continuous sequence, the camera pans right from their entrance to the hotel and then moves forward from the very back of the hotel ": null
    },
    {
        "ballroom": "ballroom"
    },
    {
        ", finally focusing in extreme closeup on the drummer in a dance band performing in ": null
    },
    {
        "blackface": "blackface"
    },
    {
        ". His eyes are twitching. He is Guy.     Recognizing Old Will in the audience, and seeing policemen nearby , Guy performs poorly due to fear. He is berated by the ": null
    },
    {
        "conductor": "conducting"
    },
    {
        " and, during a break, takes medicine to try to control the twitching, but it makes him very sleepy. Eventually, in mid-performance, Guy passes out, drawing the attention of Erica and the police. Immediately after being revived and confronted, he confesses his crime and begins laughing hysterically.     Erica then tells her father that she thinks it is time they invited Tisdall to their home for dinner.        ": null
    },
    {
        "Nova Pilbeam": "nova pilbeam"
    },
    {
        " as Erica Burgoyne   ": null
    },
    {
        "Derrick De Marney": "derrick de marney"
    },
    {
        " as Robert Tisdall   ": null
    },
    {
        "Percy Marmont": "percy marmont"
    },
    {
        " as Colonel Burgoyne   ": null
    },
    {
        "Edward Rigby": "edward rigby"
    },
    {
        " as Old Will   ": null
    },
    {
        "Mary Clare": "mary clare"
    },
    {
        " as Ericas aunt Margaret   ": null
    },
    {
        "John Longden": "john longden"
    },
    {
        " as Inspector Kent   ": null
    },
    {
        "George Curzon": "george curzon"
    },
    {
        " as Guy   ": null
    },
    {
        "Basil Radford": "basil radford"
    },
    {
        " as Ericas uncle Basil   Pamela Carme as Christine Clay   ": null
    },
    {
        "George Merritt": "george merritt"
    },
    {
        " as Detective Sergeant Miller   J. H. Roberts as the Solicitor, Henry Briggs   ": null
    },
    {
        "Jerry Verno": "jerry verno"
    },
    {
        " as Lorry Driver   ": null
    },
    {
        "H. F. Maltby": "h. f. maltby"
    },
    {
        " as Police Sergeant   John Miller as Police Constable   ": null
    },
    {
        "Syd Crossley": "syd crossley"
    },
    {
        " as Policeman   ": null
    },
    {
        "Torin Thatcher": "torin thatcher"
    },
    {
        " as the owner of Nobbys Lodging House   ": null
    },
    {
        "Anna Konstam": "anna konstam"
    },
    {
        " as Bathing Girl  ": null
    },
    {
        "Bill Shine ": "bill shine"
    },
    {
        " as Manager of Toms Hat Cafe  ": null
    },
    {
        "Beatrice Varley": "beatrice varley"
    },
    {
        " as Accused Mans Wife             Variety  called the film a Pleasing, artless vehicle for Nova Pilbeam who was charming in her role and concluded, If the pic is not Hitchcocks best effort, it is by no means unworthy of him.  ": null
    },
    {
        "Frank Nugent": "frank nugent"
    },
    {
        " of  The New York Times  called it a crisply paced, excellently performed film.   The Monthly Film Bulletin  wrote, Innumerable small touches show Hitchcocks keen and penetrating observation and his knowledge of human nature. Comedy, romance, and thrills are skilfully blended.   Harrisons Reports  wrote, Good melodramatic entertainment. Because of the novelty of the story, the interesting plot developments, and the expert direction by Alfred Hitchcock, ones attention is held from the beginning to the end.  ": null
    },
    {
        "John Mosher": "john mosher"
    },
    {
        " of  The New Yorker  wrote that it was rather exasperating and disappointing to me. It begins with a smart murder, but wanders off through the English rural landscape in a fashion so lacking in that sound common sense we like in our mysteries, or like to feel is there anyhow, that ones interest fades away.      Aggregator ": null
    },
    {
        "Rotten Tomatoes": "rotten tomatoes"
    },
    {
        " reports 100% approval of Young and Innocent, with an average rating of 7.6/10.             Significant changes were made in adapting the book for the film. The novel is a ": null
    },
    {
        "whodunit": "whodunit"
    },
    {
        " centred on the Scotland Yard inspector, who is Teys regular character Alan Grant. The storyline involving Robert Tisdall, Erica Burgoyne, and the missing coat is similar to the film story, but in the novel it is only a subplot and ends part way through the book when Erica finds the coat and it is intact. Grant then focuses on other suspects, none of whom appear in the film. Christine Clay in the novel is not divorced, but is in an unconventional marriage to an aristocrat.       ": null
    },
    {
        "Alfred Hitchcocks cameo": "list of hitchcock cameo appearances"
    },
    {
        " is a signature occurrence in most of his films. He can be seen outside the courthouse, holding a camera, at 14 minutes into the film.       A frame-by-frame ": null
    },
    {
        "digital restoration": "film preservationdigital film preservation"
    },
    {
        " was done by ": null
    },
    {
        "Prasad Corporation": "prasad corporation"
    },
    {
        ", removing dirt, tears, scratches and other defects. ": null
    }
]