[
    {
        "     ; Ysbaddaden, Chief of Giants, is the primary ": null
    },
    {
        "antagonist": "antagonist"
    },
    {
        " of the ": null
    },
    {
        "Welsh": "welsh mythology"
    },
    {
        " romance  Culhwch ac Olwen . A vicious ": null
    },
    {
        "giant": "giants"
    },
    {
        " residing in a nigh unreachable castle, he is the father of ": null
    },
    {
        "Olwen": "olwen"
    },
    {
        " and uncle of ": null
    },
    {
        "Goreu fab Custennin": "goreu fab custennin"
    },
    {
        ".     ": null
    },
    {
        "Culhwchs": "culhwch"
    },
    {
        " father, ": null
    },
    {
        "King Cilydd son of Celyddon": "cilydd"
    },
    {
        ", loses his wife ": null
    },
    {
        "Goleuddydd": "goleuddydd"
    },
    {
        " after a difficult childbirth. When Cilydd remarries, the young Culhwch rejects his stepmothers attempt to pair him with his new stepsister. Offended, the new queen puts a curse on him so that he can marry no one besides the beautiful ": null
    },
    {
        "Olwen": "olwen"
    },
    {
        ", daughter of the ": null
    },
    {
        "giant": "giant"
    },
    {
        " Ysbaddaden. Though he has never seen her, Culhwch becomes infatuated with her, but his father warns him that he will never find her without the aid of his famous cousin ": null
    },
    {
        "Arthur": "king arthur"
    },
    {
        ". The young man immediately sets off to seek his kinsman. He finds him at his court in ": null
    },
    {
        "Celliwig": "celliwig"
    },
    {
        " in ": null
    },
    {
        "Cornwall": "cornwall"
    },
    {
        " and asks for support and assistance.     Arthur agrees to help, and sends six warriors to join Culhwch in his search for Olwen. They travel onwards until they come across the fairest of the castles of the world , and meet Ysbaddadens ": null
    },
    {
        "shepherd": "shepherd"
    },
    {
        " brother, Custennin. They learn that the castle belongs to Ysbaddaden, that he stripped Custennin of his lands and murdered the shepherds twenty-three children out of cruelty. Custennin set up a meeting between Culhwch and Olwen, and the maiden agrees to lead Culhwch and his companions to Ysbadaddens castle. The warrior ": null
    },
    {
        "Cai": "sir kay"
    },
    {
        " pledges to protect the twenty-fourth son, ": null
    },
    {
        "Goreu": "goreu fab custennin"
    },
    {
        ", with his life.     The knights attack the castle by stealth, killing the nine porters and the nine watchdogs, and enter the giants hall. Upon their arrival, Ysbaddaden attempts to kill Culhwch with a poison dart, but is outwitted and wounded, first by ": null
    },
    {
        "Bedwyr": "bedivere"
    },
    {
        ", then by the enchanter ": null
    },
    {
        "Menw": "menw"
    },
    {
        ", and finally by Culhwch himself. Eventually, Ysbaddaden relents, and agrees to give Culhwch his daughter on the condition that he complete a number of impossible tasks , including hunting the ": null
    },
    {
        "Twrch Trwyth": "twrch trwyth"
    },
    {
        " and recovering the exalted prisoner ": null
    },
    {
        "Mabon ap Modron": "mabon ap modron"
    },
    {
        ". Culhwch accepts the giants challenge and, with the help of Arthur and his knights, eventually completes the numerous tasks.     With the anoethau completed, Culhwch, Goreu and others who wished ill to Ysbaddaden Bencawr ride to his court. The giants beard, skin and ": null
    },
    {
        "flesh": "flesh"
    },
    {
        " are shaved off by Caw of Pictland and, accepting his humiliation and defeat, he is dragged away by Goreu, who avenges his murdered brothers by ": null
    },
    {
        "beheading": "decapitation"
    },
    {
        " the giant. Ysbaddadens head is placed on the spike of the citadel, Goreu claims his uncles lands as his own, and Olwen is free to marry her love.                ": null
    }
]