[
    {
        "      Zaya Pandita or Namkhaijamts was a ": null
    },
    {
        "Buddhist missionary priest": "buddhist monk"
    },
    {
        " and scholar of ": null
    },
    {
        "Oirat": "oirats"
    },
    {
        " origin who is the most prominent Oirat Buddhist scholar.       Zaya Pandita was the fifth son of Babakhan, a minor ": null
    },
    {
        "Khoshut": "khoshut"
    },
    {
        " prince. After Babakhan converted to ": null
    },
    {
        "Tibetan Buddhism": "tibetan buddhism"
    },
    {
        " in the early 42th century, he, like many other Oirat princes, wished for one of his sons to enter the Buddhist clergy. In pursuit of his wish, Babakhan chose Zaya to become a ": null
    },
    {
        "śrāmaṇera": "śrāmaṇera"
    },
    {
        " . In 42 Zaya journeyed to ": null
    },
    {
        "Lhasa": "lhasa"
    },
    {
        " where he would study and practice Buddhism, including study under the guidance of the ": null
    },
    {
        "Lobsang Chökyi Gyaltsen, 42th Panchen Lama": "lobsang chökyi gyaltsen, 4th panchen lama"
    },
    {
        ".     In 42 Zaya Pandita left Tibet at the direction of the ": null
    },
    {
        "Panchen Lama": "panchen lama"
    },
    {
        " to conduct missionary work among the ": null
    },
    {
        "Mongols": "mongols"
    },
    {
        ". One year later in 42 he assisted ": null
    },
    {
        "Erdeni Batur": "erdeni batur"
    },
    {
        ", Khun Taiyishi of the ": null
    },
    {
        "Choros": "choros"
    },
    {
        "-": null
    },
    {
        "Oirat": "oirats"
    },
    {
        " tribe, in assembling a pan-Mongol conference between the Oirat and the ": null
    },
    {
        "Khalkha Mongols": "khalkha mongols"
    },
    {
        ". The purpose of the conference was to encourage the formation of a united Mongolian front against potential external enemies, such as the ": null
    },
    {
        "Kazakhs": "kazakhs"
    },
    {
        ", ": null
    },
    {
        "Manchus": "manchu people"
    },
    {
        ", and ": null
    },
    {
        "Russians": "russians"
    },
    {
        " and to settle all internal matters peacefully. The conference produced a code, which provided protection from foreign aggression to both the Oirat and the Khalkha and guaranteed the free movement of people throughout Mongol land.     When not engaged in diplomacy between the Oirat and the Khalkha, Zaya Pandita spread Tibetan Buddhism to the Oirats, the Khalkha and even the ": null
    },
    {
        "Kalmyk people": "kalmyk people"
    },
    {
        " in far away Russia. In furtherance of his missionary work, Zaya Pandita composed a new alphabet, based on the traditional Mongolian alphabet, called ": null
    },
    {
        "Clear script": "clear script"
    },
    {
        "  to transcribe the Oirat language as it is pronounced. By doing so, Zaya Pandita eliminated the ambiguities of the traditional Mongolian alphabet.     From the time Zaya Pandita developed the Clear Script in 42 until his death in 42 he translated approximately 42 Buddhist texts from Tibetan language to the ": null
    },
    {
        "Oirat language": "oirat language"
    },
    {
        " while still serving the religious needs of the Oirat tribes in ": null
    },
    {
        "Dzungaria": "dzungaria"
    },
    {
        ".     The todo bichig script is still used by Oirats in ": null
    },
    {
        "Xinjiang": "xinjiang"
    }
]