[
    {
        "        Septimia Zenobia  was a third century queen of the ": null
    },
    {
        "Palmyrene Empire": "palmyrene empire"
    },
    {
        " in ": null
    },
    {
        "Syria": "syria"
    },
    {
        ". Many legends surround her ancestry; she was probably not a commoner and she married the ruler of the city, ": null
    },
    {
        "Odaenathus": "odaenathus"
    },
    {
        ". Her husband became king in 42 elevating ": null
    },
    {
        "Palmyra": "palmyra"
    },
    {
        " to supreme power in the ": null
    },
    {
        "Near East": "near east"
    },
    {
        " by defeating the ": null
    },
    {
        "Sassanians": "sassanians"
    },
    {
        " and stabilizing the Roman East. After Odaenathus assassination, Zenobia became the ": null
    },
    {
        "regent": "regent"
    },
    {
        " of her son ": null
    },
    {
        "Vaballathus": "vaballathus"
    },
    {
        " and held de facto power throughout his reign.     In 42 Zenobia launched an invasion which brought most of the Roman East under her sway and culminated with the annexation of ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ". By mid42 her realm extended from ": null
    },
    {
        "Ancyra": "ancyra"
    },
    {
        ", central ": null
    },
    {
        "Anatolia": "anatolia"
    },
    {
        ", to ": null
    },
    {
        "southern Egypt": "upper egypt"
    },
    {
        ", although she remained nominally subordinate to Rome. However, in reaction to Roman emperor ": null
    },
    {
        "Aurelian": "aurelian"
    },
    {
        "s campaign in 42 Zenobia declared her son emperor and assumed the title of empress . The Romans were victorious after heavy fighting; the queen was besieged in her capital and captured by Aurelian, who exiled her to Rome where she spent the remainder of her life.     Zenobia was a cultured monarch and fostered an intellectual environment in her court, which was open to scholars and philosophers. She was tolerant toward her subjects and protected religious minorities. The queen maintained a stable administration which governed a multicultural multiethnic empire. Zenobia died after 42 and many tales have been recorded about her fate. Her rise and fall have inspired historians, artists and novelists, and she is a patriotic symbol in Syria.          Zenobia was born c. 42–42 She bore the ": null
    },
    {
        "gentilicium": "roman naming conventionsnomen"
    },
    {
        " Septimia, and her native Palmyrene name was Bat-Zabbai . In ": null
    },
    {
        "Greek": "greek name"
    },
    {
        "—Palmyras ": null
    },
    {
        "diplomatic": "lingua franca"
    },
    {
        " and second language, used in many Palmyrene inscriptions—she used the name Zenobia . The philologist ": null
    },
    {
        "Wilhelm Dittenberger": "wilhelm dittenberger"
    },
    {
        " believed that the name Bat Zabbai underwent a detortum , resulting in the name Zenobia. In Palmyra, names such as Zabeida, Zabdila, Zabbai or Zabda were often transformed into Zenobios and Zenobia when written in ": null
    },
    {
        "Greek": "ancient greek"
    },
    {
        ". The historian ": null
    },
    {
        "Victor Duruy": "victor duruy"
    },
    {
        " believed that the queen used the Greek name as a translation of her native name in deference to her Greek subjects. The ninth-century historian ": null
    },
    {
        "al-Tabari": "al-tabari"
    },
    {
        ", in his highly fictionalized account, wrote that the queens name was Naila al-Zabba. ": null
    },
    {
        "Manichaean": "manichaeism"
    },
    {
        " sources called her Tadi .     No contemporary statues of Zenobia have been found in Palmyra or elsewhere, only inscriptions on statues bases survive, indicating that a statue of the queen once stood in the place; most known representations of Zenobia are the idealized portraits of her found on her coins. Palmyrene sculptures were normally impersonal, unlike Greek and Roman ones: a statue of Zenobia would have given an idea of her general style in dress and jewelry but would not have revealed her true appearance. British scholar ": null
    },
    {
        "William Wright": "william wright"
    },
    {
        " visited Palmyra toward the end of the nineteenth century in a vain search for a sculpture of the queen.     In addition to archaeological evidence, Zenobias life was recorded in different ancient sources but many are flawed or fabricated; the  Augustan History , a late-Roman collection of biographies, is the most notable source for the era. The author of the Augustan History invented many events and letters attributed to Zenobia in the absence of contemporary sources. Some Augustan History accounts are corroborated from other sources, and are more credible. The Byzantine chronicler ": null
    },
    {
        "Joannes Zonaras": "joannes zonaras"
    },
    {
        " is considered an important source for the life of Zenobia.       Palmyrene society was an amalgam of ": null
    },
    {
        "Semitic": "ancient semitic-speaking peoples"
    },
    {
        " tribes , and Zenobia cannot be identified with any one group; as a Palmyrene, she would have had Aramean and Arab ethnic origins. Information about Zenobias ancestry and immediate family connections is scarce and contradictory. Nothing is known about her mother, and her fathers identity is debated. Manichaean sources mention a Nafsha , sister of the queen of Palmyra , but those sources are confused and Nafsha may refer to Zenobia herself: it is doubtful that Zenobia had a sister.     Apparently not a commoner, she would have received an education appropriate for a noble Palmyrene girl. The Augustan History contains details of Zenobias early life, although their credibility is doubtful. According to the Augustan History, the queens hobby as a child was hunting, and, in addition to her Palmyrene Aramaic mother tongue, Zenobia was reportedly fluent in ": null
    },
    {
        "Egyptian": "egyptian language"
    },
    {
        " and Greek and spoke ": null
    },
    {
        "Latin": "latin"
    },
    {
        ". Around age 42 , Zenobia became the second wife of ": null
    },
    {
        "Odaenathus": "odaenathus"
    },
    {
        ", the ras of Palmyra. Noble families in Palmyra often intermarried, and it is probable that Zenobia and Odaenathus shared some ancestors.       Based on archaeological evidence, several men have been suggested by historians as Zenobias father:      Julius Aurelius Zenobius appears on a Palmyrene inscription as a ": null
    },
    {
        "strategos": "strategos"
    },
    {
        " of Palmyra in 42–42; based on the similarity of the names, Zenobius was suggested as Zenobias father by the ": null
    },
    {
        "numismatist": "numismatist"
    },
    {
        " Alfred von Sallet": ":de:alfred von sallet"
    },
    {
        " and others. The archaeologist ": null
    },
    {
        "William Waddington": "william waddington"
    },
    {
        " argued in favor of Zenobius identification as the father, assuming that his statue stood opposite to where the statue of the queen stood in ": null
    },
    {
        "Great Colonnade": "great colonnade at palmyra"
    },
    {
        ". However, the linguist ": null
    },
    {
        "Jean-Baptiste Chabot": "jean-baptiste chabot"
    },
    {
        " pointed out that Zenobius statue stood opposite to that of Odaenathus not Zenobia and rejected Waddingtons hypothesis. The only gentilicium appearing on Zenobias inscriptions was Septimia , and it cannot be proven that the queen changed her gentilicium to Septimia after her marriage.     One of Zenobias inscriptions recorded her as Septimia Bat-Zabbai, daughter of Antiochus . Antiochus identity is not definitively known: his ancestry is not recorded in Palmyrene inscriptions, and the name was not common in Palmyra. This, combined with the meaning of Zenobias Palmyrene name , led scholars such as ": null
    },
    {
        "Harald Ingholt": ":de:harald ingholt"
    },
    {
        " to speculate that Antiochus might have been a distant ancestor: the ": null
    },
    {
        "Seleucid": "list of seleucid rulers"
    },
    {
        " king ": null
    },
    {
        "Antiochus IV Epiphanes": "antiochus iv epiphanes"
    },
    {
        " or ": null
    },
    {
        "Antiochus VII Sidetes": "antiochus vii sidetes"
    },
    {
        ", whose wife was the ": null
    },
    {
        "Ptolemaic": "ptolemaic dynasty"
    },
    {
        " Cleopatra Thea": "cleopatra thea"
    },
    {
        ". In the historian ": null
    },
    {
        "Richard Stoneman": "richard stoneman"
    },
    {
        "s view, Zenobia would not have created an obscure ancestry to connect herself with the ancient ": null
    },
    {
        "Macedonian": "ancient macedonians"
    },
    {
        " rulers: if a fabricated ancestry were needed, a more direct connection would have been invented. According to Stoneman, Zenobia had reason to believe to be true . The historian ": null
    },
    {
        "Patricia Southern": "pat southern"
    },
    {
        ", noting that Antiochus was mentioned without a royal title or a hint of great lineage, believes that he was a direct ancestor or a relative rather than a Seleucid king who lived three centuries before Zenobia.     On the basis of Zenobias Palmyrene name, Bat Zabbai, her father may have been called Zabbai; alternatively, Zabbai may have been the name of a more distant ancestor. The historian ": null
    },
    {
        "Trevor Bryce": "trevor r. bryce"
    },
    {
        " suggests that she was related to ": null
    },
    {
        "Septimius Zabbai": "septimius zabbai"
    },
    {
        ", Palmyras garrison leader, and he may even have been her father. The archaeologist ": null
    },
    {
        "Charles Simon Clermont-Ganneau": "charles simon clermont-ganneau"
    },
    {
        ", attempting to reconcile the meaning of the name Bat Zabbai with the inscription mentioning the queen as daughter of Antiochus, suggested that two brothers, Zabbai and Antiochus, existed, with a childless Zabbai dying and leaving his widow to marry his brother Antiochus. Thus, since Zenobia was born out of a ": null
    },
    {
        "levirate marriage": "levirate marriage"
    },
    {
        ", she was theoretically the daughter of Zabbai, hence the name.     Ancient sourcesAugustan History, Zenobia is said to have been a descendant of ": null
    },
    {
        "Cleopatra": "cleopatra"
    },
    {
        " and claimed descent from the Ptolemies. According to the  Souda , a 42th-century ": null
    },
    {
        "Byzantine": "byzantine empire"
    },
    {
        " encyclopedia, after the Palmyrene conquest of Egypt, the sophist ": null
    },
    {
        "Callinicus of Petra": "callinicus"
    },
    {
        " wrote a ten-volume history of ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        " dedicated to Cleopatra. According to modern scholars, by Cleopatra Callinicus meant Zenobia. Apart from legends, there is no direct evidence in Egyptian coinage or ": null
    },
    {
        "papyri": "list of ancient egyptian papyri"
    },
    {
        " of a contemporary ": null
    },
    {
        "conflation": "conflation"
    },
    {
        " of Zenobia with Cleopatra. The connection may have been invented by Zenobias enemies to discredit her, but circumstantial evidence indicates that Zenobia herself made the claim; an imperial declaration once ascribed to Emperor ": null
    },
    {
        "Severus Alexander": "severus alexander"
    },
    {
        " was probably made by Zenobia in the name of her son ": null
    },
    {
        "Vaballathus": "vaballathus"
    },
    {
        ", where the king named Alexandria my ancestral city , which indicates a claim to Ptolemaic ancestry. Zenobias alleged claim of a connection to Cleopatra seems to have been politically motivated, since it would have given her a connection with Egypt and made her a legitimate successor to the Ptolemies throne. A relationship between Zenobia and the Ptolemies is unlikely, and attempts by classical sources to trace the queens ancestry to the Ptolemies through the Seleucids are ": null
    },
    {
        "apocrypha": "apocrypha"
    },
    {
        "l.       Although some Arab historians linked Zenobia to the ": null
    },
    {
        "Queen of Sheba": "queen of sheba"
    },
    {
        ", their accounts are apocryphal. Medieval Arabic traditions identify a queen of Palmyra named al-Zabba, and her most romantic account comes from al-Tabari. According to al-Tabari, she was an ": null
    },
    {
        "Amalekite": "amalekarabs as amalekites"
    },
    {
        "; her father was Amr ibn Zarib, an Amālīq ": null
    },
    {
        "sheikh": "sheikh"
    },
    {
        " who was killed by the ": null
    },
    {
        "Tanukhids": "tanukhids"
    },
    {
        ". Al-Tabari identifies a sister of al-Zabba as Zabibah . Jadhimah ibn Malik, the Tanukhid king who killed the queens father, was killed by al-Zabba. According to al-Tabari, al-Zabba had a fortress along the ": null
    },
    {
        "Euphrates": "euphrates"
    },
    {
        " and ruled Palmyra.     Al-Tabaris account does not mention the Romans, Odaenathus, Vaballathus or the Sassanians; focusing on the tribes and their relations, it is immersed in legends. Although the account is certainly based on the story of Zenobia, it is probably conflated with the story of a semi-legendary nomadic Arab queen . Al-Zabba fortress was probably ": null
    },
    {
        "Halabiye": "halabiye"
    },
    {
        ", which was restored by the historic Palmyrene queen and named Zenobia.            During the early centuries AD, Palmyra was a city subordinate to ": null
    },
    {
        "Rome": "roman empire"
    },
    {
        " and part of the province of ": null
    },
    {
        "Syria Phoenice": "phoenice"
    },
    {
        ". In 42 the Roman emperor ": null
    },
    {
        "Valerian": "valerian"
    },
    {
        " marched against the ": null
    },
    {
        "Sassanid Persia": "sassanid persia"
    },
    {
        "n monarch ": null
    },
    {
        "Shapur I": "shapur i"
    },
    {
        ", who had invaded the empires eastern regions; Valerian was ": null
    },
    {
        "defeated and captured": "battle of edessa"
    },
    {
        " near ": null
    },
    {
        "Edessa": "edessa"
    },
    {
        ". Odaenathus, ": null
    },
    {
        "formally loyal to Rome": "odaenathusrelation with rome"
    },
    {
        " and its emperor ": null
    },
    {
        "Gallienus": "gallienus"
    },
    {
        " , was declared king of Palmyra. Launching successful campaigns against Persia, he was crowned ": null
    },
    {
        "King of Kings": "king of kings"
    },
    {
        " of the East in 42 Odaenathus crowned his eldest son, ": null
    },
    {
        "Herodianus": "hairan i"
    },
    {
        ", as co-ruler. In addition to the royal titles, Odaenathus received many ": null
    },
    {
        "Roman titles": "odaenathusruler of the east"
    },
    {
        ", most importantly  corrector totius orientis , and ruled the Roman territories from the ": null
    },
    {
        "Black Sea": "black sea"
    },
    {
        " to ": null
    },
    {
        "Palestine": "palestine"
    },
    {
        ". In 42 when Zenobia was in her late twenties or early thirties, Odaenathus and his eldest son were assassinated while returning from a campaign.     The first inscription mentioning Zenobia as queen is dated two or three years after Odaenathus death, so exactly when Zenobia assumed the title queen of Palmyra is uncertain. However, she was probably designated as queen when her husband became king. As ": null
    },
    {
        "queen consort": "queen consort"
    },
    {
        ", Zenobia remained in the background and was not mentioned in the historical record. According to later accounts, including one by ": null
    },
    {
        "Giovanni Boccaccio": "giovanni boccaccio"
    },
    {
        ", she accompanied her husband on his campaigns. If the accounts of her accompanying her husband are true, according to Southern, Zenobia would have boosted the morale of the soldiers and gained political influence, which she needed in her later career.       According to the Augustan History, Odaenathus was assassinated by a cousin named ": null
    },
    {
        "Maeonius": "maeonius"
    },
    {
        ". In the Augustan History, Odaenathus son from his first wife was named Herodes and was crowned co-ruler by his father. The Augustan History claims that Zenobia conspired with Maeonius for a time because she did not accept her stepson as his fathers heir . The Augustan History does not suggest that Zenobia was involved in the events leading to her husbands murder, and the crime is attributed to Maeonius moral degeneration and jealousy. This account, according to the historian ": null
    },
    {
        "Alaric Watson": "alaric watson"
    },
    {
        ", can be dismissed as fictional. Although some modern scholarship suggests that Zenobia was involved in the assassination due to political ambition and opposition to her husbands pro-Roman policy, she continued Odaenathus policies during her first years on the throne.          In the Augustan History, Maeonius was emperor briefly before he was killed by his soldiers, however, no inscriptions or evidence exist for his reign. At the time of Odaenathus assassination, Zenobia might have been with her husband; according to chronicler ": null
    },
    {
        "George Syncellus": "george syncellus"
    },
    {
        ", he was killed near ": null
    },
    {
        "Heraclea Pontica": "heraclea pontica"
    },
    {
        " in ": null
    },
    {
        "Bithynia": "bithynia"
    },
    {
        ". The transfer of power seems to have been smooth, since Syncellus reports that the time from the assassination to the army handing the crown to Zenobia was one day. Zenobia may have been in Palmyra, but this would have reduced the likelihood of a smooth transition; the soldiers might have chosen one of their officers, so the first scenario of her being with her husband is more likely. The historical records are unanimous that Zenobia did not fight for supremacy and there is no evidence of delay in the transfer of the throne to Odaenathus and Zenobias son, the ten-year-old ": null
    },
    {
        "Vaballathus": "vaballathus"
    },
    {
        ". Although she never claimed to rule in her own right and acted as a regent for her son, Zenobia held the reins of power in the kingdom, and Vaballathus was kept in his mothers shadow, never exercising real power.       The Palmyrene monarchy was new; allegiance was based on loyalty to Odaenathus, making the transfer of power to a successor more difficult than it would have been in an established monarchy. Odaenathus tried to ensure the dynastys future by crowning his eldest son co-king, but both were assassinated. Zenobia, left to secure the Palmyrene succession and retain the loyalty of its subjects, emphasized the continuity between her late husband and his successor . Vaballathus assumed his fathers royal titles immediately, and his earliest known inscription records him as King of Kings.        Odaenathus controlled a large area of the Roman East, and held the highest political and military authority in the region, superseding that of the Roman provincial governors. His self-created status was formalized by Emperor Gallienus, who had little choice but to acquiesce. Odaenathuss power relative to that of the emperor and the central authority was unprecedented and elastic, but relations remained smooth until his death. His assassination meant that the Palmyrene rulers authority and position had to be clarified, which led to a conflict over their interpretation. The Roman court viewed Odaenathus as an appointed Roman official who derived his power from the emperor, but the Palmyrene court saw his position as hereditary. This conflict was the first step on the road to war between Rome and Palmyra.     Odaenathus Roman titles, such as  dux Romanorum, corrector totius orientis and  imperator totius orientis differed from his royal eastern ones because the Roman ranks were not hereditary. Vaballathus had a legitimate claim to his royal titles, but had no right to the Roman ones—especially corrector , which Zenobia used for her son in his earliest known inscriptions with King of Kings . Although the Roman emperors accepted the royal succession, the assumption of Roman military rank antagonized the empire. Emperor Gallienus may have decided to intervene in an attempt to regain central authority; according to the Augustan History, ": null
    },
    {
        "praetorian prefect": "praetorian prefect"
    },
    {
        " Aurelius Heraclianus": "aurelius heraclianus"
    },
    {
        " was dispatched to assert imperial authority over the east and was repelled by the ": null
    },
    {
        "Palmyrene army": "palmyrene army"
    },
    {
        ". The account is doubtful, however, since Heraclianus participated in Gallienus assassination in 42 Odaenathus was assassinated shortly before the emperor, and Heraclianus would have been unable to be sent to the East, fight the Palmyrenes and return to the West in time to become involved in the conspiracy against the emperor.        The extent of Zenobias territorial control during her early reign is debated; according to the historian ": null
    },
    {
        "Fergus Millar": "fergus millar"
    },
    {
        ", her authority was confined to Palmyra and ": null
    },
    {
        "Emesa": "emesa"
    },
    {
        " until 42 If this was the case, the events of 42  are extraordinary. It is more likely that the queen ruled the territories controlled by her late husband, a view supported by Southern and the historian ": null
    },
    {
        "Udo Hartmann": ":de:udo hartmann"
    },
    {
        ", and backed by ancient sources . The Augustan History also mentioned that Zenobia took control of the East during Gallienus reign. Further evidence of extended territorial control was a statement by the Byzantine historian ": null
    },
    {
        "Zosimus": "zosimus"
    },
    {
        ", who wrote that the queen had a residence in ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        ".     There is no recorded unrest against the queen accompanying her ascendance in ancient sources hostile to her, indicating no serious opposition to the new regime. The most obvious candidates for opposition were the Roman provincial governors, but the sources do not say that Zenobia marched on any of them or that they tried to remove her from the throne. According to Hartmann, the governors and military leaders of the eastern provinces apparently acknowledged and supported Vaballathus as the successor of Odaenathus. During Zenobias early regency, she focused on safeguarding the borders with Persia and pacifying the ": null
    },
    {
        "Tanukhids": "tanukhids"
    },
    {
        " in ": null
    },
    {
        "Hauran": "hauran"
    },
    {
        ". To protect the Persian borders, the queen fortified many settlements on the ": null
    },
    {
        "Euphrates": "euphrates"
    },
    {
        " . Circumstantial evidence exists for confrontations with the Sassanid Persians; probably in 42 Vaballathus assumed the ": null
    },
    {
        "victory title": "victory title"
    },
    {
        " of Persicus Maximus ; this may be connected to an unrecorded battle against a Persian army trying to control northern Mesopotamia.       In 42 while ": null
    },
    {
        "Claudius Gothicus": "claudius gothicus"
    },
    {
        " was defending the borders of ": null
    },
    {
        "Italy": "roman italy"
    },
    {
        " and the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        " against Germanic invasions, Zenobia was cementing her authority; Roman officials in the East were caught between loyalty to the emperor and Zenobias increasing demands for allegiance. The timing and rationale of the queens decision to use military force to strengthen her authority in the East is unclear; scholar ": null
    },
    {
        "Gary K. Young": "gary k. young"
    },
    {
        " suggested that Roman officials refused to recognize Palmyrene authority, and Zenobias expeditions were intended to maintain Palmyrene dominance. Another factor may have been the weakness of Roman central authority and its corresponding inability to protect the provinces, which probably convinced Zenobia that the only way to maintain stability in the East was to control the region directly. The historian ": null
    },
    {
        "Jacques Schwartz": "jacques schwartz"
    },
    {
        " tied Zenobias actions to her desire to protect Palmyras economic interests, which were threatened by Romes failure to protect the provinces. Also, according to Schwartz, the economic interests conflicted; ": null
    },
    {
        "Bostra": "bosra"
    },
    {
        " and Egypt received trade which would have otherwise passed through Palmyra. The Tanukhids near Bostra and the merchants of ": null
    },
    {
        "Alexandria": "alexandria"
    },
    {
        " probably attempted to rid themselves of Palmyrene domination, triggering a military response from Zenobia.        In the spring of 42 while Claudius was fighting the ": null
    },
    {
        "Goths": "goths"
    },
    {
        " in the mountains of ": null
    },
    {
        "Thrace": "thrace"
    },
    {
        ", Zenobia sent her general ": null
    },
    {
        "Septemius Zabdas": "zabdas"
    },
    {
        " to Bostra ; the queens timing seems intentional. In Arabia the Roman governor , ": null
    },
    {
        "Trassus": "trassus"
    },
    {
        " , confronted the Palmyrenes and was routed and killed. Zabdas ": null
    },
    {
        "sacked the city": "sack of bostra"
    },
    {
        ", and destroyed the temple of ": null
    },
    {
        "Zeus Hammon": "amungreece"
    },
    {
        ", the legions revered shrine. A Latin inscription after the fall of Zenobia attests to its destruction: The temple of Iuppiter Hammon, destroyed by the Palmyrene enemies, which  ... rebuilt, with a silver statue and iron doors . The city of ": null
    },
    {
        "Umm el-Jimal": "umm el-jimal"
    },
    {
        " may have also been destroyed by the Palmyrenes in connection with their efforts to subjugate the Tanukhids.     After his victory, Zabdas marched south along the ": null
    },
    {
        "Jordan Valley": "jordan rift valley"
    },
    {
        " and apparently met little opposition. There is evidence that ": null
    },
    {
        "Petra": "petra"
    },
    {
        " was attacked by a small contingent which penetrated the region. Arabia and ": null
    },
    {
        "Judaea": "judea"
    },
    {
        " were eventually subdued. Palmyrene dominance of Arabia is confirmed by many milestones bearing Vaballathus name. Syrian subjugation required less effort because Zenobia had substantial support there, particularly in Antioch, Syrias traditional capital. The invasion of Arabia coincided with the cessation of coin production in Claudius name by the Antiochean ": null
    },
    {
        "mint": "mint"
    },
    {
        ", indicating that Zenobia had begun tightening her grip on Syria. By November 42 the mint began issuing coinage in Vaballathus name.     The Arabian milestones presented the Palmyrene king as a Roman governor and commander, referring to him as  vir clarissimus rex consul imperator dux Romanorum. The assumption of such titles was probably meant to legitimize Zenobias control of the province, not yet a usurpation of the imperial title. Until now, Zenobia could say that she was acting as a representative of the emperor while the Roman monarch was preoccupied with struggles in Europe. Although Vaballathus use of the titles amounted to a claim to the imperial throne, Zenobia could still justify them and maintain a mask of subordination to Rome; an  imperator  was a commander of troops, not the equal of an emperor .        The invasion of Egypt is sometimes explained by Zenobias desire to secure an alternative trade route to the Euphrates, which was cut because of the war with Persia. This theory ignores the fact that the Euphrates route was only partially disrupted, and overlooks Zenobias ambition. The date of the campaign is uncertain; Zosimus placed it after the ": null
    },
    {
        "Battle of Naissus": "battle of naissus"
    },
    {
        " and before Claudius death, which sets it in the summer of 42 Watson, emphasizing the works of Zonaras and Syncellus and dismissing Zosimus account, places the invasion in October 42 . According to Watson, the occupation of Egypt was an opportunistic move by Zenobia . The appearance of the Palmyrenes on Egypts eastern frontier would have contributed to unrest in the province, whose society was fractured; Zenobia had supporters and opponents among local Egyptians.        The Roman position was worsened by the absence of Egypts ": null
    },
    {
        "prefect": "praetorian prefect"
    },
    {
        ", ": null
    },
    {
        "Tenagino Probus": "tenagino probus"
    },
    {
        ", who was battling pirates. According to Zosimus, the Palmyrenes were helped by an Egyptian general named Timagenes; Zabdas moved into Egypt with 42 soldiers, defeating an army of 42 Romans. After their victory, the Palmyrenes withdrew their main force and left a 42-soldier garrison. By early November, Tenagino Probus returned and assembled an army; he expelled the Palmyrenes and regained Alexandria, prompting Zabdas to return. The Palmyrene general aimed a thrust at Alexandria, where he seems to have had local support; the city fell into Zabdas hands, and the Roman prefect fled south. The last battle was at the ": null
    },
    {
        "Babylon Fortress": "babylon fortress"
    },
    {
        ", where Tenagino Probus took refuge; the Romans had the upper hand, since they chose their camp carefully. Timagenes, with his knowledge of the land, ambushed the Roman rear; Tenagino Probus committed suicide, and Egypt became part of Palmyra. In the Augustan History the ": null
    },
    {
        "Blemmyes": "blemmyes"
    },
    {
        " were among Zenobias allies, and Gary K. Young cites the Blemmyes attack and occupation of ": null
    },
    {
        "Coptos": "qift"
    },
    {
        " in 42 as evidence of a Palmyrene-Blemmyes alliance.     Only Zosimus mentioned two invasions, contrasting with many scholars who argue in favor of an initial invasion and no retreat . During the Egyptian campaign, Rome was entangled in a succession crisis between Claudius brother ": null
    },
    {
        "Quintillus": "quintillus"
    },
    {
        " and the general ": null
    },
    {
        "Aurelian": "aurelian"
    },
    {
        ". Egyptian ": null
    },
    {
        "papyri": "list of ancient egyptian papyri"
    },
    {
        " and coinage confirm Palmyrene rule in Egypt; the papyri stopped using the ": null
    },
    {
        "regnal year": "regnal year"
    },
    {
        "s of the emperors from September to November 42 due to the succession crisis. By December regnal dating was resumed, with the papyri using the regnal years of the prevailing emperor Aurelian and Zenobias son Vaballathus. Egyptian coinage was issued in the names of Aurelian and the Palmyrene king by November 42 There is no evidence that Zenobia ever visited Egypt.     Although the operation may have commenced under Septimius Zabbai, Zabdas second-in-command, the invasion of Asia Minor did not fully begin until Zabdas arrival in the spring of 42 The Palmyrenes annexed ": null
    },
    {
        "Galatia": "galatia"
    },
    {
        " and, according to Zosimus, reached ": null
    },
    {
        "Ancyra": "ancyra"
    },
    {
        ". ": null
    },
    {
        "Bithynia": "bithynia"
    },
    {
        " and the ": null
    },
    {
        "Cyzicus": "cyzicus"
    },
    {
        " mint remained beyond Zenobias control, and her attempts to subdue ": null
    },
    {
        "Chalcedon": "chalcedon"
    },
    {
        " failed. The Asia Minor campaign is poorly documented, but the western part of the region did not become part of the queens authority; no coins with Zenobia or Vaballathus portraits were minted in Asia Minor, and no royal Palmyrene inscriptions have been found. By August 42 Zabdas was back in Palmyra, with the ": null
    },
    {
        "Palmyrene empire": "palmyrene empire"
    },
    {
        " at its zenith.       Zenobia ruled an empire of different peoples; as a Palmyrene, she was accustomed to dealing with multilingual and multicultural diversity since she hailed from a city which embraced many cults. The queens realm was culturally divided into eastern-Semitic and ": null
    },
    {
        "Hellenistic": "hellenistic period"
    },
    {
        " zones; Zenobia tried to appease both, and seems to have successfully appealed to the regions ethnic, cultural and political groups. The queen projected an image of a Syrian monarch, a Hellenistic queen and a Roman empress, which gained broad support for her cause.        Zenobia turned her court into a center of learning, with many intellectuals and sophists reported in Palmyra during her reign. As academics migrated to the city, it replaced classical learning centers such as Athens for Syrians. The best-known court philosopher was ": null
    },
    {
        "Longinus": "cassius longinus"
    },
    {
        ", who arrived during Odaenathus reign and became Zenobias tutor in  paideia  . Many historians, including Zosimus, accused Longinus of influencing the queen to oppose Rome. This view presents the queen as malleable, but, according to Southern, Zenobias actions cannot be laid entirely at Longinus door . Other intellectuals associated with the court included ": null
    },
    {
        "Nicostratus of Trapezus": "nicostratus of trapezus"
    },
    {
        " and Callinicus of Petra.     From the second to the fourth centuries, Syrian intellectuals argued that ": null
    },
    {
        "Greek culture": "ancient greececulture"
    },
    {
        " did not evolve in ": null
    },
    {
        "Greece": "greece"
    },
    {
        " but was adapted from the ": null
    },
    {
        "Near East": "near east"
    },
    {
        ". According to ": null
    },
    {
        "Iamblichus": "iamblichus"
    },
    {
        ", the great Greek philosophers reused Near Eastern and Egyptian ideas. The Palmyrene court was probably dominated by this school of thought, with an intellectual narrative presenting Palmyras dynasty as a Roman imperial one succeeding the Persian, Seleucid and Ptolemaic rulers who controlled the region in which Hellenistic culture allegedly originated. Nicostratus wrote a history of the Roman Empire from ": null
    },
    {
        "Philip the Arab": "philip the arab"
    },
    {
        " to Odaenathus, presenting the latter as a legitimate imperial successor and contrasting his successes with the disastrous reigns of the emperors.     Zenobia embarked on several restoration projects in Egypt. One of the ": null
    },
    {
        "Colossi of Memnon": "colossi of memnon"
    },
    {
        " was reputed in antiquity to sing; the sound was probably due to cracks in the statue, with solar rays interacting with dew in the cracks. The historian ": null
    },
    {
        "Glen Bowersock": "glen bowersock"
    },
    {
        " proposed that the queen restored the colossus , which would explain third-century accounts of the singing and their disappearance in the fourth.        Zenobia followed the Palmyrene paganism, where a number of ": null
    },
    {
        "Semitic gods": "ancient semitic religion"
    },
    {
        ", with ": null
    },
    {
        "Bel": "bel"
    },
    {
        " at the head of the pantheon, were worshipped. Zenobia accommodated ": null
    },
    {
        "Christians": "early christianity"
    },
    {
        " and ": null
    },
    {
        "Jews": "history of the jews in the roman empire"
    },
    {
        ", and ancient sources made many claims about the queens beliefs; ": null
    },
    {
        "Manichaeist": "manichaeism"
    },
    {
        " sources alleged that Zenobia was one of their own. It is more likely, however, that Zenobia tolerated all cults in an effort to attract support from groups marginalized by Rome.     Bishop ": null
    },
    {
        "Athanasius of Alexandria": "athanasius of alexandria"
    },
    {
        " wrote that Zenobia did not hand over churches to the Jews to make them into synagogues ; although the queen was not a Christian, she understood the power of bishops in Christian communities. In Antioch—considered representative of political control of the East and containing a large Christian community—Zenobia apparently maintained authority over the church by bringing influential clerics, probably including ": null
    },
    {
        "Paul of Samosata": "paul of samosata"
    },
    {
        ", under her auspices. She may have bestowed on Paul the rank of  ducenarius  ; he apparently enjoyed the queens protection, which helped him keep the ": null
    },
    {
        "diocesan": "diocese"
    },
    {
        " church after he was removed from his office as ": null
    },
    {
        "bishop of Antioch": "roman diocese"
    },
    {
        " by a ": null
    },
    {
        "synod": "synod"
    },
    {
        " of bishops in 42     Judaism   Less than a hundred years after Zenobias reign, Athanasius of Alexandria called her a Jewess in his History of the Arians. In 42 archbishop ": null
    },
    {
        "John Chrysostom": "john chrysostom"
    },
    {
        " wrote that Zenobia was Jewish; so did a ": null
    },
    {
        "Syriac": "syriac christianity"
    },
    {
        " chronicler around 42 and bishop ": null
    },
    {
        "Bar Hebraeus": "bar hebraeus"
    },
    {
        " in the thirteenth century. According to French scholar ": null
    },
    {
        "Javier Teixidor": "javier teixidor"
    },
    {
        ", Zenobia was probably a ": null
    },
    {
        "proselyte": "proselyte"
    },
    {
        "; this explained her strained relationship with the rabbis. Teixidor believed that Zenobia became interested in ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        " when Longinus spoke about the philosopher ": null
    },
    {
        "Porphyry": "porphyry"
    },
    {
        " and his interest in the ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        ". Although ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        "ic sources were hostile to Palmyra because of Odaenathus suppression of the Jews of ": null
    },
    {
        "Nehardea": "nehardea"
    },
    {
        ", Zenobia apparently had the support of some Jewish communities . In ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        ", a plaque originally bearing an inscription confirming a grant of immunity to a Jewish synagogue in the last quarter of the first millennium BC by King Ptolemy Euergetes  was found. At a much later date, the plaque was re-inscribed to commemorate the restoration of immunity on the orders of the queen and king . Although it is undated, the letters of the inscription date to long after Cleopatra and Anthonys era; Zenobia and her son are the only candidates for a king and a queen ruling Egypt after the Ptolemies.     The historian ": null
    },
    {
        "E. Mary Smallwood": "e. mary smallwood"
    },
    {
        " wrote that good relations with the ": null
    },
    {
        "diaspora": "jewish diasporadispersion of the jews in the roman empire"
    },
    {
        " community did not mean that the Jews of Palestine were content with Zenobias reign, and her rule was apparently opposed in that region. The ": null
    },
    {
        "Terumot": "terumot"
    },
    {
        " tells the story of Rabbi Ammi and Rabbi Samuel bar Nahmani , who visited Zenobias court and asked for the release of a Jew detained on her orders. The queen refused, saying: Why have you come to save him? He teaches that your creator performs miracles for you. Why not let God save him?  During Aurelians destruction of Palmyra, Palestinian conscripts with clubs and cudgels played a vital role in Zenobias defeat and the destruction of her city.     There is no evidence of Zenobias birth as a Jew; the names of her and her husbands families belonged to the Aramaic ": null
    },
    {
        "onomasticon": "wikt:onomasticon"
    },
    {
        " . The queens alleged patronage of Paul of Samosata , may have given rise to the idea that she was a proselyte. Only Christian accounts note Zenobias Jewishness; no Jewish source mentions it.      Syrias administrative capital. Before the monarchy, Palmyra had the institutions of a Greek city  and was ruled by a senate which was responsible for most civil affairs. Odaenathus maintained Palmyras institutions, as did Zenobia; a Palmyrene inscription after her fall records the name of ": null
    },
    {
        "Septimius Haddudan": "septimius haddudan"
    },
    {
        ", a Palmyrene senator. However, the queen apparently ruled ": null
    },
    {
        "autocratically": "autocracy"
    },
    {
        "; ": null
    },
    {
        "Septimius Worod": "septimius worod"
    },
    {
        ", Odaenathus viceroy and one of Palmyras most important officials, disappeared from the record after Zenobias ascent. The queen opened the doors of her government to Eastern nobility. Zenobias most important courtiers and advisers were her generals, Septemius Zabdas and Septimius Zabbai; both of whom were generals under Odaenathus and received the  gentilicium  Septimius from him.     Odaenathus respected the Roman emperors privilege of appointing provincial governors, and Zenobia continued this policy during her early reign. Although the queen did not interfere in day-to-day administration, she probably had the power to command the governors in the organization of border security. During the rebellion, Zenobia maintained Roman forms of administration, but appointed the governors herself .     Agreement with Rome      Zenobia initially avoided provoking Rome by claiming for herself and her son the titles, inherited from Odaenathus, of subject of Rome and protector of its eastern frontier. After expanding her territory, she seems to have tried to be recognized as an imperial partner in the eastern half of the empire and presented her son as subordinate to the emperor. In late 42 Zenobia minted coinage bearing the portraits of Aurelian and Vaballathus; Aurelian was titled emperor , and Vaballathus king . The regnal year in early samples of the coinage was only Aurelians. By March 42 despite indicating Aurelian as the paramount monarch by naming him first in the dating formulae, the coinage also began bearing Vaballathus regnal year. By indicating in the coinage that Vaballathus reign began in 42 , Vaballathus appeared to be Aurelians senior colleague.     The emperors blessing of Palmyrene authority has been debated; Aurelians acceptance of Palmyrene rule in Egypt may be inferred from the ": null
    },
    {
        "Oxyrhynchus": "oxyrhynchus"
    },
    {
        " papyri, which are dated by the regnal years of the emperor and Vaballathus. No proof of a formal agreement exists, and the evidence is based solely on the joint coinage- and papyri-dating. It is unlikely that Aurelian would have accepted such power-sharing, but he was unable to act in 42 due to crises in the West. His apparent condoning of Zenobias actions may have been a ruse to give her a false sense of security while he prepared for war. Another reason for Aurelians tolerance may have been his desire to ensure a constant ": null
    },
    {
        "supply of Egyptian grain to Rome": "cura annonae"
    },
    {
        "; it is not recorded that the supply was cut, and the ships sailed to Rome in 42 as usual. Some modern scholars, such as ": null
    },
    {
        "Harold Mattingly": ":de:harold b. mattingly"
    },
    {
        ", suggest that Claudius Gothicus had concluded a formal agreement with Zenobia which Aurelian ignored.          An inscription, found in Palmyra and dated to August 42 called Zenobia eusebes ; this title, used by Roman empresses, could be seen as a step by the queen toward an imperial title. Another contemporary inscription called her sebaste, the Greek equivalent of empress , but also acknowledged the Roman emperor. A late42 Egyptian grain receipt equated Aurelian and Vaballathus, jointly calling them  Augusti . Finally, Palmyra officially broke with Rome; the Alexandrian and Antiochian mints removed Aurelians portrait from the coins in April 42 issuing new ": null
    },
    {
        "tetradrachm": "tetradrachm"
    },
    {
        "s in the names of Vaballathus and Zenobia .     The assumption of imperial titles by Zenobia signaled a ": null
    },
    {
        "usurpation": "usurper"
    },
    {
        ": independence from, and open rebellion against, Aurelian. The timeline of events and why Zenobia declared herself empress is vague. In the second half of 42 Aurelian marched to the East, but was delayed by the ": null
    },
    {
        "Goths": "goths"
    },
    {
        " in the Balkans; this may have alarmed the queen, driving her to claim the imperial title. Zenobia also probably understood the inevitability of open conflict with Aurelian, and decided that feigning subordination would be useless; her assumption of the imperial title was used to rally soldiers to her cause. Aurelians campaign seems to have been the main reason for the Palmyrene imperial declaration and the removal of his portrait from its coins.          The usurpation, which began in late March or early April 42 ended by August. Aurelian spent the winter of 42–42 in ": null
    },
    {
        "Byzantium": "byzantium"
    },
    {
        ", and probably crossed the ": null
    },
    {
        "Bosporus": "bosporus"
    },
    {
        " to Asia Minor in April 42 Galatia fell easily; the Palmyrene garrisons were apparently withdrawn, and the provincial capital of Ancyra was regained without a struggle. All the cities in Asia Minor opened their doors to the Roman emperor, with only ": null
    },
    {
        "Tyana": "tyana"
    },
    {
        " putting up some resistance before ": null
    },
    {
        "surrendering": "siege of tyana"
    },
    {
        "; this cleared the path for Aurelian to invade Syria, the Palmyrene heartland. A simultaneous expedition reached Egypt in May 42; by early June Alexandria was captured by the Romans, followed by the rest of Egypt by the third week of June. Zenobia seems to have withdrawn most of her armies from Egypt to focus on Syria—which, if lost, would have meant the end of Palmyra.     In May 42 Aurelian headed toward Antioch. About  north of the city, he defeated the Palmyrene army at the ": null
    },
    {
        "Battle of Immae": "battle of immae"
    },
    {
        ". As a result, Zenobia, who waited in Antioch during the battle, retreated with her army to Emesa. To conceal the disaster and make her flight safer, she spread reports that Aurelian was captured; Zabdas found a man who resembled the Roman emperor and paraded him through Antioch. The following day, Aurelian entered the city before marching south. After defeating a Palmyrene garrison south of Antioch, Aurelian continued his march to meet Zenobia in the ": null
    },
    {
        "Battle of Emesa": "battle of emesa"
    },
    {
        ".     The 42-strong Palmyrene army, assembled on the plain of Emesa, nearly routed the Romans. In an initial thrill of victory they hastened their advance, breaking their lines and enabling the Roman infantry to attack their flank. The defeated Zenobia headed to her capital on the advice of her war council, leaving her treasury behind. In Palmyra, the queen prepared for a siege; Aurelian blockaded food-supply routes, and there were probably unsuccessful negotiations. According to the Augustan History, Zenobia said that she would fight Aurelian with the help of her Persian allies; however, the story was probably fabricated and used by the emperor to link Zenobia to Romes greatest enemy. If such an alliance existed, a much-larger frontier war would have erupted; however, no Persian army was sent. As the situation worsened, the queen left the city for Persia intending on seeking help from Palmyras former enemy; according to Zosimus, she rode a female camel, the fastest of its breed and faster than any horse .          Aurelian, learning about Zenobias departure, sent a contingent which captured the queen before she could cross the Euphrates to Persia; Palmyra capitulated soon after news of Zenobias captivity reached the city in August 42 Aurelian sent the queen and her son to Emesa for trial, followed by most of Palmyras court elite . According to the Augustan History and Zosimus, Zenobia blamed her actions on her advisers; however, there are no contemporary sources describing the trial, only later hostile Roman ones. The queens reported cowardice in defeat was probably Aurelians propaganda; it benefited the emperor to paint Zenobia as selfish and traitorous, discouraging the Palmyrenes from hailing her as a hero. Although Aurelian had most of his prisoners executed, he spared the queen and her son to parade her in his planned ": null
    },
    {
        "triumph": "roman triumph"
    },
    {
        ".     Zenobias fate after Emesa is uncertain since ancient historians left conflicting accounts. Zosimus wrote that she died before crossing the Bosporus on her way to Rome; according to this account, the queen became ill or starved herself to death. The generally unreliable chronicler, ": null
    },
    {
        "John Malalas": "john malalas"
    },
    {
        ", wrote that Aurelian humiliated Zenobia by parading her through the eastern cities on a ": null
    },
    {
        "dromedary": "dromedary"
    },
    {
        "; in Antioch, the emperor had her chained and seated on a dais in the ": null
    },
    {
        "hippodrome": "hippodrome"
    },
    {
        " for three days before the citys populace. Malalas concluded his account by writing that Zenobia appeared in Aurelians triumph and was then beheaded.     Most ancient historians and modern scholars agree that Zenobia was displayed in Aurelians 42 triumph; Zosimus was the only source to say that the queen died before reaching Rome, making his account questionable. A public humiliation is a plausible scenario, since Aurelian would probably have wanted to publicize his suppression of the Palmyrene rebellion. Only Malalas, however, describes Zenobias beheading; according to the other historians, her life was spared after Aurelians triumph. The Augustan History recorded that Aurelian gave Zenobia a villa in ": null
    },
    {
        "Tibur": "tivoli, lazio"
    },
    {
        " near ": null
    },
    {
        "Hadrians Villa": "hadrians villa"
    },
    {
        ", where she lived with her children. Zonaras wrote that Zenobia married a nobleman, and Syncellus that she married a Roman senator. The house she reportedly occupied became a tourist attraction in Rome.          The queen owed her elevated position to her sons minority. To celebrate Herodianus coronation, a statue was erected in Palmyra in 42 According to the inscription on the base of the statue, it was commissioned by Septimius Worod, then the  duumviri  of Palmyra, and Julius Aurelius, the Queens ": null
    },
    {
        "procurator": "procurator"
    },
    {
        " . According to the historian ": null
    },
    {
        "David Potter": "david potter"
    },
    {
        ", Zenobia is the queen mentioned, and the inscription is an evidence for the usage of the title by her during Odaenathus lifetime. An inscription on a milestone on the road between Palmyra and Emesa, dated to Zenobias early reign, identifies her as illustrious queen, mother of the king of kings ; this was the first inscription giving her an official position. A lead token from Antioch also identifies Zenobia as queen.     The earliest confirmed attestation of Zenobia as queen in Palmyra is an inscription on the base of a statue erected for her by Zabdas and Zabbai, dated to August 42 and calling her most illustrious and pious queen . On an undated milestone found near ": null
    },
    {
        "Byblos": "byblos"
    },
    {
        ", Zenobia is titled Sebaste. The queen was never acknowledged as sole monarch in Palmyra, although she was the de facto sovereign of the empire; she was always associated with her husband or son in inscriptions, except in Egypt . According to her coins, the queen assumed the title of Augusta in 42 and reigned under the regnal name Septimia Zenobia Augusta.          In addition to Vaballathus, Zenobia had other children; the image of a child named ": null
    },
    {
        "Hairan": "hairan ii"
    },
    {
        " appears on a seal impression with that of his brother Vaballathus; no name of a mother was engraved and the seal is undated. Odaenathus son Herodianus is identified by Udo Hartmann with ": null
    },
    {
        "Hairan I": "hairan i"
    },
    {
        ", a son of Odaenathus who appears in Palmyrene inscriptions as early as 42 David S. Potter, on the other hand, suggested that Hairan II is the son of Zenobia and that he is Herodianus instead of Hairan I. Nathanael Andrade maintained that Hairan I, Herodianus, and Hairan II are the same person, rejecting the existence of a second Hairan.     A controversial Palmyrene inscription mentions the mother of the King ": null
    },
    {
        "Septimius Antiochus": "septimius antiochus"
    },
    {
        "; the name of the queen is missing, and Dittenberger refused to fill the gap with Zenobias name, but many scholars, such as ": null
    },
    {
        "Grace Macurdy": "grace macurdy"
    },
    {
        " considered that the missing name is Zenobia. Septimius Antiochus may have been Vaballathus younger brother, or was presented in this manner for political reasons; Antiochus was proclaimed emperor in 42 when Palmyra revolted against Rome for a second time. If Antiochus was a son of Zenobia, he was probably a young child not fathered by Odaenathus; Zosimus described him as insignificant, appropriate for a five-year-old boy. On the other hand, Macurdy, citing the language Zosimus used when he described him, considered it more plausible that Antiochus was not a son of Zenobia, but a family relation who used her name to legitimize his claim to the throne.     The names of Herennianus and Timolaus were mentioned as children of Zenobia only in the Augustan History. Herennianus may be a conflation of Hairan and Herodianus; Timolaus is probably a fabrication, although the historian ": null
    },
    {
        "Dietmar Kienast": ":de:dietmar kienast"
    },
    {
        " suggested that he might have been Vaballathus. According to the Augustan History, Zenobias descendants were Roman nobility during the reign of Emperor ": null
    },
    {
        "Valens": "valens"
    },
    {
        " . ": null
    },
    {
        "Eutropius": "eutropius"
    },
    {
        " and ": null
    },
    {
        "Jerome": "jerome"
    },
    {
        " chronicled the queens descendants in Rome during the fourth and fifth centuries. They may have been the result of a reported marriage to a Roman spouse or offspring who accompanied her from Palmyra; both theories, however, are tentative. Zonaras is the only historian to note that Zenobia had daughters; he wrote that one married Aurelian, who married the queens other daughters to distinguished Romans. According to Southern, the emperors marriage to Zenobias daughter is a fabrication. Another descent claim is the relation of saint ": null
    },
    {
        "Zenobius of Florence": "zenobius of florence"
    },
    {
        " with the queen; the Girolami banking family claimed descent from the fifth century saint, and the alleged relation was first noted in 42 The family also extended their roots to Zenobia by claiming that the saint was a descendant of her.       An evaluation of Zenobia is difficult; the queen was courageous when her husbands supremacy was threatened and by seizing the throne, she protected the region from a power vacuum after Odaenathus death. According to Watson, she made what Odaenathus left her a glittering show of strength . In the view of Watson, Zenobia should not be seen as a total powermonger, nor as a selfless hero fighting for a cause; according to the historian David Graf, She took seriously the titles and responsibilities she assumed for her son and that her program was far more ecumenical and imaginative than that of her husband Odenathus, not just more ambitious .     Zenobia has inspired scholars, academics, musicians and actors; her fame has lingered in the West, and is supreme in the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        ". As a heroic queen with a tragic end, she stands alongside Cleopatra and ": null
    },
    {
        "Boudica": "boudica"
    },
    {
        ". The queens legend turned her into an idol, that can be reinterpreted to accommodate the needs of writers and historians; thus, Zenobia has been by turns a freedom fighter, a hero of the oppressed and a national symbol. The queen is a female role model; according to the historian ": null
    },
    {
        "Michael Rostovtzeff": "michael rostovtzeff"
    },
    {
        ", ": null
    },
    {
        "Catherine the Great": "catherine the great"
    },
    {
        " liked to compare herself to Zenobia as a woman who created military might and an intellectual court. During the 42s, thanks to an Egyptian-based feminist press, Zenobia became an icon for womens-magazine readers in the Arabic-speaking world as a strong, nationalistic female leader.        Her most lasting legacy is in Syria, where the queen is a national symbol. Zenobia became an icon for ": null
    },
    {
        "Syrian nationalists": "syrian nationalism"
    },
    {
        "; she had a cult following among Western-educated Syrians, and an 42 novel by journalist ": null
    },
    {
        "Salim al-Bustani": ":ar:سليم البستاني"
    },
    {
        " was entitled Zenobia malikat Tadmor . Syrian nationalist ": null
    },
    {
        "Ilyas Matar": "ilyas matar"
    },
    {
        ", who wrote Syrias first history in Arabic in 42 , was fascinated by Zenobia and included her in his book. To Matar, the queen kindled hope for a new Zenobia who would restore Syrias former grandeur. Another history of Syria was written by ": null
    },
    {
        "Jurji Yanni": "jurji yanni"
    },
    {
        " in 42 in which Yanni called Zenobia a daughter of the fatherland , and yearned for her glorious past . Yanni described Aurelian as a tyrant who deprived Syria of its happiness and independence by capturing its queen.     In modern Syria, Zenobia is regarded as a patriotic symbol; her image appeared on ": null
    },
    {
        "banknotes": "syrian pound"
    },
    {
        ", and in 42 she was the subject of the television series ": null
    },
    {
        "Al-Ababeed": "al-ababeed"
    },
    {
        " . The series was watched by millions in the Arabic-speaking world. It examined the ": null
    },
    {
        "Israeli–Palestinian conflict": "israeli–palestinian conflict"
    },
    {
        " from a Syrian perspective, where the queens struggle symbolized the Palestinians struggle to gain the right of self-determination. Zenobia was also the subject of a biography by ": null
    },
    {
        "Mustafa Tlass": "mustafa tlass"
    },
    {
        ", Syrias former minister of defense and one of the countrys most prominent figures.     Myth, romanticism and popular culture According to Southern, The real Zenobia is elusive, perhaps ultimately unattainable, and novelists, playwrights and historians alike can absorb the available evidence, but still need to indulge in varied degrees of speculation.      She has been the subject of romantic and ideologically-driven biographies by ancient and modern writers. The Augustan History is the clearest example of an ideological account of Zenobias life, and its author acknowledged that it was written to criticize the emperor ": null
    },
    {
        "Gallienus": "gallienus"
    },
    {
        ". According to the Augustan History, Gallienus was weak because he allowed a woman to rule part of the empire and Zenobia was an abler sovereign than the emperor. The narrative changed as the Augustan History moved on to the life of ": null
    },
    {
        "Claudius Gothicus": "claudius gothicus"
    },
    {
        ", a lauded and victorious emperor, with the author characterizing Zenobias protection of the eastern frontier as a wise delegation of power by Claudius. When the Augustan History reached the biography of Aurelian, the authors view of Zenobia changed dramatically; the queen is depicted as a guilty, insolent, proud coward. Her wisdom was discredited and her actions deemed the result of manipulation by advisers.     Zenobias staunch beauty was emphasized by the author of the Augustan History, who ascribed to her feminine timidity and inconsistency . The queens sex posed a dilemma for the Augustan History since it cast a shadow on Aurelians victory. Its author ascribed many masculine traits to Zenobia to make Aurelian a conquering hero who suppressed a dangerous ": null
    },
    {
        "Amazon": "amazons"
    },
    {
        " queen. According to the Augustan History, Zenobia had a clear, manly voice, dressed as an emperor , rode horseback, was attended by ": null
    },
    {
        "eunuchs": "eunuchs"
    },
    {
        " instead of ": null
    },
    {
        "ladies-in-waiting": "lady-in-waiting"
    },
    {
        ", marched with her army, drank with her generals, was careful with money and pursued masculine hobbies such as hunting. ": null
    },
    {
        "Giovanni Boccaccio": "giovanni boccaccio"
    },
    {
        " wrote a fanciful 42th-century account of the queen in which she is a ": null
    },
    {
        "tomboy": "tomboy"
    },
    {
        " in childhood who preferred wrestling with boys, wandering in the forests and killing goats to playing like a young girl. Zenobias chastity was a theme of these romanticized accounts; according to the Augustan History, she disdained sexual intercourse and allowed Odaenathus into her bed only for conception. Her reputed chastity impressed some male historians; ": null
    },
    {
        "Edward Gibbon": "edward gibbon"
    },
    {
        " wrote that Zenobia surpassed Cleopatra in chastity and valor. According to Boccaccio, Zenobia safeguarded her virginity when she wrestled with boys as a child.     Seventeenth-century visitors to Palmyra rekindled the Western worlds romantic interest in Zenobia. This interest peaked during the mid-nineteenth century, when ": null
    },
    {
        "Lady Hester Stanhope": "lady hester stanhope"
    },
    {
        " visited Palmyra and wrote that its people treated her like the queen; she was reportedly greeted with singing and dancing, and ": null
    },
    {
        "Bedouin": "bedouin"
    },
    {
        " warriors stood on the citys columns. A procession ended with a mock coronation of Stanhope under the ": null
    },
    {
        "arch of Palmyra": "monumental arch of palmyra"
    },
    {
        " as queen of the desert . ": null
    },
    {
        "William Ware": "william ware"
    },
    {
        ", fascinated by Zenobia, wrote a fanciful account of her life. Novelists and playwrights, such as ": null
    },
    {
        "Haley Elizabeth Garwood": "haley elizabeth garwood"
    },
    {
        " and ": null
    },
    {
        "Nick Dear": "nick dear"
    },
    {
        ", also wrote about the queen.     Selected cultural depictions Zenobia, Queen of Palmyra by ": null
    },
    {
        "Harriet Hosmer": "harriet hosmer"
    },
    {
        ", exhibited at the ": null
    },
    {
        "Art Institute of Chicago": "art institute of chicago"
    },
    {
        ".   : Zenobia in Chains by Harriet Hosmer, exhibited at the ": null
    },
    {
        "Huntington Library": "huntington library"
    },
    {
        ". ": null
    },
    {
        "Chaucer": "chaucer"
    },
    {
        " narrates a condensed story of Zenobias life in one of a series of tragedies in ": null
    },
    {
        "The Monks Tale": "the monks tale"
    },
    {
        " .   : La gran Cenobia by ": null
    },
    {
        "Pedro Calderón de la Barca": "pedro calderón de la barca"
    },
    {
        ".   : Zénobie, tragédie. Où la vérité de lHistoire est conservée dans lobservation des plus rigoureuses règles du Poème Dramatique by ": null
    },
    {
        "François Hédelin": "françois hédelin, abbé daubignac"
    },
    {
        ".   : Zenobia, Queen of Palmyra; a Narrative, Founded on History. by ": null
    },
    {
        "Adelaide OKeeffe": "adelaide okeeffe"
    },
    {
        ".   : The Queen of the East by ": null
    },
    {
        "Alexander Baron": "alexander baron"
    },
    {
        ".   : Moi, Zénobie reine de Palmyre by ": null
    },
    {
        "Bernard Simiot": ":fr:bernard simiot"
    },
    {
        ".   : The Chronicle of Zenobia by Judith Weingarten. Queen Zenobia Addressing her Soldiers by ": null
    },
    {
        "Giambattista Tiepolo": "giovanni battista tiepolo"
    },
    {
        "; it dates to the early eighteenth century but the exact year is not known. This painting  was painted by Tiepolo on the walls of the Zenobio family palace in ": null
    },
    {
        "Venice": "venice"
    },
    {
        ", although they were unrelated to the queen.   : Queen Zenobias Last Look upon Palmyra by ": null
    },
    {
        "Herbert Gustave Schmalz": "herbert gustave schmalz"
    },
    {
        ". Zenobia : ": null
    },
    {
        "Tomaso Albinoni": "tomaso albinoni"
    },
    {
        "s first opera.   : Zenobia in Palmira by ": null
    },
    {
        "Leonardo Leo": "leonardo leo"
    },
    {
        ".   : Zenobia by ": null
    },
    {
        "Johann Adolph Hasse": "johann adolph hasse"
    },
    {
        ".   : Zenobia in Palmira by ": null
    },
    {
        "Pasquale Anfossi": "pasquale anfossi"
    },
    {
        ".   : Zenobia in Palmira by ": null
    },
    {
        "Giovanni Paisiello": "giovanni paisiello"
    },
    {
        ".   :  Aureliano in Palmira  by ": null
    },
    {
        "Gioachino Rossini": "gioachino rossini"
    },
    {
        ".   : Zenobia, Queen of Palmyra by ": null
    },
    {
        "Silas G. Pratt": "silas g. pratt"
    },
    {
        ".   : Zenobia by ": null
    },
    {
        "Mansour Rahbani": "mansour rahbani"
    },
    {
        ". Zenobia , by ": null
    },
    {
        "Nick Dear": "nick dear"
    },
    {
        ", was first performed at the ": null
    },
    {
        "Young Vic": "young vic"
    },
    {
        " as a co-production with the ": null
    },
    {
        "Royal Shakespeare Company": "royal shakespeare company"
    },
    {
        ". ": null
    },
    {
        "Rahbani Brothers": "rahbani brothers"
    },
    {
        " and sang by ": null
    },
    {
        "Fairuz": "fairuz"
    },
    {
        " as part of the Rahbani Brothers 42 musical play Nas Min Waraq .  Nel Segno di Roma , a 42 Italian film starring ": null
    },
    {
        "Anita Ekberg": "anita ekberg"
    },
    {
        ".": null
    }
]