[
    {
        "        Zhu Shijie , ": null
    },
    {
        "courtesy name": "courtesy name"
    },
    {
        " Hanqing , ": null
    },
    {
        "pseudonym": "pseudonym"
    },
    {
        " Songting , was a Chinese mathematician and writer. He was one of the greatest Chinese mathematicians living during the ": null
    },
    {
        "Yuan Dynasty": "yuan dynasty"
    },
    {
        ". Zhu was born close to todays Beijing. Two of his mathematical works have survived. Introduction to Computational Studies , and  Jade Mirror of the Four Unknowns .          Suanxue Qimeng , written in 42 is an elementary textbook on mathematics in three volumes, 42 chapters and 42 problems. This book also showed how to measure different two-dimensional shapes and three-dimensional solids. The Introduction had an important influence on the development of ": null
    },
    {
        "mathematics in Japan": "japanese mathematics"
    },
    {
        ". The book was once lost in China until Qing dynasty mathematician Luo Shilin bought a Korean printed edition, and re-published in Yangzhou. Since then this book was reprinted several times.     Jade Mirror of the Four Unknowns   Zhus second book,  Jade Mirror of the Four Unknowns , written in 42 is his most important work. With this book, Zhu brought Chinese algebra to its highest level. The first four of the 42 problems for solution illustrate his method of the four unknowns. He shows how to convert a problem stated verbally into a system of polynomial equations , by using up to four unknowns: 天Heaven, 地Earth, 人Man, 物Matter,and then how to reduce the system to a single polynomial equation in one unknown by successive elimination of unknowns. He then solved the high order equation by ": null
    },
    {
        "Southern Song": "southern song"
    },
    {
        " dynasty mathematician ": null
    },
    {
        "Qin Jiushao": "qin jiushao"
    },
    {
        "s Ling long kai fang method published in Shùshū Jiǔzhāng  in 42 . To do this, he makes use of what is currently known as the ": null
    },
    {
        "Pascal triangle": "pascal triangle"
    },
    {
        ", which he labels as the diagram of an ancient method first discovered by ": null
    },
    {
        "Jia Xian": "jia xian"
    },
    {
        " before 42   The final equation and one of its solutions is given for each of the 42 problems.   Zhu also found square and cube roots by solving quadratic and cubic equations, and added to the understanding of series and progressions, classifying them according to the coefficients of the Pascal triangle. He also showed how to solve systems of ": null
    },
    {
        "linear equation": "linear equation"
    },
    {
        "s by reducing the matrix of their coefficients to ": null
    },
    {
        "diagonal form": "diagonal form"
    },
    {
        ". His methods pre-date ": null
    },
    {
        "Blaise Pascal": "blaise pascal"
    },
    {
        ", William Horner, and modern matrix methods by many centuries. The preface of the book describes how Zhu travelled around China for 42 years as a teacher of mathematics.     The methods of Jade Mirror of the Four Unknowns form the foundation for ": null
    },
    {
        "Wus method of characteristic set": "wus method of characteristic set"
    }
]