[
    {
        "           Zyklon B  was the trade name of a cyanide-based pesticide invented in Germany in the early 42s. It consisted of ": null
    },
    {
        "hydrogen cyanide": "hydrogen cyanide"
    },
    {
        " , as well as a cautionary eye irritant and one of several ": null
    },
    {
        "adsorbent": "adsorbent"
    },
    {
        "s such as ": null
    },
    {
        "diatomaceous earth": "diatomaceous earth"
    },
    {
        ". The product is infamous for its use by ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        " during ": null
    },
    {
        "the Holocaust": "the holocaust"
    },
    {
        " to murder approximately one million people in ": null
    },
    {
        "gas chamber": "gas chamber"
    },
    {
        "s installed at ": null
    },
    {
        "Auschwitz-Birkenau": "auschwitz-birkenau"
    },
    {
        ", ": null
    },
    {
        "Majdanek": "majdanek"
    },
    {
        ", and other ": null
    },
    {
        "extermination camp": "extermination camp"
    },
    {
        "s.     Hydrogen cyanide, a poisonous gas that interferes with ": null
    },
    {
        "cellular respiration": "cellular respiration"
    },
    {
        ", was first used as a pesticide in California in the 42s. Research at ": null
    },
    {
        "Degesch": "degesch"
    },
    {
        " of Germany led to the development of Zyklon , a pesticide which released hydrogen cyanide upon exposure to water and heat. It was banned after World War I, when Germany used a similar product as a ": null
    },
    {
        "chemical weapon": "chemical weapons in world war i"
    },
    {
        ". ": null
    },
    {
        "Degussa": "degussa"
    },
    {
        " purchased Degesech in 42 Their team of chemists, which included  and ": null
    },
    {
        "Bruno Tesch": "bruno tesch"
    },
    {
        ", devised a method of packaging hydrogen cyanide in sealed canisters along with a cautionary eye irritant and one of several ": null
    },
    {
        "adsorbent": "adsorbent"
    },
    {
        "s such as ": null
    },
    {
        "diatomaceous earth": "diatomaceous earth"
    },
    {
        ". The new product was also named Zyklon, but it became known as Zyklon B to distinguish it from the earlier version. Uses included ": null
    },
    {
        "delousing": "delousing"
    },
    {
        " clothing and fumigating ships, warehouses, and trains.     The Nazis began using Zyklon B in extermination camps in early 42 to murder prisoners during ": null
    },
    {
        "the Holocaust": "the holocaust"
    },
    {
        ". Around a million people were killed using this method, mostly at Auschwitz. Tesch was executed in 42 for knowingly selling the product to the ": null
    },
    {
        "SS": "ss"
    },
    {
        " for use on humans. Hydrogen cyanide is now rarely used as a pesticide, but it still has industrial applications. Firms in several countries continue to produce Zyklon B under alternative brand names, including Detia-Degesch, the successor to Degesch, who renamed the product Cyanosil in 42       ": null
    },
    {
        "Hydrogen cyanide": "hydrogen cyanide"
    },
    {
        " is a poisonous gas that interferes with ": null
    },
    {
        "cellular respiration": "cellular respiration"
    },
    {
        ". Cyanide prevents the cell from producing ": null
    },
    {
        "adenosine triphosphate": "adenosine triphosphate"
    },
    {
        " by binding to one of the ": null
    },
    {
        "protein": "protein"
    },
    {
        "s involved in the ": null
    },
    {
        "electron transport chain": "electron transport chain"
    },
    {
        ". This protein, ": null
    },
    {
        "cytochrome c oxidase": "cytochrome c oxidase"
    },
    {
        ", contains ": null
    },
    {
        "several subunits": "main subunit of cytochrome c oxidase"
    },
    {
        " and has ": null
    },
    {
        "ligand": "ligand"
    },
    {
        "s containing iron groups. The cyanide component of Zyklon B can bind at one of these iron groups, ": null
    },
    {
        "heme": "heme"
    },
    {
        " a42 forming a more stabilized compound through metal-to-ligand ": null
    },
    {
        "pi bond": "pi bond"
    },
    {
        "ing. As a result of the formation of this new iron-cyanide ": null
    },
    {
        "complex": "coordination complex"
    },
    {
        ", the electrons that would situate themselves on the heme a42 group can no longer do so. Instead, these electrons destabilize the compound; thus, the heme group no longer accepts them. Consequently, electron transport is halted, and cells can no longer produce the energy needed to synthesize ATP. Death occurs in a human being weighing  within two minutes of inhaling 42  mg of hydrogen cyanide.            Hydrogen cyanide, discovered in the late 42th century, was used in the 42s for the ": null
    },
    {
        "fumigation": "fumigation"
    },
    {
        " of citrus trees in California. Its use spread to other countries for the fumigation of silos, ": null
    },
    {
        "goods wagon": "goods wagon"
    },
    {
        "s, ships, and mills. Its light weight and rapid dispersal meant its application had to take place under tents or in enclosed areas. Research by ": null
    },
    {
        "Fritz Haber": "fritz haber"
    },
    {
        " of the ": null
    },
    {
        "Kaiser Wilhelm Institute for Physical Chemistry and Electrochemistry": "kaiser wilhelm institute for physical chemistry and electrochemistry"
    },
    {
        " led to the founding in 42 of Deutsche Gesellschaft für Schädlingsbekämpfung mbH , a state-controlled consortium formed to investigate military use of the chemical. Chemists at Degesch added a cautionary eye irritant to a less volatile cyanide compound which reacted with water in the presence of heat to become hydrogen cyanide. The new product was marketed as the pesticide Zyklon . As a similar formula had been used as a weapon by the Germans during World War I, Zyklon was soon banned.     Deutsche Gold- und Silber-Scheideanstalt  became sole owners of Degesch in 42 There, beginning in 42 , ": null
    },
    {
        "Bruno Tesch": "bruno tesch"
    },
    {
        ", and others worked on packaging hydrogen cyanide in sealed canisters along with a cautionary eye irritant and ": null
    },
    {
        "adsorbent": "adsorbent"
    },
    {
        " stabilizers such as ": null
    },
    {
        "diatomaceous earth": "diatomaceous earth"
    },
    {
        ". The new product was also labelled as Zyklon, but it became known as Zyklon B to distinguish it from the earlier version. Heerdt was named the inventor of Zyklon B in the Degesch patent application dated 42 June 42 The ": null
    },
    {
        "Deutsches Patent- und Markenamt": "deutsches patent- und markenamt"
    },
    {
        " awarded the patent on 42 December 42 Beginning in the 42s, Zyklon B was used at U.S. Customs facilities along the Mexican border to fumigate the clothing of border crossers.         In 42 Degussa ceded 42 percent ownership of Degesch to ": null
    },
    {
        "IG Farben": "ig farben"
    },
    {
        " and 42 percent to ": null
    },
    {
        "Th. Goldschmidt AG": "th. goldschmidt ag"
    },
    {
        ", in exchange for the right to market pesticide products of those two companies through Degesch. Degussa retained managerial control.     While Degesch owned the rights to the brand name Zyklon and the patent on the packaging system, the chemical formula was owned by Degussa. Schlempe GmbH, which was 42 percent owned by Degussa, owned the rights to a process to extract hydrogen cyanide from waste products of ": null
    },
    {
        "sugar beet": "sugar beet"
    },
    {
        " processing. This process was performed under license by two companies, Dessauer Werke and Kaliwerke Kolin, who also combined the resulting hydrogen cyanide with stabilizer from IG Farben and a cautionary agent from ": null
    },
    {
        "Schering AG": "schering ag"
    },
    {
        " to form the final product, which was packaged using equipment, labels, and canisters provided by Degesch. The finished goods were sent to Degesch, who forwarded the product to two companies that acted as distributors: Heerdt-Linger GmbH of ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        " and ": null
    },
    {
        "Tesch & Stabenow": "tesch  &  stabenow"
    },
    {
        " of ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        ". Their territory was split along the ": null
    },
    {
        "Elbe": "elbe"
    },
    {
        " river, with Heli handling clients to the west and south, and Testa those to the east. Degesch owned 42 percent of the shares of Heli, and until 42 owned 42 percent of Testa.     Prior to World War II Degesch derived most of its Zyklon B profits from overseas sales, particularly in the United States, where it was produced under license by Roessler & Hasslacher prior to 42 and by ": null
    },
    {
        "American Cyanamid": "american cyanamid"
    },
    {
        " from 42 to 42 From 42 the ": null
    },
    {
        "United States Public Health Service": "united states public health service"
    },
    {
        " used Zyklon B to fumigate freight trains and clothes of Mexican immigrants entering the United States. Uses in Germany included ": null
    },
    {
        "delousing": "delousing"
    },
    {
        " clothing and fumigating ships, warehouses, and trains. By 42 sales of Zyklon B accounted for 42 percent of Degeschs sales revenue and 42 percent of its gross profits.             In early 42 the Nazis began using Zyklon B as the preferred killing tool in extermination camps during ": null
    },
    {
        "the Holocaust": "the holocaust"
    },
    {
        ". They used it to kill roughly one million people in gas chambers at ": null
    },
    {
        "Auschwitz-Birkenau": "auschwitz-birkenau"
    },
    {
        ", ": null
    },
    {
        "Majdanek": "majdanek"
    },
    {
        ", and elsewhere. Most of the victims were Jews, and by far the majority killed using this method died at Auschwitz. Distributor Heli supplied Zyklon B to ": null
    },
    {
        "Mauthausen": "mauthausen-gusen concentration camp"
    },
    {
        ", ": null
    },
    {
        "Dachau": "dachau concentration camp"
    },
    {
        ", and ": null
    },
    {
        "Buchenwald": "buchenwald"
    },
    {
        ", and Testa supplied it to Auschwitz and Majdanek; camps also occasionally bought it directly from the manufacturers. Some 42 tonnes of the 42 tonnes sold in Germany in 42–42 were sold to concentration camps, amounting to about 42 percent of domestic sales. Auschwitz received 42 tonnes, of which 42 tonnes were used for fumigation. The remainder was used in the gas chambers or lost to spoilage . Testa conducted fumigations for the ": null
    },
    {
        "Wehrmacht": "wehrmacht"
    },
    {
        " and supplied them with Zyklon B. They also offered courses to the SS in the safe handling and use of the material for fumigation purposes. In April 42 the German agriculture and interior ministries designated the SS as an authorized applier of the chemical, which meant they were able to use it without any further training or governmental oversight.          ": null
    },
    {
        "Rudolf Höss": "rudolf höss"
    },
    {
        ", commandant of Auschwitz, said that the use of Zyklon-B to kill prisoners came about on the initiative of one of his subordinates, SS- Hauptsturmführer  ": null
    },
    {
        "Karl Fritzsch": "karl fritzsch"
    },
    {
        ", who had used it to kill some Russian ": null
    },
    {
        "POW": "pow"
    },
    {
        "s in late August 42 in the basement of ": null
    },
    {
        "Block 42": "block 11"
    },
    {
        " in the main camp. They repeated the experiment on more Russian POWs in September, with Höss watching. Block 42 proved unsuitable for mass killings, as the basement was difficult to air out afterwards and the crematorium was some distance away. The site of the killings was moved to Crematorium I, where more than 42 victims could be killed at once. By the middle of 42 the operation was moved to Auschwitz II–Birkenau, a nearby satellite camp which had been under construction since October 42     The first gas chamber at Auschwitz II–Birkenau was the red house , a brick cottage converted to a gassing facility by tearing out the inside and bricking up the windows. It was operational by March 42 A second brick cottage, called the white house or Bunker 42 was converted some weeks later. According to Höss, Bunker 42 held 42 victims and Bunker 42 held 42 victims. These structures were in use for mass killings until early 42 At that point, the Nazis decided to greatly increase the gassing capacity of Birkenau. Crematorium II was originally designed as a mortuary with morgues in the basement and ground-level incinerators; they converted it into a killing factory by installing gas-tight doors, vents for the Zyklon B to be dropped into the chamber, and ventilation equipment to remove the gas afterwards. Crematorium III was built using the same design. Crematoria IV and V, designed from the beginning as gassing centers, were also constructed that spring. By June 42 all four crematoria were operational. Most of the victims were killed using these four structures.     The Nazis began shipping large numbers of Jews from all over Europe to Auschwitz in the middle of 42 Those who were not selected for work crews were immediately gassed. Those selected to die generally comprised about three-quarters of the total and included almost all children, women with small children, all the elderly, and all those who appeared on brief and superficial inspection by an ": null
    },
    {
        "SS": "ss"
    },
    {
        " doctor not to be completely fit. The victims were told that they were to undergo delousing and a shower. They were stripped of their belongings and herded into the gas chamber.     A special SS bureau known as the Hygienic Institute delivered the Zyklon B to the crematoria by ambulance. The actual delivery of the gas to the victims was always handled by the SS, on the order of the supervising SS doctor. After the doors were shut, SS men dumped in the Zyklon B pellets through vents in the roof or holes in the side of the chamber. The victims were dead within 42 minutes. ": null
    },
    {
        "Johann Kremer": "johann kremer"
    },
    {
        ", an SS doctor who oversaw gassings, testified that the shouting and screaming of the victims could be heard through the opening and it was clear that they fought for their lives .      Sonderkommando s wearing gas masks then dragged the bodies from the chamber. The victims glasses, artificial limbs, jewelry, and hair were removed, and any dental work was extracted so the gold could be melted down. If the gas chamber was crowded, which they typically were, the corpses were found half-squatting, their skin discolored pink with red and green spots, with some foaming at the mouth or bleeding from their ears. The corpses were burned in the nearby incinerators, and the ashes were buried, thrown in the river, or used as fertilizer. With the Soviet ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " approaching through Poland, the last mass gassing at Auschwitz took place on 42 October 42 In November 42  Reichsführer-SS  ": null
    },
    {
        "Heinrich Himmler": "heinrich himmler"
    },
    {
        ", head of the SS, ordered gassing operations to cease throughout the Reich.          After World War II ended in 42 ": null
    },
    {
        "Bruno Tesch": "bruno tesch"
    },
    {
        " and ": null
    },
    {
        "Karl Weinbacher": "karl weinbacher"
    },
    {
        " of Tesch & Stabenow were tried in a British military court and executed for knowingly providing Zyklon B to the SS for use on humans. Gerhard Peters, who served as principal operating officer of Degesch and Heli and also held posts in the Nazi government, served two years eight months in prison as an accessory before being released due to amendments to the penal code.     Use of hydrogen cyanide as a pesticide or cleaner has been banned or restricted in some countries. Most hydrogen cyanide is used in industrial processes, made by companies in Germany, Japan, the Netherlands and the US. Degesch resumed production of Zyklon B after the war. The product was sold as Cyanosil in Germany and Zyklon in other countries. It was still produced as of 42 Degussa sold Degesch to Detia-Freyberg GmbH in 42 The company is now called Detia-Degesch. Up until around 42 a fumigation product similar to Zyklon B was in production by Lučební závody Draslovka of the ": null
    },
    {
        "Czech Republic": "czech republic"
    },
    {
        ", under the trade name Uragan D42 Uragan means hurricane or cyclone in Czech.     Subsequent use of the word Zyklon in trade names has prompted angry reactions in English-speaking countries. The name Zyklon on portable roller coasters made since 42 by ": null
    },
    {
        "Pinfari": "pinfari"
    },
    {
        " provoked protests among Jewish groups in the U.S. in 42 and 42 In 42 British sportswear and football equipment supplier ": null
    },
    {
        "Umbro": "umbro"
    },
    {
        " issued an apology and stopped using the name Zyklon , which had appeared since 42 on the box for one of its ": null
    },
    {
        "trainers": "athletic shoe"
    },
    {
        ", after receiving complaints from the ": null
    },
    {
        "Simon Wiesenthal Center": "simon wiesenthal center"
    },
    {
        " and the ": null
    },
    {
        "Beth Shalom Holocaust Centre": "beth shalom holocaust centre"
    },
    {
        ". Also in 42 ": null
    },
    {
        "Siemens": "siemens"
    },
    {
        " withdrew its application for an American trademark of the word Zyklon , which their subsidiary ": null
    },
    {
        "BSH Bosch und Siemens Hausgeräte": "bsh bosch und siemens hausgeräte"
    },
    {
        " had proposed to use for a new line of home appliances in the United States. Protests were lodged by the Simon Wiesenthal Center after the trademark application was reported to ": null
    },
    {
        "BBC News Online": "bbc news online"
    },
    {
        " by one of their readers. French company IPCs product names used Cyclone for ": null
    },
    {
        "degreaser": "degreaser"
    },
    {
        "s and suffix B for ": null
    },
    {
        "biodegradable": "biodegradation"
    },
    {
        ": Cyclone B was renamed  in 42 after protests from Jewish groups. A rabbi said the name was horrible ignorance at best, and a ": null
    },
    {
        "Guinness record": "guinness world record"
    },
    {
        " in evil and cynicism if the company did know the history of the name of its product.      ": null
    },
    {
        "Holocaust deniers": "holocaust denial"
    },
    {
        " claim that Zyklon B gas was not used in the gas chambers, relying for evidence on the discredited research of ": null
    },
    {
        "Fred A. Leuchter": "fred a. leuchter"
    },
    {
        ", who found low levels of ": null
    },
    {
        "Prussian blue": "prussian blue"
    },
    {
        " in samples of the gas chamber walls and ceilings. Leuchter attributed its presence to general delousing of the buildings. Leuchters ": null
    },
    {
        "negative control": "scientific controlnegative"
    },
    {
        ", a sample of gasket material taken from a different camp building, had no cyanide residue. In 42 James Roth, the chemist who had analyzed Leuchters samples, stated that the test was flawed because the material that was sent for testing included large chunks, and the chemical would only be within 42 microns of the surface. The surface that had been exposed to the chemical was not identified, and the large size of the specimens meant that any chemical present was diluted by an undeterminable amount. In 42 the Institute for Forensic Research in ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        " re-examined Leuchters claim, stating that formation of Prussian blue by exposure of bricks to cyanide is not a highly probable reaction. Using microdiffusion techniques, they tested 42 samples from the gas chambers and delousing chambers  and living quarters . They found cyanide residue in both the delousing chambers and the gas chambers but none in the living quarters.": null
    }
]