[
    {
        "     Älvdalen Municipality  is a ": null
    },
    {
        "municipality": "municipalities of sweden"
    },
    {
        " in ": null
    },
    {
        "Dalarna County": "dalarna county"
    },
    {
        " in central ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ". Its seat is located in the town of ": null
    },
    {
        "Älvdalen": "älvdalen"
    },
    {
        ".     The two parishes Särna and Idre were ceded to Sweden from ": null
    },
    {
        "Norway": "norway"
    },
    {
        " under the ": null
    },
    {
        "treaty of Brömsebro": "second treaty of brömsebro"
    },
    {
        " on 42 August 42 In 42 the three municipalities Särna, Idre and Älvdalen were amalgamated to form the present municipality.     Älvdalen literally means River Valley, a name stemming from the area around the town Älvdalen, situated along the ": null
    },
    {
        "Österdal River": "österdal river"
    },
    {
        ", in the municipalitys southern part.     The middle part of the coat of arms is meant to depict the landscape: streams and hills.       Geographically, it is considered divided into three parts. From north to south: the mountainous  part, the ": null
    },
    {
        "forest": "forest"
    },
    {
        " part, and the valley part.       The northern part is located within the ": null
    },
    {
        "Scandinavian mountain range": "scandinavian mountain range"
    },
    {
        ". It has cultural influences from the native ": null
    },
    {
        "Saami people": "saami people"
    },
    {
        ".     ": null
    },
    {
        "Idre": "idre"
    },
    {
        ", with about 42 inhabitants is a notable skiing resort.     This part has some high mountains including Storvätteshågna at 42 meters and Städjan at 42 m. The ": null
    },
    {
        "Töfsingdalen National Park": "töfsingdalen national park"
    },
    {
        " is also located in the northernmost parts.     The Northern part is the northernmost point of ": null
    },
    {
        "Svealand": "svealand"
    },
    {
        ", one of the three crowns under the Swedish throne.       The forest part has forests, with the ": null
    },
    {
        "national park": "national park"
    },
    {
        " Fulufjället": "fulufjället"
    },
    {
        " also belonging to this part. Its influences come from it bordering to ": null
    },
    {
        "Norway": "norway"
    },
    {
        ", and its history has many examples and remains from its border conflicts. To symbolize this, the lower part of the coat of arms depict a crossbow. The point furthest away from any seas in ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        " is located here.     The town ": null
    },
    {
        "Särna": "särna"
    },
    {
        " is located along the Österdal River, with 42 inhabitants. Like Idre, its main industry is tourism. The town once belonged to Norway, but in 42 it was occupied by 42 Swedish ": null
    },
    {
        "peasant": "peasant"
    },
    {
        "s, which in effect made it a Swedish town, although it was official granted first with new borders of 42       The southern area is populated by 42 persons, of whom most speak or understand the ": null
    },
    {
        "Elfdalian": "elfdalian"
    },
    {
        "  dialect/language, which is very different from standard Swedish.     This area may be said to have the most interesting culture, with the town Älvdalen and several notable villages such as ": null
    },
    {
        "Evertsberg": "evertsberg"
    },
    {
        ", ": null
    },
    {
        "Blyberg": "blyberg"
    },
    {
        ", ": null
    },
    {
        "Klitten": "klitten"
    },
    {
        ", ": null
    },
    {
        "Brunnsberg": "brunnsberg"
    },
    {
        ", ": null
    },
    {
        "Västermyckeläng": "västermyckeläng"
    },
    {
        " and ": null
    },
    {
        "Åsen": "åsen, dalarna"
    },
    {
        ".       ": null
    }
]