[
    {
        "            The letter Å  represents various ": null
    },
    {
        "sound": "phoneme"
    },
    {
        "s in several languages. It is a separate letter in ": null
    },
    {
        "Swedish": "swedish alphabet"
    },
    {
        " , ": null
    },
    {
        "Danish": "danish alphabet"
    },
    {
        ", ": null
    },
    {
        "Norwegian": "norwegian alphabet"
    },
    {
        ", ": null
    },
    {
        "Finnish": "finnish alphabet"
    },
    {
        ", ": null
    },
    {
        "North Frisian": "north frisian language"
    },
    {
        ", ": null
    },
    {
        "Walloon": "walloon alphabet"
    },
    {
        ", ": null
    },
    {
        "Chamorro": "chamorro alphabet"
    },
    {
        ", ": null
    },
    {
        "Lule Sami": "lule sami"
    },
    {
        ", ": null
    },
    {
        "Skolt Sami": "skolt sami language"
    },
    {
        ", ": null
    },
    {
        "Southern Sami": "southern sami"
    },
    {
        ", and ": null
    },
    {
        "Greenlandic": "greenlandic alphabet"
    },
    {
        " alphabets. Additionally, it is part of the ": null
    },
    {
        "alphabet": "alphabet"
    },
    {
        "s used for the ": null
    },
    {
        "Alemannic": "alemannic german"
    },
    {
        " and the ": null
    },
    {
        "Austro-Bavarian": "austro-bavarian"
    },
    {
        " dialect": "dialect"
    },
    {
        "s of ": null
    },
    {
        "German": "german alphabet"
    },
    {
        ".     Though Å is derived from an ": null
    },
    {
        "A": "a"
    },
    {
        ", with an ": null
    },
    {
        "overring": "ring"
    },
    {
        ", it is considered a separate ": null
    },
    {
        "letter": "letter"
    },
    {
        ". It developed as a form of semi-": null
    },
    {
        "ligature": "ligature"
    },
    {
        " of an A with a smaller o above it to denote a ": null
    },
    {
        "long": "vowel length"
    },
    {
        " and darker A, similar to how the ": null
    },
    {
        "umlaut mark": "umlaut"
    },
    {
        " that distinguishes ": null
    },
    {
        "Ä": "ä"
    },
    {
        " from A, and ": null
    },
    {
        "Ö": "ö"
    },
    {
        "/": null
    },
    {
        "Ø": "ø"
    },
    {
        " from O, developed from a small e written above the letter in question.            The å in Scandinavian ": null
    },
    {
        "alphabet": "alphabet"
    },
    {
        "s represents two sounds, one short and one long.   The short version represents ": null
    },
    {
        "IPA": "help:ipa"
    },
    {
        " .   In Swedish, the long version represents ": null
    },
    {
        "IPA": "help:ipa"
    },
    {
        " . In Danish and Norwegian, the long version is pronounced ": null
    },
    {
        "IPA": "help:ipa"
    },
    {
        " .       The Å-sound originally had the same origin as the long  sound in ": null
    },
    {
        "German": "german language"
    },
    {
        " Aal and Haar .     Historically, the å derives from the ": null
    },
    {
        "Old Norse": "old norse"
    },
    {
        " long  vowel , but over time, it developed to an  sound in most Scandinavian language varieties . Medieval writing often used doubled letters for long vowels, and the vowel continued to be written Aa. In ": null
    },
    {
        "Old Swedish": "old swedish"
    },
    {
        " the use of the ligature ": null
    },
    {
        "Æ": "æ"
    },
    {
        " and of ": null
    },
    {
        "Ø": "ø"
    },
    {
        " that represented the sounds  and  respectively were gradually replaced by new letters. Instead of using ligatures, a minuscule ": null
    },
    {
        "E": "e"
    },
    {
        " was placed above the letters ": null
    },
    {
        "A": "a"
    },
    {
        " and ": null
    },
    {
        "O": "o"
    },
    {
        " to create new ": null
    },
    {
        "grapheme": "grapheme"
    },
    {
        "s. They later evolved into the modern letters ": null
    },
    {
        "Ä": "ä"
    },
    {
        " and ": null
    },
    {
        "Ö": "ö"
    },
    {
        ", where the ": null
    },
    {
        "E": "e"
    },
    {
        " was simplified into the two dots now referred to as ": null
    },
    {
        "umlaut": "diaeresis"
    },
    {
        ". This construction was also applied to construct a new grapheme where an aa previously had been used. A minuscule O was placed on top of an A to create a new letter. It was first used in ": null
    },
    {
        "print": "publishing"
    },
    {
        " in the ": null
    },
    {
        "Gustav Vasa Bible": "gustav vasa bible"
    },
    {
        " that was published in 42 and replaced ": null
    },
    {
        "Aa": "aa"
    },
    {
        " in the 42th century. Pettersson , p. 42     In an attempt to modernize the orthography, linguists tried to introduce the Å to Danish and Norwegian writing in the 42th century. Most people felt no need for the new letter, although the letter group Aa had already been pronounced like Å for centuries in Denmark and Norway. Aa was usually treated as a single letter, spoken like the present Å when spelling out names or words. Orthography reforms making Å official were carried out in ": null
    },
    {
        "Norway": "norway"
    },
    {
        " in 42 and in ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        " in 42 It has been argued that the Å only made its way to official Danish spelling due to anti-German and pro-Scandinavian sentiment after World War II. Danish had been the only language apart from German and ": null
    },
    {
        "Luxembourgish": "luxembourgish language"
    },
    {
        " to use ": null
    },
    {
        "capitalized nouns": "capitalizationnouns"
    },
    {
        " in the last decades, but abolished them at the same occasion.     In a few names of Danish cities or towns, the old spelling has been retained as an option due to local resistance, e.g. ": null
    },
    {
        "Aalborg": "aalborg"
    },
    {
        " and ": null
    },
    {
        "Aabenraa": "aabenraa"
    },
    {
        "; however, Ålborg and Åbenrå are the spellings recommended by the ": null
    },
    {
        "Danish Language Board": "dansk sprognævn"
    },
    {
        ".  , sproget.dk Between 42 and 42 the city of ": null
    },
    {
        "Aarhus": "aarhus"
    },
    {
        " was officially spelled Århus. However, the city has changed to the Aa spelling starting 42 in a controversial decision citing internationalization and ": null
    },
    {
        "web": "world wide web"
    },
    {
        " compatibility advantages.     ": null
    },
    {
        "Icelandic": "icelandic orthography"
    },
    {
        " and ": null
    },
    {
        "Faroese": "faroese alphabet"
    },
    {
        " are the only North Germanic languages not to use the å. The Old Norse letter á is retained, but the sound it now expresses is a diphthong, pronounced  in Icelandic and  in Faroese. The short variation of Faroese á is pronounced , though.       In some place names, the old  spelling dominates, more often in Denmark than in Norway . Locals of  and  resist the Å, whereas  is rarely seen with Aa spelling. Official rules allow both forms in the most common cases, but Å is always correct.     Before 42 when spelling with the double A was common, some Norwegian place names contained three or four consecutive A letters: for instance   and  .     In family names, the bearer of the name uses Aa or Å according to their choice, but since family names are inherited they are resistant to change and the traditional Aa style is often kept. For instance, the last name  is much more common than . The surname Aa is always spelled with double A, never with the single å. However, given names - which are less commonly inherited - have largely changed to the use of the Å. For instance, in Norway more than 42 male citizens spell their name Håkon, while only around 42 are named  Haakon .     Company names are sometimes spelled with the double A by choice, usually in order to convey an impression of old-fashionedness or traditionality. The double A, representing a single sound, is usually kept in initials e.g. for people whose first, middle, and/or last name begins with the double A. Accordingly, a man named Hans Aagard Hauge would spell his initials H. Aa. H. , while a woman named Aase Vestergaard would spell her initials Aa. V. .           Correct alphabetization in Danish and Norwegian places Å as the last letter in the ": null
    },
    {
        "alphabet": "danish and norwegian alphabet"
    },
    {
        ", the sequence being ": null
    },
    {
        "Æ": "æ"
    },
    {
        ", ": null
    },
    {
        "Ø": "ø"
    },
    {
        ", Å. This is also true for the alternative spelling Aa . Unless manually corrected, sorting algorithms of programs localised for Danish or Norwegian will place e.g., Aaron after Zorro.     In Danish the correct sorting of aa depends on pronunciation - if the sound is pronounced as one sound it is sorted as Å regardless of the sound is a or å; thus, for example, the German city  Aachen  is listed under Å, as well as the Danish city  Aabenraa . This is § 42 in the Danish Retskrivningsreglerne.       In the ": null
    },
    {
        " Swedish": "swedish alphabet"
    },
    {
        " and ": null
    },
    {
        " Finnish": "finnish alphabet"
    },
    {
        " alphabets, Å is ": null
    },
    {
        "sorted": "collation"
    },
    {
        " after ": null
    },
    {
        "Z": "z"
    },
    {
        ", as the third letter from the end, the sequence being Å, ": null
    },
    {
        "Ä": "ä"
    },
    {
        ", ": null
    },
    {
        "Ö": "ö"
    },
    {
        ".       Alternative spellings of the Scandinavian Å have become a concern because of globalization, and particularly because of the popularization of the ": null
    },
    {
        "World Wide Web": "world wide web"
    },
    {
        ". This is to a large extent due to the fact that prior to the creation of ": null
    },
    {
        "IDNA": "internationalized domain name"
    },
    {
        " system around 42 internet domains containing Scandinavian letters were not recognized by the ": null
    },
    {
        "DNS": "dns"
    },
    {
        " system, and anyway do not feature on keyboards adapted for other languages. While it is recommended to keep the Å intact wherever possible, the next best thing is to use the older, double A spelling . This is because, as previously discussed, the Å/Aa indicates a separate sound. If the Å is represented as a common A without the overring there is no indication that the A is supposed to represent another sound entirely. Even so, representing the Å as just an A is particularly common in Sweden, as compared to Norway and Denmark, because the spelling Aa has no traditional use there.            Because the ": null
    },
    {
        "Finnish alphabet": "finnish alphabet"
    },
    {
        " is derived from the Swedish alphabet, Å is carried over, but it has no native Finnish use and is treated as in Swedish. Its usage is limited to loanwords and names of Swedish, Danish or Norwegian origin. In Finland there are many Swedish-speaking as well as many Finnish-speaking people with Swedish surnames, and many Swedish surnames include Å. In addition, there are many geographical places in the Finnish coastal areas that have å in their Swedish names, such as ": null
    },
    {
        "Kråkö": "kråkö"
    },
    {
        " and ": null
    },
    {
        "Långnäs": "långnäs"
    },
    {
        ". The Finnish name for Å is ruotsalainen O , and is pronounced identically to O, which has the value .     It is not advised to substitute aa for å in Finnish, as aa is already a common letter combination with the value .       In ": null
    },
    {
        "Emilian-Romagnol": "emiliano-romagnolo"
    },
    {
        ", å is used in words such as frått , brått , tåt , såppa , ståpid , dåppi . It is also used to represent the ": null
    },
    {
        "open-mid back unrounded vowel": "open-mid back unrounded vowel"
    },
    {
        " , e.g. Modenese dialect åmm, dånna man, woman .       Å was introduced to some eastern local variants of ": null
    },
    {
        "Walloon": "walloon language"
    },
    {
        " at the beginning of the 42th century and initially noted the same sound as in Danish. Its use quickly spread to all eastern dialects, but the cultural influence ": null
    },
    {
        "Liège": "liège"
    },
    {
        " and covered three sounds, a long open o, a long close o or a long a, depending on the local varieties. The use of a single å letter to cover such pronunciations has been embraced by the new pan-Walloon ": null
    },
    {
        "orthography": "orthography"
    },
    {
        ", with one orthography for words regardless of the local phonetic variations. The Waloon use of Å became the most popular use outside a Scandinavian language, even being used in the ": null
    },
    {
        "International Phonetic Alphabet": "international phonetic alphabet"
    },
    {
        " drafted by ": null
    },
    {
        "Otto Jespersen": "otto jespersen"
    },
    {
        ".     In standardized writings outside the Liège area, words containing å are written with uh, â or ô. For example, the word måjhon , in the standardized orthography is written môjo, mâhon, mohone, maujon in dialectal writings.       The ": null
    },
    {
        "Istro-Romanian": "istro-romanian language"
    },
    {
        " alphabet is based on the standard ": null
    },
    {
        "Romanian alphabet": "romanian alphabet"
    },
    {
        " with three additional letters used to mark sounds specific only to this language: å, ľ and ń.       Å and å are also used in the practical orthography of ": null
    },
    {
        "Chamorro": "chamorro language"
    },
    {
        ", a language indigenous to the people of ": null
    },
    {
        "Northern Mariana Islands": "northern mariana islands"
    },
    {
        " and ": null
    },
    {
        "Guam": "guam"
    },
    {
        ". The Chamorro name for Guam is Guåhån, and its capital is called Hagåtña .       The letter Å is also used throughout the world as the international symbol for the non-": null
    },
    {
        "SI": "si"
    },
    {
        " unit ": null
    },
    {
        "ångström": "ångström"
    },
    {
        ", a ": null
    },
    {
        "physical unit": "physical unit"
    },
    {
        " of ": null
    },
    {
        "length": "length"
    },
    {
        " named after the ": null
    },
    {
        "Swedish": "sweden"
    },
    {
        " physicist": "physicist"
    },
    {
        " Anders Jonas Ångström": "anders jonas ångström"
    },
    {
        ". It is always ": null
    },
    {
        "upper case": "upper case"
    },
    {
        " in this context . The ångström is a unit of length equal to  or .     Unicode also has encoded . However, that is ": null
    },
    {
        "canonically equivalent": "unicode normalization"
    },
    {
        " to the ordinary letter Å. The duplicate encoding at U42B is due to round-trip mapping compatibility with an East-Asian ": null
    },
    {
        "character encoding": "character encoding"
    },
    {
        ", but is otherwise not to be used.                    The ": null
    },
    {
        "logo": "logo"
    },
    {
        " of the ": null
    },
    {
        "Major League Baseball": "major league baseball"
    },
    {
        " team now known as the ": null
    },
    {
        "Los Angeles Angels of Anaheim": "los angeles angels of anaheim"
    },
    {
        " is a capital A with a halo. Due to the resemblance, Angels fans are known to stylize the name as Ångels . The logo of the  Stargate  series similarly features a stylized A with a circle above it, making it resemble an Å as in Stargåte; in Norwegian, gåte means riddle . Similarly, Cirque du Soleils Koozå production also uses this character in its logo, although it is pronounced by the main singer as a regular a .     British producer and singer ": null
    },
    {
        "Låpsley": "låpsley"
    },
    {
        " uses å in her stage name.     A related phenomenon is the ": null
    },
    {
        "metal umlaut": "metal umlaut"
    }
]