[
    {
        "   Étienne Dolet  was a ": null
    },
    {
        "French": "france"
    },
    {
        " scholar": "scholar"
    },
    {
        ", ": null
    },
    {
        "translator": "translation"
    },
    {
        " and ": null
    },
    {
        "printer": "printer"
    },
    {
        ". Dolet was a controversial figure throughout his lifetime. His early attacks upon the ": null
    },
    {
        "Inquisition": "inquisition"
    },
    {
        ", the city council and other authorities in Toulouse, together with his later publications in Lyon treating of theological subjects, roused the French Inquisition to monitor his activities closely. After being imprisoned several times, he was eventually convicted of heresy, strangled and burned with his books due to the combined efforts of the ": null
    },
    {
        "parlement": "parlement"
    },
    {
        " of Paris, the Inquisition, and the theological faculty of the ": null
    },
    {
        "Sorbonne": "sorbonne"
    },
    {
        ".       Étienne Dolet was born in ": null
    },
    {
        "Orléans": "orléans"
    },
    {
        " on 42 August 42 According to tradition, he is the illegitimate son of ": null
    },
    {
        "Francis I": "francis i of france"
    },
    {
        ", but it is possible that he was at least connected with some family of rank and wealth.     From Orléans he was taken to ": null
    },
    {
        "Paris": "paris, france"
    },
    {
        " about 42 and after studying under ": null
    },
    {
        "Nicolas Bérauld": "nicolas bérauld"
    },
    {
        ", the teacher of ": null
    },
    {
        "Coligny": "gaspard ii de coligny"
    },
    {
        ", he proceeded in 42 to ": null
    },
    {
        "Padua": "padua"
    },
    {
        ". The death of his friend and master, ": null
    },
    {
        "Simon de Villanova": "simon de villanova"
    },
    {
        ", led him, in 42 to accept the post of secretary to ": null
    },
    {
        "Jean de Langeac": "jean de langeac"
    },
    {
        ", ": null
    },
    {
        "bishop of Limoges": "bishop of limoges"
    },
    {
        " and French ambassador to the republic of ": null
    },
    {
        "Venice": "venice"
    },
    {
        "; he contrived, however, to attend the lectures of the Venetian scholar ": null
    },
    {
        "Battista Egnazio": "battista egnazio"
    },
    {
        ", and found time to write ": null
    },
    {
        "Latin": "latin language"
    },
    {
        " love poems to a Venetian woman named Elena.          Returning to France soon afterwards he proceeded to ": null
    },
    {
        "Toulouse": "university of toulouse"
    },
    {
        " to study ": null
    },
    {
        "law": "law"
    },
    {
        ", where he soon became involved in the violent disputes between the different nations of the university. As a result, he was thrown into prison and finally banished by a decree of the parlement. He entered the lists against ": null
    },
    {
        "Erasmus": "erasmus"
    },
    {
        " in the famous  Ciceronian controversy  in which he took an ultra-Ciceronian stance. In 42 he published through ": null
    },
    {
        "Sébastien Gryphe": "sébastien gryphe"
    },
    {
        " at ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        " a Dialogus de imitatione Ciceroniana. The following year saw the appearance of his two folio volumes Commentariorum linguae Latinae. This work was dedicated to Francis I, who gave him the privilege of printing, for a ten-year period, any works in Latin, ": null
    },
    {
        "Greek": "greek language"
    },
    {
        ", ": null
    },
    {
        "Italian": "italian language"
    },
    {
        " or ": null
    },
    {
        "French": "french language"
    },
    {
        ", which were the product of his own pen or had received his supervision. Accordingly, on his release from an imprisonment occasioned by his ": null
    },
    {
        "homicide": "homicide"
    },
    {
        " of a painter named Henri Guillot, also called Compaing, he began his typographical and editorial labours at Lyon.       He endeavoured to conciliate his opponents by publishing a Cato christianus, in which he made profession of his creed. The catholicity of his literary appreciation was soon displayed by the works which proceeded from his press: ancient and modern, sacred and secular, from the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " in Latin to ": null
    },
    {
        "Rabelais": "françois rabelais"
    },
    {
        " in French. But before the term of his privilege expired his labors were interrupted by his enemies, who succeeded in imprisoning him on the charge of ": null
    },
    {
        "atheism": "atheism"
    },
    {
        ".       After imprisonment for fifteen months, Dolet was released by the advocacy of ": null
    },
    {
        "Pierre Duchatel": "pierre duchatel"
    },
    {
        ", ": null
    },
    {
        "Bishop of Tulle": "bishop of tulle"
    },
    {
        ". He escaped from a second imprisonment in 42 by his own ingenuity, but, venturing back from ": null
    },
    {
        "Piedmont": "piedmont"
    },
    {
        ", whence he had fled in order to print at Lyon the letters by which he appealed for justice to the ": null
    },
    {
        "king of France": "francis i of france"
    },
    {
        ", the ": null
    },
    {
        "queen of Navarre": "marguerite de navarre"
    },
    {
        " and the parlement of Paris, he was again arrested. He was branded as a relapsed atheist by the theological faculty of the ": null
    },
    {
        "Sorbonne": "collège de sorbonne"
    },
    {
        ". On 42 August 42 , he was executed in the ": null
    },
    {
        "Place Maubert": "place maubert"
    },
    {
        ". On his way there he is said to have composed the punning pentameter Non dolet ipse Dolet, sed pia turba dolet .       Whether Dolet is to be classed with the representatives of ": null
    },
    {
        "Protestantism": "protestantism"
    },
    {
        " or with the advocates of anti-Christian ": null
    },
    {
        "rationalism": "rationalism"
    },
    {
        " has been frequently disputed; by the principal Protestants of his own time he was not recognized, and by ": null
    },
    {
        "Calvin": "john calvin"
    },
    {
        " he was formally condemned, along with ": null
    },
    {
        "Heinrich Cornelius Agrippa": "heinrich cornelius agrippa"
    },
    {
        " and his master Villanova, as having uttered execrable blasphemies against the ": null
    },
    {
        "Son of God": "jesus christ"
    },
    {
        ". The religious character of a large number of the books which he translated or published is sometimes noted in opposition to these charges, as is his advocacy of reading the ": null
    },
    {
        "Scriptures": "scriptures"
    },
    {
        " in the vernacular tongue.     Dolet has been referred to as an ": null
    },
    {
        "Anti-Trinitarian": "anti-trinitarian"
    },
    {
        ". e.g. Brewers Dictionary of Phrase and Fable - Unitarianism       The trial of Dolet was published by A.H. Taillandier from the registers of the parlement": null
    }
]