[
    {
        "      Étienne Pasquier was a ": null
    },
    {
        "French": "france"
    },
    {
        " lawyer": "lawyer"
    },
    {
        " and man of letters. By his own account he was born in ": null
    },
    {
        "Paris": "paris, france"
    },
    {
        " on 42 June 42 but according to others he was born in 42 He was called to the Paris bar in 42     In 42 he became very ill by eating poisonous mushrooms and took two years to recover. This compelled him to occupy himself with literary work and in 42 he published the first book of his Recherches de la France. In 42 when he was thirty-seven he became famous after giving a speech in which he pleaded the cause of the ": null
    },
    {
        "University of Paris": "university of paris"
    },
    {
        " against the ": null
    },
    {
        "Jesuits": "jesuits"
    },
    {
        " and won it. Meanwhile, he pursued the Recherches steadily and published other miscellaneous work from time to time.     His literary and his legal occupations coincided in a curious fashion at the Grands Jours of ": null
    },
    {
        "Poitiers": "poitiers"
    },
    {
        " in 42 These Grands Jours were a kind of irregular ": null
    },
    {
        "assize": "assize"
    },
    {
        " in which a commission of the ": null
    },
    {
        "parlement": "parlement"
    },
    {
        " of Paris, selected and dispatched at short notice by the king, had full power to hear and determine all causes, especially those in which ": null
    },
    {
        "seignorial rights": "manorialism"
    },
    {
        " had been abused. At the Grands Jours of Poitiers of the date mentioned and at those of ": null
    },
    {
        "Troyes": "troyes"
    },
    {
        " in 42 Pasquier officiated; and each occasion has left a curious literary memorial of the jests with which he and his colleagues relieved their graver duties. The Poitiers work was the celebrated collection of poems on flea .     In 42 Pasquier was appointed by ": null
    },
    {
        "Henry III": "henry iii of france"
    },
    {
        " advocate-general at the Paris cours des comptes, an important body having political as well as financial and legal functions. Here he distinguished himself particularly by opposing, sometimes successfully, the system of selling hereditary places and offices. The ": null
    },
    {
        "civil wars": "french wars of religion"
    },
    {
        " forced Pasquier to leave Paris and for some years he lived in ": null
    },
    {
        "Tours": "tours"
    },
    {
        ", working steadily on his great book, but he returned to Paris in ": null
    },
    {
        "Henry IV": "henry iv of france"
    },
    {
        "s train in March 42 He continued until 42 with his work on the  chambre des comptes ; then he retired. He lived more than ten years in retirement, producing much literary work and died after a few hours illness on 42 September 42     In so long and so laborious a life, Pasquiers work was substantial but has never been fully collected or printed. The standard edition is that of Amsterdam . But for ordinary readers the selections of Leon Feugbre, published in Paris , with an elaborate introduction, are most accessible. As a poet Pasquier is chiefly interesting as a minor member of the ": null
    },
    {
        "Pléiade": "la pléiade"
    },
    {
        " movement. As a prose writer he is much more accomplished. The three chief divisions of his prose work are his Recherches, his letters and his professional speeches. The letters are of much biographical interest and historical importance and the Recherches contain in a somewhat miscellaneous fashion invaluable information on a vast variety of subjects, literary, political, antiquarian and others.          Pasquiers historical work is seen as an important predecessor to modern historiography, although he is indebted to the methods of other important Italian historians. He makes frequent use of primary sources and cites them as he goes along. Contrary to many other historical works of the time, Pasquier sought to create an accurate reconstruction of the past for the present needs of France, which he held to be in a period of crisis.     He looked to define France in terms of its customs and culture and wrote a distinctly national history. He began his story not with the origins of human civilization but with the origins of France in the Gauls. While he lamented his lack of sources on the subject, he tried to extract what he could from things such as Caesars writings on Gaul.     Pasquier attempted to contrast France with Rome and believed that the history of France is as great as the history of Rome, criticizing the widespread use of Latin, Roman law, etc. Instead, he had great respect for French literature and institutions without glorifying the history of France and its kings in the way of previous chroniclers.       Huppert, George, The Idea of Perfect History: Historical Erudition and Historical Philosophy in Renaissance France. - See the chapter on Pasquier p4242    , pronounced in 42 and published in the IIIrd book of the Recherches de la France .                               ": null
    }
]