[
    {
        "        In ": null
    },
    {
        "Norse mythology": "norse mythology"
    },
    {
        ", Þjazi  was a ": null
    },
    {
        "giant": "jötunn"
    },
    {
        ". He was a son of the giant ": null
    },
    {
        "Ölvaldi": "olvaldi"
    },
    {
        ", brother of giants ": null
    },
    {
        "Iði": "idi"
    },
    {
        " and ": null
    },
    {
        "Gangr": "gangr"
    },
    {
        ", and the father of ": null
    },
    {
        "Skaði": "skaði"
    },
    {
        ". His most notable misdeed was the kidnapping of the ": null
    },
    {
        "goddess": "æsir"
    },
    {
        " Iðunn": "iðunn"
    },
    {
        ", which is related in both the  Prose Edda  and the ": null
    },
    {
        "skaldic poem": "skaldic poem"
    },
    {
        "  Haustlöng .     Skáldskaparmál Skáldskaparmál , the gods ": null
    },
    {
        "Odin": "odin"
    },
    {
        ", ": null
    },
    {
        "Loki": "loki"
    },
    {
        " and ": null
    },
    {
        "Hœnir": "hœnir"
    },
    {
        " set out one day on a journey, traveling through mountains and wilderness until they were in need of food. In a valley they saw a herd of oxen, and they took one of the oxen and set it in an ": null
    },
    {
        "earth oven": "earth oven"
    },
    {
        ", but after a while they found that it would not cook. As they were trying to determine the reason for this, they heard someone talking in the oak tree above them, saying that he himself was the one responsible for the oven not cooking. They looked up and saw that it was Þjazi in the form of a great eagle, and he told   them that if they would let him eat from the ox, then he would make the oven cook. To this they agreed, so he came down from the tree and began devouring a large portion of the meal. He ate so much of it that Loki became angry, grabbed his long staff and attempted to strike him, but the weapon stuck fast to Þjazis body and he took flight, carrying Loki up with him. As they flew across the land Loki shouted and begged to be let down as his legs banged against trees and stones, but Þjazi would only do so on the condition that Loki must lure Iðunn out of ": null
    },
    {
        "Asgard": "asgard"
    },
    {
        " with her apples of youth, which he solemnly promised to do.     Later, at the agreed time, Loki lured Iðunn out of Asgard into a forest, telling her he had found some apples that she might think worth having, and that she should bring her own apples with her to compare them. Þjazi then appeared in his eagle shape, grabbed Iðunn and flew away with her to his realm of ": null
    },
    {
        "Þrymheimr": "þrymheimr"
    },
    {
        ", located in ": null
    },
    {
        "Jötunheimr": "jötunheimr"
    },
    {
        ".     The gods, deprived of Iðunns apples, began growing old and grey. When they learned that Iðunn was last seen going out of Asgard with Loki, they threatened him with torture and death until he agreed to rescue her. Loki borrowed a magical coat from ": null
    },
    {
        "Freyja": "freyja"
    },
    {
        " that would allow him to take the shape of a falcon, then flew to Jotunheim until he reached the hall of Þjazi. Finding Iðunn alone while Þjazi was out to sea on a boat, Loki transformed her into a nut and carried her back, flying as fast as he could. When Þjazi returned home and discovered she was gone he assumed his eagle form and flew after   Loki. When the gods saw Loki flying toward them with Þjazi right behind they lit a fire which burned Þjazis feathers, causing him to fall to the ground where he was set upon and killed.     Þjazis daughter ": null
    },
    {
        "Skadi": "skadi"
    },
    {
        " then put on her war gear and went to Asgard to seek vengeance, but the gods offered her atonement and compensation until she was placated. She was also given the hand of ": null
    },
    {
        "Njord": "njord"
    },
    {
        " in marriage, and as a further reparation Odin took Þjazis eyes and placed them in the night sky as stars.     Also according to Skáldskaparmál, Þjazi and his brothers ": null
    },
    {
        "Gangr": "gangr"
    },
    {
        " and ": null
    },
    {
        "Idi": "idi"
    },
    {
        " had a father named ": null
    },
    {
        "Olvaldi": "olvaldi"
    },
    {
        ". Olvaldi was very rich in gold, and when he died his three sons divided their inheritance between them by each in turn taking a mouthful. For this reason the expressions speech of Þjazi, Gangr or Idi and Idis shining talk are ": null
    },
    {
        "kennings": "kennings"
    },
    {
        " for gold, and twice in the same book a kenning is given for Þjazi as lady wolf , a reference to his abduction of Iðunn. Another is snowshoe deitys fosterer , or the father of the goddess who goes about on skis.     Grímnismál Grímnismál , during Odins visions of the various dwelling places of gods and giants he mentions that of Þjazi in stanza 42:     : Thrymheim the sixth is called   :where Þjazi lived, the terrible giant,   :but now Skadi, shining bride of the gods,   :lives in her fathers ancient courts     Hárbarðsljóð Hárbarðsljóð , it was not Odin but ": null
    },
    {
        "Thor": "thor"
    },
    {
        " who claimed to have made Þjazis eyes into stars in stanza 42:     Thor said:     : I killed Þjazi, the powerful minded giant.   :I threw up the eyes of Olvaldis son   :into the bright heavens.   :They are the greatest sign of my deeds,   :those which all men can see afterwards.   :What were you doing meanwhile, Harbard?     Lokasenna Lokasenna , it was neither Odin nor Thor but Loki himself who during his verbal sparring with Skadi lays claim to the death of her father in stanza 42:     Loki said:     : You know, if on a sharp rock, with my ice cold sons guts   :the gods shall bind me,   :first and foremost I was at the killing   :when we attacked Þjazi     Hyndluljóð": null
    },
    {
        "interpolated": "interpolation"
    },
    {
        " group of stanzas known as the Short Völuspá in  Hyndluljóð , Þjazi is further described as the giant who loved to shoot .       Þjazi, anglicized as   : Thiazi   : Thjazi   : Thiassi   Tjatse   Tjasse         Image:Manuscript_boiling.jpg|Þjazi stops the Æsir from boiling food in this illustration from an 42th-century ": null
    },
    {
        "Iceland": "iceland"
    },
    {
        "ic manuscript.   Image:Treated NKS haustlong.jpg|Another depiction of Þjazi as an eagle, trying to stop the Æsir from boiling food.               ": null
    }
]