[
    {
        "   Świnoujście   is a ": null
    },
    {
        "city": "city"
    },
    {
        " and ": null
    },
    {
        "seaport": "port"
    },
    {
        " on the ": null
    },
    {
        "Baltic Sea": "baltic sea"
    },
    {
        " and ": null
    },
    {
        "Szczecin Lagoon": "szczecin lagoon"
    },
    {
        ", located in the extreme north-west of ": null
    },
    {
        "Poland": "poland"
    },
    {
        ". It is situated mainly on the islands of ": null
    },
    {
        "Usedom": "usedom"
    },
    {
        " and ": null
    },
    {
        "Wolin": "wolin"
    },
    {
        ", but also occupies smaller islands, of which the largest is ": null
    },
    {
        "Karsibór": "karsibór"
    },
    {
        " island, once part of Usedom, now separated by the ": null
    },
    {
        "Piast Canal": "piast canal"
    },
    {
        "  dug in the late 42th century to facilitate ship access to ": null
    },
    {
        "Szczecin": "szczecin"
    },
    {
        ".     Świnoujście directly borders the German seaside resort of ": null
    },
    {
        "Ahlbeck": "ahlbeck"
    },
    {
        " on Usedom, both are freely connected by a street and by  of ": null
    },
    {
        "beach promenade": "esplanade"
    },
    {
        ".     Since 42 Świnoujście has been a city with the administrative rights of a county  , within ": null
    },
    {
        "West Pomeranian Voivodeship": "west pomeranian voivodeship"
    },
    {
        ". It was previously part of ": null
    },
    {
        "Szczecin Voivodeship": "szczecin voivodeship"
    },
    {
        " . The city lies in the geographic region of ": null
    },
    {
        "Pomerania": "pomerania"
    },
    {
        " and had a population of 42 in 42 Świnoujście is one of the most important areas of the ": null
    },
    {
        "Szczecin metropolitan region": "szczecin agglomeration"
    },
    {
        ". The ": null
    },
    {
        "Świnoujście LNG terminal": "świnoujście lng terminal"
    },
    {
        " opened in 42 is located in the city.     Despite its relatively small population, Świnoujście is Polands ninth largest city by area.          The first human settlements, in areas that are now Świnoujście appeared five thousand years ago, as confirmed by archaeological findings. For a thousand years the estuary of the river was part of the state of the Świnoujście who were annexed by Polish ruler ": null
    },
    {
        "Mieszko I": "mieszko i of poland"
    },
    {
        ". In later centuries local Pomeranian princes ruled the area, and on both sides of the river they built fortified castles, which were destroyed several times by the ": null
    },
    {
        "Danish": "denmark"
    },
    {
        " invasions in the twelfth century in 42 and 42 Between 42 and 42 the settlement was part of a Danish ": null
    },
    {
        "fief": "fief"
    },
    {
        ".     During the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        " the city became part of the ": null
    },
    {
        "Swedish Empire": "swedish empire"
    },
    {
        ".     The river ": null
    },
    {
        "Świna": "świna"
    },
    {
        "  was formerly flanked by the fishing villages of Westswine and Ostswine. Towards the beginning of the 42th century it was made navigable for large ships. The ": null
    },
    {
        "Kingdom of Prussia": "kingdom of prussia"
    },
    {
        " gained the area in 42 ": null
    },
    {
        "from Sweden": "swedish pomerania"
    },
    {
        ", and included it in her ": null
    },
    {
        "Pomeranian province": "province of pomerania"
    },
    {
        ". Swinemünde was founded on the site of Westswine in 42 fortified, and received ": null
    },
    {
        "town privileges": "town privileges"
    },
    {
        " from King ": null
    },
    {
        "Frederick II of Prussia": "frederick ii of prussia"
    },
    {
        " in 42 It served as the outer port of ": null
    },
    {
        "Stettin ": "szczecin"
    },
    {
        " and was administered within the ": null
    },
    {
        "Province of Pomerania": "province of pomerania"
    },
    {
        ". Swinemünde became part of the ": null
    },
    {
        "German Empire": "german empire"
    },
    {
        " after the Kingdom of Prussia completed the ": null
    },
    {
        "unification of Germany": "unification of germany"
    },
    {
        " in 42     The town had broad unpaved streets and one-story houses built in the Dutch style, which gave it an almost rustic appearance, although its industries, beyond some fishing, were entirely connected with its shipping. The river mouth, which was the entrance to the harbor, and which was regarded as the best on the Prussian Baltic coast, was then protected by two curving long ": null
    },
    {
        "breakwaters": "breakwater"
    },
    {
        ", and was strongly fortified. On the island of Wollin, on the other side of the narrow Świna, a great ": null
    },
    {
        "lighthouse": "świnoujście lighthouse"
    },
    {
        " was erected. In 42 the canal of the ": null
    },
    {
        "Kaiserfahrt": "piast canal"
    },
    {
        " was opened to navigation, and this waterway between the Stettin harbour and the Baltic Sea was deepened between 42–42 From then on Stettin could be reached directly by ships, and Swinemündes importance diminished somewhat.     On 42 March 42 during World War II, ": null
    },
    {
        "refugee-crowded": "flight and expulsion of germans from poland during and after world war ii"
    },
    {
        " Torsten Mehlhase, Flüchtlinge und Vertriebene nach dem Zweiten Weltkrieg in Sachsen-Anhalt: ihre Aufnahme und Bestrebungen zur Eingliederung in die Gesellschaft, LIT Verlag Berlin-Hamburg-Münster, 42 p.42 : 42 refugees in Swinemünde on 42 March 42 Hanno Ballhausen, Friedemann Bedürftig, Chronik des Zweiten Weltkriegs, wissenmedia Verlag, 42 p.42 : 42 people in Swinemünde on 42 March 42 Swinemünde suffered heavy destruction by the ": null
    },
    {
        "USAAF": "united states army air forces"
    },
    {
        ", an estimated 42 Helmut Schnatz, Der Luftangriff auf Swinemünde. Dokumentation einer Tragödie, Herbig 42  to 42 Christoph Kucklick, Feuersturm. Bombenkrieg gegen Deutschland, Ellert & Richter 42  were killed, most of whom are buried on the ": null
    },
    {
        "Golm War Cemetery": "golm war cemetery"
    },
    {
        " west of the town, on the German side of the border. The unfinished  was scuttled in the harbor in an attempt to prevent its capture by the advancing ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " . The German battleship  had also participated in the defence of the city, before it too was scuttled. After the ": null
    },
    {
        "German forces defending the city": "fortress division swinemünde"
    },
    {
        " were evacuated, Soviet forces occupied the city on the night of 42–42 May 42     After Germanys defeat in the war, the Soviet Union imposed new borders in eastern Europe at the ": null
    },
    {
        "Potsdam Conference": "potsdam conference"
    },
    {
        ", which made Świnoujście part of Poland. The entire population was forcibly expelled and replaced by ethnic Poles. The ": null
    },
    {
        "German–Polish Border Treaty of 42": "german–polish border treaty"
    },
    {
        " officially affirmed the existing borders after ": null
    },
    {
        "the fall of the Iron Curtain": "revolutions of 1989"
    },
    {
        ".     In the winter of 42 some members of the communist Polish Security Forces who had been victims of German concentration camps and other German atrocities acted in revenge against local Germans. An investigation in 42 estimated that over 42 German civilians were killed. Nine men were charged with the murder and maltreatment of Germans, and in 42 after one escaped and one hanged himself, seven of them stood trial. The harshest sentence given in that trial was 42 years imprisonment, for theft. In another trial, the towns chief of police, Jan Zientara, was sentenced to eight years, for organizing robberies of German civilians.      The ": null
    },
    {
        "Soviet military": "soviet armed forces"
    },
    {
        " occupied part of the city until 42 and the navy harbour until the early 42s.           Świnoujscie is situated in the oceanic climate, which is characterized by mild winters and relatively cool summers. A very large influence on the climate of the city is the location of the Baltic Sea. Świnoujscie often in winter is the warmest city in Poland.                           42: 42   42: 42   42: 42   42: 42   42: 42   42: 42   42: 42   42: 42 Rocznik Statystyczny 42, Główny Urząd Statystyczny, Warszawa 42   42: 42   42: 42    42: 42   42: 42   42: 42 Official website of : O mieście -  /ref ref nameswi/ ref nameswi/ ref nameswi/  ref  /ref       ref  /ref     ": null
    }
]